Rhino.UI.PanelDefinition.#ctor(Rhino.PlugIns.PlugIn,System.Type,System.String,System.String,System.Drawing.Icon,Rhino.UI.PanelType)
Constructor
plugIn:
type:
englishCaption:
localCaption:
icon:
panelType: