Rhino.Render.UI.UiDynamicAccessBase
This is the abstract interface class for for all Snapshot clients.

Rhino.Render.UI.UiDynamicAccessBase.#ctor
SnapShotsClient constructor

Rhino.Render.UI.UiDynamicAccessBase.Dispose
SnapShotsClient Dispose