Rhino.Render.UI.ContentUIAgentBase
This is the abstract interface class for for all Snapshot clients.

Rhino.Render.UI.ContentUIAgentBase.#ctor
SnapShotsClient constructor

Rhino.Render.UI.ContentUIAgentBase.Dispose
SnapShotsClient Dispose