Rhino.UI.PanelSystem.OnCreatePanelCallback(System.Guid,System.Guid,System.UInt32,System.IntPtr)
Called to create the actual panel
panelTypeGuid:
hostId:
documentSerailNumber:
hParent:
Returns:

Rhino.UI.PanelSystem.Add(Rhino.PlugIns.PlugIn,System.Type,System.String,System.Drawing.Icon,Rhino.UI.PanelType)
Add a class Type to the definition
plugIn:
type:
caption:
icon:
panelType:
Returns: