Rhino.DocObjects.Font.FontOrigin.Unknown
Origin unknown.

Rhino.DocObjects.Font.FontOrigin.WindowsLogFont
Windows LOGFONT.

Rhino.DocObjects.Font.FontOrigin.WindowsLogFontAndTextMetric
Windows LOGFONT and TEXTMETRIC.

Rhino.DocObjects.Font.FontOrigin.WindowsDirectWrite
Windows Direct Write.

Rhino.DocObjects.Font.FontOrigin.AppleNSFont
Apple NSFont.