Rhino.Runtime.ISettingsService.WriteSettings(System.IO.Stream,System.String,System.Action{System.Boolean})
Writes the settings to OS specific location.
stream:
Stream containing the XML document
fileName:
Requested file name and location.
writing:
Called twice, first time with a false argument meaning about to write the
final file, second time with a true meaning it is done writing.
Returns:
Return true, if settings was written, false otherwise.