Rhino.Geometry.DetailView.SetScale(System.Double,Rhino.LengthUnit,System.Double,Rhino.LengthUnit)
Sets the detail viewport's projection so geometry is displayed at a certain scale.
modelLength: Reference model length.
modelUnits: Units for model length.
pageLength: Length on page that the modelLength should equal.
pageUnits: Units for page length.
Returns:
true on success. false if the DetailView projection is perspective or input values are incongruous.
Since: 9.0