Rhino.LengthUnit
Represents a length unit.
Since: 9.0

Rhino.LengthUnit.Magnitude
The size in meters of this unit for scale purposes.

Rhino.LengthUnit.GetHashCode
Returns the hash code for this instance.
Returns: A 32-bit integer that is the hash code for this instance.

Rhino.LengthUnit.Equals(System.Object)
Indicates whether the current object is equal to another object of the same type.
other:
Returns: true if the current object is equal to the other object otherwise false.

Rhino.LengthUnit.Equals(Rhino.LengthUnit)
Indicates whether the current object is equal to another object of the same type.
other:
Returns: true if the current object is equal to the other object otherwise false.
Remarks: Name is ignored on the comparison (Meters and Metres are considered the same)

Rhino.LengthUnit.CompareTo(Rhino.LengthUnit)
Compares the current instance with another object of the same type and returns
an integer that indicates whether the current instance precedes, follows, or
occurs in the same position in the sort order as the other object.
other: A Rhino.LengthUnit to compare with this instance.
Returns: A value that indicates the relative order of the objects being compared.
Remarks: Name is ignored on the comparison (Meters and Metres are considered the same)

Rhino.LengthUnit.op_Equality(Rhino.LengthUnit@,Rhino.LengthUnit@)
Equality operator.

Rhino.LengthUnit.op_Inequality(Rhino.LengthUnit@,Rhino.LengthUnit@)
Inequality operator.

Rhino.LengthUnit.op_LessThan(Rhino.LengthUnit@,Rhino.LengthUnit@)
Less than operator.

Rhino.LengthUnit.op_LessThanOrEqual(Rhino.LengthUnit@,Rhino.LengthUnit@)
Less than or equal operator.

Rhino.LengthUnit.op_GreaterThan(Rhino.LengthUnit@,Rhino.LengthUnit@)
Greater than operator.

Rhino.LengthUnit.op_GreaterThanOrEqual(Rhino.LengthUnit@,Rhino.LengthUnit@)
Greater than or equal operator.

Rhino.LengthUnit.Unset
Unset unit

Rhino.LengthUnit.None
No unit

Rhino.LengthUnit.Millimeters
1 millimeter = 1.0e-3 meters

Rhino.LengthUnit.Centimeters
1 millimeter = 1.0e-2 meters

Rhino.LengthUnit.Meters
SI meter length unit

Rhino.LengthUnit.Inches
1 inch = 0.0254 meters = 1/12 foot

Rhino.LengthUnit.Feet
1 foot = 0.3048  meters = 12 inches

Rhino.LengthUnit.Yards
1 yard = 0.9144 meters = 3 feet

Rhino.LengthUnit.Name
Non localized lower case plural unit name.

Rhino.LengthUnit.Symbol
Non localized unit symbol string.

Rhino.LengthUnit.DisplayName
Upper case plural localized unit name.

Rhino.LengthUnit.DisplaySymbol
Lower case singular localized unit symbol.

Rhino.LengthUnit.IsNone(Rhino.LengthUnit@)
Determines whether the specified value is None.
unit:
Returns:

Rhino.LengthUnit.IsUnset(Rhino.LengthUnit@)
Determines whether the specified value is Unset.
unit:
Returns:

Rhino.LengthUnit.IsCustom(Rhino.LengthUnit@)
Determines whether the specified value is a custom unit.
unit:
Returns:

Rhino.LengthUnit.IsKnownUnitSystem(Rhino.UnitSystem@)
Determines whether the current value is a known unit system.
Not Rhino.UnitSystem.Unset nor Rhino.UnitSystem.CustomUnits
unitSystem:
Returns:

Rhino.LengthUnit.IsKnownLengthUnit(Rhino.UnitSystem,Rhino.LengthUnit@)
Determines whether the current value is a known unit system.
Not Rhino.UnitSystem.Unset nor Rhino.UnitSystem.CustomUnits
unitSystem:
lengthUnit:
Returns:

Rhino.LengthUnit.FromCustomUnitSystem(System.String,System.Double,Rhino.UnitSystem)
Creates a custom Rhino.LengthUnit based on its size expressed on a known Rhino.UnitSystem.
name: Name of the custom unit
customUnitSize: Meters per custom unit is case knownUnitSystem is omitted
knownUnitSystem: A known unit system. Meters when omitted
Throws System.ArgumentNullException: When name is null
Throws System.ArgumentException: When customUnitSize is not a positive finite number

Rhino.LengthUnit.FromKnownUnitSystem(Rhino.UnitSystem)
Constructs a Rhino.LengthUnit from a Rhino.UnitSystem.
knownUnitSystem: A known unit system.
Throws System.ArgumentException: When knownUnitSystem is Rhino.UnitSystem.CustomUnits

Rhino.LengthUnit.ToUnitSystem(System.Double@)
Returns an Rhino.UnitSystem equivalent to this instance and its size expressed on meters.
metersPerUnit:  Unit size expressed in meters.
Returns: A Rhino.UnitSystem value.

Rhino.LengthUnit.Size(Rhino.LengthUnit@)
Returns the size of this unit expressed on a different length unit.
unit: Size unit.
Returns: The size of this length unit expressed on the specified length unit.
Remarks:
Size of None is always 1.0 expressed on any other length unit.
Size of Unset is always NaN expressed on any other length unit.

Rhino.LengthUnit.Scale(Rhino.LengthUnit@,Rhino.LengthUnit@)
Computes the scale factor for changing a measurement on different units.
from: The units to convert from.
to: The units to convert measurements into.
Returns: A unit scale factor.