Rhino.Runtime.FileSettingsService.PreventSettingsWriteOut
Setting this to true should prevent Rhino from writing out any settings.
If you disagree with this design, talk to CS, he is more than happy to change it.