Rhino.ApplicationSettings.DirectionAnalysisSettings
Contains static methods and properties to modify the visibility of edges in edge-related commands.

Rhino.ApplicationSettings.DirectionAnalysisSettings.GetDefaultState
Gets the factory settings of the application.
Since: 9.0

Rhino.ApplicationSettings.DirectionAnalysisSettings.GetCurrentState
Gets the current settings of the application.
Since: 9.0

Rhino.ApplicationSettings.DirectionAnalysisSettings.Direction
Gets or sets whether to display the direction.
Since: 9.0

Rhino.ApplicationSettings.DirectionAnalysisSettings.U
Gets or sets whether to display the U dir.
Since: 9.0

Rhino.ApplicationSettings.DirectionAnalysisSettings.V
Gets or sets whether to display the V dir.
Since: 9.0

Rhino.ApplicationSettings.DirectionAnalysisSettings.Color
Gets or sets a color used to show curve or surface direction.
Since: 9.0