Rhino.Geometry.BrepEdge.Get3dVectorsIntoFaces(System.Double,Rhino.Geometry.Vector3d[]@,Rhino.Geometry.Vector3d[]@)
For each trim at this edge, find the 3d unit vector at the edge parameter in the trim's surface tangent plane,
perpendicular to the edge, which points to the active side of the trim.
t: edge parameter where vectors and normals are evaluated
vectors: 3d vectors point into the face(s). One for each trim, in order of Rhino.Geometry.BrepEdge.TrimIndices
normals: Surface normals at edge parameter. Perpendicular to the 3d vectors.
Returns: True if vectors can be found. False if edge tangent or surface normals can't be found, or if input is bad.