Rhino.DocObjects.Tables.SectionStyleTable
Section style table
Since: 9.0

Rhino.DocObjects.Tables.SectionStyleTable.Document
Document that owns this table.
Since: 9.0

Rhino.DocObjects.Tables.SectionStyleTable.Count
Returns number of section styles in the section style table, including
deleted section styles.
Since: 9.0

Rhino.DocObjects.Tables.SectionStyleTable.ActiveCount
Returns number of section styles in the table, excluding deleted section styles.
Since: 9.0

Rhino.DocObjects.Tables.SectionStyleTable.Item(System.Int32)
Conceptually, the section style table is an array of section styles.
The operator[] can be used to get individual section styles. A section
style is either active or deleted and this state is reported by
SectionStyle.IsDeleted.
index: zero based array index.
Returns:
Reference to the section style.  If index is out of range, null is
returned. Note that this reference may become invalid after
AddSectionStyle() is called.
Since: 9.0

Rhino.DocObjects.Tables.SectionStyleTable.Find(System.String)
Finds the section style with a given name.
name:
The name of the section style to find. The search ignores case.
Returns:
If the section style was found, the section style index, >=0, is returned.
If the section style was not found, -1 is returned.
Since: 9.0

Rhino.DocObjects.Tables.SectionStyleTable.Find(System.Guid,System.Boolean)
Finds a section style with a matching ID.
id: The ID of the section style to be found.
ignoreDeletedSectionStyles:
If true, deleted section styles are not checked.
Returns:
If the section style was found, the section style index, >=0, is returned.
If the section style was not found, -1 is returned.
Since: 9.0

Rhino.DocObjects.Tables.SectionStyleTable.FindName(System.String)
Finds the section style with a given name.
name: The name of the section style to find.
Returns:
The section style if found; otherwise null.
Since: 9.0

Rhino.DocObjects.Tables.SectionStyleTable.FindIndex(System.Int32)
Retrieves a section style based on Index. This search type of search is discouraged.
We are moving towards using only IDs for all tables.
index: The index to search for.
Returns: A SectionStyle object, or null if none was found.
Since: 9.0

Rhino.DocObjects.Tables.SectionStyleTable.Add(Rhino.DocObjects.SectionStyle)
Adds a new section style with specified definition to the table.
sectionstyle:
Definition of new section style. The information in sectionstyle is
copied. If sectionstyle.Name is empty then a unique name of the form
"SectionStyle 01" will be automatically created.
Returns:
Index of new section style type or -1 on error.
Since: 9.0

Rhino.DocObjects.Tables.SectionStyleTable.AddReferenceSectionStyle(Rhino.DocObjects.SectionStyle)
Adds a reference section style that will not be saved in files.
sectionstyle:
Definition of new section style. The information in sectionstyle is
copied. If sectionstyle.Name is empty then a unique name of the form
"SectionStyle 01" will be automatically created.
Returns:
Index of new section style or -1 on error.
Since: 9.0

Rhino.DocObjects.Tables.SectionStyleTable.Modify(Rhino.DocObjects.SectionStyle,System.Int32,System.Boolean)
Modify section style settings.
sectionstyle: New sections style settings. This information is copied.
index: Zero based index of section style to set.
quiet:
if true, information message boxes pop up when illegal changes are attempted.
Returns:
true if successful. false if index is out of range.
Since: 9.0

Rhino.DocObjects.Tables.SectionStyleTable.Delete(System.Int32,System.Boolean)
Deletes a section style.
index: zero based index of section style to delete.
quiet:
If true, no warning message box appears if a section style is in use.
Returns:
true if successful. false if index is out of range or the
section style is referenced by active geometry.
Since: 9.0

Rhino.DocObjects.Tables.SectionStyleTable.Delete(Rhino.DocObjects.SectionStyle)
Deletes a section style.
item: The section style to delete.
Returns: true if successful, false otherwise.
Since: 9.0

Rhino.DocObjects.Tables.SectionStyleTable.Delete(System.Collections.Generic.IEnumerable{System.Int32},System.Boolean)
Delete multiple section styles.
sectionStyleIndices: An enumeration of section style indices.
quiet: If true, no warning message box appears if a section style is in use.
Returns: The number of section styles that were deleted.
Since: 9.0

Rhino.DocObjects.Tables.SectionStyleTable.Delete(System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Int32)
Delete multiple section styles.
sectionStyleIndices: An enumeration of section style indices.
quiet: If true, no warning message box appears if a section style is in use.
deleteWarning:
Action to take when multiple delete warnings occur, where: 0 == No to all, 1 == Yes to all, 2 == Ask the user.
Returns: The number of section styles that were deleted.
Since: 9.0

Rhino.DocObjects.Tables.SectionStyleTable.GetUnusedSectionStyleName
Gets unused section style name used as default when creating new section styles.
Returns: The unused name.
Since: 9.0

Rhino.DocObjects.Tables.SectionStyleTable.InUse(System.Int32,System.Int32@,System.Int32@,System.Int32@)
Returns true if a section style is use by an object, layer, or instance definition.
index: The index of the section style to query.
instanceDefinitionCount: The number of instance definitions using this section style.
objectCount: The number of Rhino objects using this section style.
layerCount: The number of layers using this section style.
Returns: True if the section style is in use, false otherwise.