Rhino.Render.Utilities.ContentNewExistingResults
Since: 9.0

Rhino.Render.Utilities.ContentNewExistingResults.None
No choice (user cancelled).

Rhino.Render.Utilities.ContentNewExistingResults.New
User chose from 'New' tab. contents accepts the chosen type id(s).

Rhino.Render.Utilities.ContentNewExistingResults.Copy
User chose from 'Existing' tab with 'copy' radio button checked. contents accepts the chosen instance id(s).

Rhino.Render.Utilities.ContentNewExistingResults.Instance
User chose from 'Existing' tab with 'instance' radio button checked. contents accepts the chosen instance id(s).

Rhino.Render.Utilities.ContentNewExistingResults.Reference
User chose from 'Existing' tab with no radio buttons. contents accepts the chosen instance id(s).