Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1.#ctor(System.Collections.Generic.IEnumerable{`0},System.Collections.Generic.IEqualityComparer{`0})
Creates an instance with the given items.
items: Items that the instance will contain. If there are duplicate items, they will be removed.
comparer: custom comparerer, used to check for duplicates. If no comparer is specified, System.Collections.Generic.EqualityComparer`1.Default is used.

Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1.#ctor(System.Collections.Generic.IEqualityComparer{`0})
Creates an empty instance.

Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1.AddRange(System.Collections.Generic.IEnumerable{`0})
Add multiple objects to the end of the ordered set. Only distinct items are added.
If new items were added, one CollectionChanged event is fired.
items:

Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1.RemoveRange(System.Collections.Generic.IEnumerable{`0})
Remove a number of items.
If at least one item was removed, one CollectionChanged event is fired.
items:
Returns: true if at least one item was removed