Rhino.ApplicationSettings.CommandAlias
A command alias is a set of characters that can be defined to run a macro

Rhino.ApplicationSettings.CommandAlias.#ctor(System.String,System.String,System.Boolean)
Create a new command alias
alias:
macro:
instant:

Rhino.ApplicationSettings.CommandAlias.Alias
String that represents an alias

Rhino.ApplicationSettings.CommandAlias.Macro
Macro to run when an alias is input

Rhino.ApplicationSettings.CommandAlias.Instant
Is the command alias instant? Instant aliases run without the need for
spacebar or enter