Rhino.Render.TextureMapping.Decompose(Rhino.Geometry.Transform,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@)
Gets the same decomposition of the texture mapping transforms as is used in the UI.
localTransform:
xyz_position:
xyz_scale:
xyz_rotation:
uvw_offset:
uvw_repeat:
uvw_rotation: