Rhino.Geometry.PointCloud.Split(Rhino.Geometry.Plane,Rhino.Geometry.PointCloud@,Rhino.Geometry.PointCloud@)
Split a point cloud into two parts using a plane,
or returns false if the pointcloud is not partitioned by plane.
plane: The splitting plane
above: The part of the point cloud that is above the plane
below: The part of the point cloud that is below the plane
Returns: true on success, false if the plane does not partition the cloud, or on error.

Rhino.Geometry.PointCloud.ExpertGetValues(System.Int32,Rhino.Geometry.Point3d@,Rhino.Geometry.Vector3d@,System.Drawing.Color@,System.Double@,System.Boolean@)
Expert tool to get all values of a point cloud item.
This method minimizes the number of pInvoke function calls.
index: The index of the point cloud item.
location: Output location of the point cloud item.
normal: Output normal vector of the point cloud item.
color: Output color of the point cloud item.
hidden: Output hidden flag of the point cloud item.
extra: Extra value of the point cloud item.
Returns: True on success.