Rhino.Render.UICommands.UICommandOrigin.IsAmbivalent
An origin is 'ambivalent' when it wants to show UICommand for both top-level and
child contents on the same menu. This is a special quirk of the spanner menu.
Returns: True if origin shows UICommands for both top level and child contents on the same menu