Rhino.Geometry.Brep.FilletSurfaceSettings
Settings to use when creating fillets or chamfers

Rhino.Geometry.Brep.FilletSurfaceSettings.#ctor
Use the static creation methods

Rhino.Geometry.Brep.FilletSurfaceSettings.CreateRationalArcSettings(System.Double,System.Double,System.Boolean,System.Boolean)
Create settings for rational arc fillet surfaces
radius: The fillet radius.
trim: If true, the input faces will be trimmed, if false, the input faces will be split.
extend: If true, then when one input surface is longer than the other, the fillet surface is extended to the input surface edges.
tolerance: The tolerance. When in doubt, use the document's model absolute tolerance.
Returns:

Rhino.Geometry.Brep.FilletSurfaceSettings.CreateNonRationalSettings(System.Double,System.Double,System.Int32,System.Double,System.Double,System.Boolean,System.Boolean)
Create settings for non-rational approximated arc fillet surfaces
radius: The fillet radius.
trim: If true, the input faces will be trimmed, if false, the input faces will be split.
extend: If true, then when one input surface is longer than the other, the fillet surface is extended to the input surface edges.
tolerance: The tolerance. When in doubt, use the document's model absolute tolerance.
degree: Degree of the arc approxiation (3, 4, or 5)
tanSlider: A number between -0.95 and 0.95 indicating how far to push the tangent control points toward or away from the theoretical middle control point(s)
innerSlider: A number between -0.95 and 0.95 indicating how far to push the inner control point toward or away from the theoretical middle control point

Rhino.Geometry.Brep.FilletSurfaceSettings.CreateG2BlendSettings(System.Double,System.Double,System.Boolean,System.Boolean)
Create settings for G2-blended fillet surfaces
radius: The fillet radius.
trim: If true, the input faces will be trimmed, if false, the input faces will be split.
extend: If true, then when one input surface is longer than the other, the fillet surface is extended to the input surface edges.
tolerance: The tolerance. When in doubt, use the document's model absolute tolerance.
Returns:

Rhino.Geometry.Brep.FilletSurfaceSettings.CreateChamferSettings(System.Double,System.Double,System.Double,System.Boolean,System.Boolean)
Create settings for chamfered surfaces
radius0: The distance from the intersection of face0 to the edge of the chamfer.
radius1: The distance from the intersection of face1 to the edge of the chamfer.
trim: If true, the input faces will be trimmed, if false, the input faces will be split.
extend: If true, then when one input surface is longer than the other, the fillet surface is extended to the input surface edges.
tolerance: The tolerance. When in doubt, use the document's model absolute tolerance.

Rhino.Geometry.Brep.FilletSurfaceSettings.Radius
The radius of the fillets

Rhino.Geometry.Brep.FilletSurfaceSettings.SecondRadius
The second radius of the fillets (only for chamfered surfaces)

Rhino.Geometry.Brep.FilletSurfaceSettings.Tolerance
The tolerance. When in doubt, use the document's model absolute tolerance.

Rhino.Geometry.Brep.FilletSurfaceSettings.AngleTolerance
Angle tolerance to decide when faces are tangent-continuous

Rhino.Geometry.Brep.FilletSurfaceSettings.Trim
If true, the input faces will be trimmed, if false, the input faces will be split.

Rhino.Geometry.Brep.FilletSurfaceSettings.Chamfer
If true, a ruled chamfered surface is created.

Rhino.Geometry.Brep.FilletSurfaceSettings.G2Blend
If true, a G2-continuous blend will be created

Rhino.Geometry.Brep.FilletSurfaceSettings.NonRational
Create a non-rational approximation to the arc. This requires Rhino.Geometry.Brep.FilletSurfaceSettings.Degree to be set to 3, 4, or 5
and Rhino.Geometry.Brep.FilletSurfaceSettings.TanSlider and Rhino.Geometry.Brep.FilletSurfaceSettings.InnerSlider to a value between -0.95 and 0.95.

Rhino.Geometry.Brep.FilletSurfaceSettings.Extend
If true, then when one input surface is longer than the other, the fillet surface is extended to the input surface edges

Rhino.Geometry.Brep.FilletSurfaceSettings.Degree
Degree of the arc approxiation (3, 4, or 5) - only for non-rational fillets

Rhino.Geometry.Brep.FilletSurfaceSettings.TanSlider
A number between -0.95 and 0.95 indicating how far to push the tangent control points toward or away from the theoretical middle control point(s) - only for non-rational fillets

Rhino.Geometry.Brep.FilletSurfaceSettings.InnerSlider
A number between -0.95 and 0.95 indicating how far to push the inner control point toward or away from the theoretical middle control point - only for non-rational fillets

Rhino.Geometry.Brep.FilletSurfaceSettings.ContinueAcrossTangentFaces
If true, the fillets or chamfers will be extended to neighboring faces as long as neighboring faces are tangent to the input faces.