Rhino.Runtime.InteropWrappers.SimpleArrayLine.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.Line})
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayLine instance from a set of lines
lines:
Since: 9.0