Rhino.DocObjects.Tables.SectionStyleTableEventType
Since: 9.0

Rhino.DocObjects.Tables.SectionStyleTableEventType.Added
A section style was added to the document's section style table.
Since: 9.0

Rhino.DocObjects.Tables.SectionStyleTableEventType.Deleted
A section style in the document's section style table was deleted.
Since: 9.0

Rhino.DocObjects.Tables.SectionStyleTableEventType.Undeleted
A section style in the document's section style table was undeleted.
Since: 9.0

Rhino.DocObjects.Tables.SectionStyleTableEventType.Modified
A section style in the document's section style table was modified.
Since: 9.0

Rhino.DocObjects.Tables.SectionStyleTableEventType.Sorted
The document's section style table was sorted.
Since: 9.0