Rhino.DocObjects.DimensionStyle.MaskFrame.CircleFrame
Text mask frame outline circle drawn

Rhino.DocObjects.DimensionStyle.MaskFrame.SquareFrame
Text mask frame outline square drawn

Rhino.DocObjects.DimensionStyle.MaskFrame.DiamondFrame
Text mask frame outline square rotated 45 degrees

Rhino.DocObjects.DimensionStyle.MaskFrame.TriangleFrame
Text mask frame outline triangle drawn

Rhino.DocObjects.DimensionStyle.MaskFrame.HexagonFrame
Text mask frame outline as a hexagon

Rhino.DocObjects.DimensionStyle.MaskFrame.HexagonCapsuleFrame
Text mask frame outline as an elongated hexagon

Rhino.DocObjects.DimensionStyle.MaskFrame.RoundRectFrame
Text mask frame outline as a rounded rectangle