Rhino.ApplicationSettings.EndAnalysisSettings
Contains static methods and properties to modify the visibility of curve ends.

Rhino.ApplicationSettings.EndAnalysisSettings.GetDefaultState
Gets the factory settings of the application.
Since: 9.0

Rhino.ApplicationSettings.EndAnalysisSettings.GetCurrentState
Gets the current settings of the application.
Since: 9.0

Rhino.ApplicationSettings.EndAnalysisSettings.OpenStarts
Gets or sets whether to display the open curve start points.
Since: 9.0

Rhino.ApplicationSettings.EndAnalysisSettings.OpenEnds
Gets or sets whether to display the open curve end points.
Since: 9.0

Rhino.ApplicationSettings.EndAnalysisSettings.ClosedSeams
Gets or sets whether to display the closed curve seam points.
Since: 9.0

Rhino.ApplicationSettings.EndAnalysisSettings.PolycurveJoints
Gets or sets whether to display the polycurve joint points.
Since: 9.0

Rhino.ApplicationSettings.EndAnalysisSettings.Color
Gets or sets a color used to display the points.
Since: 9.0