Rhino.DocObjects.Tables.InstanceDefinitionTable.PurgeUnused
Purges any unused instance definitions.
Returns: The number of unused instance definitions that were purged.
Since: 9.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.Export(System.Int32,System.String)
Exports the block definition's component objects to one of the file formats supported by Rhino.
idefIndex: Index of the instance definition to export.
filename: Name of the file to create.
Since: 9.0