Rhino.Geometry.Transform.ChangeBasis(Rhino.Geometry.Plane,Rhino.Geometry.Plane)
Gets a change of basis transformation.
The change of basis transformation is not the same as the rotation transformation that rotates one orthonormal frame to another.
If you have geometry defined with respect to planes, this method takes two planes and computes the transformation to change coordinates from one plane to another.
plane0: Coordinate system in which the geometry is currently described.
plane1: Target coordinate system in which we want the geometry to be described.
Returns:
A change of basis transformation if success, Rhino.Geometry.Transform.Unset on failure.
Remarks:
Change of basis transformations and rotation transformations are often confused.
This is a change of basis transformation.
If Q = P0 + a0*X0 + b0*Y0 + c0*Z0 = P1 + a1*X1 + b1*Y1 + c1*Z1, then this transform will map the coordinates (a0,b0,c0) to (a1,b1,c1).
Since: 5.0

Rhino.Geometry.Transform.IsUniformlyScaled
Determines if this transform is uniformly scaled.
Returns: True if uniformly scaled, false otherwise.
Since: 9.0