Rhino.ApplicationSettings.EndAnalysisSettingsState
Represents a snapshot of Rhino.ApplicationSettings.EndAnalysisSettings.

Rhino.ApplicationSettings.EndAnalysisSettingsState.Color
Gets or sets a color used to display the points.
Since: 9.0

Rhino.ApplicationSettings.EndAnalysisSettingsState.OpenStarts
Gets or sets whether to display the open curve start points.
Since: 9.0

Rhino.ApplicationSettings.EndAnalysisSettingsState.OpenEnds
Gets or sets whether to display the open curve end points.
Since: 9.0

Rhino.ApplicationSettings.EndAnalysisSettingsState.ClosedSeams
Gets or sets whether to display the closed curve seam points.
Since: 9.0

Rhino.ApplicationSettings.EndAnalysisSettingsState.PolycurveJoints
Gets or sets whether to display the polycurve joint points.
Since: 9.0