Rhino.Geometry.Squisher.SquishSurface(Rhino.Geometry.SquishParameters,Rhino.Geometry.Surface,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},System.Collections.Generic.List{Rhino.Geometry.GeometryBase})
Squish the surface into a flat brep
sp: The parameters for the squish operation
surface: The surface to be squished
marks: Point, PountCloud, TextDot, and Curve objects to squish. Can be null.
squished_marks_out: A list of the squished marks, with null entries for marks
that fail to squish. Can be null.
Returns: A brep representing the flattened surface
Remarks: NB: If you are using this function from Grasshopper, which does not have a type
that can hold a trimmed surface, you will need to pass a Brep to your component and get the
face of interest from this Brep into this function. Otherwise you will lose all trimming information.
Example: `brep_out = SquishSurface(sp, brep.Faces[0], marks_in, marks_out)`
Since: 7.9

Rhino.Geometry.Squisher.SquishSurface(Rhino.Geometry.SquishParameters,Rhino.Geometry.Surface)
Squish the surface into a flat brep
sp: The parameters for the squish operation
surface: The surface to be squished
Returns: A brep representing the flattened surface
Remarks: NB: If you are using this function from Grasshopper, which does not have a type
that can hold a trimmed surface, you will need to pass a Brep to your component and get the
face of interest from this Brep into this function. Otherwise you will lose all trimming information.
Example: `brep_out = SquishSurface(sp, brep.Faces[0])`
Since: 7.9