Rhino.UI.PanelIds.CommandHistory
Command control bar Id, for internal use only, don't want to provide
way for plug-in's to hide the command control bar. This is used by
the dock site restoration code in Rhino.UI to ensure the command prompt
is visible when Rhino starts.

Rhino.UI.PanelIds.MacCommandPrompt
This is the old sidebar-based command prompt panel that was used on Mac.
It is replaced by Rhino.UI.PanelIds.Sidebar when Eto-based command UI is active.

Rhino.UI.PanelIds.MacHistoryPanel
This is the bottom dockbar ID that usually contained just the command history on Mac.

Rhino.UI.PanelIds.CommandPrompt
Gets the Id of the command prompt panel currently in use depending on the mode.

Rhino.UI.PanelIds.MacSidebar
Gets the ID of the sidebar in use, Mac in legacy mode used a different ID.