Rhino.Geometry.Surface.IsoCurve(Rhino.Geometry.IsoStatus,System.Double)
Gets isoparametric curve. Rhino.Geometry.IsoStatus.None is not supported,
and Rhino.Geometry.IsoStatus.X and Rhino.Geometry.IsoStatus.Y need valid t-values in the U- or V-domain respectively.
iso: Rhino.Geometry.IsoStatus.North returns the curve where U varies and V is V_max (paramter t is ignored)
Rhino.Geometry.IsoStatus.East returns the curve where V varies and U is U_max (paramter t is ignored)
Rhino.Geometry.IsoStatus.South returns the curve where U varies and V is V_min (paramter t is ignored)
Rhino.Geometry.IsoStatus.West returns the curve where V varies and U is U_min (paramter t is ignored)
Rhino.Geometry.IsoStatus.X returns the curve where V varies and U is t (if t is inside the U-domain)
Rhino.Geometry.IsoStatus.Y returns the curve where U varies and V is t (if t is inside the V-domain)
t: the parameter used if iso is X or Y.
Returns: An isoparametric curve or null on error.

Rhino.Geometry.Surface.IsoCurve(Rhino.Geometry.IsoStatus)
Gets isoparametric curve that corresponds to one of the four surface edges. Other Rhino.Geometry.IsoStatus values are not supported.
iso: Rhino.Geometry.IsoStatus.North returns the curve where U varies and V is V_max
Rhino.Geometry.IsoStatus.East returns the curve where V varies and U is U_max
Rhino.Geometry.IsoStatus.South returns the curve where U varies and V is V_min
Rhino.Geometry.IsoStatus.West returns the curve where V varies and U is U_min
Returns: An isoparametric curve or null on error.