Rhino.Runtime.HostUtils.RunningOnLinux
Tests if this process is currently executing on the Linux platform.
Since: 9.0

Rhino.Runtime.HostUtils.RegisterStaticIDisposable(System.IDisposable)
Statics do not get disposed of in .NET. If you have a static IDisposable
that you want to be disposed during shutdown, add your disposable to this
list.
disposable: