Rhino.Input.RhinoGet.GetDistance(System.String,System.Double,System.Double@)
Allows the user to interactively pick a distance
commandPrompt: if null, a default prompt will be displayed
defaultDistance:
distance:
Returns:
Since: 9.0