Rhino.DocObjects.RhinoObject.AnalysisModeChanged
Called when the visual analysis mode of a Rhino.DocObjects.RhinoObject changes.
Since: 9.0

Rhino.DocObjects.RhinoObject.IsGeometricTolerance
21-May-2025 Dale Fugier, https://mcneel.myjetbrains.com/youtrack/issue/RH-2256
Since: 9.0

Rhino.DocObjects.RhinoObject.DestroyMeshes(Rhino.Geometry.MeshType)
Destroys cached meshes of type meshType
meshType: type of meshes to create
Returns: number of meshes created
Since: 9.0

Rhino.DocObjects.RhinoObject.CreateSlices(Rhino.Geometry.Plane,System.String,System.Double,System.Double,Rhino.DocObjects.ObjectAttributes[]@)
Generate slices by intersecting a plane with an object of type Brep, Extrusion, SubD , Mesh, or Block Instance.
centerPlane: Intesecting plane.
name: Name for section of objects.
thickness: Thickness of the slice. If thickness is less than tolerance, a surface will be created instead of a solid slice.
tolerance: The intersection tolerance. When in doubt, use the document's model absolute tolerance.
objectAttributes: Object attributes, one for each returned geometry item.
Returns: Slice geometry in the form of Breps, Extrusions, Meshes, and Curves if successful. An empty array if unsuccessful.
Since: 9.0

Rhino.DocObjects.RhinoObject.CreateSections(Rhino.Geometry.Plane,System.String,System.Double,Rhino.DocObjects.ObjectAttributes[]@)
Generate section curves by intersecting a plane with an object of type Brep, Extrusion, SubD ,Mesh or Block Instance.
plane: Intersecting plane.
name: Name for section of objects.
tolerance: The intersection tolerance. When in doubt, use the document's model absolute tolerance.
objectAttributes: Object attributes, one for each returned geometry item.
Returns: Section geometry in the form of Breps, Extrusions, Meshes, and Curves if successful. An empty array if unsuccessful.
Since: 9.0

Rhino.DocObjects.RhinoObject.DeleteHistoryRecord
For expert use only.
Deletes existing history record
Returns: true if history record was purged