Rhino.DocObjects.Tables.DimStyleTable.BuiltInStyles
Creates an array of default DimensionStyle objects
Since: 6.0

Rhino.DocObjects.Tables.DimStyleTable.PurgeUnused
Purges any unused dimension styles.
Returns: The number of unused dimension styles that were purged.
Since: 9.0