Rhino.ApplicationSettings.CurvatureGraphAnalysisSettings


Rhino.ApplicationSettings.CurvatureGraphAnalysisSettings.GetDefaultState
Gets the factory settings of the application.
Since: 9.0

Rhino.ApplicationSettings.CurvatureGraphAnalysisSettings.GetCurrentState
Gets the current settings of the application.
Since: 9.0

Rhino.ApplicationSettings.CurvatureGraphAnalysisSettings.RestoreDefaults
Commits the default settings as the current settings.
Since: 9.0

Rhino.ApplicationSettings.CurvatureGraphAnalysisSettings.UpdateFromState(Rhino.ApplicationSettings.CurvatureGraphAnalysisSettingsState)
Sets all settings to a particular defined joined state.
state: The particular state.
Since: 9.0

Rhino.ApplicationSettings.CurvatureGraphAnalysisSettings.HairScale
The hair scale.
100 = true length, greater than 100 magnified, less than 100 shortened
Since: 9.0

Rhino.ApplicationSettings.CurvatureGraphAnalysisSettings.ShowSrfuHair
Show surface u isocurve hair.
true if surface u isocurve hair is on
Since: 9.0

Rhino.ApplicationSettings.CurvatureGraphAnalysisSettings.ShowSrfvHair
Show surface v isocurve hair.
true if surface v isocurve hair is on
Since: 9.0

Rhino.ApplicationSettings.CurvatureGraphAnalysisSettings.HairDensity
The hair density.
>= 0 larger numbers = more hairs
Since: 9.0

Rhino.ApplicationSettings.CurvatureGraphAnalysisSettings.WireDensity
The wire density.
between -1 and 10. Higher numbers draw more surface subdivisions. This value does nothing for curves.
A value of -1 only draws the surface boundary.
Since: 9.0

Rhino.ApplicationSettings.CurvatureGraphAnalysisSettings.CurveHairColor
The hair color for curves.
Since: 9.0

Rhino.ApplicationSettings.CurvatureGraphAnalysisSettings.SrfuHairHairColor
The hair color for surface U.
Since: 9.0

Rhino.ApplicationSettings.CurvatureGraphAnalysisSettings.SrfvHairHairColor
The hair color for surface V.
Since: 9.0