Rhino.Geometry.Brep.CurveConstraint
Variational curve constraint (position)

Rhino.Geometry.Brep.CurveConstraint.#ctor(Rhino.Geometry.Curve)
Constructor, use curve as positional constraint
curve:

Rhino.Geometry.Brep.CurveConstraint.#ctor(Rhino.Geometry.Curve,Rhino.Geometry.Continuity)
Subclass constructor for any continuity
curve: The curve to use
continuity:

Rhino.Geometry.Brep.CurveConstraint.Curve
The constraint curve

Rhino.Geometry.Brep.CurveConstraint.Continuity
The constraint continuity