Rhino.Display.DisplayPipeline.SupportedMultisamlpleModes(Rhino.Display.DisplayTechnology)
Multisample modes available
technology:
Returns:

Rhino.Display.DisplayPipeline.DrawMeshShaded(Rhino.Geometry.Mesh,System.Drawing.Color,Rhino.Display.IsoDrawEffect)
Draws shaded mesh with isodraw settings applied (zebra)
mesh:
diffuseMaterialColor:
zebraSettings:

Rhino.Display.DisplayPipeline.DrawClippingPlaneWires(Rhino.Geometry.ClippingPlaneSurface,System.Drawing.Color)
Draw a cipping plane
clippingPlane:
color:

Rhino.Display.DisplayPipeline.DrawEmapPreview(Rhino.Geometry.Brep,System.Drawing.Color)
Draws a Brep in Environment Map preview.
brep: Brep to draw.
color: Objct color.
Since: 9.0

Rhino.Display.DisplayPipeline.DrawEmapPreview(Rhino.Geometry.Mesh,System.Drawing.Color)
Draws a Mesh in Environment Map preview.
mesh: Mesh to draw.
color: Objct color.
Since: 9.0

Rhino.Display.DisplayPipeline.DrawCurvaturePreview(Rhino.Geometry.Brep,System.Drawing.Color)
Draws a Brep in Curvature Analysis preview.
brep: Brep to draw.
color: Objct color.
Since: 9.0

Rhino.Display.DisplayPipeline.DrawCurvaturePreview(Rhino.Geometry.Mesh,System.Drawing.Color)
Draws a Mesh in Curvature Analysis preview.
mesh: Mesh to draw.
color: Objct color.
Since: 9.0

Rhino.Display.DisplayPipeline.DrawDraftAnglePreview(Rhino.Geometry.Brep,System.Drawing.Color)
Draws a Brep in Draft Angle preview.
brep: Brep to draw.
color: Objct color.
Since: 9.0

Rhino.Display.DisplayPipeline.DrawDraftAnglePreview(Rhino.Geometry.Mesh,System.Drawing.Color)
Draws a Mesh in Draft Angle preview.
mesh: Mesh to draw.
color: Objct color.
Since: 9.0