Rhino.PlugIns.CustomRenderSaveFileTypes.TypeList
Used to cache the list, the cache is built by the
OnCustomRenderSaveFileTypes callback and used by the
OnSaveCustomRenderFile callback to find the specific
save file callback.