Rhino.Geometry.LengthMassProperties.Sum(Rhino.Geometry.LengthMassProperties)
Sum mass properties together to get an aggregate mass.
summand: mass properties to add.
Returns: true if successful.

Rhino.Geometry.LengthMassProperties.Sum(System.Collections.Generic.IEnumerable{Rhino.Geometry.LengthMassProperties},System.Boolean)
Sum mass properties together to get an aggregate mass.
summands: An array of mass properties to add.
bAddTo: If true, then the summands are added to the existing mass.
Returns: True if successful.
Throws System.ArgumentNullException:

Rhino.Geometry.LengthMassProperties.WeightedSum(System.Collections.Generic.IEnumerable{Rhino.Geometry.LengthMassProperties},System.Collections.Generic.IEnumerable{System.Double})
Sum a list of mass properties together to get
an aggregate mass, weighting each by a density factor.Ignores existing
mass properties in this object.
summands: An array of mass properties to add.
weights: An array of non-negative densities, of the same length as summands.
Returns: An LengthMassProperties containing the result if successful, null if a failure occurs.
Throws System.ArgumentNullException: When summands or weights is null.