Rhino.DocObjects.Tables.MarkupTableEventArgs
markup table event arguments.
Since: 9.0

Rhino.DocObjects.Tables.MarkupTableEventArgs.Document
The Rhino document.
Since: 9.0

Rhino.DocObjects.Tables.MarkupTableEventArgs.EventType
The event type.
Since: 9.0

Rhino.DocObjects.Tables.MarkupTableEventArgs.Index
The index of the markup.
Since: 9.0

Rhino.DocObjects.Tables.MarkupTableEventArgs.NewState
The markup
Since: 9.0

Rhino.DocObjects.Tables.MarkupTableEventArgs.OldState
The old or previous markup.
Since: 9.0