Rhino.DocObjects.Tables.ObjectTable.AddGeometricTolerance(Rhino.Geometry.TextEntity,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
21-May-2025 Dale Fugier, https://mcneel.myjetbrains.com/youtrack/issue/RH-2256
Since: 9.0