Rhino.Geometry.Brep.PointConstraint
Constrain the result to go through a point

Rhino.Geometry.Brep.PointConstraint.#ctor(Rhino.Geometry.Point3d)
Constructor for a given location
point:

Rhino.Geometry.Brep.PointConstraint.Point
Location of the constraint