Rhino.Input.Custom.CommandLineOption.AcceleratorIndex
The index of the accelerator
Since: 9.0

Rhino.Input.Custom.CommandLineOption.AcceleratorChar
The accelerator character
Since: 9.0

Rhino.Input.Custom.CommandLineOption.SimpleOptionValue
The command option simple value
Since: 9.0

Rhino.Input.Custom.CommandLineOption.ColorOptionValue
The command option color value
Since: 9.0