Rhino.Geometry.Brep.SurfaceSettings
Settings for the surface creation

Rhino.Geometry.Brep.SurfaceSettings.#ctor
Constructor with defaults

Rhino.Geometry.Brep.SurfaceSettings.DegreeU
Surface degree in U-direction

Rhino.Geometry.Brep.SurfaceSettings.DegreeV
Surface degree in V-direction

Rhino.Geometry.Brep.SurfaceSettings.SpanCountU
Number of spans in U-direction

Rhino.Geometry.Brep.SurfaceSettings.SpanCountV
Number of spans in V-direction

Rhino.Geometry.Brep.SurfaceSettings.Domain
The domain creation option

Rhino.Geometry.Brep.SurfaceSettings.Stretching
Stretching to apply (default 0, better not change)

Rhino.Geometry.Brep.SurfaceSettings.Bending
Bending to apply (default 0.3)

Rhino.Geometry.Brep.SurfaceSettings.RocBending
Rate-of-change in bending to apply (default 0.7)

Rhino.Geometry.Brep.SurfaceSettings.UVRotation
The rotation angle of the UV domain

Rhino.Geometry.Brep.SurfaceSettings.MaxRefinements
The maximum number of refinements to apply (default 5).

Rhino.Geometry.Brep.SurfaceSettings.InitialSurface
The initial surface to use (default: null). The initial surface may not be rational.