Rhino.FileIO.File3dmSettings.ModelUnits
Gets or sets the model length units, using Rhino.LengthUnit value.
Since: 9.0

Rhino.FileIO.File3dmSettings.PageUnits
Gets or sets the page length units, using Rhino.LengthUnit value.
Since: 9.0