Rhino.Commands.UndoRedoEventArgs
Undo Redo Event Arguments
Since: 5.0

Rhino.Commands.UndoRedoEventArgs.DocumentSerialNumber
The document runtime serial number.
Since: 9.0

Rhino.Commands.UndoRedoEventArgs.CommandId
The id of the Rhino command. This can be Guid.Empty.
Since: 5.0

Rhino.Commands.UndoRedoEventArgs.UndoSerialNumber
The undo record serial number.
Since: 5.0