Rhino.RhinoMath.Integrate(System.Func{System.Object,System.Int32,System.Double,System.Double},System.Object,Rhino.Geometry.Interval,System.Double,System.Double,System.Double@)
Calculates the definite integral of a smooth (C-infinity)
function using a Rhomberg integration technique.
integrandFunction:
The integrand function is
double f(object context, int limit_direction, double t)
and returns the value of the integrand at t.
The limit_direction parameter will be -1, 0, or +1 and specifies
which limit direction should be used in the evaluation.
If limit_direction = 1, then the integrand may not be C-infinity at t and
should be evaluated using the limit from above.
If limit_direction = -1, then the integrand may not be C-infinity at t and
should be evaluated using the limit from below.
If limit_direction = 0, then the integrand is C-infinity at t and may
and evaluation from above and below will return the same answer.
context:
Anything you want to be passed to and used by the integrandFunction
limits:
Limits of integration. The integrand must be C-infinity on each
interval (limits[0],limits[1]).
relativeTolerance:
Desired relative tolerance.
If I = mathematical value and N = numerical integration value,
then the algorithm will terminate when
|I - N| <= relative_tolerance*|I|.
For example, if you want to know the answer with 5 digits of accuracy,
then pass 1e-5.
absoluteTolerance:
Desired absolute tolerance.
If I = mathematical value and N = numerical integration value,
then the algorithm will terminate when
|I - N| <= absolute_tolerance.
errorBound:
upper bound on the error in the calculation
Returns:
If the calulation succeeds, then the numerical integral is returned.
Otherwise double.NaN is returned.

Rhino.RhinoMath.Integrate(System.Func{System.Object,System.Int32,System.Double,System.Double},System.Object,Rhino.Geometry.Curve,System.Double,System.Double,System.Double@)
Calculates the definite integral of a smooth (C-infinity)
function of one variable using a Rhomberg integration technique
and returns returns Integral(f(t)*|curve'(t)|*dt).
The C-infinity requirement is used by the Rhomberg algorithm when
estimating error bounds and convergence. If you choose to pass a
C2 function, you are likely to converge while getting less accurate
results and incorrect error bound estimates.
Using a C0 or C1 fucntion will often return nonsense.
curve:
The integration is performed over the C-infinity spans of the curve
and |curve'(t)| is automatically included in the integrand.
The integrand must be C-infinity on the intesection each curve span
with the interval (limits[0],limits[1]).
The curve may have any dimension.
integrandFunction:
The integrand function is
double f(ON__UINT_PTR context, int limit_direction, double t)
and returns the value of the integrand at t.
The limit_direction parameter will be -1, 0, or +1 and specifies
which limit direction should be used in the evaluation.
If limit_direction = 1, then the integrand may not be C-infinity at t and
should be evaluated using the limit from above.
If limit_direction = -1, then the integrand may not be C-infinity at t and
should be evaluated using the limit from below.
If limit_direction = 0, then the integrand is C-infinity at t and may
and evaluation from above and below will return the same answer.
context:
First parameter passed into the integrand function.
relativeTolerance:
Desired relative tolerance.
If I = mathematical value and N = numerical integration value,
then the algorithm will terminate when
|I - N| <= relative_tolerance*|I|.
For example, if you want to know the answer with 5 digits of accuracy,
then pass 1e-5.
absoluteTolerance:
Desired absolute tolerance.
If I = mathematical value and N = numerical integration value,
then the algorithm will terminate when
|I - N| <= absolute_tolerance.
errorBound:
If error_bound is not nullptr, then the returned value is upper bound
on the error in the calculation.
If I = mathematical value and N = returned value,
then |I - N| <= *error_bound;
Returns:
If the calulation succeeds, then the numerical integral is returned.
Otherwise ON_DBL_QNAN is returned.

Rhino.RhinoMath.Integrate(System.Func{System.Object,System.Int32,System.Double,System.Double,System.Double},System.Object,Rhino.Geometry.Interval,Rhino.Geometry.Interval,System.Double,System.Double,System.Double@)
integrandFunction:
context:
limits1:
limits2:
relativeTolerance:
absoluteTolerance:
errorBound:
Returns:

Rhino.RhinoMath.Integrate(System.Func{System.Object,System.Int32,System.Double,System.Double,System.Double},System.Object,Rhino.Geometry.Surface,System.Double,System.Double,System.Double@)
integrandFunction:
context:
surface:
relativeTolerance:
absoluteTolerance:
errorBound:
Returns:

Rhino.RhinoMath.Minimize(System.Func{System.Object,System.Double[],System.Double[],System.Double},System.Object,Rhino.Geometry.Interval[],System.Double[],System.Double,System.Double,System.Double,System.Double,System.Int32,System.Double[]@,System.Boolean@)
Find a local minimum of the objective function f(t[]) of n independent variables.
The function must be C2 on the search domain. The search begins at t0[]
objectiveFunction:
The objective function which returns the value of the objective function of f() at (t[0], t[1], ..., t[n-1])
Caling f() should return grad = gradient of f at t.
context:
the context object passed to the objective function as first argument
limits:
Lower and upper bounds for each variable. These intervals should be finite at set to something reasonable.
t0:
The input array of n evaluation parameters where that specify where the search begins
terminateValue:
The search for a minimum will terminate and return t[] if f(t) <= terminate_value.
If you don't know what value of f(t) should terminate the search for a minimum,
then pass System.Double.NaN.
terminateGradient:
The search for a minimum will terminate and return t[] if |Grad(f)(t)| <= terminate_gradient.
If you don't know what gradient magnitude should stop the search for a minimum,
then pass System.Double.NaN.
relativeTolerance:
relative_tolerance > 0.
The search for a minimum will terminate when
2*|f(t + delta) - f(t)| <= relative_tolerance*(|f(t + delta)| + |f(t)|) + zero_tolerance.
For example, set relative_tolerance = 1e-6 if you want to find a t[] where the first 6 significant
digits of f(t) have stabilized during the search.
When in doubt, try 1e-6 and generally avoid values >= 1e-4. Always avoid values < 1e-16.
zeroTolerance:
zero_tolerance > 0.
See the description of the relative_tolerance parameter for the use of the zero_tolerance parameter.
When in doubt, pass something around 1e-16.
maxIterations:
The local minimum is found by iterating from the starting parameters t0[] to a local minimum.
Tha maximum_iterations parameter specifies the masimum number of iterations to try
before giving up. When in doubt, pass something around 200 for efficient evaluators
and smaller vaules for slow evaluators. In some situations, there may be significantly
more evaluations than maximum_iterations (from the line search step in each iteration).
t:
t[] is an output array of n evaluation parameters that specify where the search ended.
converged: converged will be true if the search terminated
because of the conditions controlled by terminate_value, relative_tolerance and relative_tolerance.
Otherwise converged will be false.
Returns: If successful, the local minimum value of f is returned. Otherwise System.Double.NaN is returned.