Rhino.Geometry.RhinoVariationalDomain
The type of trimming domain

Rhino.Geometry.RhinoVariationalDomain.Projected
Project the input curves to a least-squares plane

Rhino.Geometry.RhinoVariationalDomain.Molded
Project the input curves to a least-squares plane, then iteratively mold the surface to the constraints.

Rhino.Geometry.RhinoVariationalDomain.Untrimmed
Do not use a trimming domain