Rhino.Input.Custom.OptionString
RhinoGet string option helper
Since: 9.0

Rhino.Input.Custom.OptionString.#ctor(System.String)
Constructs the option object.
initialString: The initial value.
Since: 9.0

Rhino.Input.Custom.OptionString.#ctor(System.String,System.Boolean)
Constructs the option object.
initialString: The initial value.
allowEmptyString:
If false, the value is not allowed to be changed to an empty string. It is allowed to remain empty if it starts out as empty.
If true, the string is allowed to be changed to an empty string.
Since: 9.0

Rhino.Input.Custom.OptionString.Dispose
Since: 9.0

Rhino.Input.Custom.OptionString.CurrentValue
Gets and sets the current value of the option.
Since: 9.0

Rhino.Input.Custom.OptionString.InitialValue
Gets the initial value of the option.