Rhino.DocObjects.Tables.MarkupTable
Collection of markups for a document
Since: 9.0

Rhino.DocObjects.Tables.MarkupTable.Document
Document that owns this table.
Since: 9.0

Rhino.DocObjects.Tables.MarkupTable.Count
Returns number of markups in the table, including deleted markups.
Since: 9.0

Rhino.DocObjects.Tables.MarkupTable.ActiveCount
Returns number of markups in the table, excluding deleted markups.
Since: 9.0

Rhino.DocObjects.Tables.MarkupTable.Item(System.Int32)
Conceptually, the markup table is an array of markups. The
operator[] can be used to get individual markups. A markup is either
active or deleted and this state is reported by Markup.IsDeleted.
index: zero based array index.
Returns:
Reference to the markup.  If index is out of range, null is returned.
Note this reference may become invalid after AddMarkup() is called.
Since: 9.0

Rhino.DocObjects.Tables.MarkupTable.Find(System.String)
Finds the markup with a given name.
name:
The name of the markup to find. The search ignores case.
Returns:
If the markup was found, the markup index, >=0, is returned.
If the markup was not found, -1 is returned.
Since: 9.0

Rhino.DocObjects.Tables.MarkupTable.Find(System.Guid,System.Boolean)
Finds a markup with a matching ID.
id: The ID of the markup to be found.
ignoreDeletedMarkups:
If true, deleted markups are not checked.
Returns:
If the markup was found, the markup index, >=0, is returned.
If the markup was not found, -1 is returned.
Since: 9.0

Rhino.DocObjects.Tables.MarkupTable.FindName(System.String)
Finds the markup with a given name.
name: The name of the markup to find.
Returns:
The markup if found; otherwise null.
Since: 9.0

Rhino.DocObjects.Tables.MarkupTable.FindIndex(System.Int32)
Retrieves a markup based on Index. This type of search is discouraged.
We are moving towards using only IDs for all tables.
index: The index to search for.
Returns: A SectionStyle object, or null if none was found.
Since: 9.0

Rhino.DocObjects.Tables.MarkupTable.Add(Rhino.DocObjects.Markup)
Adds a new markup with specified definition to the table.
markup:
Definition of new markup. The information in markup is
copied. If markup.Name is empty then a unique name of the form
"Markup 01" will be automatically created.
Returns:
Index of new markup type or -1 on error.
Since: 9.0

Rhino.DocObjects.Tables.MarkupTable.AddReferenceMarkup(Rhino.DocObjects.Markup)
Adds a reference markup that will not be saved in files.
markup:
Definition of new markup. The information in markup is
copied. If markup.Name is empty then a unique name of the form
"Markup 01" will be automatically created.
Returns:
Index of new markup or -1 on error.
Since: 9.0

Rhino.DocObjects.Tables.MarkupTable.Modify(Rhino.DocObjects.Markup,System.Int32,System.Boolean)
Modify markup settings.
markup: New markup settings. This information is copied.
index: Zero based index of markup to set.
quiet:
if true, information message boxes pop up when illegal changes are attempted.
Returns:
true if successful. false if index is out of range.
Since: 9.0

Rhino.DocObjects.Tables.MarkupTable.Delete(System.Int32,System.Boolean)
Deletes a markup.
index: zero based index of markup to delete.
quiet:
If true, no warning message box appears if a markup is in use.
Returns:
true if successful. false if index is out of range or the
markup is referenced by active geometry.
Since: 9.0

Rhino.DocObjects.Tables.MarkupTable.Delete(Rhino.DocObjects.Markup)
Deletes a markup.
item: The markup to delete.
Returns: true if successful, false otherwise.
Since: 9.0

Rhino.DocObjects.Tables.MarkupTable.Delete(System.Collections.Generic.IEnumerable{System.Int32},System.Boolean)
Delete multiple markups.
markupIndices: An enumeration of markup indices.
quiet: If true, no warning message box appears if a markup is in use.
Returns: The number of markups that were deleted.
Since: 9.0

Rhino.DocObjects.Tables.MarkupTable.Delete(System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Int32)
Delete multiple markups.
markupIndices: An enumeration of markup indices.
quiet: If true, no warning message box appears if a markup is in use.
deleteWarning:
Action to take when multiple delete warnings occur, where: 0 == No to all, 1 == Yes to all, 2 == Ask the user.
Returns: The number of markups that were deleted.
Since: 9.0

Rhino.DocObjects.Tables.MarkupTable.GetUnusedMarkupName
Gets unused markup name used as default when creating new markups.
Returns: The unused name.
Since: 9.0