Rhino.UI.DrawingUtilities.MakeArgb(System.Byte,System.Byte,System.Byte,System.Byte)
Stores a color into an integer from 4 bytes.
a: Alpha (between 0 and 255)
r: Red (between 0 and 255)
g: Green (between 0 and 255)
b: Blue (between 0 and 255)
Returns: An integer containing the ARGB data
Since: 8.0

Rhino.UI.DrawingUtilities.PixelsFromSvg(System.String,System.Int32,System.Int32,System.Boolean,System.Drawing.Color)
Get array of bytes that represent RGBA values for an image of a given
size created from SVG
svg: A valid svg string
width: Width of the svg in pixels
height: Height of the svg in pixels
premultiplyAlpha: Pre-lends the background color with the pixels based on their alpha value
backgroundColor: Background color - pass Color.Empty if you don't know what to pass.
Returns: Null on an exception, an array of System.Drawing.Color as bytes otherwise
Since: 8.0

Rhino.UI.DrawingUtilities.PixelsFromSvg(System.String,System.Int32,System.Int32,System.Boolean,System.Drawing.Color,System.Boolean)
Get array of bytes that represent RGBA values for an image of a given
size created from SVG
svg: A valid svg string
width: Width of the svg in pixels
height: Height of the svg in pixels
premultiplyAlpha: Pre-lends the background color with the pixels based on their alpha value
backgroundColor: Background color - pass Color.Empty if you don't know what to pass.
adjustForDarkMode: If true swaps any available attributes for their dark mode counterparts>
Returns: Null on an exception, an array of System.Drawing.Color as bytes otherwise
Since: 8.0

Rhino.UI.DrawingUtilities.DarkModeConvertPixel(System.Byte@,System.Byte@,System.Byte@)
Attempt to adjust pixels to an image that works for dark mode
r: Red
g: Green
b: Vlue
Since: 8.0

Rhino.UI.DrawingUtilities.BitmapFromSvg(System.String,System.Int32,System.Int32)
Create bitmap of a given size from an svg string
svg: A valid svg string
width: Width of the svg in pixels
height: Height of the svg in pixels
Returns:
Since: 7.6

Rhino.UI.DrawingUtilities.BitmapFromSvg(System.String,System.Int32,System.Int32,System.Boolean)
Create bitmap of a given size from an svg string
svg: A valid svg string
width: Width of the svg in pixels
height: Height of the svg in pixels
adjustForDarkMode: If true dark mode specific attributes will be used in the svg
Returns: A
Since: 8.0