Rhino.Render.RenderContent.IsOverridden(System.Reflection.MethodInfo)
Checks if a method is overridden.
method:
Returns:

Rhino.Render.RenderContent.GetUnderlyingInstances(Rhino.Render.RenderContentCollection)
Since: 7.0
DO NOT CALL THIS FUNCTION IN NEW CODE. IT WILL BE DEPRECATED ASAP.

Rhino.Render.RenderContent.ConvertUnits(Rhino.LengthUnit,Rhino.LengthUnit)
Modify your content so that it is converted from meters into the units of the unit system.
No need to call the base class when you override this, and no need to recurse into children.
Since: 9.0