Rhino.RhinoDoc.ModelUrl
Gets and sets the link address, or URL, for the model.
Since: 9.0

Rhino.RhinoDoc.GetModelUrl(System.String@,System.String@)
Gets the link address, or URL, for the model.
url: The URL.
urlDescription: The URL description.
Since: 9.0

Rhino.RhinoDoc.SetModelUrl(System.String,System.String)
Sets the link address, or URL, for the model.
url: The URL.
urlDescription: The URL description.
Since: 9.0

Rhino.RhinoDoc.DistanceDisplayPrecision
Since: 5.0
9.0

Rhino.RhinoDoc.ModelUnits
Length unit used on model space.
Since: 9.0

Rhino.RhinoDoc.PageUnits
Length unit used on page space geometry.
Since: 9.0

Rhino.RhinoDoc.SectionStyles
Collection of section styles in this document

Rhino.RhinoDoc.Markups
Collection of markups in this document

Rhino.RhinoDoc.TimeoutActiveGet
Exit the active get operation with a timeout

Rhino.RhinoDoc.SectionStyleTableEvent
Called when any modification happens to a document's section style table.
Since: 9.0

Rhino.RhinoDoc.MarkupTableEvent
Called when any modification happens to a document's markup table.
Since: 9.0