Rhino.ApplicationSettings.CurvatureGraphAnalysisSettingsState
Represents a snapshot of Rhino.ApplicationSettings.CurvatureGraphAnalysisSettings

Rhino.ApplicationSettings.CurvatureGraphAnalysisSettingsState.HairScale
The hair scale.
100 = true length, greater than 100 magnified, less than 100 shortened
Since: 9.0

Rhino.ApplicationSettings.CurvatureGraphAnalysisSettingsState.ShowSrfuHair
Show surface u isocurve hair.
true if surface u isocurve hair is on
Since: 9.0

Rhino.ApplicationSettings.CurvatureGraphAnalysisSettingsState.ShowSrfvHair
Show surface v isocurve hair.
true if surface v isocurve hair is on
Since: 9.0

Rhino.ApplicationSettings.CurvatureGraphAnalysisSettingsState.HairDensity
The hair density.
>= 0 larger numbers = more hairs
Since: 9.0

Rhino.ApplicationSettings.CurvatureGraphAnalysisSettingsState.WireDensity
The wire density.
between -1 and 10. Higher numbers draw more surface subdivisions. This number does nothing for curves.
Since: 9.0

Rhino.ApplicationSettings.CurvatureGraphAnalysisSettingsState.CurveHairColor
The hair color for curves.
Since: 9.0

Rhino.ApplicationSettings.CurvatureGraphAnalysisSettingsState.SrfuHairHairColor
The hair color for surface U.
Since: 9.0

Rhino.ApplicationSettings.CurvatureGraphAnalysisSettingsState.SrfvHairHairColor
The hair color for surface V.
Since: 9.0