Rhino.DocObjects.SectionStyle.IsUnset
Returns true if the section style is unset.
Since: 9.0

Rhino.DocObjects.SectionStyle.CreatePreviewGeometry(Rhino.RhinoDoc,System.Int32,System.Int32)
Work in progress. Keep internal while we figure out what we eventually
need from our section style previewer
doc:
width:
height:
Returns:

Rhino.DocObjects.SectionStyle.InUse
Returns true if a section style is use by an object, layer, or instance definition.
Since: 9.0

Rhino.DocObjects.SectionStyle.ReadFromFile(System.String,Rhino.DocObjects.SectionStyle[]@,Rhino.DocObjects.HatchPattern[]@)
Reads linetypes from a Rhino .3dm file.
filename: The path to the file to read.
sectionStyles:
An array of section styles, or an empty array if the file had no section styles.
hatchPatterns:
An array of hatch patterns reference by the section styles, or an empty array
if the file has no section styles or if none of the sections styles uses a hatch pattern.
The section style's Rhino.DocObjects.SectionStyle.HatchIndex property references hatch patterns in this array.
Returns: True if the file was read successfully, false otherwise.
Since: 9.0