Rhino.DocObjects.Tables.MarkupTableEventType
Since: 9.0

Rhino.DocObjects.Tables.MarkupTableEventType.Added
A markup was added to the document's markup table.
Since: 9.0

Rhino.DocObjects.Tables.MarkupTableEventType.Deleted
A markup in the document's markup table was deleted.
Since: 9.0

Rhino.DocObjects.Tables.MarkupTableEventType.Undeleted
A markup in the document's markup table was undeleted.
Since: 9.0

Rhino.DocObjects.Tables.MarkupTableEventType.Modified
A markup in the document's markup table was modified.
Since: 9.0

Rhino.DocObjects.Tables.MarkupTableEventType.Sorted
The document's markup table was sorted.
Since: 9.0