Rhino.Render.UICommands.RenderUICommandContext.ContentTypeBrowserNew
Content New / Existing Browser 'new' page.

Rhino.Render.UICommands.RenderUICommandContext.ContentTypeBrowserExisting
Content New / Existing Browser 'existing' page.

Rhino.Render.UICommands.RenderUICommandContext.AddDecalButton
The 'Add decal' button on the decals panel.