Rhino.ApplicationSettings.EmapAnalysisSettingsState
Represents a snapshot of Rhino.ApplicationSettings.EmapAnalysisSettings.

Rhino.ApplicationSettings.EmapAnalysisSettingsState.FileName
Gets or sets the current emap file name.
Since: 9.0

Rhino.ApplicationSettings.EmapAnalysisSettingsState.BlendWithObjectColor
Gets or sets whether to blend the image with the object's color.
Since: 9.0

Rhino.ApplicationSettings.EmapAnalysisSettingsState.ShowIsoparams
Gets or sets whether to display iso curves.
Since: 9.0