Rhino.Geometry.Brep.CreateFilletSurfaceCurve(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.Curve,System.Double,Rhino.Geometry.Brep.FilletSurfaceSettings,Rhino.Geometry.Brep.FilletSurfaceResults@)
Create a fillet (rational arcs or non-rational arc approxiation or chamfered surface
face: Face to fillet from.
uv: A parameter on the face at the side you want to keep after filleting.
curve: Curve to fillet to.
t: A parameter on the curve close to the point on the face.
settings: The settings to use for filleting
results: If true is returned, this contains the fillet results.
Returns: true if successful
Throws System.ArgumentNullException:

Rhino.Geometry.Brep.CreateFilletSurface(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.Brep.FilletSurfaceSettings,Rhino.Geometry.Brep.FilletSurfaceResults@)
Create a fillet (rational arcs or non-rational arc approxiation or chamfered surface
face0: First face to fillet from.
uv0: A parameter face0 at the side you want to keep after filleting.
face1: Second face to fillet from.
uv1: A parameter face1 at the side you want to keep after filleting.
settings: The settings to use for filleting/chamfering
results: If true is returned, this contains the fillet results.
Returns: true if successful
Throws System.ArgumentNullException:

Rhino.Geometry.Brep.CreateFilletEdges(Rhino.Geometry.Brep,System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},Rhino.Geometry.BlendType,Rhino.Geometry.RailType,System.Boolean,System.Double,System.Double)
Fillets, chamfers, or blends the edges of a brep.
brep: The brep to fillet, chamfer, or blend edges.
edgeIndices: An array of one or more edge indices where the fillet, chamfer, or blend will occur.
startRadii: An array of starting fillet, chamfer, or blend radaii, one for each edge index.
endRadii: An array of ending fillet, chamfer, or blend radaii, one for each edge index.
blendType: The blend type.
railType: The rail type.
setbackFillets: Use setback fillets (not used with blendType=Rhino.Geometry.BlendType.Chamfer)
tolerance: The tolerance to be used to perform calculations.
angleTolerance: Angle tolerance to be used to perform calculations [radians]. If unsure, use Math.PI/180.0 (one degree)
Returns: Array of Breps if successful.
Since: 8.6

Rhino.Geometry.Brep.CreateFilletEdgesVariableRadius(Rhino.Geometry.Brep,System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IDictionary{System.Int32,System.Collections.Generic.IList{Rhino.Geometry.BrepEdgeFilletDistance}},Rhino.Geometry.BlendType,Rhino.Geometry.RailType,System.Boolean,System.Double,System.Double)
Fillets, chamfers, or blends the edges of a brep.
brep: The brep to fillet, chamfer, or blend edges.
edgeIndices: An array of one or more edge indices where the fillet, chamfer, or blend will occur.
edgeDistances: A dictionary with key the edge index on the input brep, and value a list of Rhino.Geometry.BrepEdgeFilletDistance items to apply.
blendType: The blend type.
railType: The rail type.
setbackFillets: Use setback fillets (not used with blendType=Rhino.Geometry.BlendType.Chamfer)
tolerance: The tolerance to be used to perform calculations.
angleTolerance: Angle tolerance to be used to perform calculations [radians].
Returns: Array of Breps if successful.
Since: 8.6

Rhino.Geometry.Brep.CreateVariationalPatch(System.Collections.Generic.IList{Rhino.Geometry.Brep.CurveConstraint},System.Collections.Generic.IList{Rhino.Geometry.Brep.CurveConstraint},System.Collections.Generic.IList{Rhino.Geometry.Brep.PointConstraint},System.Collections.Generic.IList{Rhino.Geometry.Brep.NormalConstraint},Rhino.Geometry.Brep.SurfaceSettings,System.Double,System.Double,System.Double,System.Double,System.Boolean,System.Threading.CancellationToken,System.IProgress{System.Double},System.Boolean@,System.Boolean@,System.Boolean@,System.Boolean@,System.String@,System.String@)
Create a patch using variational approach
edges: Edges with continuity constraints
internalCurves: Internal curves
points: Internal points
normals: Internal normals (currrently not used)
settings: The settings to use while creating the surface
tolerance: Positional tolerance
angleToleranceRadians: Tangential tolerance
curvatureTolerance: Curvature tolerance
internalTolerance: Internal curve and point tolerance
multiThreading: Use multi-threading during the calculation
cancelToken: The cancellation token.
progress: The provider for progress updates.
g0internal: true if internal curve and point constraints are met
g0: returns true if positional constraints are met
g1: returns true if tangential constraints are met
g2: returns true if cuvature constraints are met
warning: can contain warning(s) even if succesful
error: contains error if not successful
Returns: Trimmed surface if successful, null otherwise