Rhino.ApplicationSettings.GeneralSettings.SplitCreasedSurfaces
Should surfaces be split into polysurfaces with smooth faces.
This setting is read-only.

Rhino.ApplicationSettings.GeneralSettings.PopupMenuFavorites
Gets or sets the popup menu favorites