Rhino.DocObjects.HatchPattern.GetDefaultHatchPatterns
Gets Rhino default hatch patterns. These patterns are not in the document hatch pattern table.
Returns: An array of hatch patterns.
Since: 9.0

Rhino.DocObjects.HatchPattern.PatternUnitSystem
Hatchpattern patterns are typically defined as distances on
the printed output when printing. In this case PatternUnitSystem is
UnitSystem.None (default). When set to any other unit system,
the hatch pattern will be scaled acordingly.
Since: 9.0

Rhino.DocObjects.HatchPattern.AlwaysModelDistances
Hatchpattern patterns are typically interpreted as distances on
the printed output when printing. In this case AlwaysModelDistances is
false (default). When set to true, the hatch pattern will
be interpreted as being in world distances.
Since: 9.0