Rhino.Geometry.Morphs.MeshCageMorph
Morph used by MeshCageMorph command

Rhino.Geometry.Morphs.MeshCageMorph.#ctor(Rhino.Geometry.Mesh,Rhino.Geometry.Mesh)
Constructs a mesh cage morph
referenceMesh:
targetMesh:

Rhino.Geometry.Morphs.MeshCageMorph.IsValid
Returns true if the space morph definition is valid, false otherwise.

Rhino.Geometry.Morphs.MeshCageMorph.MorphPoint(Rhino.Geometry.Point3d)
Morphs an Euclidean point.
point: A point that will be morphed by this object.
Returns: Resulting morphed point.

Rhino.Geometry.Morphs.MeshCageMorph.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Geometry.Morphs.MeshCageMorph.Dispose
Actively reclaims unmanaged resources that this instance uses

Rhino.Geometry.Morphs.MeshCageMorph.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.