Rhino.Render.Utilities.ShowContentChooser(System.Guid,System.Guid,Rhino.Render.RenderContentKind,System.Guid@,Rhino.Render.RenderContent.ShowContentChooserFlags,Rhino.RhinoDoc)
Shows the Content New / Existing Browser to allow the user to select a new or existing content.
Since: 6.25
7.9

Rhino.Render.Utilities.ShowContentChooser(Rhino.RhinoDoc,System.Guid,System.Guid,Rhino.Render.RenderContentKind,Rhino.Render.RenderContent.ShowContentChooserFlags,System.String,System.Collections.Generic.IEnumerable{System.String},System.Collections.Generic.IEnumerable{System.Guid},System.Guid[]@)
Shows the Content New / Existing Browser to allow the user to select a new or existing content.
Since: 7.6
7.9

Rhino.Render.Utilities.ShowContentChooser(Rhino.RhinoDoc,System.Guid,System.Guid,Rhino.Render.RenderContentKind,Rhino.Render.Utilities.ContentChooserFlags,System.String,System.Collections.Generic.IEnumerable{System.String},System.Collections.Generic.IEnumerable{System.Guid},System.Guid[]@)
Shows the Content New / Existing Browser to allow the user to select a new or existing
content, or multiple contents.
Since: 7.9
9.0

Rhino.Render.Utilities.ShowContentNewExistingBrowser(Rhino.RhinoDoc,System.Guid,System.Guid,Rhino.Render.RenderContentKind,Rhino.Render.Utilities.ContentNewExistingFlags,System.String,System.Collections.Generic.IEnumerable{System.String},System.Collections.Generic.IEnumerable{System.Guid},System.Guid[]@)
Shows the Content New / Existing Browser to allow the user to select a new or existing
content, or multiple contents.
doc: A Rhino document.
defaultType: The content type that will be initially selected in the 'New' tab.
defaultInstanceId: The content instance that will be initially selected in the 'Existing' tab.
kinds: Semicolon-delimited string specifying which content kinds will be displayed.
flags: Flags controlling the browser (tabs to hide, type of selection).
presetCategory: Specifies the category to preset in the drop-down list on the 'New' tab. If this string is empty, the preset category will be 'All'.
categories: Specifies the categories to display. Render contents that do not belong to one of these categories will not be listed. If this array is empty, all render contents from all categories will be listed.
types: Specifies content types to display. Contents that are not one of these types will not be listed. If this array is empty, all content types will be listed.
contents: Array of Guid(s) of the chosen item(s). Depending on the result, this can accept type id(s) of content type(s) or instance id(s) of existing content(s).
Returns: The result of displaying the browser.
Since: 9.0