Rhino.Input.Custom.GetCylinder.Get(Rhino.Geometry.Extrusion@)
Prompt for the getting of a cylinder.
cylinder: The cylinder geometry defined by the user.
Returns: The result of the getting operation.
Since: 6.0