Rhino.Geometry.Curve.SortCurves(System.Collections.Generic.ICollection{Rhino.Geometry.Curve},System.Double,System.Collections.Generic.IList{System.Collections.Generic.IList{Rhino.Geometry.Curve.SortedSegment}}@)
Sorts the curves into joinable segment groups. No joining is performed, the curves are only analyzed for start/end proximity.
inputCurves: The curves to sort
tolerance: The tolerance to bridge any gaps between curves
groups: The groups of curves that can be formed upon joining.
A curve that cannot be joined to any other curve forms a group of size 1. No joining is performed.
Returns:

Rhino.Geometry.Curve.RebuildElmo(System.Int32,System.Int32,System.Boolean)
Rebuild a curve with a specific point count and degree.
Work in progress. This function is likely to change.
pointCount: Number of control points in the rebuilt curve.
degree: Degree of the rebuilt curve. Valid values are between and including 1 and 11.
preserveTangents: If true, the end tangents of the input curve will be preserved.
Returns: A NURBS curve on success or null on failure.
Since: 9.0