Rhino.Geometry.SurfaceFilletBase.#ctor(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,System.Double,System.Boolean,System.Double)
FaceA:
uvA:
FaceB:
uvB:
radius0:
radius1:
allowExtend:
tolerance:

Rhino.Geometry.SurfaceFilletBase.Lines(System.Int32,System.Boolean,System.Collections.Generic.List{Rhino.Geometry.Brep})
make chamfer surfaces and hack them up to active pieces. Adjusts cross sections
railDegree: The degree of the rail
bExtend: If true, when one input surface is longer than the other, the fillet surface is extended to the input surface edges.
Fillets: the fillet8s that were created
Returns: true if successful
Since: 9.0