Rhino.DocObjects.Tables.SectionStyleTableEventArgs
Section style table event arguments.
Since: 9.0

Rhino.DocObjects.Tables.SectionStyleTableEventArgs.Document
The Rhino document.
Since: 9.0

Rhino.DocObjects.Tables.SectionStyleTableEventArgs.EventType
The event type.
Since: 9.0

Rhino.DocObjects.Tables.SectionStyleTableEventArgs.Index
The index of the section style.
Since: 9.0

Rhino.DocObjects.Tables.SectionStyleTableEventArgs.NewState
The section style.
Since: 9.0

Rhino.DocObjects.Tables.SectionStyleTableEventArgs.OldState
The old or previous section style.
Since: 9.0