Rhino.Runtime.InteropWrappers.SimpleArrayVector3d
ON_SimpleArray<ON_3dVector>, ON_3dVectorArray all have the same size
This class wraps all of these C++ versions.  If you are not writing C++ code then this
class is not for you.

Rhino.Runtime.InteropWrappers.SimpleArrayVector3d.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayVector3d.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.

Rhino.Runtime.InteropWrappers.SimpleArrayVector3d.#ctor
Initializes a new empty Rhino.Runtime.InteropWrappers.SimpleArrayVector3d instance.

Rhino.Runtime.InteropWrappers.SimpleArrayVector3d.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.Vector3d})
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayVector3d instance from a set of vectors
vectors:

Rhino.Runtime.InteropWrappers.SimpleArrayVector3d.Count
Gets the amount of vectors in this array.

Rhino.Runtime.InteropWrappers.SimpleArrayVector3d.Add(Rhino.Geometry.Vector3d)
Adds a vector to the list
v:

Rhino.Runtime.InteropWrappers.SimpleArrayVector3d.ToArray
Copies the unmanaged array to a managed counterpart.
Returns: The managed array.

Rhino.Runtime.InteropWrappers.SimpleArrayVector3d.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.SimpleArrayVector3d.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Runtime.InteropWrappers.SimpleArrayVector3d.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.