Rhino.Geometry.Dimension.UpdateDimensionText(Rhino.DocObjects.DimensionStyle,Rhino.LengthUnit)
Remakes dimension text geometry object and sets it on the dimension.
style: The dimension style.
units: The length units.
Since: 9.0