Rhino.FileIO.FileDwgWriteOptions.AutocadVersion.Release12
Acad 12, vAC12

Rhino.FileIO.FileDwgWriteOptions.AutocadVersion.Release13
Acad 13, vAC13

Rhino.FileIO.FileDwgWriteOptions.AutocadVersion.Release14
Acad 14, vAC14

Rhino.FileIO.FileDwgWriteOptions.AutocadVersion.Acad2000
Acad 2000, vAC15

Rhino.FileIO.FileDwgWriteOptions.AutocadVersion.Acad2004
Acad 2004, vAC18

Rhino.FileIO.FileDwgWriteOptions.AutocadVersion.Acad2007
Acad 2007, vAC21

Rhino.FileIO.FileDwgWriteOptions.AutocadVersion.Acad2010
Acad 2010, vAC24

Rhino.FileIO.FileDwgWriteOptions.AutocadVersion.Acad2013
Acad 2013, vAC27

Rhino.FileIO.FileDwgWriteOptions.AutocadVersion.Acad2018
Acad 2018, vAC32