Rhino.ApplicationSettings.ThicknessAnalysisSettingsState
Represents a snapshot of Rhino.ApplicationSettings.ThicknessAnalysisSettings.
Since: 9.0

Rhino.ApplicationSettings.ThicknessAnalysisSettingsState.DistanceRange
The distance range.
Since: 9.0

Rhino.ApplicationSettings.ThicknessAnalysisSettingsState.ShowIsoCurves
Get or sets the display of surface isocurves.
Since: 9.0