Rhino.DocObjects.EarthAnchorPoint.GetModelToEarthTransform(Rhino.LengthUnit)
Gets a transformation from model coordinates to earth coordinates.
This transformation assumes the model is small enough that
the curvature of the earth can be ignored.
modelUnits: The model length unit.
Returns:
Transform on success. Invalid Transform on error.
Remarks:
If M is a point in model coordinates and E = model_to_earth*M,
then
E.x = latitude in decimal degrees
E.y = longitude in decimal degrees
E.z = elevation in meters above mean sea level
Because the earth is not flat, there is a small amount of error
when using a linear transformation to calculate oblate spherical
coordinates.  This error is small.  If the distance from P to M
is d meters, then the approximation error is
latitude error  <=
longitude error <=
elevation error <= 6379000*((1 + (d/6356000)^2)-1) meters
In particular, if every point in the model is within 1000 meters of
the m_model_basepoint, then the maximum approximation errors are
latitude error  <=
longitude error <=
elevation error <= 8 centimeters.
Since: 9.0