Rhino.Geometry.Box.#ctor(Rhino.Geometry.Box)
Copy constructor.
other: The source box.
Since: 7.0

Rhino.Geometry.Box.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.BoundingBox)
Initializes a box from a base plane and a world-aligned bounding box.
The box will use basePlane for its Plane, and the X, Y, and Z intervals
of boundingbox as its X, Y, and Z intervals.
basePlane: Base plane of bounding box.
boundingbox: Bounding Box in plane coordinates.
Remarks: The box might not contain boundingbox.
Since: 5.0

Rhino.Geometry.Box.Area
Gets the total surface area of this box, or Rhino.RhinoMath.UnsetValue for an invalid box.
Since: 5.0

Rhino.Geometry.Box.Volume
Gets the total volume of this box, or Rhino.RhinoMath.UnsetValue for an invalid box.
Since: 5.0

Rhino.Geometry.Box.PointAt(System.Double,System.Double,System.Double)
Evaluates the box at the given unitized parameters.
The box is parametrized with a side length of 1x1x1.
x: Unitized parameter (between 0 and 1 is inside the box) along box X direction.
y: Unitized parameter (between 0 and 1 is inside the box) along box Y direction.
z: Unitized parameter (between 0 and 1 is inside the box) along box Z direction.
Returns: The point at (x,y,z).
Since: 5.0

Rhino.Geometry.Box.FurthestPoint(Rhino.Geometry.Point3d)
Finds the furthest point on the boundary of this Box. The Box should be Valid for this to work properly.
point: Sample point.
Returns: The point on boundary of the the box that is furthest from the sample point.
Since: 5.0

Rhino.Geometry.Box.Contains(Rhino.Geometry.Point3d)
Determines whether a point is inside this Box, including its boundary.
This is the same as calling Contains(point,false).
Invalid boxes contain nothing. Invalid points are never contained.
point: Point to test.
Returns: true if the point is in the inside or on the boundary of this Box. false if this Box or the Point are invalid.
Since: 5.0

Rhino.Geometry.Box.Contains(Rhino.Geometry.Point3d,System.Boolean)
Determines whether a point is (strictly, if strict is true) inside this Box.
Invalid boxes contain nothing. Invalid points are never contained.
point: Point to test.
strict: If true, the point needs to be strictly inside this Box.
I.e. points on the boundary of this Box will be considered 'outside'.
Returns: true if the point is (strictly, if strict is true) inside this Box. false if this Box or the Point are invalid.
Since: 5.0

Rhino.Geometry.Box.Contains(Rhino.Geometry.BoundingBox)
Determines whether a BoundingBox is inside this Box, including its boundary.
This is the same as calling Contains(box,false).
Invalid boxes contain nothing. Invalid bounding boxes are never contained.
box: BoundingBox to test.
Returns: true if all corners of the BoundingBox are non-strictly inside this Box. false if this Box or the BoundingBox are invalid.
Since: 5.0

Rhino.Geometry.Box.Contains(Rhino.Geometry.BoundingBox,System.Boolean)
Determines whether a BoundingBox is inside this Box (strict inclusion, if strict is true).
Invalid boxes contain nothing. Invalid bounding boxes are never contained.
box: BoundingBox to test.
strict:
If true, the BoundingBox needs to be strictly inside this Box, i.e. all corners of the BoundingBox are strictly inside this Box.
If false, the BoundingBox can be touching this Box's boundary, i.e. all corners of the BoundingBox are non-strictly inside this Box.
Returns: true if the box is (strictly, if strict is true) inside this Box. false if this Box or the BoundingBox are invalid.
Since: 5.0

Rhino.Geometry.Box.Contains(Rhino.Geometry.Box)
Determines whether a Box is inside this Box, including its boundary.
This is the same as calling Contains(box,false).
Invalid boxes contain nothing. Invalid boxes are never contained.
box: Box to test.
Returns: true if all corners of the Box are non-strictly inside this Box. false if this Box or the tested Box are invalid.
Since: 5.0

Rhino.Geometry.Box.Contains(Rhino.Geometry.Box,System.Boolean)
Determines whether a Box is inside this Box (strict inclusion, if strict is true).
Invalid boxes contain nothing. Invalid boxes are never contained.
box: Box to test.
strict:
If true, the tested Box needs to be strictly inside this Box, i.e. all corners of the BoundingBox are strictly inside this Box.
If false, the tested Box can be touching this Box's boundary, i.e. all corners of the BoundingBox are non-strictly inside this Box.
Returns: true if the box is (strictly) on the inside of this Box. false if this Box or the tested Box are invalid.
Since: 5.0

Rhino.Geometry.Box.Union(Rhino.Geometry.Point3d)
Constructs a union between this Box and the given point.
This grows the box in directions so it contains the point.
point: Point to include.
Remarks: If this box is invalid, it becomes the box containing only the point,
with the same orientation or the WorldXY's orientation if the orientation was invalid.
If point is invalid or can't be projected, this box is unchanged.
Since: 5.0

Rhino.Geometry.Box.MakeValid
DO NOT USE THIS FUNCTION
If some of the box's values (Plane origin or axis, intervals bounds) are unset, do nothing.
Else, make the Box valid by reversing the non-increasing intervals of this box.
This is almost never what you want because it only makes Empty boxes not empty and with non-zero length.
Returns: true if the box was made valid, or if it was valid to begin with.
false if the box remains unchanged.
Since: 5.0

Rhino.Geometry.Box.GetCorners
Gets an array of the 8 corner points of this box, or an empty array if this box is not valid.
Returns: An array of 0 or 8 corners.
Since: 5.0

Rhino.Geometry.Box.Transform(Rhino.Geometry.Transform)
Transforms this Box using a Transformation matrix. If the Transform is not a
Similarity, the dimensions of the resulting box cannot be trusted.
xform: Transformation matrix to apply to this Box.
Returns: true if the Box was successfully transformed, false otherwise.
Since: 5.0

Rhino.Geometry.Box.EpsilonEquals(Rhino.Geometry.Box,System.Double)
Check that all values in Box other are within epsilon of the values in this Box.
other:
epsilon:
Returns:
Since: 5.4

Rhino.Geometry.Box.Clone
Returns a deep copy of this instance.
Returns: A plane with the same values as this item.
Since: 9.0