Rhino.Geometry.Ellipse.TryFitEllipseToPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.Geometry.Ellipse@)
Attempt to fit an ellipse through a set of points.
points: The points through which to fit.
ellipse: The resulting ellipse on success.
Returns: true on success, false on failure.
Since: 9.0