Rhino.DocObjects.Markup
Markup elements that store image data when users create markups

Rhino.DocObjects.Markup.#ctor
Create a new instance of a Markup

Rhino.DocObjects.Markup.#ctor(Rhino.DocObjects.Markup)
Create a new Markup that is a copy of another Markup

Rhino.DocObjects.Markup.IsUnset
Returns true if the markup is unset.
Since: 9.0

Rhino.DocObjects.Markup.ComponentType
Returns Rhino.DocObjects.ModelComponentType.Markup.
Since: 8.0