Rhino.Geometry.Brep.FilletSurfaceResults
Results from a fillet surface operation

Rhino.Geometry.Brep.FilletSurfaceResults.Face0
The first face used as input for the fillet surface generation

Rhino.Geometry.Brep.FilletSurfaceResults.Face1
The second face used as input for the fillet surface generation

Rhino.Geometry.Brep.FilletSurfaceResults.OutBreps0
If the first input face was trimmed, the trimmed results are returned here

Rhino.Geometry.Brep.FilletSurfaceResults.OutBreps1
If the second input face was trimmed, the trimmed results are returned here

Rhino.Geometry.Brep.FilletSurfaceResults.Fillets
The fillet surfaces created between the first and second face