Rhino.FileIO.FileUsdWriteOptions
Options for writing a USD File (.usda, .usda, .usdz)

Rhino.FileIO.FileUsdWriteOptions.MeshingParameters
Since: 8.0
Leaving this empty will not insert a Prim

Rhino.FileIO.FileUsdWriteOptions.BlockHandling
Including blocks inside the file will result in a larger file size and data duplication

Rhino.FileIO.FileUsdWriteOptions.DefaultLayer
The root prim for the USD File

Rhino.FileIO.FileUsdWriteOptions.ModelName
A given model name will add a prim between the root prim and the start of the models data.
Leaving this empty will not insert a Prim

Rhino.FileIO.FileUsdWriteOptions.ForceMeshes
Forces all geometry to be represented as meshes

Rhino.FileIO.FileUsdWriteOptions.IncludeUserStrings
Includes user strings in prim data

Rhino.FileIO.FileUsdWriteOptions.ToDictionary
Create a dictionary of these options.
This dictionary can be passed to Rhino.RhinoDoc.Export(System.String,Rhino.Collections.ArchivableDictionary)
Returns: A Rhino.Collections.ArchivableDictionary with all the necessary key/value pairs
Since: 8.0