Rhino.DocObjects.Tables.HatchPatternTable.PurgeUnused
Purges any unused hatch patterns.
Returns: The number of unused hatch patterns that were purged.
Since: 9.0

Rhino.DocObjects.Tables.HatchPatternTable.GetUnusedHatchPatternName
Gets unused hatchpattern name used as default when creating new hatchpatterns.
Returns: The unused hatchpattern name.
Since: 9.0