Rhino.Geometry.Vector3d.Decompose(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,System.Double@,System.Double@)
Find scalars x and y so that the component of v in the plane of a and b
is x*a + y*b
v:
a: non-zero and not parallel to b
b: non-zero and not parallel to a
x:
y:
Returns: true if the decomposition is successful.