Rhino.Geometry.Mesh.CreateFromIsosurface(System.Func{Rhino.Geometry.Point3d,System.Double},Rhino.Geometry.BoundingBox,System.Int32,System.Int32)
Create an isosurface mesh based on a scalar field evaluator
scalarFieldEvaluator:
box:
resolution:
RootFindingMaxSteps:
Returns:

Rhino.Geometry.Mesh.rootFind(System.Func{Rhino.Geometry.Point3d,System.Double},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double,System.Int32,System.Double)
Bracketed root finding for a scalar field using the Illinois variant of Regula Falsi
Given one point where the field value is below zero and one point where it is above zero,
it iteratively shrinks the interval to find where along the line between them the field value is zero.
It stops when either the specified accuracy or the maximum iteration count is reached.
Using a maxSteps input of 1 is equivalent to linear interpolation.
scalarField:
pA: Point at one end of the line
pB: Point at the other end of the line
fa: The value of the field at pA
fb: The value of the field at pB
maxSteps: The maximum number of iterations to perform
accuracy: The root finding stops when the interval size relative to the initial interval is less than this value
Returns: