Rhino.PlugIns.PlugIn.GetReplacedAssembly(System.String@,System.Boolean)
Checks if the plug-in assembly is listed in the RHINO_REPLACE_ASSEMBLIES environment variable
and swaps it out for the alternate assembly if it is listed.
NOTE: This is not intended to be used by plug-in developers, but only internally
by McNeel to develop Rhino-included plugins with a release version of Rhino.
path: The path to the assembly, which may be modified with a new path.
displayDebugInfo: If true, debug information will be displayed in the Rhino command line.
Returns:
Returns false if the assembly should be skipped altogether.