Rhino.ApplicationSettings.TransformSettings


Rhino.ApplicationSettings.TransformSettings.DragPlane


Rhino.ApplicationSettings.TransformSettings.DragStrengthEnabled


Rhino.ApplicationSettings.TransformSettings.DragStrength


Rhino.ApplicationSettings.TransformSettings.SoftTransformEnabled


Rhino.ApplicationSettings.TransformSettings.SoftTransformRadius


Rhino.ApplicationSettings.TransformSettings.SoftTransformShape


Rhino.ApplicationSettings.TransformSettings.SoftTransformMeasureDistanceAlong


Rhino.ApplicationSettings.TransformSettings.SoftTransformFalloffColor
