Rhino.Geometry.TextEntity.CreateSurfaces(Rhino.DocObjects.DimensionStyle,System.Boolean,System.Double,System.Double)
Creates planar breps from the outline curves.
dimstyle:
makeSmallCaps:  Set to true to create small caps out of lower case letters.
smallCapsScale:  Set to create small caps out of lower case letters.
spacing:  Set to add additional spacing between glyph output.
Returns: An array of planar breps.

Rhino.Geometry.TextEntity.CreateSurfacesGrouped(Rhino.DocObjects.DimensionStyle,System.Boolean,System.Double,System.Double)
Creates planar Breps from text outline curves. Breps are grouped such that each element
in the list being returned represents a single character.
dimstyle:
makeSmallCaps:
smallCapsScale:
spacing:
Returns:

Rhino.Geometry.TextEntity.CreatePolysurfacesGrouped(Rhino.DocObjects.DimensionStyle,System.Boolean,System.Double,System.Double,System.Double)
Creates 3d Breps from text outline curves. Breps are grouped such that each element
in the list being returned represents a single character.
dimstyle:
makeSmallCaps:
smallCapsScale:
height:
spacing:
Returns:

Rhino.Geometry.TextEntity.CreatePolySurfaces(Rhino.DocObjects.DimensionStyle,System.Double,System.Boolean,System.Double,System.Double)
Creates breps from the outline curves with specified height.
dimstyle:
height:  Height in direction perpendicular to plane of text.
makeSmallCaps:  Set to true to create small caps out of lower case letters.
smallCapsScale:  Set to create small caps out of lower case letters.
spacing:  Set to add additional spacing between glyph output.
Returns: An array of planar breps.

Rhino.Geometry.TextEntity.CreateExtrusionsGrouped(Rhino.DocObjects.DimensionStyle,System.Boolean,System.Double,System.Double,System.Double)
Creates 3d Breps from text outline curves. Breps are grouped such that each element
in the list being returned represents a single character.
dimstyle:
makeSmallCaps:
smallCapsScale:
height:
spacing:
Returns:

Rhino.Geometry.TextEntity.CreateExtrusions(Rhino.DocObjects.DimensionStyle,System.Double,System.Boolean,System.Double,System.Double)
Creates extrusions from the outline curves with specified height.
dimstyle:
height:  Height in direction perpendicular to plane of text.
makeSmallCaps:  Set to true to create small caps out of lower case letters.
smallCapsScale:  Set to create small caps out of lower case letters.
spacing:  Set to add additional spacing between glyph output.
Returns: An array of planar breps.

Rhino.Geometry.TextEntity.CreateCurves(Rhino.DocObjects.DimensionStyle,System.Boolean,System.Boolean,System.Double,System.Double)
Returns the outline curves.
dimstyle:
allowOpen:  Set to true to prevent forced closing of open curves retrieved from glyphs.
makeSmallCaps:  Set to create small caps out of lower case letters.
smallCapsScale:  If makeSmallCaps is true, this will be the scale factor for small caps.
spacing:  Set to add additional spacing between glyph output.
Returns: An array of curves that forms the outline or content of this text entity.

Rhino.Geometry.TextEntity.CreateCurvesGrouped(Rhino.DocObjects.DimensionStyle,System.Boolean,System.Boolean,System.Double,System.Double)
Creates planar curve from text outline curves. Curves are grouped such that each element
in the list being returned represents a single character.
dimstyle:
allowOpen:  Set to true to prevent forced closing of open curves retrieved from glyphs.
makeSmallCaps:
smallCapsScale:
spacing:
Returns: