Rhino.DocObjects.Linetype.HasShapes
Does this linetype have shapes

Rhino.DocObjects.Linetype.RemoveAllShapes
Remove all shapes from this linetype

Rhino.DocObjects.Linetype.ShapeSpacing
If shapes are present in this linetype, this is the distance between
shapes

Rhino.DocObjects.Linetype.ShapeSpan
If shapes are present in this linetype, this is the gap around the
shape.

Rhino.DocObjects.Linetype.AddShape(Rhino.Geometry.Curve,System.Double)
Add a curve shape to this linetype definition
shapeCurve:
offset:
Returns:

Rhino.DocObjects.Linetype.AddShape(Rhino.Geometry.TextEntity,System.Double)
Add text as a shape to this linetype definition
text:
offset:
Returns:

Rhino.DocObjects.Linetype.AddShape(System.String,System.String,System.Double,System.Double)
Add text as a shape to this linetype definition
text:
fontFace:
height:
offset:
Returns: