Rhino.DocObjects.ObjectAttributes.DetailBackgroundVisible
Should the background color show for a detail

Rhino.DocObjects.ObjectAttributes.GetActiveInViewportOverrides(System.Guid[]@,System.Boolean@)
Returns:
Since: 9.0

Rhino.DocObjects.ObjectAttributes.SetActiveInViewportOverrides(System.Guid[],System.Boolean)
Returns:
Since: 9.0

Rhino.DocObjects.ObjectAttributes.HasActiveInViewportOverride(System.Guid,System.Boolean@)
Returns:
Since: 9.0

Rhino.DocObjects.ObjectAttributes.AddActiveInViewportOverride(System.Guid,System.Boolean)
Returns:
Since: 9.0

Rhino.DocObjects.ObjectAttributes.RemoveActiveInViewportOverride(System.Guid,System.Boolean)
viewportId:
active:
Returns:
Since: 9.0

Rhino.DocObjects.ObjectAttributes.SectionStyleIndex
Gets or sets the section style index.