Rhino.LengthValue.Finalize
passively reclaim native allocated ON_LengthValue*

Rhino.LengthValue.Dispose
actively reclaim native allocated ON_LengthValue*
Since: 6.0

Rhino.LengthValue.Create(System.Double,Rhino.LengthUnit,Rhino.LengthValue.StringFormat)
Create from Length and LengthUnit
length: Numeric length value
units: Length units
format:
Since: 9.0

Rhino.LengthValue.Create(System.Double,Rhino.LengthUnit,Rhino.LengthValue.StringFormat,System.UInt32)
Create from Length and LengthUnit
length: Numeric length value
units: Length units
format:
localeId:
Since: 9.0

Rhino.LengthValue.Length(Rhino.LengthUnit)
Length value in a given unit system
units:
Returns:
Since: 9.0

Rhino.LengthValue.ChangeUnits(Rhino.LengthUnit)
Change the UnitSystem of a LengthValue
The numeric value of Length is scaled by new_us / current unit system
so that the absolute length stays the same
newUnits:
Returns:
Since: 9.0

Rhino.LengthValue.Units
LengthUnit used by this LengthValue
Since: 9.0