Rhino.Geometry.Arc.Angle
Gets or sets the sweep -or subtended- angle (in Radians) for this arc segment. Setting this
property only alters the Rhino.Geometry.Arc.EndAngle property such that Angle = Rhino.Geometry.Arc.EndAngle - Rhino.Geometry.Arc.StartAngle.
Since: 5.0