Rhino.UI.CommandPromptChangedEventArgs
Event args for the CommandPromptChanged event

Rhino.UI.CommandPromptChangedEventArgs.Prompt
Command line prompt text

Rhino.UI.CommandPromptChangedEventArgs.PromptDefault
Default command line prompt text

Rhino.UI.CommandPromptChangedEventArgs.Options
Active command line options