Rhino.ApplicationSettings.EmapAnalysisSettings
Contains static methods and properties to modify the visibility of curve ends.

Rhino.ApplicationSettings.EmapAnalysisSettings.GetDefaultState
Gets the factory settings of the application.
Since: 9.0

Rhino.ApplicationSettings.EmapAnalysisSettings.GetCurrentState
Gets the current settings of the application.
Since: 9.0

Rhino.ApplicationSettings.EmapAnalysisSettings.FileName
Gets or sets the current emap file name.
Since: 9.0

Rhino.ApplicationSettings.EmapAnalysisSettings.BlendWithObjectColor
Gets or sets whether to blend the image with the object's color.
Since: 9.0

Rhino.ApplicationSettings.EmapAnalysisSettings.ShowIsoparams
Gets or sets whether to display iso curves.
Since: 9.0

Rhino.ApplicationSettings.EmapAnalysisSettings.GetFileNames
Get available list of emap filenames
Returns:

Rhino.ApplicationSettings.EmapAnalysisSettings.SetFileNames(System.Collections.Generic.IEnumerable{System.String})
Set available list of emap filenames
filenames:

Rhino.ApplicationSettings.EmapAnalysisSettings.GetDefaultFileNames
Get list of emap's Default MRU filenames
Returns: