Rhino.Geometry.Brep.NormalConstraint
Constraing the result to go through a point with a given normal

Rhino.Geometry.Brep.NormalConstraint.#ctor(Rhino.Geometry.Line)
Constructor for a normal constraint. The surface must go
through the starting point of the line and have a normal
along the line.
normal:

Rhino.Geometry.Brep.NormalConstraint.Normal
The normal line to apply