Rhino.ApplicationSettings.ThicknessAnalysisSettings
Contains static methods and properties to modify Zebra analysis-related commands.
Since: 9.0

Rhino.ApplicationSettings.ThicknessAnalysisSettings.GetDefaultState
Gets the factory settings of the application.
Since: 9.0

Rhino.ApplicationSettings.ThicknessAnalysisSettings.GetCurrentState
Gets the current settings of the application.
Since: 9.0

Rhino.ApplicationSettings.ThicknessAnalysisSettings.RestoreDefaults
Commits the default settings as the current settings.
Since: 9.0

Rhino.ApplicationSettings.ThicknessAnalysisSettings.UpdateFromState(Rhino.ApplicationSettings.ThicknessAnalysisSettingsState)
Sets all settings to a particular defined joined state.
state: The particular state.
Since: 9.0

Rhino.ApplicationSettings.ThicknessAnalysisSettings.DistanceRange
The distance range.
Since: 9.0

Rhino.ApplicationSettings.ThicknessAnalysisSettings.ShowIsoCurves
Get or sets the display of surface isocurves.
Since: 9.0