Rhino.Geometry.Curve.SortedSegment
A segment in a sorted curve collection

Rhino.Geometry.Curve.SortedSegment.CurveId
The id in the original input curve collection

Rhino.Geometry.Curve.SortedSegment.Reversed
Indicates if the curve is to be reversed