Rhino.Runtime.CommonObject.ComputeMemoryEstimate(Rhino.Runtime.CommonObject)
Computes an estimate of the number of bytes that this object is using in memory.
Remarks:
This is the same as calling GeometryBase.MemoryEstimate, but works for all CommonObject derived classes.
obj:
Returns: An estimated memory footprint.
Since: 9.0