Rhino.Render.Utilities.ContentNewExistingFlags
Since: 9.0

Rhino.Render.Utilities.ContentNewExistingFlags.None
No flags; normal usage.

Rhino.Render.Utilities.ContentNewExistingFlags.HideNewTab
Hides the 'New' tab.

Rhino.Render.Utilities.ContentNewExistingFlags.HideExistingTab
Hides the 'Existing' tab.

Rhino.Render.Utilities.ContentNewExistingFlags.MultipleSelection
Enables multiple selection.

Rhino.Render.Utilities.ContentNewExistingFlags.DisableImportButton
Disables the import button.

Rhino.Render.Utilities.ContentNewExistingFlags.HideCopyOrShare
Hides the copy/share radio buttons.