Rhino.FileIO.FileDwgWriteOptions.#ctor
AutoCAD version format to write to
Since: 8.0

Rhino.FileIO.FileDwgWriteOptions.Version
Version of DWG file to write
Since: 8.0
Remarks:  Updated default acad version to 2018 in Rhino V9

Rhino.FileIO.FileDwgWriteOptions.UseColor
Set AutoCAD display color with Rhino print or display color
Since: 9.0

Rhino.FileIO.FileDwgWriteOptions.WriteThickCurves
Write extrusions with simple profile curves as thick curves.
Since: 9.0

Rhino.FileIO.FileDwgWriteOptions.AddToDictionary(Rhino.Collections.ArchivableDictionary)
Add these options to a dictionary, used by UIless dotnet export.
Returns:
Since: 9.0

Rhino.FileIO.FileDwgWriteOptions.SetNamedParameters(Rhino.Runtime.NamedParametersEventArgs)
Add these options to a NamedParametersEventArgs, used in the dotnet version of the acad export UI.
Returns:
Since: 9.0