Rhino.Input.Custom.GetBaseClass.AddOptionString(Rhino.UI.LocalizeStringPair,Rhino.Input.Custom.OptionString@,System.String)
Add a command line option to get a string and automatically save the value.
optionName: The option description.
stringValue: The current string value.
prompt: Command prompt to be shown if the picks this option.
Returns: The option index value (>0) or 0 if option cannot be added.
Since: 9.0

Rhino.Input.Custom.GetBaseClass.AddOptionString(Rhino.UI.LocalizeStringPair,Rhino.Input.Custom.OptionString@)
Add a command line option to get a string and automatically save the value.
optionName: The option description.
stringValue: The current string value.
Returns: The option index value (>0) or 0 if option cannot be added.
Since: 9.0

Rhino.Input.Custom.GetBaseClass.AddOptionString(System.String,Rhino.Input.Custom.OptionString@,System.String)
Add a command line option to get a string and automatically save the value.
englishName: The option description.
stringValue: The current string value.
prompt: Command prompt to be shown if the picks this option.
Returns: The option index value (>0) or 0 if option cannot be added.
Since: 9.0

Rhino.Input.Custom.GetBaseClass.AddOptionString(System.String,Rhino.Input.Custom.OptionString@)
Add a command line option to get a string and automatically save the value.
englishName: The option description.
stringValue: The current string value.
Returns: The option index value (>0) or 0 if option cannot be added.
Since: 9.0