Rhino.ApplicationSettings.CommandAliasList.InstantAliasDelayMilliseconds
Timer delay to use before triggering instant aliases

Rhino.ApplicationSettings.CommandAliasList.GetAlias(System.Int32)
Get command alias from the list
index:
Returns: null is index is out of range

Rhino.ApplicationSettings.CommandAliasList.FindAlias(System.String)
Find an existing CommandAlias given the alias string
alias:
Returns:

Rhino.ApplicationSettings.CommandAliasList.Update(System.Collections.Generic.IEnumerable{Rhino.ApplicationSettings.CommandAlias},System.Boolean)
Add or modify the command aliases with a list of aliases
aliases:
replaceAll: