Rhino.DocObjects.RhinoObjectAnalysisModeChangedEventArgs
Rhino object visual analysis mode changed event argument.
Since: 9.0

Rhino.DocObjects.RhinoObjectAnalysisModeChangedEventArgs.DocumentSerialNumber
The serial number of the Rhino document.
Since: 9.0

Rhino.DocObjects.RhinoObjectAnalysisModeChangedEventArgs.ObjectId
The id of the Rhino object whose visual analysis mode changed.

Rhino.DocObjects.RhinoObjectAnalysisModeChangedEventArgs.AnalysisModeId
The id of the visual analysis mode.

Rhino.DocObjects.RhinoObjectAnalysisModeChangedEventArgs.Enabled
True if the visual analysis mode was enabled, false otherwise.
Since: 9.0

Rhino.DocObjects.RhinoObjectAnalysisModeChangedEventArgs.Document
Gets the Rhino document.
Since: 9.0

Rhino.DocObjects.RhinoObjectAnalysisModeChangedEventArgs.TheObject
The Rhino object whose visual analysis mode changed.
Since: 9.0

Rhino.DocObjects.RhinoObjectAnalysisModeChangedEventArgs.AnalysisMode
The visual analysis mode.
Since: 9.0