Rhino.Geometry.TextRun
A range of text with all the same attributes

Rhino.Geometry.TextRun.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Geometry.TextRun.Dispose
Actively reclaims unmanaged resources that this instance uses.