Rhino.Geometry.Intersect.Intersection.MeshPlane(Rhino.Geometry.Mesh,Rhino.Geometry.Plane)
Intersects a mesh with an infinite plane.
Rhino.RhinoMath.ZeroTolerance is used as fixed tolerance.
We suggest to use the document tolerance multiplied by Rhino.Geometry.Intersect.Intersection.MeshIntersectionsTolerancesCoefficient instaed.
mesh: Mesh to intersect.
plane: Plane to intersect with.
Returns:
An array of polylines describing the intersection loops,
or null if no intersections could be found.
Since: 5.0

Rhino.Geometry.Intersect.Intersection.MeshPlane(Rhino.Geometry.Mesh,Rhino.Geometry.Intersect.MeshIntersectionCache,Rhino.Geometry.Plane,System.Double)
Intersects a mesh with an infinite plane.
Tolerance can be specified.
We suggest to use the document tolerance multiplied by Rhino.Geometry.Intersect.Intersection.MeshIntersectionsTolerancesCoefficient.
mesh: Mesh to intersect.
cache: Intersection cache for mesh.
plane: Plane to intersect with.
tolerance: Intersection tolerance.
Returns:
An array of polylines describing the intersection loops,
or null if no intersections could be found.
Since: 8.0

Rhino.Geometry.Intersect.Intersection.MeshPlane(Rhino.Geometry.Mesh,Rhino.Geometry.Intersect.MeshIntersectionCache,Rhino.Geometry.Plane,System.Double,System.Boolean)
Intersects a mesh with an infinite plane.
Tolerance can be specified.
We suggest to use the document tolerance multiplied by Rhino.Geometry.Intersect.Intersection.MeshIntersectionsTolerancesCoefficient.
mesh: Mesh to intersect.
cache: Intersection cache for mesh.
plane: Plane to intersect with.
tolerance: Intersection tolerance.
overlaps: If true, overlaps are computed and will be part of the output.
Returns:
An array of polylines describing the intersection loops,
or null if no intersections could be found.
Since: 8.0

Rhino.Geometry.Intersect.Intersection.MeshPlane(Rhino.Geometry.Mesh,System.Collections.Generic.IEnumerable{Rhino.Geometry.Plane})
Intersects a mesh with a collection of infinite planes.
Rhino.RhinoMath.ZeroTolerance is used as fixed tolerance.
We suggest to use the document tolerance multiplied by Rhino.Geometry.Intersect.Intersection.MeshIntersectionsTolerancesCoefficient instaed.
mesh: Mesh to intersect.
planes: Planes to intersect with.
Returns:
An array of polylines describing the intersection loops,
or null if no intersections could be found.
Since: 5.0

Rhino.Geometry.Intersect.Intersection.MeshPlane(Rhino.Geometry.Mesh,Rhino.Geometry.Intersect.MeshIntersectionCache,System.Collections.Generic.IEnumerable{Rhino.Geometry.Plane},System.Double)
Intersects a mesh with a collection of infinite planes, providing both overlaps and perforations.
Tolerance can be specified.
We suggest to use the document tolerance multiplied by Rhino.Geometry.Intersect.Intersection.MeshIntersectionsTolerancesCoefficient.
mesh: Mesh to intersect.
cache: Intersection cache for the mesh.
planes: Planes to intersect with.
tolerance: Intersection tolerance.
Returns:
An array of polylines describing the intersection loops,
or null if no intersections could be found.
Since: 8.0

Rhino.Geometry.Intersect.Intersection.MeshPlane(Rhino.Geometry.Mesh,Rhino.Geometry.Intersect.MeshIntersectionCache,System.Collections.Generic.IEnumerable{Rhino.Geometry.Plane},System.Double,System.Boolean)
Intersects a mesh with a collection of infinite planes.
Tolerance can be specified.
We suggest to use the document tolerance multiplied by Rhino.Geometry.Intersect.Intersection.MeshIntersectionsTolerancesCoefficient.
mesh: Mesh to intersect.
cache: Intersection cache for the mesh.
planes: Planes to intersect with.
tolerance: Intersection tolerance.
overlaps: If true, overlaps are computed and will be part of the output.
Returns:
An array of polylines describing the intersection loops,
or null if no intersections could be found.
Since: 9.0

Rhino.Geometry.Intersect.Intersection.MeshMesh(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Double,Rhino.Geometry.Polyline[]@,System.Boolean,Rhino.Geometry.Polyline[]@,System.Boolean,Rhino.Geometry.Mesh@,Rhino.FileIO.TextLog,System.Threading.CancellationToken,System.IProgress{System.Double})
Intersects meshes. Overlaps and perforations are provided in the output list.
Tolerance can be specified.
We suggest to use the document tolerance multiplied by Rhino.Geometry.Intersect.Intersection.MeshIntersectionsTolerancesCoefficient.
meshes: The mesh input list. This cannot be null. Null entries are tolerated.
tolerance: A tolerance value. If negative, the positive value will be used.
WARNING! Good tolerance values are in the magnitude of 10^-7, or RhinoMath.SqrtEpsilon*10.
intersections: Returns the intersections.
overlapsPolylines: If true, overlaps are computed and returned.
overlapsPolylinesResult: If requested, overlaps are returned here.
overlapsMesh: If true, an overlaps mesh is computed and returned.
overlapsMeshResult: If requested, overlaps are returned here.
textLog: A text log, or null.
cancel: A cancellation token to stop the computation at a given point.
progress: A progress reporter to inform the user about progress, or null. The reported value is indicative.
Returns: True, if the operation succeeded, otherwise false.
Since: 7.0

Rhino.Geometry.Intersect.Intersection.MeshMeshPredicate(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Double,System.Int32[]@,Rhino.FileIO.TextLog)
Determines if meshes intersect or overlap. No geometry is computed.
meshes: The mesh input list. This cannot be null. Null entries are tolerated.
tolerance: A tolerance value. If negative, the positive value will be used.
WARNING! Good tolerance values are in the magnitude of 10^-7, or RhinoMath.SqrtEpsilon*10.
pairs: An array containing pairs of meshes that intersect.
textLog: A text log, or null.
Returns: True, if meshes intersect or overlap, otherwise false. False is also returned on error, but textLog will start with Error: and contain the error.
Since: 8.0

Rhino.Geometry.Intersect.Intersection.MeshMeshAccurate(Rhino.Geometry.Mesh,Rhino.Geometry.Mesh,System.Double)
Intersects two meshes. Overlaps and near misses are handled. This is an old method kept for compatibility.
Tolerance can be specified.
We suggest to use the document tolerance multiplied by Rhino.Geometry.Intersect.Intersection.MeshIntersectionsTolerancesCoefficient.
meshA: First mesh for intersection.
meshB: Second mesh for intersection.
tolerance: A tolerance value. If negative, the positive value will be used.
WARNING! Good tolerance values are in the magnitude of 10^-7, or RhinoMath.SqrtEpsilon*10.
Returns: An array of intersection and overlaps polylines.
Since: 5.0