Rhino.Notifications.SuspendCollectionChangedEventHandler`1
Using this on a subscribed event handler for the given Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1 will suspend
notifications to the specified handler until Rhino.Notifications.SuspendCollectionChangedEventHandler`1 is disposed.

Rhino.Notifications.SuspendCollectionChangedEventHandler`1.#ctor(System.Collections.Specialized.NotifyCollectionChangedEventHandler,Rhino.Runtime.Notifications.TrulyObservableOrderedSet{`0},System.Boolean)
Constructor. Notifications from the set to the handler are suspended until this object is disposed.
handler: The event handler to suspend
set: The collection to suspend notifications for
fireOnResume: If true (=default), upon resuming notifications one System.Collections.Specialized.NotifyCollectionChangedAction.Reset
event will be fired if the collection was modified during the suspension.

Rhino.Notifications.SuspendCollectionChangedEventHandler`1.Dispose
