Rhino.UI.Localization.FormatNumber(System.Double,Rhino.LengthUnit,Rhino.UI.DistanceDisplayMode,System.Int32,System.Boolean)
Get a string version of a number in a given unit system / display mode.
x: The number to format into a string.
units: The length unit for the number.
mode: How the number should be formatted.
precision: The precision of the number.
appendUnitSystemName: Adds unit system name to the end of the number.
Returns: The formatted number.
Since: 9.0