Rhino.Display.VisualAnalysisMode.RhinoDirectionAnalysisModeId
Id for Rhino's built-in direction analysis mode.
Since: 9.0

Rhino.Display.VisualAnalysisMode.RhinoEndAnalysisModeId
Id for Rhino's built-in End analysis mode.
Since: 9.0

Rhino.Display.VisualAnalysisMode.CurvatureColorAutoRange
Adjusts the auto range values for curvature analysis.
Since: 9.0

Rhino.Display.VisualAnalysisMode.CurvatureColorMaxRange
Adjusts the max range values for curvature analysis.
Since: 9.0