Rhino.ApplicationSettings.DirectionAnalysisSettingsState
Represents a snapshot of Rhino.ApplicationSettings.DirectionAnalysisSettings.

Rhino.ApplicationSettings.DirectionAnalysisSettingsState.Color
Gets or sets a color used to display the direction.
Since: 9.0

Rhino.ApplicationSettings.DirectionAnalysisSettingsState.Direction
Gets or sets whether to display the direction.
Since: 9.0

Rhino.ApplicationSettings.DirectionAnalysisSettingsState.U
Gets or sets whether to display the U dir.
Since: 9.0

Rhino.ApplicationSettings.DirectionAnalysisSettingsState.V
Gets or sets whether to display the V dir.
Since: 9.0