Rhino.FileIO.USDExportBlockHandling
USD Block Exporting Options

Rhino.FileIO.USDExportBlockHandling.SeparateFiles
Blocks are exported as separate files

Rhino.FileIO.USDExportBlockHandling.Ignore
Blocks are not exported inside the file or outside the file

Rhino.FileIO.USDExportBlockHandling.Embedded
Blocks are included inside the file