Rhino.Runtime.AdvancedSetting.MRUFileCount
Set number of max files to display in the MRU list
Note that anything above 9 cannot be accessed with an accelator key.
https://mcneel.myjetbrains.com/youtrack/issue/RH-78502