Rhino.Notifications.SuspendCollectionChangedNotifications`1
Using this on a Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1 will suspend notifications
until the Rhino.Notifications.SuspendCollectionChangedNotifications`1 is disposed.

Rhino.Notifications.SuspendCollectionChangedNotifications`1.#ctor(Rhino.Runtime.Notifications.TrulyObservableOrderedSet{`0},System.Boolean)
Constructor. Notifications will be suspended until this object is disposed.
set: The collection to suspend notifications for
fireOnResume: If true (=default), upon resuming notifications one System.Collections.Specialized.NotifyCollectionChangedAction.Reset
event will be fired if the collection was modified during the suspension.

Rhino.Notifications.SuspendCollectionChangedNotifications`1.Dispose
