Rhino.Render.Decal.CRC
The decal CRC identifies a decal by its state. Multiple decals which would be exactly the same would
have the same CRC and are culled from the system. If you store this value with the intention of using
it to find the decal again later, you must update your stored value whenever the decal state changes.
You can detect when a decal changes by watching for the legacy OnUserDataTransformed event or the newer
custom event uuidEventDecalUserDataTransformed.
Since: 6.0

Rhino.Render.Decal.SetHorzSweep(System.Double,System.Double)
Sets the angles of the decal's arc of 'horizontal sweep'.
Since: 9.0

Rhino.Render.Decal.SetVertSweep(System.Double,System.Double)
Sets the angles of the decal's arc of 'vertical sweep'.
Since: 9.0

Rhino.Render.Decal.SetUVBounds(System.Double,System.Double,System.Double,System.Double)
Sets the UV bounds of the decal. Only used when mapping is UV.
Since: 9.0

Rhino.Render.Decal.GetTextureMapping
Gets the Texture Mapping of the decal.
Since: 7.0