Rhino.Render.TextureMapping.Capped
// The m_bCapped applies to planar, cylinder and box mappings.
If m_bCapped is false, the cylinder or box is "infinite", if m_bCapped is true, they are finite.
In planar mappings, m_bCapped=false means "the Z texture coordinate will always be 0.0"
this is now the default behaviour in Rhino 5.0 - it's what users expect apparently.

Rhino.Render.TextureMapping.TextureSpace
See TextureSpace

Rhino.Render.TextureMapping.Projection
See Projection