Rhino.Render.TextureSpace
Texture space
When a mapping primitive is a box or a capped cylinder,
there are two options for the mapping.  Either the sides
all map to (0,1)x(0,1) (so the either texture map appears
on each side, or the sides map to distinct regions of the
texture space.