Rhino.DocObjects.Tables.ObjectTable.SelectedObjectsExist(Rhino.DocObjects.ObjectType,System.Boolean)
Quick way to test if any objects are currently selected
objectType: the type of objects to test for
checkSubObjects: Check to see if subobjects are selected
Returns:

Rhino.DocObjects.Tables.ObjectTable.GetSelectedObjectCount(System.Boolean)
Compute the current number of selected objects
checkSubObjects: Check to see if subobjects are selected
Returns: