Rhino.Display.DisplayPipelineAttributes.SetSurfaceEdgeThicknessUsage(Rhino.Display.DisplayPipelineAttributes.SurfaceThicknessUse)
Helper function for getting the SurfaceEdgeThicknessFlags
Returns:

Rhino.Display.DisplayPipelineAttributes.MeshEdgeThickness
Mesh edge width in pixels

Rhino.Display.DisplayPipelineAttributes.MeshNakedEdgeThickness
Naked mesh edge width in pixels.}

Rhino.Display.DisplayPipelineAttributes.MeshNonmanifoldEdgeThickness
Non-manifold mesh edge width in pixels

Rhino.Display.DisplayPipelineAttributes.MeshVertexSize
Mesh vertex size in pixels

Rhino.Display.DisplayPipelineAttributes.MeshEdgeColorReduction
The darken percentage of the color

Rhino.Display.DisplayPipelineAttributes.MeshNakedEdgeColorReduction
The darken percentage of the color

Rhino.Display.DisplayPipelineAttributes.MeshNonmanifoldEdgeColorReduction
The darken percentage of the color

Rhino.Display.DisplayPipelineAttributes.MeshEdgeColor
Sets the mesh edge color

Rhino.Display.DisplayPipelineAttributes.MeshNakedEdgeColor
Sets the naked edge color

Rhino.Display.DisplayPipelineAttributes.MeshNonmanifoldEdgeColor
Sets the nonmanifold edge color

Rhino.Display.DisplayPipelineAttributes.CustomGroundPlaneAltitude
Height above the world XY plane in model units

Rhino.Display.DisplayPipelineAttributes.CustomGroundPlaneOn
Turn the custom ground plane on or off

Rhino.Display.DisplayPipelineAttributes.CustomGroundPlaneShadowOnly
Makes the ground plane transparent, but allows shadows to still be cast on it.

Rhino.Display.DisplayPipelineAttributes.CustomGroundPlaneAutomaticAltitude
Turns on auto-elevation that moves Ground Plane to the lowest point of the objects in the model.

Rhino.Display.DisplayPipelineAttributes.ShowSubDEdges
Set visibility of SubD smooth edges.

Rhino.Display.DisplayPipelineAttributes.ShowSubDCreases
Set visibility of SubD creased edges.

Rhino.Display.DisplayPipelineAttributes.ShowSubDBoundary
Set visibility of SubD naked edges.

Rhino.Display.DisplayPipelineAttributes.ShowSubDNonmanifoldEdges
Turn on/off color differentiation of SubD symmetry children.

Rhino.Display.DisplayPipelineAttributes.ShowMeshEdges
Display mesh edges on/off

Rhino.Display.DisplayPipelineAttributes.ShowMeshNakedEdges
Display mesh naked edges on/off

Rhino.Display.DisplayPipelineAttributes.ShowMeshNonmanifoldEdges
Display mesh manifold edges on/off

Rhino.Display.DisplayPipelineAttributes.UseLightColor
Draw lights using light color

Rhino.Display.DisplayPipelineAttributes.ShowClippingFills
When a clipping plane intersects a 3-D object and the section is closed, the section is filled.

Rhino.Display.DisplayPipelineAttributes.ShowClippingEdges
Shows the edges between the clipping plane and clipped objects.

Rhino.Display.DisplayPipelineAttributes.ClippingShadeSelectedPlane
Shades the selected clipping plane.

Rhino.Display.DisplayPipelineAttributes.ClipSelectionHighlight
Clips the highlight wires. Shaded selections always clip.

Rhino.Display.DisplayPipelineAttributes.ClippingPlaneFillColorUsage
Specifies how the color for the clipping plane object fill is determined.

Rhino.Display.DisplayPipelineAttributes.ClippingFillColor
Clipping plane fill color

Rhino.Display.DisplayPipelineAttributes.ClippingEdgeColorUsage
Specifies how the color for the Edges is determined

Rhino.Display.DisplayPipelineAttributes.ClippingEdgeColor
Clipping edge color

Rhino.Display.DisplayPipelineAttributes.ClippingShadeColorUsage
Specifies how to shade the clipping plane

Rhino.Display.DisplayPipelineAttributes.ClippingShadeColor
Clipping plane solid color

Rhino.Display.DisplayPipelineAttributes.ClippingEdgeThickness
Edge thickness in pixels.

Rhino.Display.DisplayPipelineAttributes.ClippingShadeTransparency
Specifies the clipping plane transparency percentage.

Rhino.Display.DisplayPipelineAttributes.UseSectionStyles
When enabled, the appearances of clipping fills and edges are based on objects' section style properties.

Rhino.Display.DisplayPipelineAttributes.ControlPolygonWireThickness
The width of the control polygon lines in pixels.

Rhino.Display.DisplayPipelineAttributes.ControlPolygonStyle
PointStyle for the control polygon. Supported values are ControlPoint, RoundControlPoint, VariableDot, and RoundDot

Rhino.Display.DisplayPipelineAttributes.ControlPolygonGripSize
The control point size in pixels.

Rhino.Display.DisplayPipelineAttributes.LockedObjectTransparency
LockedObjectTransparency.

Rhino.Display.DisplayPipelineAttributes.LockedObjectUsage
Set asource of display attributes for locked objects

Rhino.Display.DisplayPipelineAttributes.DynamicDisplayUsage
Sets the appearance of objects in the display

Rhino.Display.DisplayPipelineAttributes.HighlightSurfaces
Shades entire object with highlight color.

Rhino.Display.DisplayPipelineAttributes.ControlPolygonUseSolidLines
Use dotted / solid lines

Rhino.Display.DisplayPipelineAttributes.ControlPolygonUseFixedSingleColor
Specifies a color for the control polygon.
true = Use a specified color for all control polygons.
false = Use the color specified in the object's Properties.

Rhino.Display.DisplayPipelineAttributes.ControlPolygonShowPoints
Shows the control points while the control polygon is displayed.

Rhino.Display.DisplayPipelineAttributes.ControlPolygonShowSurface
Shows the object while the control polygon is displayed.

Rhino.Display.DisplayPipelineAttributes.ControlPolygonShow
Shows the control polygon and only shows the control points.

Rhino.Display.DisplayPipelineAttributes.ControlPolygonHighlight
Highlights the segments of the control polygon on either side of the control points.

Rhino.Display.DisplayPipelineAttributes.GhostLockedObjects
Set locked appearance
true = Locked objects appear transparent
false = Locked objects appear solid

Rhino.Display.DisplayPipelineAttributes.LayersFollowLockUsage
Applies the settings for locked objects to locked layers.

Rhino.Display.DisplayPipelineAttributes.ControlPolygonColor
Control polygon color

Rhino.Display.DisplayPipelineAttributes.LockedColor
Locked Object Color

Rhino.Display.DisplayPipelineAttributes.ShadowsOn
Enable shadows

Rhino.Display.DisplayPipelineAttributes.ShadowIntensity
Shadow intensity (percentage 0-100)

Rhino.Display.DisplayPipelineAttributes.ShadowMemoryUsage
Value from 1 to 16384 indicating how much memory is to be allocated. Actual memory use
is ShadowMemoryUsage*ShadowMemoryUsage*4.

Rhino.Display.DisplayPipelineAttributes.SkylightShadowQuality
Skylight shadow quality, from 0 (lowest) to 8 (highest)

Rhino.Display.DisplayPipelineAttributes.ShadowSoftEdgeQuality
Soft edge quality, from 0 (none/faster) to 12 (softer/slower)

Rhino.Display.DisplayPipelineAttributes.ShadowEdgeBlur
Set blurring from 0 (no blurring) to 16 (maximum blurring)

Rhino.Display.DisplayPipelineAttributes.ShadowBiasX
ShadowBiasX (Self shadowing artifacts) from 0 (dirty) to 50 (cleaner).

Rhino.Display.DisplayPipelineAttributes.ShadowTransparencyTolerance
Transparency tolerance from 0 (never cast shadows) to 100 (always case shadows)

Rhino.Display.DisplayPipelineAttributes.ShadowClippingRadius
Camera-based shadow clipping radius

Rhino.Display.DisplayPipelineAttributes.ShadowsIgnoreUserDefinedClippingPlanes
If true, shadows ignore user-defined clipping planes

Rhino.Display.DisplayPipelineAttributes.AxesSizePercentage
Size of axes as a percentage of the grid extents.

Rhino.Display.DisplayPipelineAttributes.GridTransparency
Transparency of the grid, percentage (0-100)

Rhino.Display.DisplayPipelineAttributes.GridPlaneTransparency
Transparency of the grid plane, percentage (0-100)

Rhino.Display.DisplayPipelineAttributes.GridPlaneVisibility
Set when to show the grid plane

Rhino.Display.DisplayPipelineAttributes.PlaneUsesGridColor
If true, use the grid thin line color in App settings

Rhino.Display.DisplayPipelineAttributes.GridPlaneColor
The color of the grid plane

Rhino.Display.DisplayPipelineAttributes.GroundPlaneUsage
Turn on or off custom Ground plane settungs

Rhino.Display.DisplayPipelineAttributes.LinearWorkflowUsage
Turn on or off custom linear workflow settings

Rhino.Display.DisplayPipelineAttributes.PreProcessColors
Linear workflow input colors

Rhino.Display.DisplayPipelineAttributes.PreProcessTextures
Linear workflow input textures

Rhino.Display.DisplayPipelineAttributes.PreProcessGamma
Linear workflow input gamma

Rhino.Display.DisplayPipelineAttributes.PostProcessFrameBuffer
Linear workflow Adjust output image

Rhino.Display.DisplayPipelineAttributes.PostProcessGamma
Linear workflow Output image gamma

Rhino.Display.DisplayPipelineAttributes.FrontFlatShaded
Shades the current viewport with no smoothing so the individual render mesh faces are visible.

Rhino.Display.DisplayPipelineAttributes.FrontOverrideObjectColor


Rhino.Display.DisplayPipelineAttributes.FrontDiffuse
Shades the current viewport with no smoothing so the individual render mesh faces are visible.

Rhino.Display.DisplayPipelineAttributes.BakeTextures
Adds the ability to display procedural textures in viewports. When it is turned off, procedural textures in viewports look different from the rendering.