Rhino.DocObjects.ViewInfo.ClippingPlanesIds
Returns a list of clipping plane Ids associated with this view.

Rhino.DocObjects.ViewInfo.ClippingPlaneSurfaces
Returns a list of ClippingPlaneSurfaces for this view.
Returns: