Rhino.Render.Decal.TryGetColor(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Display.Color4f@,Rhino.Geometry.Point2d@)
Blend color with the decal color at a given point.
point: The point in space or, if the decal is uv-mapped, the uv-coordinate of that point.
normal: The face normal of the given point.
colInOut: The color to blend the decal color to.
uvOut: the UV on the texture that the color point was read from.
Returns: true if the given point hits the decal, else false.
Since: 5.10
8.5