Rhino.Render.RenderContent.GenerateQuickContentPreview(Rhino.Render.LinearWorkflow,Rhino.Render.RenderContent,System.Int32,System.Int32,Rhino.Render.PreviewSceneServer,System.Boolean,System.Int32,Rhino.Commands.Result@)
Generate a quick render content preview
lw: Linear workflow
c: Render Content
width: Image width
height: Image height
psc: PreviewSceneServer
bSuppressLocalMapping: SuppressLocalMapping
reason:  ContentChanged = 0, ViewChanged = 1, RefreshDisplay = 2, Other = 99
result: Rhino.Command.Result value for successfull quick image creation
Returns: The Bitmap of the quick render content preview

Rhino.Render.RenderContent.ShowContentInstanceBrowser(Rhino.RhinoDoc,System.Guid@,Rhino.Render.RenderContentKind,Rhino.Render.RenderContent.ContentInstanceBrowserButtons)
Allows the user to choose a content by displaying the Content Instance Browser dialog.
The dialog will have OK, Cancel and Help buttons, and optional New and Edit buttons.
doc: Specifies the document to use.
instance_id: Sets the initially selected content and receives the instance id of the chosen content.
kinds: Specifies the kind(s) of content that should be displayed in the browser.
buttons: Specifies which optional buttons to display.
Returns true if the user chooses a content or false if the dialog is cancelled.