Rhino.Display.DisplayPipeline.DrawSubDWires(Rhino.Geometry.SubD,Rhino.Display.DisplayPen,Rhino.Display.DisplayPen,Rhino.Display.DisplayPen,Rhino.Display.DisplayPen)
Draws all the wireframe curves os a SubD object using different pens
subd: SubD to draw
boundaryPen: Pen to use for boundary wires. If null, no boundary wires will be drawn
smoothInteriorPen: Pen to use for smooth interior wires. If null, no smooth interior wires will be drawn
creasePen: Pen to use for crease wires. If null, no crease wires will be drawn
nonmanifoldPen: Pen to use for non-manifold wires. If null, no non-manifold wires will be drawn

Rhino.Display.DisplayPipeline.DrawInferenceLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Drawing.Color,Rhino.Display.DisplayPipeline.InferenceLineType)
Draw an inference line used in gesture based snapping
P: First point used to define the line in world coordinates
O: Second point used to define the line in world coordinates
color: Color of line
type: Type of line Rhino.Display.DisplayPipeline.InferenceLineType

Rhino.Display.DisplayPipeline.DraweInferencePoint(Rhino.Geometry.Point3d,System.Drawing.Color)
Draw inference point used in gesture based snapping
P: Location of point in world coordinates
color: Color of the point

Rhino.Display.DisplayPipeline.DrawLinesNoClip(System.Collections.Generic.IEnumerable{Rhino.Geometry.Line},System.Drawing.Color,System.Int32)
Draws a multiple lines. This version of line drawing will draw the
segments of the line that extend beyond the near and far planes of the
view frustum with depths on those planes
lines: the lines to draw
color: Color to draw lines in
thickness: Thickness (in pixels) of lines