Rhino.ApplicationSettings.ShortcutKeySettings.GetShortcuts
Get all shortcuts registered with Rhino
Returns:

Rhino.ApplicationSettings.ShortcutKeySettings.GetDefaults
Get all the default shortcuts registered with Rhino
Returns:

Rhino.ApplicationSettings.ShortcutKeySettings.Update(System.Collections.Generic.IEnumerable{Rhino.ApplicationSettings.KeyboardShortcut},System.Boolean)
Add or modify shortcuts with a list or KeyboardShortcut elements
shortcuts:
replaceAll:

Rhino.ApplicationSettings.ShortcutKeySettings.SetMacro(Rhino.UI.KeyboardKey,Rhino.UI.ModifierKey,System.String)
Set a macro for a given key and modifier combination
key:
modifier:
macro:

Rhino.ApplicationSettings.ShortcutKeySettings.IsAcceptableKeyCombo(Rhino.UI.KeyboardKey,Rhino.UI.ModifierKey)
Is a key plus modifier combination one that can be used with Rhino
key:
modifier:
Returns: