Rhino.Geometry.ClippingPlaneSurface.#ctor
Constructs an empty clipping plane surface

Rhino.Geometry.ClippingPlaneSurface.#ctor(Rhino.Geometry.Plane)
Constructs a clipping plane surface from a Plane
plane:

Rhino.Geometry.ClippingPlaneSurface.#ctor(Rhino.Geometry.PlaneSurface)
Constructs a ClippingPlaneSurface from a PlaneSurface
planeSurface: