Rhino.PlugIns.PlugIn.IdFromFileName(System.String)
Attempt to get a plugiin id from just the filename of a plug-in
filename: plug-in filename
Returns: id on success; Guid.Empty if no plug-in could be found