Rhino.Display.RhinoViewport.ChangeToParallelReflectedProjection
When a viewport is set to Parallel Reflected projection, the geometry on the ceiling is shown as if it is mirrored to the floor below.
Returns: