Rhino.DocObjects.ConstructionPlaneGridDefaults.GridSpacing
Distance between grid lines

Rhino.DocObjects.ConstructionPlaneGridDefaults.SnapSpacing
When grid snap is enabled, the distance between snap points. Typically
this is the same distance as grid spacing

Rhino.DocObjects.ConstructionPlaneGridDefaults.GridLineCount
Number of grid lines in each direction

Rhino.DocObjects.ConstructionPlaneGridDefaults.GridThickFrequency
This line frequency. 0: none, 1: all lines are thick, 2: every other is
thick, ...

Rhino.DocObjects.ConstructionPlaneGridDefaults.ShowGrid
Show the grid

Rhino.DocObjects.ConstructionPlaneGridDefaults.ShowGridAxes
Show the grid axes

Rhino.DocObjects.ConstructionPlaneGridDefaults.ShowWorldAxes
Show the world axes icon in the corner