Rhino.DocObjects.Tables.InstanceDefinitionTable.Modify(System.Int32,Rhino.DocObjects.Custom.UserData,System.Boolean)
Modifies the instance definition user data.
Does not change instance definition ID or geometry.
idefIndex: The index of the instance definition to be modified.
userData: The user data to replace.
quiet:
If false, information message boxes pop up when illegal changes are attempted.
Returns:
true if successful.