Rhino.ApplicationSettings.KeyboardShortcut.Modifier
Modifier key used for shortcut

Rhino.ApplicationSettings.KeyboardShortcut.Key
Key used for shortcut

Rhino.ApplicationSettings.KeyboardShortcut.Macro
Macro to execute when key plus modifier are pressed