Rhino.DocObjects.Font.FontOrigin.AppleFont
Set from an Apple NSFont of font name by ON_Font::SetFromAppleFont()
and PostScriptName() and FamilyName() match a font installed on an Apple device.
or iOS computer.