Rhino.Render.RenderTexture.IsHdrCapable
Return true if the texture is HDR capable.
When creating a custom RenderTexture implementation that is HDR capable
set the appropriate property on the CustomRenderContentAttribute decorator on that clas.
Returns:

Rhino.Render.RenderTexture.IsLinear
Return true if the texture color data is linear.
NOTE: this function is marked as virtual, but the correct way to make a custom RenderTexture linear is by
setting the correct property for the CustomRenderContentAttribute decorator on the class.
Returns:

Rhino.Render.RenderTexture.IsNormalMap
Return true if the texture is a normalmap.
When creating a custom RenderTexture implementation of a normal map
set the appropriate property on the CustomRenderContentAttribute decorator on that clas.
Returns:

Rhino.Render.RenderTexture.IsImageBased
Query if the texture is image based.
When creating a custom RenderTexture implementation of an image-based texture
set the appropriate property on the CustomRenderContentAttribute decorator on that class.
Do not override this function
Returns: true if the texture is image-based.