Rhino.Geometry.AreaMassProperties.CentroidCoordinatesProductMoments
Product moments with respect to centroid coordinate system.

Rhino.Geometry.AreaMassProperties.CentroidCoordinatesProductMomentsError
Uncertainty in product moments with respect to centroid coordinate system.