Rhino.Geometry.SweepTwoRail
Utility class for generating Breps by sweeping cross section curves over two rail curves.
Note, this class has been superceeded by the Rhino.Geometry.Brep.CreateFromSweep static functions.