Rhino.Geometry.NurbsCurve.GrevillePoint(System.Int32)
Gets the Greville parameter that belongs
to the control point at the specified index.
index: Index of Greville point.

Rhino.Geometry.NurbsCurve.GrevilleParameters
Gets all Greville parameters for this curve.

Rhino.Geometry.NurbsCurve.GrevillePoints
Gets all Greville points for this curve.

Rhino.Geometry.NurbsCurve.GrevillePoints(System.Boolean)
Gets Greville points for this curve.
all: If true, then all Greville points are returnd. If false, only edit points are returned.
Returns: A list of points if successful, null otherwise.

Rhino.Geometry.NurbsCurve.SetGrevillePoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Sets all Greville edit points for this curve.
points:
The new point locations. The number of points should match
the number of point returned by NurbsCurve.GrevillePoints(false).
Returns: true if successful, false otherwise.