Rhino.Render.RenderContent.GroupId
Group ID of the content

Rhino.Render.RenderContent.MakeGroupInstance
Create an 'instance' of the content tree and group the new tree with this tree.
If the instance is subsequently attached to the same document, the state of all members
of the group will be kept synchronized.With the exception of the instance ids, all
state is exactly preserved in the new instance tree.
\note The grouping will have no effect until the new instance is attached to the same document.
Returns: A grouped instance of the content tree

Rhino.Render.RenderContent.Ungroup
Remove this content from any instance group it may be a member of.
Does not record undo but does send the OnContentGroupIdChanged event.
Returns: true if content was ungrouped, \e false if it was not part of a group.

Rhino.Render.RenderContent.UngroupRecursive
Remove this content and all its children from any instance groups they may be a member of.
Does not record undo but does send the OnContentGroupIdChanged event.
Returns: true if a content was ungrouped, \e false if no content or child was part of a group.

Rhino.Render.RenderContent.SmartUngroupRecursive
Remove this content and all its children from any instance groups they may be a member of.
If any content in the same document is left alone in the group, that content is also ungrouped.
Records undo and sends events OnContentChanged and OnContentGroupIdChanged.
\note This method is designed to be called from a content UI and is intended for RDK internal
use but may be used as an expert user override.
Returns: true if a content was ungrouped, \e false if no content or child was part of a group.