Rhino.FileIO.File3dmLinetypeTable.FindIndex(System.Int32)
Retrieves a Linetype object based on Index. This search type of search is discouraged.
We are moving towards using only IDs for all tables.
index: The index to search for.
Returns: A Linetype, or null if none was found.