Rhino.Geometry.BrepFace.MaterialChannelIndex
This face's rendering material channel index.

Rhino.Geometry.BrepFace.ShrinkFace(Rhino.Geometry.BrepFace.ShrinkDisableSide)
Shrinks the underlying untrimmed surface of this Brep face close to trimming boundaries.
Shrinking a surface is like extending smoothly, only backwards. knot of full multiplicity
are added where you want the surface to be cut off. Then the remaining control points are
thrown away.
disableSide: The side(s) of the surface to not shrink.
Returns: true on success, false on failure.

Rhino.Geometry.BrepFace.ShrinkSurfaceToEdge
Shrinks the underlying untrimmed surface of this Brep face right to the trimming boundaries.
Note, shrinking the trimmed surface can sometimes cause problems later since having
the edges so close to the trimming boundaries can cause commands that use the surface
edges as input to fail.
Returns: true on success, false on failure.

Rhino.Geometry.BrepFace.ClearMaterialChannelIndex
Clear this face's rendering material channel index.