Rhino.FileIO.File3dmDimStyleTable.FindIndex(System.Int32)
Retrieves a DimensionStyle object based on Index. This search type of search is discouraged.
We are moving towards using only IDs for all tables.
index: The index to search for.
Returns: A DimensionStyle object, or null if none was found.