Rhino.FileIO.File3dmObjectTable.FindByGroup(Rhino.DocObjects.Group)
Finds all File3dmObject that are in a given group.
group: A group instance.
Returns: Array of objects that belong to the specified group or empty array if no objects could be found.
Throws System.ArgumentNullException: If group is null.