Rhino.DocObjects.Tables.ObjectTable.AddInstanceObject(System.Int32,Rhino.Geometry.Transform)
Adds an instance object to the document.
instanceDefinitionIndex: The index of the instance definition.
instanceXform: The instance transformation.
Returns: A unique identifier for the object if successful. Guid.Empty it not successful.

Rhino.DocObjects.Tables.ObjectTable.AddInstanceObject(System.Int32,Rhino.Geometry.Transform,Rhino.DocObjects.ObjectAttributes)
Adds an instance object to the document.
instanceDefinitionIndex: The index of the instance definition.
instanceXform: The instance transformation.
attributes: The attribues to apply to the instance object.
Returns: A unique identifier for the object if successful. Guid.Empty it not successful.

Rhino.DocObjects.Tables.ObjectTable.AddInstanceObject(System.Int32,Rhino.Geometry.Transform,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds an instance object to the document.
instanceDefinitionIndex: The index of the instance definition.
instanceXform: The instance transformation.
attributes: The attribues to apply to the instance object.
history: The history record associated with this instance object.
reference: true if the object is from a reference file. Reference objects do not persist in archives.
Returns: A unique identifier for the object if successful. Guid.Empty it not successful.