Rhino.FileIO.File3dmLayerTable.FindIndex(System.Int32)
Retrieves a Layer object based on Index. This search type of search is discouraged.
We are moving towards using only IDs for all tables.
index: The index to search for.
Returns: A Layer object, or null if none was found.