Rhino.Geometry.Mesh.CreateFromClosedPolyline(Rhino.Geometry.Polyline)
Attempts to create a Mesh that is a triangulation of a simple closed polyline that projects onto a plane.
polyline: must be closed
Returns:
New mesh on success or null on failure.