Rhino.Geometry.Collections.BrepTrimList.MatchEnds
Matches the endpoints of all trims in the Brep.
Returns: true if any trim's 2d curve is changed, false otherwise.

Rhino.Geometry.Collections.BrepTrimList.MatchEnds(System.Int32)
Match the endpoints of a trim to the next and previous trim.
trimIndex:
Returns: true if any trim's 2d curve is changed, false otherwise.

Rhino.Geometry.Collections.BrepTrimList.MatchEnds(Rhino.Geometry.BrepTrim,Rhino.Geometry.BrepTrim)
Match the end of a trim to the start of the next trim.
trim0: The Brep trim.
trim1: Trep trim that comes immediately after trim0 in the same loop.
Returns: true if either trim's 2d curve is changed, false otherwise.

Rhino.Geometry.Collections.BrepTrimList.MatchEnds(Rhino.Geometry.BrepLoop)
Match the endpoints of all trims in a loop.
loop: The Brep loop.
Returns: true if any trim's 2d curve is changed, false otherwise.