Rhino.Geometry.AnnotationBase.PlainTextWithFields
Text stripped of RTF formatting information and with field expressions intact

Rhino.Geometry.AnnotationBase.IsAllBold
Returns true if all of the text in the annotation is Bold, otherwise returns false
Returns:

Rhino.Geometry.AnnotationBase.IsAllItalic
Returns true if all of the text in the annotation is Italic, otherwise returns false
Returns:

Rhino.Geometry.AnnotationBase.IsAllUnderlined
Returns true if all of the text in the annotation is Underlined, otherwise returns false
Returns: