Rhino.Geometry.Brep.CreateFromSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Boolean,System.Double)
Sweep1 function that fits a surface through a profile curve that define the surface cross-sections
and one curve that defines a surface edge.
rail: Rail to sweep shapes along
shape: Shape curve
closed: Only matters if shape is closed
tolerance: Tolerance for fitting surface and rails
Returns: Array of Brep sweep results

Rhino.Geometry.Brep.CreateFromSweep(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Boolean,System.Double)
Sweep1 function that fits a surface through profile curves that define the surface cross-sections
and one curve that defines a surface edge.
rail: Rail to sweep shapes along
shapes: Shape curves
closed: Only matters if shapes are closed
tolerance: Tolerance for fitting surface and rails
Returns: Array of Brep sweep results

Rhino.Geometry.Brep.CreateFromSweepSegmented(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Boolean,System.Double)
Sweep1 function that fits a surface through a profile curve that define the surface cross-sections
and one curve that defines a surface edge. The Segmented version breaks the rail at curvature kinks
and sweeps each piece separately, then put the results together into a Brep.
rail: Rail to sweep shapes along
shape: Shape curve
closed: Only matters if shape is closed
tolerance: Tolerance for fitting surface and rails
Returns: Array of Brep sweep results

Rhino.Geometry.Brep.CreateFromSweepSegmented(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Boolean,System.Double)
Sweep1 function that fits a surface through a series of profile curves that define the surface cross-sections
and one curve that defines a surface edge. The Segmented version breaks the rail at curvature kinks
and sweeps each piece separately, then put the results together into a Brep.
rail: Rail to sweep shapes along
shapes: Shape curves
closed: Only matters if shapes are closed
tolerance: Tolerance for fitting surface and rails
Returns: Array of Brep sweep results

Rhino.Geometry.Brep.CreateFromSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Boolean,System.Double)
General 2 rail sweep. If you are not producing the sweep results that you are after, then
use the SweepTwoRail class with options to generate the swept geometry.
rail1: Rail to sweep shapes along
rail2: Rail to sweep shapes along
shape: Shape curve
closed: Only matters if shape is closed
tolerance: Tolerance for fitting surface and rails
Returns: Array of Brep sweep results

Rhino.Geometry.Brep.CreateFromSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Boolean,System.Double)
General 2 rail sweep. If you are not producing the sweep results that you are after, then
use the SweepTwoRail class with options to generate the swept geometry.
rail1: Rail to sweep shapes along
rail2: Rail to sweep shapes along
shapes: Shape curves
closed: Only matters if shapes are closed
tolerance: Tolerance for fitting surface and rails
Returns: Array of Brep sweep results

Rhino.Geometry.Brep.CreateFromSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Double,Rhino.Geometry.SweepRebuild,System.Int32,System.Double,System.Boolean)
Sweep2 function that fits a surface through profile curves that define the surface cross-sections
and two curves that defines a surface edge.
rail1: Rail to sweep shapes along
rail2: Rail to sweep shapes along
shapes: Shape curves
start: Optional starting point of sweep. Use Point3d.Unset if you do not want to include a start point.
end: Optional ending point of sweep. Use Point3d.Unset if you do not want to include an end point.
closed: Only matters if shapes are closed.
tolerance: Tolerance for fitting surface and rails.
rebuild: The rebuild style.
rebuildPointCount: If rebuild == SweepRebuild.Rebuild, the number of points. Otherwise specify 0.
refitTolerance: If rebuild == SweepRebuild.Refit, the refit tolerenace. Otherwise, specify 0.0
preserveHeight: Removes the association between the height scaling from the width scaling
Returns: Array of Brep sweep results

Rhino.Geometry.Brep.CreateFromSweepInParts(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d},System.Boolean,System.Double)
Makes a 2 rail sweep. Like CreateFromSweep but the result is split where parameterization along a rail changes abruptly.
rail1: Rail to sweep shapes along
rail2: Rail to sweep shapes along
shapes: Shape curves    ///
rail_params: Shape parameters
closed: Only matters if shapes are closed
tolerance: Tolerance for fitting surface and rails
Returns: Array of Brep sweep results

Rhino.Geometry.Brep.CreateBooleanSplit(Rhino.Geometry.Brep,Rhino.Geometry.Brep,System.Double)
Splits shared areas of Breps and creates separate Breps from the shared and unshared parts.
firstBrep: The Brep to split.
secondBrep: The cutting Brep.
tolerance: Tolerance to use for splitting operation. When in doubt, use the document's model absolute tolerance.
Returns: An array of Brep if successful, an empty array on failure.

Rhino.Geometry.Brep.CreateBooleanSplit(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double)
Splits shared areas of Breps and creates separate Breps from the shared and unshared parts.
firstSet: The Breps to split.
secondSet: The cutting Breps.
tolerance: Tolerance to use for splitting operation. When in doubt, use the document's model absolute tolerance.
Returns: An array of Brep if successful, an empty array on failure.

Rhino.Geometry.Brep.ClosestPoint(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d@,Rhino.Geometry.ComponentIndex@,System.Double@,System.Double@,System.Double,Rhino.Geometry.Vector3d@)
Finds a point on a Brep that is closest to testPoint.
The method searches all Brep faces looking for the one closest to testPoint.
When found, if the closest point falls on the inactive region of the face, then
the method finds the face's edge that is closest to testPoint.
testPoint: base point to project to surface.
closestPoint: location of the closest brep point.
ci: Component index of the brep component that contains
the closest point. Possible types are brep_face, brep_edge or brep_vertex.
s: If the ci type is brep_edge, then s is the parameter
of the closest edge point.
t: If the ci type is brep_face, then (s,t) is the parameter
of the closest edge point.
maximumDistance:
If maximumDistance > 0, then only points whose distance
is <= maximumDistance will be returned. Using a positive
value of maximumDistance can substantially speed up the search.
normal: The normal to the face if ci is a brep_face
and the tangent to the edge if ci is brep_edge.
Returns: true if the operation succeeded; otherwise, false.

Rhino.Geometry.Brep.IsPointInside(Rhino.Geometry.Point3d,System.Double,System.Boolean)
Determines if point is inside a Brep.  This question only makes sense when
the brep is a closed and manifold.  This function does not not check for
closed or manifold, so result is not valid in those cases.  Intersects
a line through point with brep, finds the intersection point Q closest
to point, and looks at face normal at Q.  If the point Q is on an edge
or the intersection is not transverse at Q, then another line is used.
point: 3d point to test.
tolerance:
3d distance tolerance used for intersection and determining strict inclusion.
A good default is RhinoMath.SqrtEpsilon.
strictlyIn:
if true, point is in if inside brep by at least tolerance.
if false, point is in if truly in or within tolerance of boundary.
Returns:
true if point is in, false if not.

Rhino.Geometry.Brep.GetPointInside(System.Double,Rhino.Geometry.Point3d@)
Finds a point inside of a solid Brep.
tolerance:
Used for intersecting rays and is not necessarily related to the distance from the brep to the found point.
When in doubt, use the document's model absolute tolerance.
point: A point inside the solid Brep.
Returns:
Returns false if the input is not solid and manifold, if the Brep's bounding box is less than 2.0 * tolerance wide,
or if no point could be found due to ray shooting or other errors. Otherwise, true is returned.