Rhino.DocObjects.Material.MaterialChannelIdFromIndex(System.Int32)
Finds id of the material channel at given index.
material_channel_index: Index
Returns: Id of the material channel

Rhino.DocObjects.Material.MaterialChannelIndexFromId(System.Guid,System.Boolean)
Finds index of the material channel that refers to a material channel with the given id.
Optionally adds channel if one is not found.
material_channel_id: Id
bAddIdIfNotPresent: Controls whether to add channel if none exist
Returns: Index of the material channel

Rhino.DocObjects.Material.ClearMaterialChannels
Removes all material channels