Rhino.RhinoDoc.ModelSpaceHatchScalingEnabled
True if hatch scaling is enabled, false if not.

Rhino.RhinoDoc.Undo
Undo the last action
Returns:  true on success

Rhino.RhinoDoc.Redo
Redo the last action that was "undone"
Returns:  true on success

Rhino.RhinoDoc.EndOpenDocumentInitialViewUpdate
This event is raised after Rhino.RhinoDoc.EndOpenDocument when the
documents initial views have been created and initialized.