Rhino.DocObjects.ObjectAttributes.GetDisplayModeOverride(System.Guid)
Returns the id of the display mode of an objects. Object display modes are view based. Thus, it is possible to have an object display different in different views.
viewportId: Id of a Rhino Viewport.
Returns: A display node id if the object has a display mode override for the viewport; otherwise Guid.Empty is returned.