Rhino.Render.TextureMapping.Evaluate(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d@)
Evaluate the mapping to get a texture coordinate
p: Vertex location
n: If the mapping projection is ray_projection, then this
is the vertex unit normal.  Otherwise n is ignored.
t: Texture coordinate (u,v,w)
Returns:
Nonzero if evaluation is successful.  When the mapping is a box or
capped cylinder mapping, the value indicates which side was evaluated.
Cylinder mapping: 1 = cylinder wall, 2 = bottom cap, 3 = top cap
Box mapping: 1 = front, 2 = right, 3 = back, 4 = left, 5 = bottom, 6 = top

Rhino.Render.TextureMapping.Evaluate(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d@,Rhino.Geometry.Transform,Rhino.Geometry.Transform)
Evaluate the mapping to get a texture coordinate
p: Vertex location
n: If the mapping projection is ray_projection, then this
is the vertex unit normal.  Otherwise n is ignored.
t: Texture coordinate (u,v,w)
pXform:
Transformation to be applied to P before performing the mapping calculation.
nXform:
Transformation to be applied to N before performing the mapping
calculation. One way to calculate nXxform is to use the call
pXform::GetVectorTransform(nXform).
Returns:
Nonzero if evaluation is successful.  When the mapping is a box or
capped cylinder mapping, the value indicates which side was evaluated.
Cylinder mapping: 1 = cylinder wall, 2 = bottom cap, 3 = top cap
Box mapping: 1 = front, 2 = right, 3 = back, 4 = left, 5 = bottom, 6 = top

Rhino.Render.TextureMapping.TryGetMappingMesh(Rhino.Geometry.Mesh@)
Get custom mapping mesh from this texture mapping.
mesh:
Returns: True if custom mapping mesh was returned.