Rhino.Geometry.Curve.LocalClosestPoint(Rhino.Geometry.Point3d,System.Double,System.Double@)
Find parameter of the point on a curve that is locally closest to
the testPoint.  The search for a local close point starts at
a seed parameter.
testPoint: A point to test against.
seed: The seed parameter.
t: >Parameter of the curve that is closest to testPoint.
Returns: true if the search is successful, false if the search fails.