Rhino.Display.ViewCaptureSettings.GetModelScale(Rhino.UnitSystem,Rhino.UnitSystem)
Returns the model scale factor.
pageUnits: The current page units.
modelUnits: The current model units.
Returns: The model scale factor.

Rhino.Display.ViewCaptureSettings.SetModelScaleToValue(System.Double)
Sets the model scale to a value.
scale: The scale value.

Rhino.Display.ViewCaptureSettings.SetModelScaleToFit(System.Boolean)
Scales the model to fit.
promptOnChange: Prompt the user if the model scale will change.

Rhino.Display.ViewCaptureSettings.IsScaleToFit
Returns true if the model has been scaled to fit.