Rhino.Display.RhinoPageView.GetDetailViews
Gets a list of the detail view objects associated with this layout.
Returns: An array of detail view objects if successful, an empty array if the layout has no details.

Rhino.Display.RhinoPageView.PageNumber
Gets or sets the runtime page number and updates the page number for all
of the other pages. The first page has a value of 0.