Rhino.Display.DisplayPipeline.ViewportProjectionChanged
Called when the projection changes for a viewport being drawn.

Rhino.Display.DisplayPipeline.AvailableOpenGLVersion(System.Boolean@)
If Rhino is using OpenGL for display, this function will return
major.minor version of OpenGL available for this instance of Rhino
coreProfile:
If true, OpenGL is being used in "core profile" mode
Returns:
major version * 10 + minor version
For example, OpenGL 4.5 returns 45

Rhino.Display.DisplayPipeline.DrawZebraPreview(Rhino.Geometry.Brep,System.Drawing.Color)
Draws a shaded Brep with Zebra stripe preview.
brep: Brep to draw.
color: Object color.