Rhino.DocObjects.Tables.LayerTable.Duplicate(System.Int32,System.Boolean,System.Boolean)
Duplicates, or copies, a layer. Duplicated layers are added to the document.
layerIndex: The index of the layer to duplicate.
duplicateObjects: If true, then layer objects will also be duplicated and added to the document.
duplicateSublayers: If true, then all sublayers of the layer will be duplicated.
Returns: The indices of the newly added layers if successful, an empty array on failure.

Rhino.DocObjects.Tables.LayerTable.Duplicate(System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean)
Duplicates, or copies, one or more layers. Duplicated layers are added to the document.
layerIndices: The indices of layers to duplicate.
duplicateObjects: If true, then layer objects will also be duplicated and added to the document.
duplicateSublayers: If true, then all sublayers of the layer will be duplicated.
Returns: The indices of the newly added layers if successful, an empty array on failure.