Rhino.PlugIns.RenderPlugIn.GetRenderSettingsSections
This function returns a list of uuid for the render settings pages that should be displayed.
Returns:
Return a Id list of of the Render settings sections that will be displayed