Rhino.FileIO.File3dmGroupTable.FindIndex(System.Int32)
Retrieves a Group object based on an index. This search type of search is discouraged.
We are moving towards using only IDs for all tables.
groupIndex: The index to search for.
Returns: A Group object, or null if none was found.

Rhino.FileIO.File3dmGroupTable.GroupMembers(System.Int32)
Gets an array of all of the objects in a group.
groupIndex: The index of the group in this table.
Returns: Array of objects that belong to the specified group or empty array if no objects could be found.