Rhino.Geometry.MeshUnsafeLock.VertexPoint3fArray(System.Int32@)
Retrieves a pointer to the raw mesh vertex array, which uses coordinates
defined with single precision floating point numbers, or null if none is available.
length: The length of the array. This value is returned by reference (out in C#).
0 is returned when there is no single precision array.
Returns: The beginning of the vertex array. Item 0 is the first vertex,
and item length-1 is the last valid one. If no array is available, null is returned.
Throws System.InvalidOperationException: The mesh does not use single precision vertices.
Remarks: When running this method for writing, it is up to the caller to ensure that the mesh has no
double precision array that needs to be synchronized. Otherwise, also the double precision array must be synchronized.

Rhino.Geometry.MeshUnsafeLock.VertexPoint3dArray(System.Int32@)
Retrieves a pointer to the raw mesh vertex array, which uses coordinates
defined with double precision floating point numbers, or throws an exception if none is available.
length: The length of the array. This value is returned by reference (out in C#).
Returns: The beginning of the vertex array. Item 0 is the first vertex,
and item length-1 is the last valid one. If no array is available, null is returned.
Throws System.InvalidOperationException: The mesh does not use double precision vertices.
Remarks: When running this method for writing and if the mesh has also a single precision array, the array is synchronized if the pointer to the
single precision array was not requested. Otherwise, it is up to the caller to ensure that the mesh vertices are kept synchronized, by setting both arrays to
the required values.

Rhino.Geometry.MeshUnsafeLock.NormalVector3fArray(System.Int32@)
Retrieves a pointer to the raw mesh vertex normal array, which uses vectors
defined with single precision floating point numbers, or throws an exception if none is available.
length: The length of the array. This value is returned by reference (out in C#).
Returns: The beginning of the vertex array. Item 0 is the first vertex,
and item length-1 is the last valid one.
Throws System.InvalidOperationException: The mesh does not have vertex normals.

Rhino.Geometry.MeshUnsafeLock.FacesArray(System.Int32@)
Retrieves a pointer to the raw faces array, which uses 4 integers for each face.
Rhino.Geometry.MeshFace.
length: The length of the array. This value is returned by reference (out in C#).
Returns: The beginning of the vertex array. Item 0 is the first vertex,
and item length-1 is the last valid one.
Throws System.InvalidOperationException: The mesh does not have face normals.