Rhino.FileIO.File3dmHatchPatternTable.FindIndex(System.Int32)
Retrieves a HatchPattern object based on Index. This search type of search is discouraged.
We are moving towards using only IDs for all tables.
index: The index to search for.
Returns: A HatchPattern object, or null if none was found.