Rhino.Display.DisplayPipelineAttributes.SetFill(System.Drawing.Color)
Set fill mode to solid color and set the fill color
singleColor:

Rhino.Display.DisplayPipelineAttributes.SetFill(System.Drawing.Color,System.Drawing.Color)
Set fill mode to two color and set the colors
gradientTop:
gradientBottom:

Rhino.Display.DisplayPipelineAttributes.SetFill(System.Drawing.Color,System.Drawing.Color,System.Drawing.Color,System.Drawing.Color)
Set the fill mode to four color gradient and set the colors
gradientTopLeft:
gradientBottomLeft:
gradientTopRight:
gradientBottomRight:

Rhino.Display.DisplayPipelineAttributes.GetFill(System.Drawing.Color@,System.Drawing.Color@,System.Drawing.Color@,System.Drawing.Color@)
Get fill colors used for clearing the frame buffer
topLeft:
bottomLeft:
topRight:
bottomRight: