Rhino.Geometry.SweepOneRail
Utility class for generating Breps by sweeping cross section curves over a single rail curve.
Note, this class has been superceeded by the Rhino.Geometry.Brep.CreateFromSweep static functions.