Rhino.Commands.BlockEditCommand
This class may be used to replace the built in BlockEdit command with a
plug-in version.  Make sure to make your plug-in a load at startup plug-in
when replacing the command to ensure the command is properly overridden.

Rhino.Commands.BlockEditCommand.ReplaceWith(Rhino.Commands.BlockEditCommand)
Call this method to register your replacement command, the last command
registered will be called.
replacementCommand:

Rhino.Commands.BlockEditCommand.Replacement
The current replacement command

Rhino.Commands.BlockEditCommand.InBlockEditMode(Rhino.RhinoDoc)
Call this method to determine if a document is being blocked edited.
doc:
Returns:
Returns true if the specified document is editing a block.

Rhino.Commands.BlockEditCommand.IsBlockEditing(Rhino.RhinoDoc)
Called to determine if the specified document was not block edit mode.
doc:
Returns:

Rhino.Commands.BlockEditCommand.RunCommand(Rhino.RhinoDoc,Rhino.Commands.RunMode)
Called by the internal BlockEdit command when the command is executed.
doc:
mode:
Returns: