Rhino.Geometry.Collections.BrepEdgeList.MergeEdge(System.Int32,System.Double)
Merge adjacent edges to a specified edge recursively.
A pair of adjacent edges in a Brep  are mergable if the angle between them is less than tolerance and the valence of the shared vertex is 2.
edgeIndex: >Index of edge to merge.
angleTolerance: The maximum allowable difference of angle in radian between adjacent edges that can be merged.
Returns: The number of edges merged.

Rhino.Geometry.Collections.BrepEdgeList.MergeAllEdges(System.Double)
Merges all possible Brep edges. Edges across kinks cannot be merged.
A pair of adjacent edges in a Brep  are mergable if the angle between them is less than tolerance and the valence of the shared vertex is 2.
angleTolerance: The maximum allowable difference of angle in radian between adjacent edges that can be merged.
Returns: The number of edges merged.