Rhino.Render.Utilities.ShowContentChooser(System.Guid,System.Guid,Rhino.Render.RenderContentKind,System.Guid@,Rhino.Render.RenderContent.ShowContentChooserFlags,Rhino.RhinoDoc)
Shows the content chooser to allow the user to select a new or existing content.
defaultType: The content type that will be initially selected in the 'New' tab.
defaultInstanceId: The content instance that will be initially selected in the 'Existing' tab.
kinds: Which content kinds will be displayed.
instanceIdOut: The UUID of the chosen item. Depending on eRhRdkSccResult, this can be the type id of a content type or the instance id of an existing content.
flags: Tabs specifications.
doc: A Rhino document.
Returns: The result.