Rhino.Input.Custom.CommandLineOption.EnglishName
The English command option name

Rhino.Input.Custom.CommandLineOption.LocalName
The localized command option name

Rhino.Input.Custom.CommandLineOption.StringOptionValue
Assigned by RhinoGet.Get if an option value is specified in a script or by a command window control.