Rhino.RhinoApp.SetFocusToMainWindow
Sets the focus to the main window. This function attempts to use the
ActiveDoc on Mac to figure out which window to set focus to.

Rhino.RhinoApp.SetFocusToMainWindow(Rhino.RhinoDoc)
Sets the focus to the main windows for a given document
doc:
the document to use for determing a "main window"

Rhino.RhinoApp.IsClosing
Returns true if Rhino is in the process of closing, false otherwise.
This can be true even before the Closing event fires, such as when RhinoDoc.CloseDocument event is called.

Rhino.RhinoApp.IsExiting
Returns true if Rhino is in the process of exiting, false otherwise.
This can be true even before the Closing event fires, such as when RhinoDoc.CloseDocument event is called.