Rhino.Geometry.VolumeMassProperties.CentroidCoordinatesProductMoments
Product moments with respect to centroid coordinate system.

Rhino.Geometry.VolumeMassProperties.CentroidCoordinatesProductMomentsError
Uncertainty in product moments with respect to centroid coordinate system.