Rhino.PlugIns.PlugInLoadTime
Rhino plug-in load time enumeration.
Since: 5.0

Rhino.PlugIns.PlugInLoadTime.Disabled
never load plug-in.

Rhino.PlugIns.PlugInLoadTime.AtStartup
Load when Rhino starts.

Rhino.PlugIns.PlugInLoadTime.WhenNeeded
(default) Load the first time a plug-in command used.

Rhino.PlugIns.PlugInLoadTime.WhenNeededIgnoreDockingBars
Load the first time a plug-in command used NOT when restoring docking control bars.

Rhino.PlugIns.PlugInLoadTime.WhenNeededOrOptionsDialog
When a plug-in command is used or the options dialog is shown.

Rhino.PlugIns.PlugInLoadTime.WhenNeededOrTabbedDockBar
When a plug-in command is used or when a tabbed dockbar is loaded.