Rhino.FileIO.FileAiReadOptions
Options for reading a AI file (old ai files, ps not pdf)

Rhino.FileIO.FileAiReadOptions.PreserveModelScale
Since: 8.0

Rhino.FileIO.FileAiReadOptions.RhinoScale
Since: 8.0

Rhino.FileIO.FileAiReadOptions.AiUnits
Since: 8.0

Rhino.FileIO.FileAiReadOptions.AiScale
Since: 8.0

Rhino.FileIO.FileAiReadOptions.ToDictionary
Since: 8.0