Rhino.Display.DisplayModeDescription
Description of a how Rhino will display in a viewport. These are the modes
that are listed under "Advanced display" in the options dialog.

Rhino.Display.DisplayModeDescription.Dispose
Since: 5.0

Rhino.Display.DisplayModeDescription.GetDisplayModes
Gets all display mode descriptions that Rhino currently knows about.
Returns:
Copies of all of the display mode descriptions. If you want to modify
these descriptions, you must call UpdateDisplayMode or AddDisplayMode.
Since: 5.0

Rhino.Display.DisplayModeDescription.GetDisplayMode(System.Guid)
Since: 5.0

Rhino.Display.DisplayModeDescription.FindByName(System.String)
Since: 5.0

Rhino.Display.DisplayModeDescription.AddDisplayMode(Rhino.Display.DisplayModeDescription)
Since: 5.0

Rhino.Display.DisplayModeDescription.AddDisplayMode(System.String)
Adds a new display mode.
name: The name of the new display mode.
Returns: The id of the new display mode if successful. Guid.Empty on error.
Since: 6.7

Rhino.Display.DisplayModeDescription.CopyDisplayMode(System.Guid,System.String)
Copies an existing display mode.
id: The id of the existing display mode to copy.
name: The name of the new display mode.
Returns: The id of the new display mode if successful. Guid.Empty on error.
Since: 6.7

Rhino.Display.DisplayModeDescription.UpdateDisplayMode(Rhino.Display.DisplayModeDescription)
Since: 5.0

Rhino.Display.DisplayModeDescription.DeleteDiplayMode(System.Guid)
Deletes an existing display mode.
id: The id of the existing display mode to delete.
Returns: true if successful, false otherwise.
Since: 5.0
7.0

Rhino.Display.DisplayModeDescription.DeleteDisplayMode(System.Guid)
Deletes an existing display mode.
id: The id of the existing display mode to delete.
Returns: true if successful, false otherwise.
Since: 7.0

Rhino.Display.DisplayModeDescription.ImportFromFile(System.String)
Imports a DisplayModeDescription from a Windows-style .ini file.
filename: The name of the file to import.
Returns: The id of the DisplayModeDescription if successful.
Since: 6.0

Rhino.Display.DisplayModeDescription.ImportFromFile(System.String,System.Boolean)
Imports a DisplayModeDescription from a Windows-style .ini file.
filename: The name of the file to import.
interactive: True to show user interface messages, false to suppress any user interface messages.
Returns: The id of the DisplayModeDescription if successful.
Since: 8.27

Rhino.Display.DisplayModeDescription.ExportToFile(Rhino.Display.DisplayModeDescription,System.String)
Exports a DisplayModeDescription to a Windows-style .ini file.
displayMode: The DisplayModeDescription to export.
filename: The name of the file to create.
Returns:
Since: 6.0

Rhino.Display.DisplayModeDescription.InMenu
Since: 5.0

Rhino.Display.DisplayModeDescription.SupportsShadeCommand
Since: 5.0

Rhino.Display.DisplayModeDescription.SupportsShading
Since: 5.0

Rhino.Display.DisplayModeDescription.AllowObjectAssignment
Since: 5.0

Rhino.Display.DisplayModeDescription.ShadedPipelineRequired
Since: 5.0

Rhino.Display.DisplayModeDescription.WireframePipelineRequired
Since: 5.0

Rhino.Display.DisplayModeDescription.PipelineLocked
Since: 5.0

Rhino.Display.DisplayModeDescription.DisplayAttributes
Since: 5.0

Rhino.Display.DisplayModeDescription.EnglishName
Since: 5.0

Rhino.Display.DisplayModeDescription.Id
Since: 5.0

Rhino.Display.DisplayModeDescription.LocalName
Since: 5.0

Rhino.Display.DisplayModeDescription.ArtisticId
Since: 6.26

Rhino.Display.DisplayModeDescription.GhostedId
Since: 6.0

Rhino.Display.DisplayModeDescription.PenId
Since: 6.0

Rhino.Display.DisplayModeDescription.RenderedId
Since: 6.0

Rhino.Display.DisplayModeDescription.RenderedShadowsId
Since: 6.0

Rhino.Display.DisplayModeDescription.ShadedId
Since: 6.0

Rhino.Display.DisplayModeDescription.TechId
Since: 6.0

Rhino.Display.DisplayModeDescription.WireframeId
Since: 6.0

Rhino.Display.DisplayModeDescription.XRayId
Since: 6.0

Rhino.Display.DisplayModeDescription.AmbientOcclusionId
Since: 6.0

Rhino.Display.DisplayModeDescription.RaytracedId
Since: 6.0

Rhino.Display.DisplayModeDescription.MonochromeId
Since: 8.14