Rhino.Geometry.SubDCreationOptions.TextureCoordinateOption
Specifies how texture coordinate information is transferred from the mesh to the SubD.

Rhino.Geometry.SubDCreationOptions.TextureCoordinateOption.Unset
The option is not set.

Rhino.Geometry.SubDCreationOptions.TextureCoordinateOption.None
No texture coordianate information is transferred from the mesh.

Rhino.Geometry.SubDCreationOptions.TextureCoordinateOption.Automatic
If the mesh has a mapping, then TextureCoordinatesOption::CopyMapping is used.
Otherwise if the mesh has texture coordinates, then TextureCoordinatesOption::CopyCoordinates is used.
Otherwise TextureCoordinatesOption::Packed is used.

Rhino.Geometry.SubDCreationOptions.TextureCoordinateOption.Packed
No texture coordianate information is transferred from the mesh.
The SubD faces are packed.

Rhino.Geometry.SubDCreationOptions.TextureCoordinateOption.CopyMapping
Texture coordinates mapping information is copied from the mesh.
Generally this is the best choice because common mappings, like planar,
will appear as most people expect on the SubD.

Rhino.Geometry.SubDCreationOptions.TextureCoordinateOption.CopyCoordinates
If a mesh has custom texture coordinates, the custom texture coordinates
are transferred to the SubD. This requires more memory resources,
slows subdivision evaluation, often produces unattractive
results on n-gons, and distorts the texture when comes from a common mapping
technique, like planar. This option may be useful when the mesh contains only
triangles and quads and the custom texture coordinates are of high quality.