Rhino.FileIO.FileObjWriteOptions.AsciiEol
End of Line
Since: 6.0

Rhino.FileIO.FileObjWriteOptions.AsciiEol.Crlf
MicroSoft

Rhino.FileIO.FileObjWriteOptions.AsciiEol.Lf
UNIX

Rhino.FileIO.FileObjWriteOptions.AsciiEol.Cr
Apple