Rhino.Runtime.InteropWrappers.SimpleArrayPoint3d
ON_SimpleArray<ON_3dPoint>, ON_3dPointArray, ON_PolyLine all have the same size
This class wraps all of these C++ versions.  If you are not writing C++ code then this
class is not for you.

Rhino.Runtime.InteropWrappers.SimpleArrayPoint3d.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayPoint3d.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayPoint3d.#ctor
Initializes a new empty Rhino.Runtime.InteropWrappers.SimpleArrayPoint3d instance.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayPoint3d.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayPoint3d instance from a set of points
pts:
Since: 7.18

Rhino.Runtime.InteropWrappers.SimpleArrayPoint3d.Count
Gets the amount of points in this array.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayPoint3d.Add(Rhino.Geometry.Point3d)
Adds a point to the list
pt:
Since: 8.0

Rhino.Runtime.InteropWrappers.SimpleArrayPoint3d.ToArray
Copies the unmanaged array to a managed counterpart.
Returns: The managed array.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayPoint3d.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.SimpleArrayPoint3d.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayPoint3d.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.