Rhino.Geometry.Interpolator
Exposes a set of standard numeric interpolation algorithms.

Rhino.Geometry.Interpolator.#ctor
Constructs a new, empty Interpolator.
Since: 5.0

Rhino.Geometry.Interpolator.#ctor(System.Int32)
Constructs an empty Interpolator with a certain capacity.
initialCapacity: Number of items this interpolator can store without resizing.
Since: 5.0

Rhino.Geometry.Interpolator.#ctor(Rhino.Collections.RhinoList{System.Double})
Copy all the numbers from an existing RhinoList.
list: List to mimic.
Since: 5.0

Rhino.Geometry.Interpolator.#ctor(System.Collections.Generic.IEnumerable{System.Double})
Constructs an Interpolator from a collection of numbers.
collection: Collection of numbers to duplicate.
Since: 5.0

Rhino.Geometry.Interpolator.#ctor(System.Int32,System.Double)
Constructs a new Interpolator with a specified amount of numbers.
amount: Number of values to add to this Interpolator. Must be equal to or larger than zero.
defaultValue: Number to add.
Since: 5.0

Rhino.Geometry.Interpolator.Cyclical
Gets or sets a value indicating whether or not the values inside this Interpolator
are to be treated as cyclical (i.e. circular).
Since: 5.0

Rhino.Geometry.Interpolator.InterpolateNearestNeighbour(System.Double)
Sample the list of numbers with Nearest Neighbor interpolation.
t: Parameter to sample at. The integer portion of the parameter
indicates the index of the left-hand value. If this Interpolator is cyclical,
parameters will be wrapped.
Returns: The sampled value at t.
Since: 5.0

Rhino.Geometry.Interpolator.InterpolateLinear(System.Double)
Sample the list of numbers with linear interpolation.
t: Parameter to sample at. The integer portion of the parameter
indicates the index of the left-hand value. If this Interpolator is cyclical,
parameters will be wrapped.
Returns: The sampled value at t.
Since: 5.0

Rhino.Geometry.Interpolator.InterpolateCosine(System.Double)
Sample the list of numbers with cosine interpolation.
t: Parameter to sample at. The integer portion of the parameter
indicates the index of the left-hand value. If this Interpolator is cyclical,
parameters will be wrapped.
Returns: The sampled value at t.
Since: 5.0

Rhino.Geometry.Interpolator.InterpolateCubic(System.Double)
Sample the list of numbers with cubic interpolation.
t: Parameter to sample at. The integer portion of the parameter
indicates the index of the left-hand value. If this Interpolator is cyclical,
parameters will be wrapped.
Returns: The sampled value at t.
Since: 5.0

Rhino.Geometry.Interpolator.InterpolateCatmullRom(System.Double)
Sample the list of numbers with Catmull-Rom interpolation.
t: Parameter to sample at. The integer portion of the parameter
indicates the index of the left-hand value. If this Interpolator is cyclical,
parameters will be wrapped.
Returns: The sampled value at t.
Since: 5.0

Rhino.Geometry.Interpolator.MapIndex(System.Int32)
Map a sample index onto the actual sample list.
index: Index to map.
Returns: The mapped index.

Rhino.Geometry.Interpolator.SolveParameter(System.Double,System.Int32@,System.Double@)
Decompose a sampling parameter into an index and a unitized parameter.
param: Parameter to decompose.
index: Integer portion of parameter.
t: Floating point portion of parameter.