Rhino.DocObjects.DimensionStyle.MaskFrame
Draw a frame stroke around the text mask area

Rhino.DocObjects.DimensionStyle.MaskFrame.NoFrame
Text mask frame not drawn

Rhino.DocObjects.DimensionStyle.MaskFrame.RectFrame
Text mask frame outline rectangle drawn

Rhino.DocObjects.DimensionStyle.MaskFrame.CapsuleFrame
Text mask frame outline capsule drawn