Rhino.UI.ToolbarFileCollection
Represents a collection of Rhino toolbars, or .RUI, files.
Since: 5.0

Rhino.UI.ToolbarFileCollection.Count
Get tne number of open toolbar files.
Since: 5.0

Rhino.UI.ToolbarFileCollection.Item(System.Int32)
Gets an open toolbar file by index.
index: The index of the toolar file.
Returns: The toolbar if successful, null otherwise.
Since: 5.0

Rhino.UI.ToolbarFileCollection.FindByName(System.String,System.Boolean)
Gets an open toolbar file by name, or alias.
name: The name, or alias, of the toolbar file.
ignoreCase: true to ignore case during the comparison; otherwise, false.
Returns: The toolbar if successful, null otherwise.
Since: 5.0

Rhino.UI.ToolbarFileCollection.FindByPath(System.String)
Gets an open toolbar by full path.
path: The full path to the toolbar file.
Returns:
Returns: The toolbar if successful, null otherwise.
Since: 5.0

Rhino.UI.ToolbarFileCollection.Open(System.String)
Opens a toolbar file.
path: The full path to the toolbar file.
Returns: The toolbar if successful, null otherwise.
Since: 5.0

Rhino.UI.ToolbarFileCollection.GetEnumerator
Gets a toolbar file enumerator.
Returns: The enumerator.
Since: 5.0

Rhino.UI.ToolbarFileCollection.SidebarIsVisible
Returns true if the sizebar is visible.
Since: 5.0

Rhino.UI.ToolbarFileCollection.MruSidebarIsVisible
Returns true if the most-recently-used sizebar is visible.
Since: 5.0