Rhino.PrivateMeshCommands.MeshTypes.FacesCollection.AddSimplestCase(Rhino.PrivateMeshCommands.MeshTypes.WeshFace,System.Boolean)
1) Adds this face, if 2) it is not already present

Rhino.PrivateMeshCommands.MeshTypes.FacesCollection.Contains(Rhino.PrivateMeshCommands.MeshTypes.WeshFace)
Face must be in invariant order for this to work.
item: The face.
Returns:

Rhino.PrivateMeshCommands.MeshTypes.FacesCollection.DiscardSubFaces
TODO: This is slow because it checks every combination.
It might be useful to note that the intersection of sets (subface U face) => subface