Rhino.DocObjects.EarthAnchorPoint
Contains information about the model's position in latitude, longitude,
and elevation for GIS mapping applications.

Rhino.DocObjects.EarthAnchorPoint.#ctor
Initializes a new instance of the Rhino.DocObjects.EarthAnchorPoint class.
Since: 5.0

Rhino.DocObjects.EarthAnchorPoint.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.DocObjects.EarthAnchorPoint.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0

Rhino.DocObjects.EarthAnchorPoint.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.DocObjects.EarthAnchorPoint.EarthBasepointLatitude
Gets or sets a point latitude on earth, in degrees.
+90 = north pole, 0 = equator, -90 = south pole.
Since: 5.0

Rhino.DocObjects.EarthAnchorPoint.EarthBasepointLongitude
Gets or sets the point longitude on earth, in degrees.
Since: 5.0

Rhino.DocObjects.EarthAnchorPoint.EarthBasepointElevation
Gets or sets the point elevation on earth, in meters.
Since: 5.0

Rhino.DocObjects.EarthAnchorPoint.EarthBasepointElevationCoordinateSystem
Gets or sets a value indicating the zero level convention relating to a location on Earth.
Since: 8.5

Rhino.DocObjects.EarthAnchorPoint.EarthBasepointElevationZero
Gets or sets a value indicating the zero level convention relating to a location on Earth.
Since: 5.0

Rhino.DocObjects.EarthAnchorPoint.KMLOrientationHeadingAngleDegrees
Gets Keyhole Markup Language (KML) orientation heading angle in degrees.
Since: 7.11

Rhino.DocObjects.EarthAnchorPoint.KMLOrientationTiltAngleDegrees
Gets Keyhole Markup Language (KML) orientation tilt angle in degrees.
Since: 7.11

Rhino.DocObjects.EarthAnchorPoint.KMLOrientationRollAngleDegrees
Gets Keyhole Markup Language (KML) orientation roll angle in degrees.
Since: 7.11

Rhino.DocObjects.EarthAnchorPoint.KMLOrientationHeadingAngleRadians
Gets Keyhole Markup Language (KML) orientation heading angle in radians.
Since: 7.11

Rhino.DocObjects.EarthAnchorPoint.KMLOrientationTiltAngleRadians
Gets Keyhole Markup Language (KML) orientation tilt angle in degrees.
Since: 7.11

Rhino.DocObjects.EarthAnchorPoint.KMLOrientationRollAngleRadians
Gets Keyhole Markup Language (KML) orientation roll angle in degrees.
Since: 7.11

Rhino.DocObjects.EarthAnchorPoint.ModelBasePoint
Corresponding model point in model coordinates.
Since: 5.0

Rhino.DocObjects.EarthAnchorPoint.ModelNorth
Earth directions in model coordinates.
Since: 5.0

Rhino.DocObjects.EarthAnchorPoint.ModelEast
Earth directions in model coordinates.
Since: 5.0

Rhino.DocObjects.EarthAnchorPoint.Name
Gets or sets the short form of the identifying information about this location.
Since: 5.0

Rhino.DocObjects.EarthAnchorPoint.Description
Gets or sets the long form of the identifying information about this location.
Since: 5.0

Rhino.DocObjects.EarthAnchorPoint.EarthLocationIsSet
Checks if the earth location is set or not.
Returns: Boolean value, true if set else false
Since: 6.0

Rhino.DocObjects.EarthAnchorPoint.ModelLocationIsSet
Checks if the model location is set or not.
Returns: Boolean value, true if set else false
Since: 8.5

Rhino.DocObjects.EarthAnchorPoint.GetModelCompass
Returns a plane in model coordinates whose X axis points East,
Y axis points North and Z axis points Up. The origin
is set to ModelBasepoint.
Returns: A plane value. This might be invalid on error.
Since: 5.0

Rhino.DocObjects.EarthAnchorPoint.GetModelToEarthTransform(Rhino.UnitSystem)
Gets a transformation from model coordinates to earth coordinates.
This transformation assumes the model is small enough that
the curvature of the earth can be ignored.
modelUnitSystem: The model unit system.
Returns:
Transform on success. Invalid Transform on error.
Remarks:
If M is a point in model coordinates and E = model_to_earth*M,
then
E.x = latitude in decimal degrees
E.y = longitude in decimal degrees
E.z = elevation in meters above mean sea level
Because the earth is not flat, there is a small amount of error
when using a linear transformation to calculate oblate spherical
coordinates.  This error is small.  If the distance from P to M
is d meters, then the approximation error is
latitude error  <=
longitude error <=
elevation error <= 6379000*((1 + (d/6356000)^2)-1) meters
In particular, if every point in the model is within 1000 meters of
the m_model_basepoint, then the maximum approximation errors are
latitude error  <=
longitude error <=
elevation error <= 8 centimeters.
Since: 5.0

Rhino.DocObjects.EarthAnchorPoint.GetEarthAnchorPlane(Rhino.Geometry.Vector3d@)
Returns the earth anchor plane
anchorNorth:
Returns: A plane value.
Since: 6.0