Rhino.Render.PreviewLighting
PreviewAppearance takes care of construction and destruction of PreviewLight

Rhino.Render.PreviewLighting.CppPointer
CppPointer for PreivewLighting
Since: 6.0

Rhino.Render.PreviewLighting.#ctor(System.IntPtr)
Constructor for PreivewLighting
Since: 6.0

Rhino.Render.PreviewLighting.SetUpPreview(System.IntPtr)
SetUpPreview
Since: 6.0

Rhino.Render.PreviewLighting.ElementKind
ElementKind
Since: 6.0