Rhino.Runtime.LicenseManager.GetCustomLicenseCallback
Delegate passed to rhcommon_c as a call back function pointer
pluginId:
ID of plug-in requesting a license
licenseId:
ID of license for this version of the plug-in. May be different from pluginId.
title:
License description string
capabilities:
Bitwise flag containing a list of buttons to be displayed on the custom
get license dialog.
textMask:
Optional text mask to be applied to the license key input control
path:
Full path to module which we are getting a license for, will check
module for the required digital signatures.
validator:
A pointer to the CRhinoLicenseValidator associated with this call, this
object contains the ValidateProductKey method used by the Zoo Client to
validate key values.
Returns:
Returns a value of 1 on success or 0 on failure.