Rhino.DocObjects.LineJoinStyle
Shape to be used at the corners of curves

Rhino.DocObjects.LineJoinStyle.Round
Rounds corners

Rhino.DocObjects.LineJoinStyle.Miter
Sharp corners where outer edges are extended to a point where they meet

Rhino.DocObjects.LineJoinStyle.Bevel
Beveled corner where outer edges are connected without extending