Rhino.FileIO.FileGltfWriteOptions.SubDMeshing
Determines whether the surface or control net of a SubD object is used to generate a mesh
Since: 8.3

Rhino.FileIO.FileGltfWriteOptions.SubDMeshing.Surface
The SubD surface is used

Rhino.FileIO.FileGltfWriteOptions.SubDMeshing.ControlNet
The SubD control net is used