Rhino.Render.RenderWindowClonedEventArgs.OldSessionId
Since: 5.11

Rhino.Render.RenderWindowClonedEventArgs.NewSessionId
Since: 5.11

Rhino.Render.RenderWindowClonedEventArgs.OldRenderWindow
Since: 5.11

Rhino.Render.RenderWindowClonedEventArgs.NewRenderWindow
Since: 5.11