Rhino.Render.InternalUtilities.RdkIsNonRDKPlugInMaterial(Rhino.DocObjects.Material)
Checks if material is non rdk material
mat: Material
Returns: Returns true if material is non rdk material, otherwise false