Rhino.Geometry.SubDDisplayParameters
A collection of parameters that are passed to functions that calculate a various representations of SubD objects.
Since: 7.18

Rhino.Geometry.SubDDisplayParameters.#ctor
Initializes a new instance with default values.
Since: 7.18

Rhino.Geometry.SubDDisplayParameters.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Geometry.SubDDisplayParameters.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 7.18

Rhino.Geometry.SubDDisplayParameters.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.Geometry.SubDDisplayParameters.ClampDisplayDensity(System.UInt32)
Limits display density to a value useful in user interface code.
displayDensity:
Returns: The clamped value.
Since: 7.18

Rhino.Geometry.SubDDisplayParameters.AdaptiveDisplayMeshQuadMaximum
When the SubD display density is adaptive (default), AdaptiveMeshQuadMaximum
specifies the approximate number of display mesh quads to permit before
reducing the SubD display mesh density.
Since: 7.18

Rhino.Geometry.SubDDisplayParameters.Empty
Get an empty SubDDisplayParameters.
Returns: The SubD display parameters.
Since: 7.18

Rhino.Geometry.SubDDisplayParameters.ExtraCoarse
Parameters for an extra course limit surface display mesh.
SubD display density = adaptive SubDDisplayParameters.Density.ExtraCoarseDensity.
Returns: The SubD display parameters.
Since: 7.18

Rhino.Geometry.SubDDisplayParameters.Coarse
Parameters for a course limit surface display mesh.
SubD display density = adaptive SubDDisplayParameters.Density.CoarseDensity.
Returns: The SubD display parameters.
Since: 7.18

Rhino.Geometry.SubDDisplayParameters.Medium
Parameters for a medium limit surface display mesh.
SubD display density = adaptive SubDDisplayParameters.Density.MediumDensity.
Returns: The SubD display parameters.
Since: 7.18

Rhino.Geometry.SubDDisplayParameters.Fine
Parameters for a fine limit surface display mesh.
SubD display density = adaptive SubDDisplayParameters.Density.FineDensity.
Returns: The SubD display parameters.
Since: 7.18

Rhino.Geometry.SubDDisplayParameters.ExtraFine
Parameters for an extra fine limit surface display mesh.
SubD display density = adaptive SubDDisplayParameters.Density.ExtraFineDensity.
Returns: The SubD display parameters.
Since: 7.18

Rhino.Geometry.SubDDisplayParameters.Default
Parameters for the default limit surface display mesh.
SubD display density = adaptive SubDDisplayParameters.Density.DefaultDensity.
Returns: The SubD display parameters.
Since: 7.18

Rhino.Geometry.SubDDisplayParameters.AbsoluteDisplayDensityFromSubDFaceCount(System.UInt32,System.UInt32)
Gets the absolute SubD display density for SubD with subdFaceCount faces.
adaptiveSubDDisplayDensity:
A value <= SubDDisplayParameters.Density.MaximumDensity.
When in doubt, pass SubDDisplayParameters.Density.DefaultDensity.
subDFaceCount: Number of SubD faces.
Returns:
The absolute SubD display density is <= adaptiveSubDDisplayDensity and <= SubDDisplayParameters.Density.MaximumDensity.
Since: 7.18

Rhino.Geometry.SubDDisplayParameters.AbsoluteDisplayDensityFromSubD(System.UInt32,Rhino.Geometry.SubD)
Gets absolute SubD display density for subd.
adaptiveSubDDisplayDensity:
A value <= SubDDisplayParameters.Density.MaximumDensity.
When in doubt, pass SubDDisplayParameters.Density.DefaultDensity.
subd:
In the cases when the SubD in question is not available, like user interface code that applies in general
and to unknown SubDs, pass SubD.Empty.
Returns:
The absolute SubD display density is <= adaptiveSubDDisplayDensity and <= SubDDisplayParameters.Density.MaximumDensity.
Since: 7.18

Rhino.Geometry.SubDDisplayParameters.CreateFromDisplayDensity(System.UInt32)
In most applications, the caller sets the mesh density and leaves the other parameters set to the default values.
adaptiveSubDDisplayDensity:
A value <= SubDDisplayParameters.Density.MaximumDensity. When in doubt, pass SubDDisplayParameters.Density.DefaultDensity.
Values < SubDDisplayParameters.Density.MinimumAdaptiveDensity are treated as SubDDisplayParameters.Density.MinimumAdaptiveDensity.
All other invalid input values are treated as SubDDisplayParameters.Density.DefaultDensity.
Returns: The SubD display parameters.
Since: 7.18

Rhino.Geometry.SubDDisplayParameters.CreateFromAbsoluteDisplayDensity(System.UInt32)
Use of absolute display density is strongly discouraged.
SubDs can have a single face or millions of faces.
Adaptive display meshing produces more desirable results in almost all cases.
absoluteSubDDisplayDensity:
A value <= SubDDisplayParameters.Density.MaximumDensity.
When in doubt, pass SubDDisplayParameters.Density.DefaultDensity.
Returns: The SubD display parameters.
Since: 7.18

Rhino.Geometry.SubDDisplayParameters.CreateFromMeshDensity(System.Double)
This function creates SubDDisplayParameters from a user interface "slider" like Rhino's simple mesh controls.
normalizedMeshDensity: A double between 0.0 and 1.0.
Returns: A valid ON_SubDDisplayParameters with the specified subd display density.
Since: 7.18

Rhino.Geometry.SubDDisplayParameters.DisplayDensityIsAdaptive
True if the SubD display density setting is adaptive and approximate display
mesh quad count is capped at SubDDisplayParameters::AdaptiveDisplayMeshQuadMaximum.
Since: 7.18

Rhino.Geometry.SubDDisplayParameters.DisplayDensityIsAbsolute
True if the SubD display density setting is absolute.
Since: 7.18

Rhino.Geometry.SubDDisplayParameters.DisplayDensity(Rhino.Geometry.SubD)
Gets the absolute display density to use when creating display meshes for SubD.
When adaptive reduction is enabled, subd.Faces.Count is used to determine
the appropriate display density.
subd: The SubD object.
Returns: The display density.
Since: 7.18

Rhino.Geometry.SubDDisplayParameters.SetAdaptiveDisplayDensity(System.UInt32)
Set an adaptive SubD display density that caps display mesh quad count at SubDDisplayParameters.AdaptiveDisplayMeshQuadMaximum.
adaptiveDisplayDensity:
adaptiveDisplayDensity <= SubDDisplayParameters.Density.MaximumDensity.
Values <= SubDDisplayParameters.Density.MinimumAdaptiveDensity will never be adaptively reduced during display mesh creation.
Since: 7.18

Rhino.Geometry.SubDDisplayParameters.SetAbsoluteDisplayDensity(System.UInt32)
In almast all cases, you are better off using SetAdaptiveDisplayDensity().
absoluteDisplayDensity: absoluteDisplayDensity <= SubDDisplayParameters.Density.MaximumDensity.
Since: 7.18

Rhino.Geometry.SubDDisplayParameters.MeshLocation
The MeshLocation property determines if the mesh is on the SubD's control net or the SubD's surface.
Since: 7.18

Rhino.Geometry.SubDDisplayParameters.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Since: 8.0

Rhino.Geometry.SubDDisplayParameters.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Called by BinaryFormatter.Deserialize to create a new MeshParamaters
object.
info:
context:
Since: 8.0

Rhino.Geometry.SubDDisplayParameters.ToEncodedString
Returns a encoded string that represents the MeshingParameters.
Returns:
A encoded string that represents the MeshingParameters.
Since: 8.0

Rhino.Geometry.SubDDisplayParameters.FromEncodedString(System.String)
Converts encoded serialized string into a MeshingParameters
value:
Encoded string returned by MeshingParameters.ToString()
Returns:
Returns a new MeshingParameters created by decoding and deserializing
the string or null if value is invalid.
Since: 8.0