Rhino.Geometry.Collections.BrepSurfaceList
Provides access to all the underlying surfaces in a Brep object.

Rhino.Geometry.Collections.BrepSurfaceList.Count
Gets the number of surfaces in a brep.
Since: 5.4

Rhino.Geometry.Collections.BrepSurfaceList.Item(System.Int32)
Gets the Surface at the given index.
The index must be valid or an IndexOutOfRangeException will be thrown.
index: Index of Surface to access.
Throws System.IndexOutOfRangeException: Thrown when the index is invalid.
Returns: The Surface at [index].

Rhino.Geometry.Collections.BrepSurfaceList.System#Collections#IEnumerable#GetEnumerator
Gets the same enumerator as Rhino.Geometry.Collections.BrepSurfaceList.GetEnumerator.
Returns: The enumerator.
Since: 5.4

Rhino.Geometry.Collections.BrepSurfaceList.GetEnumerator
Gets an enumerator that visits all surfaces.
Returns: The enumerator.
Since: 5.4