Rhino.DocObjects.ObjectAttributes.ObjectFrameFlags
Since: 8.0

Rhino.DocObjects.ObjectAttributes.ObjectFrameFlags.Standard
Never returns unset plane.  Will always calculate the plane even if nothing is stored.

Rhino.DocObjects.ObjectAttributes.ObjectFrameFlags.IncludeScaleTransforms
By default, the plane is orientation and rotation only.  But scale transforms are stored if you need them.

Rhino.DocObjects.ObjectAttributes.ObjectFrameFlags.ReturnUnset
The object frame may be stored unset by default.  If this is the case, and you want to know if it really is unset, this will tell you.