Rhino.Render.LightManagerSupportClient.CppPointer
Since: 6.0

Rhino.Render.LightManagerSupportClient.#ctor(System.UInt32)
Since: 6.0

Rhino.Render.LightManagerSupportClient.Dispose
Since: 6.0

Rhino.Render.LightManagerSupportClient.GetLights
Since: 6.0

Rhino.Render.LightManagerSupportClient.GetLightFromId(System.Guid)
Since: 6.0

Rhino.Render.LightManagerSupportClient.OnEditLight(Rhino.Render.LightArray)
Since: 6.0

Rhino.Render.LightManagerSupportClient.GroupLights(Rhino.Render.LightArray)
Since: 6.0

Rhino.Render.LightManagerSupportClient.UnGroup(Rhino.Render.LightArray)
Since: 6.0

Rhino.Render.LightManagerSupportClient.ModifyLight(Rhino.Geometry.Light)
Since: 6.0

Rhino.Render.LightManagerSupportClient.DeleteLight(Rhino.Geometry.Light)
Since: 6.0

Rhino.Render.LightManagerSupportClient.LightDescription(Rhino.Geometry.Light)
Since: 6.0

Rhino.Render.LightManagerSupportClient.ObjectFromLight(Rhino.Geometry.Light)
Since: 6.0

Rhino.Render.LightManagerSupportClient.SetLightSolo(Rhino.Geometry.Light,System.Boolean)
Since: 6.0

Rhino.Render.LightManagerSupportClient.GetLightSolo(Rhino.Geometry.Light)
Since: 6.0

Rhino.Render.LightManagerSupportClient.LightsInSoloStorage
Since: 6.0