Rhino.Render.AddCustomUISectionsEventArgs
Used as Rhino.Render Custom Events args.

Rhino.Render.AddCustomUISectionsEventArgs.ExpandableContentUI
Since: 7.12

Rhino.Render.AddCustomUISectionsEventArgs.EventType
The type of the event.
Since: 7.0