Rhino.FileIO.FileObjWriter.ObjRhinoObject


Rhino.FileIO.FileObjWriter.ObjRhinoObject.#ctor(Rhino.RhinoDoc,Rhino.DocObjects.RhinoObject,Rhino.DocObjects.ObjectAttributes,Rhino.Render.RenderMaterial,Rhino.Geometry.Transform,System.Boolean)
doc:
locobject:
attribs:
render_material:
xform:
bInstance: