Rhino.Geometry.HiddenLineDrawingObject
Represents an object added to a HiddenLineDrawing

Rhino.Geometry.HiddenLineDrawingObject.OccludingSections
Objects in this drawing could have occluding sections.
Objects must added with the occluding section  option set as desired.
Since: 8.0

Rhino.Geometry.HiddenLineDrawingObject.Geometry
Returns the geometry in world coordinates if UseXform is false.
Otherwise, the geometry in object space coordinates is returned.
Since: 6.0

Rhino.Geometry.HiddenLineDrawingObject.Transform
Returns the transformation passed into the Add... function
when setting up the hidden line drawing parameters.
Since: 6.0

Rhino.Geometry.HiddenLineDrawingObject.Tag
Returns the extra data used to cross-reference the object specified in
HiddenLineDrawing.AddObject.
Since: 6.0