Rhino.DocObjects.Custom.GripsDrawEventArgs.DrawStaticStuff
If true, then draw stuff that moves when grips are dragged,
like the curve being bent by a dragged control point.
Since: 5.0

Rhino.DocObjects.Custom.GripsDrawEventArgs.DrawDynamicStuff
If true, then draw stuff that does not move when grips are
dragged, like the control polygon of the "original" curve.
Since: 5.0

Rhino.DocObjects.Custom.GripsDrawEventArgs.ControlPolygonStyle
What kind of line is used to display things like control polygons.
0 = no control polygon,  1 = solid control polygon,  2 = dotted control polygon.
Since: 5.0

Rhino.DocObjects.Custom.GripsDrawEventArgs.GripColor
Since: 5.0

Rhino.DocObjects.Custom.GripsDrawEventArgs.LockedGripColor
Since: 5.0

Rhino.DocObjects.Custom.GripsDrawEventArgs.SelectedGripColor
Since: 5.0

Rhino.DocObjects.Custom.GripsDrawEventArgs.GripStatusCount
Since: 5.0

Rhino.DocObjects.Custom.GripsDrawEventArgs.GripStatus(System.Int32)
Since: 5.0

Rhino.DocObjects.Custom.GripsDrawEventArgs.DrawControlPolygonLine(Rhino.Geometry.Line,Rhino.DocObjects.Custom.GripStatus,Rhino.DocObjects.Custom.GripStatus)
Draws the lines in a control polygons.
This is an helper function.
line: Line between two grips.
startStatus: Grip status at start of line.
endStatus: Grip status at end of line.
Since: 5.0

Rhino.DocObjects.Custom.GripsDrawEventArgs.DrawControlPolygonLine(Rhino.Geometry.Line,System.Int32,System.Int32)
Draws the lines in a control polygons.
This is an helper function.
line: Line between two grips.
startStatus: Index of Grip status at start of line.
endStatus: Index if Grip status at end of line.
Since: 5.0

Rhino.DocObjects.Custom.GripsDrawEventArgs.DrawControlPolygonLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Int32,System.Int32)
Draws the lines in a control polygons.
This is an helper function.
start: The point start.
end: The point end.
startStatus: Index of Grip status at start of line defined by start and end.
endStatus: Index if Grip status at end of line defined by start and end.
Since: 5.0

Rhino.DocObjects.Custom.GripsDrawEventArgs.RestoreViewportSettings
Since: 5.0