Rhino.UI.MouseCursor
Contains static methods to control the mouse icon.

Rhino.UI.MouseCursor.SetToolTip(System.String)
Sets a cursor tooltip string shown next to the mouse cursor.
Overrides all cursor tooltip panes.
tooltip: The text to show.
Since: 5.0

Rhino.UI.MouseCursor.Location
Retrieves the position of the mouse cursor, in screen coordinates
Since: 5.8