Rhino.Display.DisplayPipelineAttributes.DynamicDisplayUse
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.DynamicDisplayUse.UseAppSettings
Use system default settings.

Rhino.Display.DisplayPipelineAttributes.DynamicDisplayUse.DisplayObjectBoundingBox
Reduces the display of objects to their bounding boxes. This can speed up the display on large models.