Rhino.Display.RhinoView
A RhinoView represents a single "window" display of a document. A view could
contain one or many RhinoViewports (many in the case of Layout views with detail viewports).
Standard Rhino modeling views have one viewport.

Rhino.Display.RhinoView.FromRuntimeSerialNumber(System.UInt32)
Get a RhinoView from it's unique runtime serial number
serialNumber:
Returns: RhinoView or null if no view exists for a given serial number
Since: 6.0

Rhino.Display.RhinoView.RuntimeSerialNumber
Since: 6.0

Rhino.Display.RhinoView.Handle
Gets the window handle that this view is bound to.
Since: 5.0

Rhino.Display.RhinoView.DisplayPipeline
Gets the display pipeline used for this view.
Since: 6.0

Rhino.Display.RhinoView.RealtimeDisplayMode
Gets the RealtimeDisplayMode active for this view. null if the view doesn't have a RealtimeDisplayMode set.
Since: 6.0

Rhino.Display.RhinoView.Bounds
Gets the size and location of the view including its non-client elements, in pixels, relative to the parent control.
Since: 5.0

Rhino.Display.RhinoView.ClientRectangle
Gets the rectangle that represents the client area of the view.
Since: 5.0

Rhino.Display.RhinoView.ScreenRectangle
Gets the rectangle that represents the client area of the view in screen coordinates.
Since: 5.0

Rhino.Display.RhinoView.Size
Gets or sets the size of the view
Since: 6.0

Rhino.Display.RhinoView.ScreenToClient(System.Drawing.Point)
Converts a point in screen coordinates to client coordinates for this view.
screenPoint: The 2D screen point.
Returns: A 2D point in client coordinates.
Since: 5.0

Rhino.Display.RhinoView.ScreenToClient(Rhino.Geometry.Point2d)
Since: 5.8

Rhino.Display.RhinoView.ClientToScreen(System.Drawing.Point)
Since: 5.0

Rhino.Display.RhinoView.ClientToScreen(Rhino.Geometry.Point2d)
Since: 5.0

Rhino.Display.RhinoView.Redraw
Redraws this view.
Remarks:
If you change something in "this" view like the projection, construction plane,
background bitmap, etc., then you need to call RhinoView.Redraw() to redraw
"this" view./ The other views will not be changed. If you change something in
the document (like adding new geometry to the model), then you need to call
RhinoDoc.Views.Redraw() to redraw all the views.
Since: 5.0

Rhino.Display.RhinoView.EnableDrawing
Gets or sets the 'drawing enabled' flag. By default, drawing is enabled.
There are some rare situations where scripts want to disable drawing for a while.
Since: 5.0

Rhino.Display.RhinoView.InDynamicViewChange
true if the view is being dynamically changed by mouse moves, arrow keys, trackballs, etc.
Since: 8.1

Rhino.Display.RhinoView.SpeedTest(System.Int32,System.Boolean,System.Int32,System.Double)
Since: 5.8

Rhino.Display.RhinoView.CreateWireframePreviewImage(System.String,System.Drawing.Size,System.Boolean,System.Boolean)
Creates a bitmap preview image of model.
[in] The name of the bitmap file to create.  The extension of the imagePath controls
the format of the bitmap file created (BMP, TGA, JPG, PCX, PNG, TIF).
[in] The width and height of the bitmap in pixels.
ignoreHighlights: true if highlighted elements should be drawn normally.
drawConstructionPlane: true if the CPlane should be drawn.
Returns: true if successful.
Since: 5.0

Rhino.Display.RhinoView.CreateShadedPreviewImage(System.String,System.Drawing.Size,System.Boolean,System.Boolean,System.Boolean)
Creates a bitmap preview image of model.
[in] The name of the bitmap file to create.  The extension of the imagePath controls
the format of the bitmap file created (BMP, TGA, JPG, PCX, PNG, TIF).
[in] The width and height of the bitmap in pixels.
ignoreHighlights: true if highlighted elements should be drawn normally.
drawConstructionPlane: true if the CPlane should be drawn.
useGhostedShading: true if ghosted shading (partially transparent shading) should be used.
Returns: true if successful.
Since: 5.0

Rhino.Display.RhinoView.CaptureToBitmap
Capture View contents to a bitmap.
Returns: The bitmap of the complete view.
Since: 5.0

Rhino.Display.RhinoView.CaptureToBitmap(System.Drawing.Size)
Capture View contents to a bitmap.
size: Size of Bitmap to capture to.
Returns: The bitmap of the specified part of the view.
Since: 5.0

Rhino.Display.RhinoView.CaptureToBitmap(System.Drawing.Size,System.Boolean,System.Boolean,System.Boolean)
Captures a part of the view contents to a bitmap allowing for visibility of grid and axes.
size: The width and height of the returned bitmap.
grid: true if the construction plane grid should be visible.
worldAxes: true if the world axis should be visible.
cplaneAxes: true if the construction plane close the grid should be visible.
Returns: A new bitmap.
Since: 5.0

Rhino.Display.RhinoView.CaptureToBitmap(System.Boolean,System.Boolean,System.Boolean)
Captures the view contents to a bitmap allowing for visibility of grid and axes.
grid: true if the construction plane grid should be visible.
worldAxes: true if the world axis should be visible.
cplaneAxes: true if the construction plane close the grid should be visible.
Returns: A new bitmap.
Since: 5.0

Rhino.Display.RhinoView.CaptureToBitmap(System.Drawing.Size,Rhino.Display.DisplayModeDescription)
Capture View contents to a bitmap using a display mode description to define
how drawing is performed.
size: The width and height of the returned bitmap.
mode: The display mode.
Returns: A new bitmap.
Since: 5.0

Rhino.Display.RhinoView.CaptureToBitmap(Rhino.Display.DisplayModeDescription)
Capture View contents to a bitmap using a display mode description to define
how drawing is performed.
mode: The display mode.
Returns: A new bitmap.
Since: 5.0

Rhino.Display.RhinoView.CaptureToBitmap(System.Drawing.Size,Rhino.Display.DisplayPipelineAttributes)
Capture View contents to a bitmap using display attributes to define how
drawing is performed.
size: The width and height of the returned bitmap.
attributes: The specific display mode attributes.
Returns: A new bitmap.
Since: 5.0

Rhino.Display.RhinoView.CaptureToBitmap(Rhino.Display.DisplayPipelineAttributes)
Captures view contents to a bitmap using display attributes to define how
drawing is performed.
attributes: The specific display mode attributes.
Returns: A new bitmap.
Since: 5.0

Rhino.Display.RhinoView.Document
Since: 5.0

Rhino.Display.RhinoView.MainViewport
A RhinoView contains a "main viewport" that fills the entire view client window.
RhinoPageViews may also contain nested child RhinoViewports for implementing
detail viewports.
The MainViewport will always return this RhinoView's m_vp.
Since: 5.0

Rhino.Display.RhinoView.ActiveViewport
The ActiveViewport is the same as the MainViewport for standard RhinoViews. In
a RhinoPageView, the active viewport may be the RhinoViewport of a child detail object.
Most of the time, you will use ActiveViewport unless you explicitly need to work with
the main viewport.
Since: 5.0

Rhino.Display.RhinoView.ActiveViewportID
Returns viewport ID for the active viewport. Faster than ActiveViewport function when
working with page views.
Since: 5.0

Rhino.Display.RhinoView.TitleVisible
Visibility of the viewport title window.
Since: 5.0

Rhino.Display.RhinoView.Maximized
Since: 5.0

Rhino.Display.RhinoView.Floating
Floating state of RhinoView.
if true, then the view will be in a floating frame window. Otherwise
the view will be embedded in the main frame.
Since: 5.0

Rhino.Display.RhinoView.Close
Remove this View from Rhino. DO NOT attempt to use this instance of this
class after calling Close.
Returns: true on success
Since: 5.0

Rhino.Display.RhinoView.MouseCaptured(System.Boolean)
Returns whether or not the mouse is captured in this view.
bIncludeMovement: If captured, test if the mouse has moved between mouse button down and mouse button up.
Returns: true if captured, false otherwise.
Since: 6.0

Rhino.Display.RhinoView.ShowToast(System.String)
Shows a temporary popup message in the lower right corner of the view
message: The message to be shown
Returns: The runtime serial number of the view toast
Since: 8.0

Rhino.Display.RhinoView.ShowToast(System.String,System.Int32)
Shows a temporary popup message in the lower right corner of the view
message: The message to be shown
textHeight: The height of the message
Returns: The runtime serial number of the view toast
Since: 8.0

Rhino.Display.RhinoView.ShowToast(System.String,System.Int32,System.Drawing.PointF)
Shows a temporary popup message in the lower right corner of the view
message: The message to be shown
textHeight: The height of the message
location: The location of the message
Returns: The runtime serial number of the view toast
Since: 8.0

Rhino.Display.RhinoView.EnableDrawingChanged
Called when the state of Rhino.Display.RhinoView.EnableDrawing changes.

Rhino.Display.RhinoView.Create
Since: 5.0

Rhino.Display.RhinoView.Destroy
Since: 5.0

Rhino.Display.RhinoView.SetActive
Since: 5.0

Rhino.Display.RhinoView.Rename
Since: 5.0

Rhino.Display.RhinoView.Modified
Since: 7.0