Rhino.Geometry.HiddenLineDrawingObjectCurve
Curves generated from source objects which correspond to edges, and
silhouettes of source objects and intersections with cutting planes. A
HiddenLineDrawingObjectCurve is partitioned into hidden and visible
segments called HiddenLineDrawingSegment

Rhino.Geometry.HiddenLineDrawingObjectCurve.IsValid
Verifies the object is valid.
Since: 6.0

Rhino.Geometry.HiddenLineDrawingObjectCurve.SourceObject
Return the source object that this curve came from
Since: 6.0

Rhino.Geometry.HiddenLineDrawingObjectCurve.SourceObjectComponentIndex
Component of source object part that generated this curve.
Since: 6.0

Rhino.Geometry.HiddenLineDrawingObjectCurve.ClippingPlaneIndex
Index into HiddenLineDrawing.ClippingPlanes when SilhouetteType == SilhouetteType.SectionCut.
Since: 6.0

Rhino.Geometry.HiddenLineDrawingObjectCurve.Index
Index of this object in HiddenLineDrawing.FullCurves.
Since: 6.0

Rhino.Geometry.HiddenLineDrawingObjectCurve.SilhouetteType
The silhouette event type
Since: 6.0

Rhino.Geometry.HiddenLineDrawingObjectCurve.OriginalDomainStart
Initialized to RhinoMath.UnsetValue. Valid if the full curve is closed.
Rejoin can reparameterize the curve by moving the seam.  When this has been
done the original domain start is stored here.
Since: 6.0

Rhino.Geometry.HiddenLineDrawingObjectCurve.Parameters
Increasing, partition of curve.Domain.
Since: 6.0

Rhino.Geometry.HiddenLineDrawingObjectCurve.Segments
The HiddenLineDrawingCurve objects that make up this full curve.
Since: 6.0

Rhino.Geometry.HiddenLineDrawingObjectCurve.IsProjecting
Returns true if all the non clipped portions of this curve are projecting.
Since: 6.0

Rhino.Geometry.HiddenLineDrawingObjectCurve.Curve(System.Double)
Returns the HiddenLineDrawingCurve object containing parameter 't'.
t: The parameter.
Returns: The HiddenLineDrawingCurve object if successful.
Since: 6.0

Rhino.Geometry.HiddenLineDrawingObjectCurve.Curve(System.Double,System.Int32)
Returns the HiddenLineDrawingCurve object containing parameter 't'.
t: The parameter.
side:
Determines which side to return at breakpoints, where:
0 - default,
<0 - curve that contains an interval [t-, t], for some t- < t,
>0 - curve that contains an interval [t, t+], for some t+ > t.
Returns: The HiddenLineDrawingCurve object if successful.
Since: 6.0