Rhino.Render.RenderMaterial.StandardChildSlots
Defines enumerated constant values for use in Rhino.Render.RenderMaterial.TextureChildSlotName(Rhino.Render.RenderMaterial.StandardChildSlots) method.
NOTE WELL - these values cannot be changed. https://mcneel.myjetbrains.com/youtrack/issue/RH-57752
Since: 5.1

Rhino.Render.RenderMaterial.StandardChildSlots.None
Corresponds to CRhRdkMaterial::ChildSlotUsage::None.

Rhino.Render.RenderMaterial.StandardChildSlots.Diffuse
Corresponds to CRhRdkMaterial::ChildSlotUsage::Diffuse.

Rhino.Render.RenderMaterial.StandardChildSlots.Transparency
Corresponds to CRhRdkMaterial::ChildSlotUsage::Transparency

Rhino.Render.RenderMaterial.StandardChildSlots.Bump
Corresponds to CRhRdkMaterial::ChildSlotUsage::Bump

Rhino.Render.RenderMaterial.StandardChildSlots.Environment
Corresponds to CRhRdkMaterial::ChildSlotUsage::Environment

Rhino.Render.RenderMaterial.StandardChildSlots.PbrBaseColor
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_base_color

Rhino.Render.RenderMaterial.StandardChildSlots.PbrSubsurface
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_subsurface

Rhino.Render.RenderMaterial.StandardChildSlots.PbrSubSurfaceScattering
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_subsurface_scattering_color

Rhino.Render.RenderMaterial.StandardChildSlots.PbrSubsurfaceScatteringRadius
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_subsurface_scattering_radius

Rhino.Render.RenderMaterial.StandardChildSlots.PbrMetallic
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_metallic

Rhino.Render.RenderMaterial.StandardChildSlots.PbrSpecular
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_specular

Rhino.Render.RenderMaterial.StandardChildSlots.PbrSpecularTint
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_specular_tint

Rhino.Render.RenderMaterial.StandardChildSlots.PbrRoughness
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_roughness

Rhino.Render.RenderMaterial.StandardChildSlots.PbrAnisotropic
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_anisotropic

Rhino.Render.RenderMaterial.StandardChildSlots.PbrAnisotropicRotation
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_anisotropic_rotation

Rhino.Render.RenderMaterial.StandardChildSlots.PbrSheen
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_sheen

Rhino.Render.RenderMaterial.StandardChildSlots.PbrSheenTint
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_sheen_tint

Rhino.Render.RenderMaterial.StandardChildSlots.PbrClearcoat
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_clearcoat

Rhino.Render.RenderMaterial.StandardChildSlots.PbrClearcoatRoughness
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_clearcoat_roughness

Rhino.Render.RenderMaterial.StandardChildSlots.PbrOpacityIor
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_opacity_ior

Rhino.Render.RenderMaterial.StandardChildSlots.PbrOpacity
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_opacity

Rhino.Render.RenderMaterial.StandardChildSlots.PbrOpacityRoughness
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_opacity_roughness

Rhino.Render.RenderMaterial.StandardChildSlots.PbrEmission
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_emission

Rhino.Render.RenderMaterial.StandardChildSlots.PbrAmbientOcclusion
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_ambient_occlusion

Rhino.Render.RenderMaterial.StandardChildSlots.PbrDisplacement
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_smudge
PbrSmudge = 0x400000,
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_displacement

Rhino.Render.RenderMaterial.StandardChildSlots.PbrClearcoatBump
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_clearcoat_roughness

Rhino.Render.RenderMaterial.StandardChildSlots.PbrAlpha
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_alpha