Rhino.FileIO.NameHash
Contains information that is useful to uniquely identify an object name.
Remarks: This object is immutable.

Rhino.FileIO.NameHash.m_sha1_hash
SHA-1 hash of ordinal minimum mapped Unicode (UTF-32) code points.

Rhino.FileIO.NameHash.m_flags
m_flags - used internally

Rhino.FileIO.NameHash.m_parent_id
When names appear in a tree structure,
m_parent_id identifies the parent node.

Rhino.FileIO.NameHash.#ctor(System.String)
Creates a new NameHash, representing a piece of text.
name: A name. This can be null and can refer to a non-existing path.
Returns:
Since: 6.0

Rhino.FileIO.NameHash.#ctor(System.String,System.Guid)
Creates a new NameHash, representing a piece of text.
name: A name. This can be null and can refer to a non-existing path.
parentId: The id of the parent layer. This is only useful with layers.
Returns: A new hash
Since: 6.0

Rhino.FileIO.NameHash.#ctor(System.String,System.Guid,Rhino.DocObjects.ModelComponentType)
Creates a new NameHash, representing a piece of text.
name: A name. This can be null and can refer to a non-existing path.
parentId: The id of the parent layer. This is only useful with layers.
type: Calls Rhino.DocObjects.ModelComponent.ModelComponentTypeIgnoresCase(Rhino.DocObjects.ModelComponentType) to determine if case should be used in search.
Returns: A new hash
Since: 6.0

Rhino.FileIO.NameHash.#ctor(System.String,System.Guid,System.Boolean)
Creates a new NameHash, representing a piece of text.
name: A name. This can be null and can refer to a non-existing path.
parentId: The id of the parent layer. This is only useful with layers.
ignoreCase: All manifest searches currently ignore case, except for groups.
Returns: A new hash
Since: 6.0

Rhino.FileIO.NameHash.#ctor(Rhino.FileIO.NameHash)
Constructs a copy of a content hash.
other: The other content hash to copy.

Rhino.FileIO.NameHash.#ctor(System.Guid,System.Byte[],System.UInt32)
Constructs a new instance of the content hash class. Fields are NOT copied.

Rhino.FileIO.NameHash.Sha1Hash
Gets the 20-bytes long SHA-1 hash of ordinal minimum mapped Unicode (UTF-32) code points.
Since: 6.0

Rhino.FileIO.NameHash.MappedCodePoints
Gets the NameHash flags. In some cases = number of mapped code points.
Since: 6.0

Rhino.FileIO.NameHash.ParentId
Only useful if this participates in a tree structure, as with layers.
Since: 6.0

Rhino.FileIO.NameHash.GetDisposableHandle
Be responsible: call Dispose()

Rhino.FileIO.NameHash.CreateFilePathHash(System.String)
Creates a new NameHash, representing the name of a file.
path: A path. This can be null and can refer to a non-existing path.
Returns:
Since: 6.0

Rhino.FileIO.NameHash.System#ICloneable#Clone
Since: 6.0

Rhino.FileIO.NameHash.Clone
Creates a copy of this name hash.
Because content hash is immutable, this can be used as a deep copy.
Returns: A different instance of the same name hash.
Since: 6.0

Rhino.FileIO.NameHash.Equals(Rhino.FileIO.NameHash)
Determines if another name hash has the same value.
other: The other name hash to compare.
Returns: True if the two hashes are equal.
Since: 6.0

Rhino.FileIO.NameHash.Equals(System.Object)
Determines if another object is a name hash with same value.
obj: The other content hash to compare.
Returns: True if the two hashes are equal.

Rhino.FileIO.NameHash.GetHashCode
Gets an hash code for this name hash.
Two equal content hashes have equal hash code. The other way around might not be true.
Returns: An hash code value.

Rhino.FileIO.NameHash.op_Equality(Rhino.FileIO.NameHash,Rhino.FileIO.NameHash)
Determines if two NameHash instances are equal by value.
left: The first hash.
right: The second hash.
Returns: True if they are equal by value, otherwise false.
Since: 6.0

Rhino.FileIO.NameHash.op_Inequality(Rhino.FileIO.NameHash,Rhino.FileIO.NameHash)
Determines if two NameHash instances are different by value.
left: The first hash.
right: The second hash.
Returns: True if they are different by value, otherwise false.
Since: 6.0