Rhino.FileIO.FileTxtReadOptions
Options for writing a Txt file.

Rhino.FileIO.FileTxtReadOptions.Delimiter
Since: 8.0

Rhino.FileIO.FileTxtReadOptions.DelimiterCharacter
Since: 8.0

Rhino.FileIO.FileTxtReadOptions.CreatePointCloud
Since: 8.0

Rhino.FileIO.FileTxtReadOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0