Rhino.DocObjects.RhinoModifyObjectAttributesEventArgs.Document
Since: 5.0

Rhino.DocObjects.RhinoModifyObjectAttributesEventArgs.RhinoObject
Since: 5.0

Rhino.DocObjects.RhinoModifyObjectAttributesEventArgs.OldAttributes
Since: 5.0

Rhino.DocObjects.RhinoModifyObjectAttributesEventArgs.NewAttributes
Since: 5.0