Rhino.Render.Utilities.ShowContentChooserResults
Since: 6.0

Rhino.Render.Utilities.ShowContentChooserResults.None
No choice (user cancelled).

Rhino.Render.Utilities.ShowContentChooserResults.New
User chose from 'New' tab. uuidOut is the type id.

Rhino.Render.Utilities.ShowContentChooserResults.Copy
User chose from 'Existing' tab with 'copy' radio button checked. uuidOut is the instance id.

Rhino.Render.Utilities.ShowContentChooserResults.Instance
User chose from 'Existing' tab with 'instance' radio button checked. uuidOut is the instance id.