Rhino.UI.RhinoHelp
Provides access to the built in Rhino help system

Rhino.UI.RhinoHelp.Show(System.String)
Call this method to display standard Rhino help
helpLink:
Rhino help links are formatted like this:
http://docs.mcneel.com/rhino/6/help/en-us/index.htm#commands/line.htm
This parameter would be equal to "#commands/line.htm" in the link
above.  Rhino will calculate the string up to and including the
index.html and append this value to the end.
Returns:
Since: 6.0

Rhino.UI.RhinoHelp.ShowHelpCalled
Total hack to work around the fact that options and object properties
pages OnHelp virtual methods return void instead of bool.  This will
get set to the result of the last Show call above.
true if show help called; otherwise, false.