Rhino.DocObjects.RhinoReplaceObjectEventArgs
Rhino.RhinoDoc.ReplaceRhinoObject event arguments.
Since: 5.0

Rhino.DocObjects.RhinoReplaceObjectEventArgs.ObjectId
The id of the existing object, or the object about to be deleted.
At the time Rhino.RhinoDoc.ReplaceRhinoObject is called, this object has not been deleted.
Since: 5.0

Rhino.DocObjects.RhinoReplaceObjectEventArgs.OldRhinoObject
The existing object, or the object about to be deleted.
At the time Rhino.RhinoDoc.ReplaceRhinoObject is called, this object has not been deleted.
Since: 5.0

Rhino.DocObjects.RhinoReplaceObjectEventArgs.NewRhinoObject
The new replacement object, or the object about to be added.
At the time Rhino.RhinoDoc.ReplaceRhinoObject is called, this object has not been added to the document.
Thus, this object's id will be System.Guid.Empty.
Since: 5.0

Rhino.DocObjects.RhinoReplaceObjectEventArgs.Document
The document where the event occurred.
Since: 5.0