Rhino.FileIO.File3dmThickening
Represents the thickening attached to file3dm object attributes.

Rhino.FileIO.File3dmThickening.On
Specifies whether the feature is enabled or not.
Since: 8.0

Rhino.FileIO.File3dmThickening.Distance
Specifies how thick meshes will be made.
Since: 8.0

Rhino.FileIO.File3dmThickening.Solid
Specifies whether to make open meshes solid by adding walls when thickening.
Since: 8.0

Rhino.FileIO.File3dmThickening.OffsetOnly
Specifies whether to only offset the original surface.
Since: 8.0

Rhino.FileIO.File3dmThickening.BothSides
Specifies whether to thicken to both sides of the surface.
Since: 8.0