Rhino.PlugInSettings.CURRENT_XML_FORMAT_VERSION
Main settings element id attribute value, used to query valid settings section in settings XML file.

Rhino.PlugInSettings.SaveSettingsUnmanagedHook(System.Boolean)
Should get call from PersistentSettingsHooks.Save when core Rhino has
called SaveProfile on a application settings class and wants to update
the applications settings XML file.
shuttingDown:
Returns:

Rhino.PlugInSettings.SettingsFileFolder(System.Boolean)
Computes folder to read or write settings files.

Rhino.PlugInSettings.GetRhinoSchemeRegistryPath
Get the current Rhino scheme name as a valid file path name without any
spaces
Returns:
Returns the current Rhino scheme name as a valid file path name without
any spaces

Rhino.PlugInSettings.SettingsFileName(System.Boolean,System.Boolean)
Computes full path to settings file to read or write.

Rhino.PlugInSettings.#ctor(System.Reflection.Assembly,System.Guid,Rhino.PlugInSettings,System.Boolean)
PersistentSettingsManager constructor.
pluginAssembly: Requires a valid Skin, DLL or PlugIn object to attach to.
pluginId: Requires a PlugIn Id to attach to.
allUserSettings: All user setting to compare for changes.
createWatcher:
If true then a file watcher is created when the settings are initially
read and will raise PlugIn.SettingsSaved events when the plug-in is
unloading or when PlugIn.SaveSettings() is called.

Rhino.PlugInSettings.#ctor(System.Guid,Rhino.PlugInSettings,System.Boolean)
PersistentSettingsManager constructor
pluginId:
allUserSettings:
createWatcher:
If true then a file watcher is created when the settings are initially
read and will raise PlugIn.SettingsSaved events when the plug-in is
unloading or when PlugIn.SaveSettings() is called.

Rhino.PlugInSettings.PluginSettings
Gets the Plug-in settings associated with this plug-in, if this is the first time called then
the plug-in settings member variable will get initialized and if a settings file exists it
will get loaded.

Rhino.PlugInSettings.WindowPositionSettings
Gets the Plug-in settings associated with this plug-in, if this is the first time called then
the plug-in settings member variable will get initialized and if a settings file exists it
will get loaded.

Rhino.PlugInSettings.CommandSettings(System.String)
Gets the PersistentSettings associated with the specified command.  If the settings file
has not been previously loaded and exists then it will get read.  If the command name is
not in the command settings dictionary then a new entry will get created and its settings
will be returned.
name: Command name key to search for and/or add.
Returns: Returns PersistentSettings object associated with command name on success or null on error.

Rhino.PlugInSettings.ReadSettingsHelper(System.Boolean,System.Boolean)
Reads existing settings for a plug-in and its associated commands.
Clears the dirty flag for the settings.
Returns:
true if settings are successfully read. false if there was no existing
settings file to read, or if a read lock could not be acquired.

Rhino.PlugInSettings.g_settings_changed_list
List of SettingsSaved events to raise

Rhino.PlugInSettings.SettingsChangedOnIdle(System.Object,System.EventArgs)
Rhino.Idle event callback. Only raise the settings changed event
during an OnIdle event when a command is not running.
sender:
e:

Rhino.PlugInSettings.ContainsChangedSinceSavedValues
Check the plug-in and command settings dictionaries for values that have changed.
Returns: Returns true if either the plug-ins or commands dictionaries contains a value that has changed.

Rhino.PlugInSettings.ContainsModifiedValues
Check the plug-in and command settings dictionaries for values other than default value.
Returns: Returns true if either the plug-ins or commands dictionaries contains a modified item otherwise false.

Rhino.PlugInSettings.WriteSettingsHelper(System.Boolean,System.Boolean,System.Boolean)
Flushes the current settings to the user's roaming directory.
If an xml file for the guid already exists, it attempts to update
the file in order to maintain comments, etc. If the xml is corrupt
or the file does not exist, it writes out a new file.
shuttingDown:
localSettings:
windowPositions:
Returns:
true if settings where flushed to disk, otherwise false.

Rhino.PlugInSettings.WriteToStream(System.Boolean)
Constructs a temporary file and write plug-in and plug-in command settings to the temp file.
Only writes PersistentSettings that contain one or more item with a value that differs
from the default value.

Rhino.PlugInSettings.ToStream(Rhino.PersistentSettings,System.Collections.Generic.Dictionary{System.String,Rhino.PersistentSettings})
Write the specified settings to a MemoryStream
settings:
The settings to write, if null the XML document's settings section will be empty
otherwise; it will contain any settings that are not equal to their default value.
commandSettings:
Should be null when writing window positions XML file.  If writing plug-in settings
then pass the commands dictionary.
Returns:
Returns a stream containing the settings XML document on success otherwise; null.