Rhino.PrivateMeshCommands.MeshTypes.WeldedWeshTopology
Creates a topology that simulates Rhino's OpenNurbs' ordering.

Rhino.PrivateMeshCommands.MeshTypes.WeldedWeshTopology.VertexMap
Length: original wesh vLength. Contains the index of a top_vertex at the index of a vertex