Rhino.DocObjects.AnnotationObjectBase
Base class for all annotation objects (text and dimensions)

Rhino.DocObjects.AnnotationObjectBase.DisplayText
Gets the text that is displayed to users.
Since: 5.0

Rhino.DocObjects.AnnotationObjectBase.AnnotationGeometry
Get the annotation base geometry for this object
Since: 6.0

Rhino.DocObjects.AnnotationObjectBase.HasMeasurableTextFields
Test if the text in the annotation object contains fields
that involve length, area, or volume measurements
Since: 7.0