Rhino.FileIO.File3dm.ObjectTypeFilter
Since: 5.9

Rhino.FileIO.File3dm.ObjectTypeFilter.None


Rhino.FileIO.File3dm.ObjectTypeFilter.Point
some type of Point

Rhino.FileIO.File3dm.ObjectTypeFilter.Pointset
some type of PointCloud, PointGrid, ...

Rhino.FileIO.File3dm.ObjectTypeFilter.Curve
some type of Curve like LineCurve, NurbsCurve, etc.

Rhino.FileIO.File3dm.ObjectTypeFilter.Surface
some type of Surface like PlaneSurface, NurbsSurface, etc.

Rhino.FileIO.File3dm.ObjectTypeFilter.Brep
some type of Brep

Rhino.FileIO.File3dm.ObjectTypeFilter.Mesh
some type of Mesh

Rhino.FileIO.File3dm.ObjectTypeFilter.Annotation
some type of Annotation

Rhino.FileIO.File3dm.ObjectTypeFilter.InstanceDefinition
some type of InstanceDefinition

Rhino.FileIO.File3dm.ObjectTypeFilter.InstanceReference
some type of InstanceReference

Rhino.FileIO.File3dm.ObjectTypeFilter.TextDot
some type of TextDot

Rhino.FileIO.File3dm.ObjectTypeFilter.DetailView
some type of DetailView

Rhino.FileIO.File3dm.ObjectTypeFilter.Hatch
some type of Hatch

Rhino.FileIO.File3dm.ObjectTypeFilter.Extrusion
some type of Extrusion

Rhino.FileIO.File3dm.ObjectTypeFilter.Any
