Rhino.DocObjects.DimensionStyle.ToleranceDisplayFormat
Style of tolerance display for dimensions

Rhino.DocObjects.DimensionStyle.ToleranceDisplayFormat.None
No tolerance display

Rhino.DocObjects.DimensionStyle.ToleranceDisplayFormat.Symmetrical
Symmetrical +/- tolerance

Rhino.DocObjects.DimensionStyle.ToleranceDisplayFormat.Deviation
Distance +tol, -tol

Rhino.DocObjects.DimensionStyle.ToleranceDisplayFormat.Limits
Distance upper and lower limits