Rhino.DocObjects.Tables.DimStyleTableEventArgs.Document
Since: 6.0

Rhino.DocObjects.Tables.DimStyleTableEventArgs.EventType
Since: 6.0

Rhino.DocObjects.Tables.DimStyleTableEventArgs.Index
Since: 6.0

Rhino.DocObjects.Tables.DimStyleTableEventArgs.NewState
Since: 6.0

Rhino.DocObjects.Tables.DimStyleTableEventArgs.OldState
Since: 6.0