Rhino.Geometry.SubDCreationOptions
Options used for creating a SubD

Rhino.Geometry.SubDCreationOptions.#ctor
Create default options
Since: 7.0

Rhino.Geometry.SubDCreationOptions.Smooth
No interior creases and no corners.
Since: 7.0

Rhino.Geometry.SubDCreationOptions.InteriorCreases
Create an interior sub-D crease along all input mesh double edges
Since: 7.0

Rhino.Geometry.SubDCreationOptions.ConvexCornersAndInteriorCreases
Look for convex corners at sub-D vertices with 2 edges or fewer that have an
included angle ≤ 120 degrees.
Since: 7.0

Rhino.Geometry.SubDCreationOptions.ConvexAndConcaveCornersAndInteriorCreases
Look for convex corners at sub-D vertices with 2 edges or fewer that have an
included angle ≤ 120 degrees.
Look for concave corners at sub-D vertices with 3 edges or more that have an
included angle ≥ 240 degrees.
Since: 8.0

Rhino.Geometry.SubDCreationOptions.Finalize
Finalizer

Rhino.Geometry.SubDCreationOptions.Dispose
Delete unmanaged pointer for this
Since: 7.0

Rhino.Geometry.SubDCreationOptions.InteriorCreaseTest
Get or sets the interior crease test option.
Since: 7.0

Rhino.Geometry.SubDCreationOptions.ConvexCornerTest
Get or sets the convex corner test option.
Since: 7.0

Rhino.Geometry.SubDCreationOptions.TextureCoordinateTest
Gets or sets the texture coordinate test option.
Since: 8.28

Rhino.Geometry.SubDCreationOptions.MaximumConvexCornerEdgeCount
If ConvexCornerTest == ConvexCornerOption.AtMeshCorner, then an input mesh boundary
vertex becomes a SubD corner when the number of edges that end at the
vertex is <= MaximumConvexCornerEdgeCount edges and the corner angle
is <= MaximumConvexCornerAngleRadians.
Since: 7.0

Rhino.Geometry.SubDCreationOptions.MaximumConvexCornerAngleRadians
If ConvexCornerTest == ConvexCornerOption.AtMeshCorner, then an input mesh boundary
vertex becomes a SubD corner when the number of edges that end at the
vertex is <= MaximumConvexCornerEdgeCount edges and the corner angle
is <= MaximumConvexCornerAngleRadians.
Since: 7.0

Rhino.Geometry.SubDCreationOptions.ConcaveCornerTest
Get or sets the concave corner test option.
Since: 7.0

Rhino.Geometry.SubDCreationOptions.MinimumConcaveCornerAngleRadians
If ConcaveCornerTest == ConcaveCornerOption.AtMeshCorner, then an
input mesh boundary vertex becomes a SubD corner when the number of
edges that end at the vertex is >= MinimumConcaveCornerEdgeCount edges
and the corner angle is >= MinimumConcaveCornerAngleRadians.
Since: 7.0

Rhino.Geometry.SubDCreationOptions.MinimumConcaveCornerEdgeCount
If ConcaveCornerTest == ConcaveCornerOption.AtMeshCorner, then an
input mesh boundary vertex becomes a SubD corner when the number of
edges that end at the vertex is >= MinimumConcaveCornerEdgeCount edges
and the corner angle is >= MinimumConcaveCornerAngleRadians.
Since: 7.0

Rhino.Geometry.SubDCreationOptions.InterpolateMeshVertices
If false, input mesh vertex locations will be used to set SubD vertex control net locations.
If true, input mesh vertex locations will be used to set SubD vertex limit surface locations.
Since: 7.0