Rhino.Runtime.RhinoAccounts.IRhinoAccountsManager
Performs various Rhino Accounts-related tasks.

Rhino.Runtime.RhinoAccounts.IRhinoAccountsManager.ExecuteProtectedCodeAsync(System.Func{Rhino.Runtime.RhinoAccounts.SecretKey,System.Threading.Tasks.Task})
Any asynchronous method in the Rhino.Runtime.RhinoAccounts.IRhinoAccountsManager class must be executed within the function passed to this method,
or an System.InvalidOperationException will be thrown.
protectedCode: A function returning an awaitable task that has a Rhino.Runtime.RhinoAccounts.SecretKey passed to it. You will need to pass this
secret key to any method you wish to call within Rhino.Runtime.RhinoAccounts.IRhinoAccountsManager.
Remarks: The code within the function passed must be kept as breif as possible for performance and security reasons.
Throws Rhino.Runtime.RhinoAccounts.RhinoAccountsOperationInProgressException: Another operation is already in progress.

Rhino.Runtime.RhinoAccounts.IRhinoAccountsManager.ExecuteProtectedCode(System.Action{Rhino.Runtime.RhinoAccounts.SecretKey})
Any synchronous method in the Rhino.Runtime.RhinoAccounts.IRhinoAccountsManager class must be executed within the function passed to this method,
or an System.InvalidOperationException will be thrown.
protectedCode: A function returning an awaitable task that has a Rhino.Runtime.RhinoAccounts.SecretKey passed to it. You will need to pass this
secret key to any method you wish to call within Rhino.Runtime.RhinoAccounts.IRhinoAccountsManager.
Remarks: The code within the function passed must be kept as breif as possible for performance and security reasons.
Throws Rhino.Runtime.RhinoAccounts.RhinoAccountsOperationInProgressException: Another operation is already in progress.
Since: 7.0

Rhino.Runtime.RhinoAccounts.IRhinoAccountsManager.TryGetAuthTokens(System.String,Rhino.Runtime.RhinoAccounts.SecretKey)
Attempts to return cached auth tokens that match the given criteria if any have been stored in cache.
clientId: The unique id of the client registered in Rhino Accounts.
secretKey: A special key that was handed to you in Rhino.Runtime.RhinoAccounts.IRhinoAccountsManager.ExecuteProtectedCodeAsync(System.Func{Rhino.Runtime.RhinoAccounts.SecretKey,System.Threading.Tasks.Task})
Returns: Cached tokens matching the exact criteria passed, or null if none can be found matching the criteria.
Throws System.InvalidOperationException: An invalid secretKey was passed, or the assembly is not allowed to call methods from Rhino.Runtime.RhinoAccounts.IRhinoAccountsManager
Since: 7.0

Rhino.Runtime.RhinoAccounts.IRhinoAccountsManager.TryGetAuthTokens(System.String,System.Collections.Generic.IEnumerable{System.String},Rhino.Runtime.RhinoAccounts.SecretKey)
Attempts to return cached auth tokens that match the given criteria if any have been stored in cache.
clientId: The unique id of the client registered in Rhino Accounts.
scope: The scope desired for the tokens. Valid scope values can be found in the Rhino Accounts documentation.
secretKey: A special key that was handed to you in Rhino.Runtime.RhinoAccounts.IRhinoAccountsManager.ExecuteProtectedCodeAsync(System.Func{Rhino.Runtime.RhinoAccounts.SecretKey,System.Threading.Tasks.Task})
Returns: Cached tokens matching the exact criteria passed, or null if none can be found matching the criteria.
Throws System.InvalidOperationException: An invalid secretKey was passed, or the assembly is not allowed to call methods from Rhino.Runtime.RhinoAccounts.IRhinoAccountsManager
Since: 7.0

Rhino.Runtime.RhinoAccounts.IRhinoAccountsManager.GetAuthTokensAsync(System.String,System.String,Rhino.Runtime.RhinoAccounts.SecretKey,System.Threading.CancellationToken)
Asynchronously retrieves auth tokens with the given criteria from the Rhino Accounts server.
clientId: The unique id of the client registered in Rhino Accounts.
clientSecret: The secret of the client registered in Rhino Accounts
secretKey: A special key that was handed to you in Rhino.Runtime.RhinoAccounts.IRhinoAccountsManager.ExecuteProtectedCodeAsync(System.Func{Rhino.Runtime.RhinoAccounts.SecretKey,System.Threading.Tasks.Task})
cancellationToken: A token that can be used to signal that the operation should be cancelled.
Returns: The auth tokens requested.
Throws System.InvalidOperationException: An invalid secretKey was passed, or the assembly is not allowed to call methods from Rhino.Runtime.RhinoAccounts.IRhinoAccountsManager
Throws Rhino.Runtime.RhinoAccounts.RhinoAccountsException: An error occurred during the authentication process. You may look at the specific subclass of the exception gain more insight as to why the operation failed.
Throws System.OperationCanceledException: The operation was cancelled, either by internal decisions or because the cancellationToken was cancelled.
Remarks: This method includes a default scope of 'openid', 'email', 'profile', and 'groups'. It should be suffifient for most workflows. This method shows the user a UI showing them the progress of the operation, and allows them to cancel it at any time.
It also stores the retrieved tokens in a secure cache so they can be retrieved in the future by calling Rhino.Runtime.RhinoAccounts.IRhinoAccountsManager.TryGetAuthTokens(System.String,Rhino.Runtime.RhinoAccounts.SecretKey)
Since: 7.0

Rhino.Runtime.RhinoAccounts.IRhinoAccountsManager.GetAuthTokensAsync(System.String,System.String,System.Collections.Generic.IEnumerable{System.String},System.String,System.Nullable{System.Int32},System.Boolean,System.IProgress{Rhino.Runtime.RhinoAccounts.RhinoAccoountsProgressInfo},Rhino.Runtime.RhinoAccounts.SecretKey,System.Threading.CancellationToken)
Asynchronously retrieves auth tokens with the given criteria from the Rhino Accounts server.
clientId: The unique id of the client registered in Rhino Accounts.
clientSecret: The secret of the client registered in Rhino Accounts
scope: The scope desired for the tokens. Valid scope values can be found in the Rhino Accounts documentation.
prompt: The prompt of the request. See Rhino Accounts documentation for details. You may pass null if no prompt is desired.
maxAge: The maxAge of the request. See Rhino Accounts documentation for details. You may pass null if no maxAge should be enforced.
showUI: true if the user should see a UI showing the progress of the operation and a way to cancel it, or false if the UI should not be displayed.
If false, it is strongly recommended that you pass a progress object and display your own UI to the user.
progress: An object that will report the progress of the operation to the caller. If no progress is needed, you may pass null.
secretKey: A special key that was handed to you in Rhino.Runtime.RhinoAccounts.IRhinoAccountsManager.ExecuteProtectedCodeAsync(System.Func{Rhino.Runtime.RhinoAccounts.SecretKey,System.Threading.Tasks.Task})
cancellationToken: A token that can be used to signal that the operation should be cancelled.
Returns: The auth tokens requested.
Throws System.InvalidOperationException: An invalid secretKey was passed, or the assembly is not allowed to call methods from Rhino.Runtime.RhinoAccounts.IRhinoAccountsManager
Throws Rhino.Runtime.RhinoAccounts.RhinoAccountsException: An error occurred during the authentication process. You may look at the specific subclass of the exception gain more insight as to why the operation failed.
Throws System.OperationCanceledException: The operation was cancelled, either by internal decisions or because the cancellationToken was cancelled.

Rhino.Runtime.RhinoAccounts.IRhinoAccountsManager.UpdateOpenIDConnectTokenAsync(Rhino.Runtime.RhinoAccounts.IOpenIDConnectToken,Rhino.Runtime.RhinoAccounts.IOAuth2Token,Rhino.Runtime.RhinoAccounts.SecretKey,System.Threading.CancellationToken)
Updates an OpenID Connect token so that it contains the latest user information by contacting the Rhino Account's server userinfo endpoint using a compatible O
currentToken: The existing OpenID Connect token that you wish to updated with the latest user information.
oauth2Token: A valid OAuth2 token used for authorization. The OAuth2 token must have been issued together with the OpenID Connect token passed or a Rhino.Runtime.RhinoAccounts.RhinoAccountsAuthTokenMismatchException will be thrown.
secretKey: A special key that was handed to you in Rhino.Runtime.RhinoAccounts.IRhinoAccountsManager.ExecuteProtectedCodeAsync(System.Func{Rhino.Runtime.RhinoAccounts.SecretKey,System.Threading.Tasks.Task})
cancellationToken: A token that can be used to signal that the operation should be cancelled.
Returns: The updated OpenIDConnectToken based on the original token passed to this method.
Throws System.InvalidOperationException: An invalid secretKey was passed, or the assembly is not allowed to call methods from Rhino.Runtime.RhinoAccounts.IRhinoAccountsManager
Throws Rhino.Runtime.RhinoAccounts.RhinoAccountsException: An error occurred during the authentication process. You may look at the specific subclass of the exception gain more insight as to why the operation failed.
Throws System.OperationCanceledException: The operation was cancelled, either by internal decisions or because the cancellationToken was cancelled.
Remarks: If the OpenID Connect token is currently stored in the local cache, it will be updated to reflect the new token.
Since: 7.0

Rhino.Runtime.RhinoAccounts.IRhinoAccountsManager.RevokeAuthTokenAsync(Rhino.Runtime.RhinoAccounts.IOAuth2Token,Rhino.Runtime.RhinoAccounts.SecretKey,System.Threading.CancellationToken)
Invalidates/revokes an Rhino.Runtime.RhinoAccounts.IOAuth2Token object from the Rhino Accounts server.
oauth2Token: The token to revoke.
secretKey: A special key that was handed to you in Rhino.Runtime.RhinoAccounts.IRhinoAccountsManager.ExecuteProtectedCodeAsync(System.Func{Rhino.Runtime.RhinoAccounts.SecretKey,System.Threading.Tasks.Task})
cancellationToken: A token that can be used to signal that the operation should be cancelled.
Throws System.InvalidOperationException: An invalid secretKey was passed, or the assembly is not allowed to call methods from Rhino.Runtime.RhinoAccounts.IRhinoAccountsManager
Throws System.OperationCanceledException: The operation was cancelled, either by internal decisions or because the cancellationToken was cancelled.
Remarks: If the OAuth 2 token is stored in the local cache, it will be removed from the cache as well.
Since: 7.0