Rhino.Render.RenderPrimitiveEnumerator.#ctor(System.UInt32,System.Guid,Rhino.DocObjects.ViewportInfo,System.Boolean,System.Boolean)
documentSerialNumber:
Runtime serial number of the Rhino document.
plugInId:
The Id of the plug-in creating the iterator.
viewport:
The rendering view camera.
forceTriangleMeshes:
If true quad meshes will be triangulated
quiet:
Iterate quietly, if true then no user interface will be displayed

Rhino.Render.RenderPrimitiveEnumerator.SceneBoundingBox
Bounding box containing all meshes in the scene.