Rhino.Geometry.PolylineCurve
Represents the geometry of a set of linked line segments.
This is fundamentally a class that derives from Rhino.Geometry.Curve
and internally contains a Rhino.Geometry.Polyline.

Rhino.Geometry.PolylineCurve.#ctor
Initializes a new empty polyline curve.
Since: 5.0

Rhino.Geometry.PolylineCurve.#ctor(Rhino.Geometry.PolylineCurve)
Initializes a new polyline curve by copying its content from another polyline curve.
other: Another polyline curve.
Since: 5.0

Rhino.Geometry.PolylineCurve.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Initializes a new polyline curve by copying its content from another set of points.
points: A list, an array or any enumerable set of points to copy from.
This includes a Rhino.Geometry.Polyline object.
Since: 5.0

Rhino.Geometry.PolylineCurve.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor for internal use.
info: Serialization data.
context: Serialization stream.

Rhino.Geometry.PolylineCurve.Internal_FromArray(Rhino.Geometry.Point3d[],System.Int32)
[Giulio - 2018 03 29] This static factory method skips all checks and simply calls the C++ instantiator.
You are responsible for providing a correct count, that is: larger than 2 and less or equal points.Length.
Use the public PolylineCurve constructor with IEnumerable when in doubt. See RH-45133.

Rhino.Geometry.PolylineCurve.CreateConvexHull2d(Rhino.Geometry.Point2d[],System.Int32[]@)
Attempts to create a closed PolylineCurve that is the anti-clockwise planar convex hull of the input points.
In addition, the indices of the extremal points among the input points are returned in correct order.
Possible duplicates among the input points are taken care of.
points: The input points
hullIndices: The indices into the input points such that points[hullIndices[i]] = result[i]. Since the
result is a closed polyline if successful, the start/end index is repeated at the beginning and end of the hullIndices.
Returns:
The closed PolylineCurve encompassing the input points, or null if the input points were either too few, or were found to be collinear.
Since: 8.6

Rhino.Geometry.PolylineCurve.PointCount
Gets the number of points in this polyline.
Since: 5.0

Rhino.Geometry.PolylineCurve.Point(System.Int32)
Gets a point at a specified index in the polyline curve.
index: An index.
Returns: A point.
Since: 5.0

Rhino.Geometry.PolylineCurve.SetPoint(System.Int32,Rhino.Geometry.Point3d)
Sets a point at a specified index in the polyline curve.
index: An index.
point: A point location to set.
Since: 5.0

Rhino.Geometry.PolylineCurve.Parameter(System.Int32)
Gets a parameter at a specified index in the polyline curve.
index: An index.
Returns: A parameter.
Since: 6.0

Rhino.Geometry.PolylineCurve.SetParameter(System.Int32,System.Double)
Sets a parameter at a specified index in the polyline curve.
index: An index.
parameter: A parameter to set.
Since: 6.0

Rhino.Geometry.PolylineCurve.SetArcLengthParameterization(System.Double)
Sets the polyline curve to use arc length parameterization for higher quality geometry.
tolerance: Minimum distance tolerance.
Since: 8.0

Rhino.Geometry.PolylineCurve.ToPolyline
Returns the underlying Polyline, or points.
Returns: The Polyline if successful, null of the curve has no points.
Since: 6.0

Rhino.Geometry.PolylineCurve.ToArray
Returns the underlying Polyline points as an array.
Returns: An array of 3d points.
Since: 8.9