Rhino.Geometry.PointCloud
Represents a collection of coordinates with optional normal vectors and colors.

Rhino.Geometry.PointCloud.#ctor
Initializes a new instance of the Rhino.Geometry.PointCloud class
that is empty.
Since: 5.0

Rhino.Geometry.PointCloud.#ctor(Rhino.Geometry.PointCloud)
Initializes a new instance of the Rhino.Geometry.PointCloud class,
copying (Merge) the content of another point cloud.
Since: 5.0

Rhino.Geometry.PointCloud.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Initializes a new instance of the Rhino.Geometry.PointCloud class,
copying the content from a set of points.
points: A list or an array of Point3d, or any object that implements System.Collections.Generic.IEnumerable`1.
Since: 5.0

Rhino.Geometry.PointCloud.CreateFromMesh(Rhino.Geometry.Mesh)
Creates a point cloud from a mesh.
mesh: Mesh to copy vertices, vertex normals, and colors.
Returns: A point cloud if successful, otherwise null.
Since: 8.29

Rhino.Geometry.PointCloud.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Binds with the Rhino default serializer to support object persistence.
info: Some storage.
context: The source and destination of the stream.

Rhino.Geometry.PointCloud.Count
Gets the number of points in this point cloud.
Since: 5.0

Rhino.Geometry.PointCloud.Item(System.Int32)
Gets the item at the given index.
index: Index of item to retrieve.
Returns: The item at the given index.

Rhino.Geometry.PointCloud.HiddenPointCount
Gets the number of points that have their Hidden flag set.
Since: 5.0

Rhino.Geometry.PointCloud.ContainsColors
Gets a value indicating whether or not the points in this
point cloud have colors assigned to them.
Since: 5.0

Rhino.Geometry.PointCloud.ContainsNormals
Gets a value indicating whether or not the points in this
point cloud have normals assigned to them.
Since: 5.0

Rhino.Geometry.PointCloud.ContainsHiddenFlags
Gets a value indicating whether or not the points in this
point cloud have hidden flags assigned to them.
Since: 5.0

Rhino.Geometry.PointCloud.ContainsPointValues
Gets a value indicating whether or not the points in this point cloud have extra values assigned to them.
Extra values can be used to store a user-defined values, such as intensity.
Since: 7.5

Rhino.Geometry.PointCloud.ClearColors
Destroys the color information in this point cloud.
Since: 5.0

Rhino.Geometry.PointCloud.ClearNormals
Destroys the normal vector information in this point cloud.
Since: 5.0

Rhino.Geometry.PointCloud.ClearHiddenFlags
Destroys the hidden flag information in this point cloud.
Since: 5.0

Rhino.Geometry.PointCloud.ClearPointValues
Destroys the extra value information in this point cloud.
Extra values can be used to store a user-defined values, such as intensity.
Since: 7.5

Rhino.Geometry.PointCloud.AppendNew
Appends a new PointCloudItem to the end of this point cloud.
Returns: The newly appended item.
Since: 5.0

Rhino.Geometry.PointCloud.InsertNew(System.Int32)
Inserts a new Rhino.Geometry.PointCloudItem at a specific position of the point cloud.
index: Index of new item.
Returns: The newly inserted item.
Since: 5.0

Rhino.Geometry.PointCloud.Merge(Rhino.Geometry.PointCloud)
Merges, or appends, a specified point cloud into this one.
other: PointCloud to merge with this one.
Since: 5.0

Rhino.Geometry.PointCloud.Add(Rhino.Geometry.Point3d)
Append a new point to the end of the list.
point: Point to append.
Since: 5.0

Rhino.Geometry.PointCloud.Add(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)
Append a new point to the end of the list.
point: Point to append.
normal: Normal vector of new point.
Since: 5.0

Rhino.Geometry.PointCloud.Add(Rhino.Geometry.Point3d,System.Drawing.Color)
Append a new point to the end of the list.
point: Point to append.
color: Color of new point.
Since: 5.0

Rhino.Geometry.PointCloud.Add(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Color)
Append a new point to the end of the list.
point: Point to append.
normal: Normal vector of new point.
color: Color of new point.
Since: 5.0

Rhino.Geometry.PointCloud.Add(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Color,System.Double)
Append a new point to the end of the list.
point: Point to append.
normal: Normal vector of new point.
color: Color of new point.
value:
Extra value of new point.
An extra value can be used to store a user-defined value, such as intensity.
Since: 7.5

Rhino.Geometry.PointCloud.AddRange(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Appends a collection of points to this point cloud.
points: Points to append.
Since: 5.0

Rhino.Geometry.PointCloud.AddRange(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{Rhino.Geometry.Vector3d})
Appends a collection of points and normal vectors to this point cloud.
Throws System.ArgumentException: thrown if points and normals have differing numbers of elements
points: Points to append.
normals: Normal Vectors to append.
Since: 6.0

Rhino.Geometry.PointCloud.AddRange(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{System.Drawing.Color})
Appends a collection of points and normal vectors to this point cloud.
points: Points to append.
colors: Colors to append.
Since: 6.0

Rhino.Geometry.PointCloud.AddRange(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{Rhino.Geometry.Vector3d},System.Collections.Generic.IEnumerable{System.Drawing.Color})
Appends a collection of points, normal vectors, and colors to this point cloud.
points: Points to append.
normals: Normal Vectors to append.
colors: Colors to append.
Since: 6.0

Rhino.Geometry.PointCloud.AddRange(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{Rhino.Geometry.Vector3d},System.Collections.Generic.IEnumerable{System.Drawing.Color},System.Collections.Generic.IEnumerable{System.Double})
Appends a collection of points, normal vectors, colors, and extra values to this point cloud.
points: Points to append.
normals: Normal Vectors to append.
colors: Colors to append.
values:
Exta point values to append.
Extra values can be used to store a user-defined values, such as intensity.
Since: 7.5

Rhino.Geometry.PointCloud.Insert(System.Int32,Rhino.Geometry.Point3d)
Inserts a new point into the point list.
index: Insertion index.
point: Point to append.
Since: 5.0

Rhino.Geometry.PointCloud.Insert(System.Int32,Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)
Inserts a new point into the point list.
index: Insertion index.
point: Point to append.
normal: Normal vector of new point.
Since: 5.0

Rhino.Geometry.PointCloud.Insert(System.Int32,Rhino.Geometry.Point3d,System.Drawing.Color)
Inserts a new point into the point list.
index: Insertion index.
point: Point to append.
color: Color of new point.
Since: 5.0

Rhino.Geometry.PointCloud.Insert(System.Int32,Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Color)
Inserts a new point into the point list.
index: Insertion index.
point: Point to append.
normal: Normal vector of new point.
color: Color of new point.
Since: 5.0

Rhino.Geometry.PointCloud.Insert(System.Int32,Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Color,System.Double)
Inserts a new point into the point list.
index: Insertion index.
point: Point to append.
normal: Normal vector of new point.
color: Color of new point.
value:
An extra value of new point.
An extra values can be used to store a user-defined value, such as intensity.
Since: 7.5

Rhino.Geometry.PointCloud.InsertRange(System.Int32,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Append a collection of points to this point cloud.
index: Index at which to insert the new collection.
points: Points to append.
Since: 5.0

Rhino.Geometry.PointCloud.RemoveAt(System.Int32)
Remove the point at the given index.
index: Index of point to remove.
Since: 5.0

Rhino.Geometry.PointCloud.RemoveRange(System.Collections.Generic.IEnumerable{System.Int32})
Removes points at given indices.
indices: An array of indices of the points to remove.
Returns: The number of points removed from the point cloud.
Since: 7.5

Rhino.Geometry.PointCloud.ShrinkWrap(Rhino.Geometry.ShrinkWrapParameters)
Returns a ShrinkWrap mesh from this point cloud object.
parameters:
Returns:
Since: 8.0

Rhino.Geometry.PointCloud.CreateSectionCurve(Rhino.Geometry.Plane,System.Double)
Creates planar curves by intersecting a plane with a point cloud.
plane: The plane to intersect with
absoluteTolerance: The document's model absolute tolerance
Returns: The intersection curves if successful, an empty array if unsuccessful.
Since: 8.0

Rhino.Geometry.PointCloud.CreateSectionCurve(Rhino.Geometry.Plane,System.Double,System.Double,System.Double,System.Boolean,System.Boolean,System.Boolean,System.Double)
Creates a planar curve by intersecting a plane with a point cloud.
plane: The plane to intersect with
absoluteTolerance: The document's model absolute tolerance
maxDistance:
Maximum distance to plane. The thickness of the "slab" around the plane from which sample points are taken.
Those sample points are projected to the section plane and a polyline is found that connects them.
This distance depends on the size of the point cloud and the spacing of the points.
minDistance:
Minimum distance between points. A threshold for the minimum spacing between adjacent sample points.
If there are points closer than that, some are not used.
openCurves: True for open, false for closed.
createSpline: Creates a smooth curve. You can create both a curve and a polyline.
createPolyline: Creates a polyline. You can create both a curve and a polyline.
fitTolerance: The tolerance used to fit the curve through the polyline.
Returns: The intersection curves if successful, an empty array if unsuccessful.
Since: 8.0

Rhino.Geometry.PointCloud.CreateContourCurves(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double)
Creates a planar curves by intersecting a plane with a point cloud.
contourStart: Start point for vector that is normal to contour plane.
contourEnd: End point for vector that is normal to contour plane.
interval: he interval or distance between contours.
absoluteTolerance: The document's model absolute tolerance
Returns: The intersection curves if successful, an empty array if unsuccessful.
Since: 8.0

Rhino.Geometry.PointCloud.CreateContourCurves(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double,System.Double,System.Double,System.Boolean,System.Boolean,System.Boolean,System.Double)
Creates a planar curves by intersecting a plane with a point cloud.
startPoint: Start point for vector that is normal to contour plane.
endPoint: End point for vector that is normal to contour plane.
interval: he interval or distance between contours.
absoluteTolerance: The document's model absolute tolerance
maxDistance:
Maximum distance to plane. The thickness of the "slab" around the plane from which sample points are taken.
Those sample points are projected to the section plane and a polyline is found that connects them.
This distance depends on the size of the point cloud and the spacing of the points.
minDistance:
Minimum distance between points. A threshold for the minimum spacing between adjacent sample points.
If there are points closer than that, some are not used.
openCurves: True for open, false for closed.
createSpline: Creates a smooth curve. You can create both a curve and a polyline.
createPolyline: Creates a polyline. You can create both a curve and a polyline.
fitTolerance: The tolerance used to fit the curve through the polyline.
Returns: The intersection curves if successful, an empty array if unsuccessful.
Since: 8.0

Rhino.Geometry.PointCloud.GetPoints
Copy all the point coordinates in this point cloud to an array.
Returns: An array containing all the points in this point cloud.
Since: 5.0

Rhino.Geometry.PointCloud.PointAt(System.Int32)
Returns the location of the point at a specific index.
index: The index.
Returns:
Since: 6.0

Rhino.Geometry.PointCloud.GetNormals
Copy all the normal vectors in this point cloud to an array.
Returns: An array containing all the normals in this point cloud.
Since: 5.0

Rhino.Geometry.PointCloud.GetColors
Copy all the point colors in this point cloud to an array.
Returns: An array containing all the colors in this point cloud.
Since: 5.0

Rhino.Geometry.PointCloud.GetPointValues
Copy all the extra point values in this point cloud to an array.
Extra values can be used to store a user-defined value, such as intensity.
Returns: An array containing all the extra point values in this point cloud.
Since: 7.5

Rhino.Geometry.PointCloud.ClosestPoint(Rhino.Geometry.Point3d)
Returns index of the closest point in the point cloud to a given test point.
testPoint: .
Returns: Index of point in the point cloud on success. -1 on failure.
Since: 5.0

Rhino.Geometry.PointCloud.GetRandomSubsample(System.UInt32)
Returns a random subsample of a point cloud.
numberOfPoints: The number of points the new point cloud should contain.
Returns: A subsample of this point cloud if success, null otherwise.
Since: 7.5

Rhino.Geometry.PointCloud.GetRandomSubsample(System.UInt32,System.Threading.CancellationToken,System.IProgress{System.Double})
Returns a random subsample of a point cloud.
numberOfPoints: The number of points the new point cloud should contain.
cancelToken: The cancellation token.
progress: The provider for progress updates.
Returns: A subsample of this point cloud if success, null otherwise.
Since: 7.5

Rhino.Geometry.PointCloud.GetUnsafeLock(System.Boolean)
Allows the developer to obtain unsafe pointers to the underlying unmanaged data structures of the PointCloud.
writable: true if user will need to write onto the structure. false otherwise.
Returns: A lock that needs to be released.
Remarks: The lock implements the IDisposable interface, and one call of its
System.IDisposable.Dispose or Rhino.Geometry.PointCloud.ReleaseUnsafeLock(Rhino.Geometry.PointCloudUnsafeLock) will update the data structure as required.
This can be achieved with a using statement (Using in Vb.Net).
Since: 7.9

Rhino.Geometry.PointCloud.ReleaseUnsafeLock(Rhino.Geometry.PointCloudUnsafeLock)
Updates the PointCloud data with the information that was stored via the Rhino.Geometry.PointCloudUnsafeLock.
pointCloudData: The data that will be unlocked.
Since: 7.9

Rhino.Geometry.PointCloud.AsReadOnlyListOfPoints
Returns an enumerator and list indexer over point cloud locations.
Returns: The read-only list. This is a reference to the present point cloud.
Since: 6.0

Rhino.Geometry.PointCloud.GetEnumerator
Gets an enumerator that allows to modify each point cloud point.
Returns: A instance of System.Collections.Generic.IEnumerator`1.
Since: 5.0

Rhino.Geometry.PointCloud.System#Collections#IEnumerable#GetEnumerator
Since: 5.0