Rhino.Geometry.Quaternion
Represents the four coefficient values in a quaternion.
The first value a is the real part,
while the rest multiplies i, j and k, that are imaginary.
quaternion = a + bi + cj + dk

Rhino.Geometry.Quaternion.Zero
Returns the default quaternion, where all coefficients are 0.
Since: 5.0

Rhino.Geometry.Quaternion.Identity
Returns the (1,0,0,0) quaternion.
Since: 5.0

Rhino.Geometry.Quaternion.I
Returns the (0,1,0,0) quaternion.
Since: 5.0

Rhino.Geometry.Quaternion.J
Returns the (0,0,1,0) quaternion.
Since: 5.0

Rhino.Geometry.Quaternion.K
Returns the (0,0,0,1) quaternion.
Since: 5.0

Rhino.Geometry.Quaternion.#ctor(System.Double,System.Double,System.Double,System.Double)
Initializes a new quaternion with the provided coefficients.
a: A number. This is the real part.
b: Another number. This is the first coefficient of the imaginary part.
c: Another number. This is the second coefficient of the imaginary part.
d: Another number. This is the third coefficient of the imaginary part.
Since: 5.0

Rhino.Geometry.Quaternion.op_Equality(Rhino.Geometry.Quaternion,Rhino.Geometry.Quaternion)
Determines whether two quaternions have the same value.
a: A quaternion.
b: Another quaternion.
Returns: true if the quaternions have exactly equal coefficients; otherwise false.
Since: 5.0

Rhino.Geometry.Quaternion.op_Inequality(Rhino.Geometry.Quaternion,Rhino.Geometry.Quaternion)
Determines whether two quaternions have different values.
a: A quaternion.
b: Another quaternion.
Returns: true if the quaternions differ in any coefficient; otherwise false.
Since: 5.0

Rhino.Geometry.Quaternion.Equals(Rhino.Geometry.Quaternion)
Determines whether this quaternion has the same value of another quaternion.
other: Another quaternion to compare.
Returns: true if the quaternions have exactly equal coefficients; otherwise false.
Since: 5.0

Rhino.Geometry.Quaternion.Equals(System.Object)
Determines whether an object is a quaternion and has the same value of this quaternion.
obj: Another object to compare.
Returns: true if obj is a quaternion and has exactly equal coefficients; otherwise false.

Rhino.Geometry.Quaternion.EpsilonEquals(Rhino.Geometry.Quaternion,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:
Since: 5.4

Rhino.Geometry.Quaternion.GetHashCode
Gets a non-unique but repeatable hashing code for this quaternion.
Returns: A signed number.

Rhino.Geometry.Quaternion.A
Gets or sets the real part of the quaternion.
Since: 5.0

Rhino.Geometry.Quaternion.B
Gets or sets the first imaginary coefficient of the quaternion.
Since: 5.0

Rhino.Geometry.Quaternion.C
Gets or sets the second imaginary coefficient of the quaternion.
Since: 5.0

Rhino.Geometry.Quaternion.D
Gets or sets the third imaginary coefficient of the quaternion.
Since: 5.0

Rhino.Geometry.Quaternion.Set(System.Double,System.Double,System.Double,System.Double)
Sets all coefficients of the quaternion.
Since: 5.0

Rhino.Geometry.Quaternion.op_Multiply(Rhino.Geometry.Quaternion,System.Int32)
Multiplies (scales) all quaternion coefficients by a factor and returns a new quaternion with the result.
q: A quaternion.
x: A number.
Returns: A new quaternion.
Since: 5.0

Rhino.Geometry.Quaternion.op_Multiply(Rhino.Geometry.Quaternion,System.Single)
Multiplies (scales) all quaternion coefficients by a factor and returns a new quaternion with the result.
q: A quaternion.
x: A number.
Returns: A new quaternion.
Since: 5.0

Rhino.Geometry.Quaternion.op_Multiply(Rhino.Geometry.Quaternion,System.Double)
Multiplies (scales) all quaternion coefficients by a factor and returns a new quaternion with the result.
q: A quaternion.
x: A number.
Returns: A new quaternion.
Since: 5.0

Rhino.Geometry.Quaternion.op_Division(Rhino.Geometry.Quaternion,System.Double)
Divides all quaternion coefficients by a factor and returns a new quaternion with the result.
q: A quaternion.
y: A number.
Returns: A new quaternion.
Since: 5.0

Rhino.Geometry.Quaternion.op_Addition(Rhino.Geometry.Quaternion,Rhino.Geometry.Quaternion)
Adds two quaternions.
This sums each quaternion coefficient with its correspondent and returns
a new result quaternion.
a: A quaternion.
b: Another quaternion.
Returns: A new quaternion.

Rhino.Geometry.Quaternion.op_Subtraction(Rhino.Geometry.Quaternion,Rhino.Geometry.Quaternion)
Subtracts a quaternion from another one.
This computes the difference of each quaternion coefficient with its
correspondent and returns a new result quaternion.
a: A quaternion.
b: Another quaternion.
Returns: A new quaternion.
Since: 5.0

Rhino.Geometry.Quaternion.op_Multiply(Rhino.Geometry.Quaternion,Rhino.Geometry.Quaternion)
Multiplies a quaternion with another one.
Quaternion multiplication (Hamilton product) is not commutative.
a: The first term.
b: The second term.
Returns: A new quaternion.
Since: 5.0

Rhino.Geometry.Quaternion.IsValid
Determines if the four coefficients are valid numbers within RhinoCommon.
See Rhino.RhinoMath.IsValidDouble(System.Double).
Since: 5.0

Rhino.Geometry.Quaternion.Conjugate
Gets a new quaternion that is the conjugate of this quaternion.
This is (a,-b,-c,-d)
Since: 5.0

Rhino.Geometry.Quaternion.Invert
Modifies this quaternion to become
(a/L2, -b/L2, -c/L2, -d/L2),
where L2 = length squared = (a*a + b*b + c*c + d*d).
This is the multiplicative inverse, i.e.,
(a,b,c,d)*(a/L2, -b/L2, -c/L2, -d/L2) = (1,0,0,0).
Returns:
true if successful. false if the quaternion is zero and cannot be inverted.
Since: 5.0

Rhino.Geometry.Quaternion.Inverse
Computes a new inverted quaternion,
(a/L2, -b/L2, -c/L2, -d/L2),
where L2 = length squared = (a*a + b*b + c*c + d*d).
This is the multiplicative inverse, i.e.,
(a,b,c,d)*(a/L2, -b/L2, -c/L2, -d/L2) = (1,0,0,0).
If this is the zero quaternion, then the zero quaternion is returned.
Since: 5.0

Rhino.Geometry.Quaternion.Length
Returns the length or norm of the quaternion.
Math.Sqrt(a*a + b*b + c*c + d*d)
Since: 5.0

Rhino.Geometry.Quaternion.LengthSquared
Gets the result of (a^2 + b^2 + c^2 + d^2).
Since: 5.0

Rhino.Geometry.Quaternion.DistanceTo(Rhino.Geometry.Quaternion)
Computes the distance or norm of the difference between this and another quaternion.
q: Another quaternion.
Returns: (this - q).Length.
Since: 5.0

Rhino.Geometry.Quaternion.Distance(Rhino.Geometry.Quaternion,Rhino.Geometry.Quaternion)
Returns the distance or norm of the difference between two quaternions.
p: A quaternion.
q: Another quaternion.
Returns: (p - q).Length()
Since: 5.0

Rhino.Geometry.Quaternion.MatrixForm
Returns 4x4 real valued matrix form of the quaternion
a  b  c  d
-b  a -d  c
-c  d  a -b
-d -c  b  a
which has the same arithmetic properties as the quaternion.
Returns: A transform value.
Remarks:
Do not confuse this with the rotation defined by the quaternion. This
function will only be interesting to math nerds and is not useful in
rendering or animation applications.
Since: 5.0

Rhino.Geometry.Quaternion.Unitize
Scales the quaternion's coordinates so that a*a + b*b + c*c + d*d = 1.
Returns:
true if successful.  false if the quaternion is zero and cannot be unitized.
Since: 5.0

Rhino.Geometry.Quaternion.SetRotation(System.Double,Rhino.Geometry.Vector3d)
Sets the quaternion to cos(angle/2), sin(angle/2)*x, sin(angle/2)*y, sin(angle/2)*z
where (x,y,z) is the unit vector parallel to axis.  This is the unit quaternion
that represents the rotation of angle about axis.
angle: in radians.
axisOfRotation: The direction of the axis of rotation.
Since: 5.0

Rhino.Geometry.Quaternion.Rotation(System.Double,Rhino.Geometry.Vector3d)
Returns the unit quaternion
cos(angle/2), sin(angle/2)*x, sin(angle/2)*y, sin(angle/2)*z
where (x,y,z) is the unit vector parallel to axis.  This is the
unit quaternion that represents the rotation of angle about axis.
angle: An angle in radians.
axisOfRotation: The axis of rotation.
Returns: A new quaternion.
Since: 5.0

Rhino.Geometry.Quaternion.SetRotation(Rhino.Geometry.Plane,Rhino.Geometry.Plane)
Sets the quaternion to the unit quaternion which rotates
plane0.xaxis to plane1.xaxis, plane0.yaxis to plane1.yaxis,
and plane0.zaxis to plane1.zaxis.
plane0: The "from" rotation plane. Origin point is ignored.
plane1: The "to" rotation plane. Origin point is ignored.
Remarks: The plane origins are ignored
Since: 5.0

Rhino.Geometry.Quaternion.Rotation(Rhino.Geometry.Plane,Rhino.Geometry.Plane)
Returns the unit quaternion that represents the rotation that maps
plane0.xaxis to plane1.xaxis, plane0.yaxis to plane1.yaxis, and
plane0.zaxis to plane1.zaxis.
plane0: The first plane.
plane1: The second plane.
Returns: A quaternion value.
Remarks: The plane origins are ignored
Since: 5.0

Rhino.Geometry.Quaternion.GetRotation(System.Double@,Rhino.Geometry.Vector3d@)
Returns the rotation defined by the quaternion.
angle: An angle in radians.
axis: unit axis of rotation of 0 if (b,c,d) is the zero vector.
Returns: True if the operation succeeded; otherwise, false.
Remarks:
If the quaternion is not unitized, the rotation of its unitized form is returned.
Since: 5.0

Rhino.Geometry.Quaternion.GetRotation(Rhino.Geometry.Plane@)
Returns the frame created by applying the quaternion's rotation
to the canonical world frame (1,0,0),(0,1,0),(0,0,1).
plane: A plane. This out value will be assigned during this call.
Returns: true if the operation succeeded; otherwise, false.
Since: 5.0

Rhino.Geometry.Quaternion.GetRotation(Rhino.Geometry.Transform@)
Returns a transformation matrix that performs the rotation defined by the quaternion.
The transformation returned by this method has the property that xform * V = q.Rotate(V).
If the quaternion is not unitized, the rotation of its unitized form is returned.
xform:
Returns: true if successful, false otherwise.
Remarks:
Do not confuse the result of this method the transformation matrix returned by Rhino.Geometry.Quaternion.MatrixForm.
Since: 7.12

Rhino.Geometry.Quaternion.Rotate(Rhino.Geometry.Vector3d)
Rotates a 3d vector. This operation is also called conjugation,
because the result is the same as
(q.Conjugate()*(0,x,y,x)*q/q.LengthSquared).Vector.
v: The vector to be rotated.
Returns:
R*v, where R is the rotation defined by the unit quaternion.
This is mathematically the same as the values
(Inverse(q)*(0,x,y,z)*q).Vector
and
(q.Conjugate()*(0,x,y,x)*q/q.LengthSquared).Vector.
Remarks:
If you need to rotate more than a dozen or so vectors,
it will be more efficient to calculate the rotation
matrix once and use it repeatedly.
Since: 5.0

Rhino.Geometry.Quaternion.Vector
The imaginary part of the quaternion
(B,C,D)
Since: 5.0

Rhino.Geometry.Quaternion.Scalar
The real (scalar) part of the quaternion
This is Rhino.Geometry.Quaternion.A.
Since: 5.0

Rhino.Geometry.Quaternion.IsZero
true if a, b, c, and d are all zero.
Since: 5.0

Rhino.Geometry.Quaternion.IsScalar
true if b, c, and d are all zero.
Since: 5.0

Rhino.Geometry.Quaternion.IsVector
true if a = 0 and at least one of b, c, or d is not zero.
Since: 5.0

Rhino.Geometry.Quaternion.ToString
Returns a string representation of this Quaternion.
Returns: A textual representation.
Since: 7.12

Rhino.Geometry.Quaternion.Product(Rhino.Geometry.Quaternion,Rhino.Geometry.Quaternion)
The quaternion product of p and q.  This is the same value as p*q.
p: The first transform.
q: The second transform.
Returns: A transform value.
Since: 5.0

Rhino.Geometry.Quaternion.CrossProduct(Rhino.Geometry.Quaternion,Rhino.Geometry.Quaternion)
Computes the vector cross product of p and q = (0,x,y,z),
where (x,y,z) = CrossProduct(p.Vector,q.Vector).
This is not the same as the quaternion product p*q.
p: A quaternion.
q: Another quaternion.
Returns: A new quaternion.
Since: 5.0

Rhino.Geometry.Quaternion.Slerp(Rhino.Geometry.Quaternion,Rhino.Geometry.Quaternion,System.Double)
Interpolates between two quaternions, using spherical linear interpolation.
a: The first quaternion.
b: The second quaternion.
t: The parameter in the range [0, 1].
Returns: The interpolated quaternion.
Since: 8.0

Rhino.Geometry.Quaternion.Lerp(Rhino.Geometry.Quaternion,Rhino.Geometry.Quaternion,System.Double)
Interpolates between two quaternions, using linear interpolation.
a: The first quaternion.
b: The second quaternion.
t: The parameter in the range [0, 1].
Returns: The interpolated quaternion.
Since: 8.0

Rhino.Geometry.Quaternion.RotateTowards(Rhino.Geometry.Quaternion,Rhino.Geometry.Quaternion,System.Double)
Returns the quaternion obtained by rotating a towards b, limiting the rotation by MaxRadians.
a: The first quaternion.
b: The second quaternion.
maxRadians: The maximum rotation in radians.
Returns: The rotated quaternion.
Since: 8.0

Rhino.Geometry.Quaternion.CreateFromRotationZYX(System.Double,System.Double,System.Double)
Constructs a quaternion defined by Tait-Byran angles, also loosely known as Euler angles.
yaw: Angle, in radians, to rotate about the ZAxis.
pitch: Angle, in radians, to rotate about the YAxis.
roll: Angle, in radians, to rotate about the XAxis.
Returns: The quaternion.
Remarks:
CreateFromRotationZYX(yaw, pitch, roll) = R_z(yaw) * R_y(pitch) * R_x(roll),
where R_*(angle) is rotation of angle radians about the corresponding world coordinate axis.
Since: 8.0

Rhino.Geometry.Quaternion.CreateFromRotationZYZ(System.Double,System.Double,System.Double)
Constructs a quaternion defined by Euler angles.
alpha: Angle, in radians, to rotate about the ZAxis.
beta: Angle, in radians, to rotate about the YAxis.
gamma: Angle, in radians, to rotate about the ZAxis.
Returns: The quaternion.
Remarks:
CreateFromRotationZYZ(alpha, beta, gamma) = R_z(alpha) * R_y(beta) * R_z(gamma),
where R_*(angle) is rotation of angle radians about the corresponding *-world coordinate axis.
Since: 8.0

Rhino.Geometry.Quaternion.GetYawPitchRoll(System.Double@,System.Double@,System.Double@)
Find sthe Tait-Byran angles, also loosely called Euler angles, for this quaternion.
yaw: Angle, in radians, to rotate about the ZAxis.
pitch: Angle, in radians, to rotate about the YAxis.
roll: Angle, in radians, to rotate about the XAxis.
Returns: true if successful, or false if this is not a rotation.
Remarks:
When true, this = RotationZYX(yaw, pitch, roll) = R_z(yaw) * R_y(pitch) * R_x(roll),
where R_*(angle) is rotation of angle radians about the corresponding world coordinate axis.
roll and yaw are in the range (-pi, pi], and pitch is in [-pi/2, pi/2].
Since: 8.0

Rhino.Geometry.Quaternion.GetEulerZYZ(System.Double@,System.Double@,System.Double@)
Find the Euler angles for a rotation transformation.
alpha: Angle, in radians, to rotate about the ZAxis.
beta: Angle, in radians, to rotate about the YAxis.
gamma: Angle, in radians, to rotate about the ZAxis.
Returns: true if successful, or false if this is not a rotation.
Remarks:
When true, this = RotationZYZ(alpha, beta, gamma) = R_z(alpha) * R_y(beta) * R_z(gamma),
where R_*(angle) is rotation of angle radians about the corresponding *-world coordinate axis.
alpha and gamma are in the range (-pi, pi], while beta in the range [0, pi].
Since: 8.0