Rhino.Geometry.SubDComponentLocation
The ON_SubDComponentLocation enum is used when an ON_SubD component
is referenced and it is important to distinguish between the
component's location in the SubD control net and its location
in the SubD limit surface.

Rhino.Geometry.SubDComponentLocation.Unset
Not a valid component location and used to indicate the value is not initialized.
Note well: This value is saved in 3dm archives and cannot be changed.

Rhino.Geometry.SubDComponentLocation.ControlNet
The component's location in the SubD control net.
Note well: This value is saved in 3dm archives and cannot be changed.

Rhino.Geometry.SubDComponentLocation.Surface
The component's location in the SubD limit surface.
Note well: This value is saved in 3dm archives and cannot be changed.