Rhino.Input.Custom.PickContext.MeshPickStyle
Since: 5.0

Rhino.Input.Custom.PickContext.MeshPickStyle.WireframePicking
Checks for vertex and edge hits

Rhino.Input.Custom.PickContext.MeshPickStyle.ShadedModePicking
Checks for face hits

Rhino.Input.Custom.PickContext.MeshPickStyle.VertexOnlyPicking
Returns false if no vertices are hit