Rhino.Render.RenderWindow.ImageAdjust
Class to set image adjusting settings to a RenderWindow. This can't be
directly created. Instead, one should use RenderWindow.GetAdjust() to
get an ImageAdjust instance that can be modified, then passed into
RenderWindow.SetAdjust() to update image adjusting settings.1

Rhino.Render.RenderWindow.ImageAdjust.Gamma
Set the gamma value. The inverse of this will be used to apply
gamma correction to the RenderWindow RGBA channel when necessary.
Since: 6.0

Rhino.Render.RenderWindow.ImageAdjust.Dither
Set the Dithering method to use when adjusting the RenderWindow
content.
Since: 6.0

Rhino.Render.RenderWindow.ImageAdjust.#ctor(System.Single,Rhino.Render.Dithering.Methods)
Internal constructor, used in RenderWindow.GetAdjust()
gamma:
dither: