Rhino.Geometry.HermiteSurface
Create an ON_NurbsSurface satisfying Hermite interpolation conditions at a grid of points.

Rhino.Geometry.HermiteSurface.ConstPointer
Gets the const (immutable) pointer of this class.
Returns: The const pointer.
Since: 7.0

Rhino.Geometry.HermiteSurface.NonConstPointer
Gets the non-const pointer (for modification) of this class.
Returns: The non-const pointer.
Since: 7.0

Rhino.Geometry.HermiteSurface.#ctor
Initializes a new Rhino.Geometry.HermiteSurface instance.
Since: 7.0

Rhino.Geometry.HermiteSurface.#ctor(System.Int32,System.Int32)
Initializes a new Rhino.Geometry.HermiteSurface instance.
uCount: The number of parameters in the "u" direction.
vCount: The number of parameters in the "v" direction.
Since: 7.0

Rhino.Geometry.HermiteSurface.IsValid
Returns true if the all of values in all of the internal data structures contain valid values, false otherwise.
Since: 7.0

Rhino.Geometry.HermiteSurface.UCount
Gets the number of parameters in the "u" direction.
Since: 7.0

Rhino.Geometry.HermiteSurface.VCount
Gets the number of parameters in the "v" direction.
Since: 7.0

Rhino.Geometry.HermiteSurface.UParameterAt(System.Int32)
Gets the "u" parameter at an index. These parameters are strictly increasing.
index: The index.
Returns: The parameter.
Since: 7.0

Rhino.Geometry.HermiteSurface.SetUParameterAt(System.Int32,System.Double)
Sets the "u" parameter at an index. These parameters are strictly increasing.
index: The index.
parameter: The parameter value.
Since: 7.0

Rhino.Geometry.HermiteSurface.VParameterAt(System.Int32)
Gets the "v" parameter at an index. These parameters are strictly increasing.
index: The index.
Returns: The parameter.
Since: 7.0

Rhino.Geometry.HermiteSurface.SetVParameterAt(System.Int32,System.Double)
Sets the "v" parameter at an index. These parameters are strictly increasing.
index: The index.
parameter: The parameter value.
Since: 7.0

Rhino.Geometry.HermiteSurface.PointAt(System.Int32,System.Int32)
Gets the interpolation point at the u,v parameter location.
uIndex: The "u" index.
vIndex: The "v" index.
Returns: The point location.
Since: 7.0

Rhino.Geometry.HermiteSurface.SetPointAt(System.Int32,System.Int32,Rhino.Geometry.Point3d)
Sets the interpolation point at the u,v parameter location.
uIndex: The "u" index.
vIndex: The "v" index.
point: The point location.
Since: 7.0

Rhino.Geometry.HermiteSurface.UTangentAt(System.Int32,System.Int32)
Get the "u" tangent direction (actually first derivative) to interpolate at the u,v parameter location.
uIndex: The "u" index.
vIndex: The "v" index.
Returns: The tangent direction.
Since: 7.0

Rhino.Geometry.HermiteSurface.SetUTangentAt(System.Int32,System.Int32,Rhino.Geometry.Vector3d)
Set the "u" tangent direction (actually first derivative) to interpolate at the u,v parameter location.
uIndex: The "u" index.
vIndex: The "v" index.
tangent: The tangent direction.
Since: 7.0

Rhino.Geometry.HermiteSurface.VTangentAt(System.Int32,System.Int32)
Get the "v" tangent direction (actually first derivative) to interpolate at the u,v parameter location.
uIndex: The "u" index.
vIndex: The "v" index.
Returns: The tangent direction.
Since: 7.0

Rhino.Geometry.HermiteSurface.SetVTangentAt(System.Int32,System.Int32,Rhino.Geometry.Vector3d)
Set the "v" tangent direction (actually first derivative) to interpolate at the u,v parameter location.
uIndex: The "u" index.
vIndex: The "v" index.
tangent: The tangent direction.
Since: 7.0

Rhino.Geometry.HermiteSurface.TwistAt(System.Int32,System.Int32)
Get the twist direction (mixed second partial derivative) to interpolate at the u,v parameter location.
uIndex: The "u" index.
vIndex: The "v" index.
Returns: The twist direction.
Since: 7.0

Rhino.Geometry.HermiteSurface.SetTwistAt(System.Int32,System.Int32,Rhino.Geometry.Vector3d)
Set the twist direction (mixed second partial derivative) to interpolate at the u,v parameter location.
uIndex: The "u" index.
vIndex: The "v" index.
twist: The twist direction.
Since: 7.0

Rhino.Geometry.HermiteSurface.ToNurbsSurface
Constructs a NURBS surface satisfying the Hermite interpolation conditions.
Returns: A NURBS surface is successful, null otherwise.
Since: 7.0

Rhino.Geometry.HermiteSurface.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Geometry.HermiteSurface.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 7.0