Rhino.FileIO.File3dmRenderMaterial


Rhino.FileIO.File3dmRenderMaterial.#ctor(System.Guid,Rhino.FileIO.File3dm)
Constructor for when the object is top-level.

Rhino.FileIO.File3dmRenderMaterial.#ctor(System.Guid,Rhino.FileIO.File3dmRenderContent)
Constructor for when the object is a child.

Rhino.FileIO.File3dmRenderMaterial.ToMaterial
Get a simulated material that approximates this material's appearance.
Since: 8.0