Rhino.Geometry.SumSurface
Represents a sum surface, or an extrusion of a curve along a curved path.

Rhino.Geometry.SumSurface.Create(Rhino.Geometry.Curve,Rhino.Geometry.Curve)
Constructs a new sum surface by extruding a curve A along a path B.
curveA: The curve used as extrusion profile.
curveB: The curve used as path.
Returns: A new sum surface on success; null on failure.
Since: 5.0

Rhino.Geometry.SumSurface.Create(Rhino.Geometry.Curve,Rhino.Geometry.Vector3d)
Constructs a new sum surface by extruding a curve in a specified direction.
curve: The curve used as extrusion profile.
extrusionDirection: The extrusion vector (must be non-zero).
Returns: A new sum surface on success; null on failure.
Since: 7.18

Rhino.Geometry.SumSurface.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor for internal use.
info: Serialization data.
context: Serialization stream.