Rhino.DocObjects.ObjectMaterialSource
Defines enumerated values for the source of material of single objects.
Since: 5.0

Rhino.DocObjects.ObjectMaterialSource.MaterialFromLayer
use material assigned to layer.

Rhino.DocObjects.ObjectMaterialSource.MaterialFromObject
use material assigned to object.

Rhino.DocObjects.ObjectMaterialSource.MaterialFromParent
for objects with parents, like definition geometry in instance
references and faces in polysurfaces, this value indicates the
material definition should come from the parent. If the object
does not have an obvious "parent", then treat it the same as
material_from_layer.