Rhino.Runtime.InteropWrappers.SimpleArrayClippingPlaneObjectPointer
ON_SimpleArray of CRhinoClippingPlaneObject*

Rhino.Runtime.InteropWrappers.SimpleArrayClippingPlaneObjectPointer.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.
Since: 6.7

Rhino.Runtime.InteropWrappers.SimpleArrayClippingPlaneObjectPointer.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.
Since: 6.7

Rhino.Runtime.InteropWrappers.SimpleArrayClippingPlaneObjectPointer.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayClippingPlaneObjectPointer instance.
Since: 6.7

Rhino.Runtime.InteropWrappers.SimpleArrayClippingPlaneObjectPointer.Count
Gets the amount of clipping planes in this array.
Since: 6.7

Rhino.Runtime.InteropWrappers.SimpleArrayClippingPlaneObjectPointer.Add(Rhino.DocObjects.ClippingPlaneObject,System.Boolean)
Adds a clipping plane to the list.
clippingplane: A clipping plane to add.
asConst: Whether this clipping plane should be treated as non-modifiable.
Since: 6.7

Rhino.Runtime.InteropWrappers.SimpleArrayClippingPlaneObjectPointer.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.SimpleArrayClippingPlaneObjectPointer.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 6.7

Rhino.Runtime.InteropWrappers.SimpleArrayClippingPlaneObjectPointer.Dispose(System.Boolean)
disposing: