Rhino.Input.Custom.GetLine
Use to interactively get a line.  The Rhino "Line" command uses GetLine.

Rhino.Input.Custom.GetLine.#ctor
Since: 5.1

Rhino.Input.Custom.GetLine.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Input.Custom.GetLine.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.1

Rhino.Input.Custom.GetLine.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.Input.Custom.GetLine.Get(Rhino.Geometry.Line@)
Perform the 'get' operation.
line:
Returns:
Since: 5.1

Rhino.Input.Custom.GetLine.FirstPointPrompt
Prompt when getting first point
Since: 5.1

Rhino.Input.Custom.GetLine.MidPointPrompt
Prompt when getting midpoint
Since: 5.1

Rhino.Input.Custom.GetLine.SecondPointPrompt
Prompt when getting second point
Since: 5.1

Rhino.Input.Custom.GetLine.AcceptZeroLengthLine
Controls whether or not a zero length line is acceptable.
The default is to require the user to keep picking the end
point until we get a point different than the start point.
Since: 5.1

Rhino.Input.Custom.GetLine.HaveFeedbackColor
If true, the feedback color is used to draw the dynamic
line when the second point is begin picked.  If false,
the active layer color is used.
Since: 5.1

Rhino.Input.Custom.GetLine.FeedbackColor
If set, the feedback color is used to draw the dynamic
line when the second point is begin picked.  If not set,
the active layer color is used.
Since: 5.1

Rhino.Input.Custom.GetLine.FixedLength
If FixedLength > 0, the line must have the specified length
Since: 5.1

Rhino.Input.Custom.GetLine.EnableFromBothSidesOption(System.Boolean)
If true, then the "BothSides" option shows up when the
start point is interactively picked.
on:
Since: 5.1

Rhino.Input.Custom.GetLine.EnableFromMidPointOption(System.Boolean)
If true, the "MidPoint" options shows up
on:
Since: 5.1

Rhino.Input.Custom.GetLine.EnableAllVariations(System.Boolean)
If true, then all line variations are shown if the default line mode is used
on:
Since: 5.1

Rhino.Input.Custom.GetLine.SetFirstPoint(Rhino.Geometry.Point3d)
Use SetFirstPoint to specify the line's starting point and skip
the start point interactive picking
point:
Since: 5.1

Rhino.Input.Custom.GetLine.GetLineMode
Mode used
Since: 5.1