Rhino.DocObjects.Font.FontOrigin
Platform where font originated. This information is useful when
searching for appropriate substitutes.

Rhino.DocObjects.Font.FontOrigin.Unset
Not set.

Rhino.DocObjects.Font.FontOrigin.Unknown
Origin unknown. Changing an ON_Font characteristic like weight or style sets the origin to unknown.

Rhino.DocObjects.Font.FontOrigin.WindowsFont
Set from a Windows IDWriteFont by ON_Font::SetFromDWriteFont()
or a Windows LOGFONT by ON_Font::SetFromWindowsLogFont() and
FaceName and WindowLogfontName match a font installed on a Windows device.

Rhino.DocObjects.Font.FontOrigin.AppleFont
Set from an Apple CTFont. The PostScriptName() and FamilyName() match a
font installed on device running MacOS or iOS. The FaceName() matches
the "typeface" name shown in the MacOS FontBook app.