Rhino.Geometry.ComponentIndexType
Defines enumerated values to represent component index types.
Since: 5.0

Rhino.Geometry.ComponentIndexType.InvalidType
Not used. This is the default value of the enumeration type.

Rhino.Geometry.ComponentIndexType.BrepVertex
Targets a brep vertex index.

Rhino.Geometry.ComponentIndexType.BrepEdge
Targets a brep edge index.

Rhino.Geometry.ComponentIndexType.BrepFace
Targets a brep face index.

Rhino.Geometry.ComponentIndexType.BrepTrim
Targets a brep trim index.

Rhino.Geometry.ComponentIndexType.BrepLoop
Targets a brep loop index.

Rhino.Geometry.ComponentIndexType.MeshVertex
Targets a mesh vertex index.

Rhino.Geometry.ComponentIndexType.MeshTopologyVertex
Targets a mesh topology vertex index.

Rhino.Geometry.ComponentIndexType.MeshTopologyEdge
Targets a mesh topology edge index.

Rhino.Geometry.ComponentIndexType.MeshFace
Targets a mesh face index.

Rhino.Geometry.ComponentIndexType.MeshNgon
Targets a mesh n-gon index.

Rhino.Geometry.ComponentIndexType.InstanceDefinitionPart
Targets an instance definition part index.

Rhino.Geometry.ComponentIndexType.PolycurveSegment
Targets a polycurve segment index.

Rhino.Geometry.ComponentIndexType.PointCloudPoint
Targets a point cloud point index.

Rhino.Geometry.ComponentIndexType.GroupMember
Targets a group member index.

Rhino.Geometry.ComponentIndexType.ExtrusionBottomProfile
3d bottom profile curves. Index identifies profile component

Rhino.Geometry.ComponentIndexType.ExtrusionTopProfile
3d top profile curves. Index identifies profile component

Rhino.Geometry.ComponentIndexType.ExtrusionWallEdge
3d wall edge curve.
Index/2: identifies profile component
Index%2: 0=start, 1=end

Rhino.Geometry.ComponentIndexType.ExtrusionWallSurface
Side wall surfaces.
Index identifies profile component

Rhino.Geometry.ComponentIndexType.ExtrusionCapSurface
Bottom and top cap surfaces. Index 0=bottom, 1=top

Rhino.Geometry.ComponentIndexType.ExtrusionPath
Extrusion path (axis line). Index -1=entire path, 0=start point, 1=endpoint

Rhino.Geometry.ComponentIndexType.SubdVertex
Targets a SubD vertex pointer Id. Ids are not guaranteed to be sequential.

Rhino.Geometry.ComponentIndexType.SubdEdge
Targets a SubD edge pointer Id. Ids are not guaranteed to be sequential.

Rhino.Geometry.ComponentIndexType.SubdFace
Targets a SubD face pointer Id. Ids are not guaranteed to be sequential.

Rhino.Geometry.ComponentIndexType.HatchLoop
Targets a hatch loop.

Rhino.Geometry.ComponentIndexType.DimLinearPoint
Targets a linear dimension point index.

Rhino.Geometry.ComponentIndexType.DimRadialPoint
Targets a radial dimension point index.

Rhino.Geometry.ComponentIndexType.DimAngularPoint
Targets an angular dimension point index.

Rhino.Geometry.ComponentIndexType.DimOrdinatePoint
Targets an ordinate dimension point index.

Rhino.Geometry.ComponentIndexType.DimTextPoint
Targets a text point index.

Rhino.Geometry.ComponentIndexType.DimCentermarkPoint
Targets a centermark point

Rhino.Geometry.ComponentIndexType.DimLeaderPoint
Targets a leader point

Rhino.Geometry.ComponentIndexType.NoType
Targets no specific type.