Rhino.Geometry.SpaceMorph
Represents a spacial, Euclidean morph.

Rhino.Geometry.SpaceMorph.Morph(Rhino.Geometry.GeometryBase)
Apply the space morph to geometry.
geometry: Geometry to morph.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.SpaceMorph.Morph(Rhino.Geometry.Plane@)
Apply the space morph to a plane.
plane: Plane to morph.
Returns: true on success, false on failure.
Since: 6.0

Rhino.Geometry.SpaceMorph.IsMorphable(Rhino.Geometry.GeometryBase)
true if the geometry can be morphed by calling SpaceMorph.Morph(geometry)
Since: 5.0

Rhino.Geometry.SpaceMorph.MorphPoint(Rhino.Geometry.Point3d)
Morphs an Euclidean point. This method is abstract.
point: A point that will be morphed by this function.
Returns: Resulting morphed point.
Since: 5.0

Rhino.Geometry.SpaceMorph.Tolerance
The desired accuracy of the morph. This value is primarily used for deforming
surfaces and breps. The default is 0.0 and any value <= 0.0 is ignored by
morphing functions. The Tolerance value does not affect the way meshes and points
are morphed.
Since: 5.0

Rhino.Geometry.SpaceMorph.QuickPreview
true if the morph should be done as quickly as possible because the result
is being used for some type of dynamic preview. If QuickPreview is true,
the tolerance may be ignored.
The QuickPreview value does not affect the way meshes and points are morphed.
The default is false.
Since: 5.0

Rhino.Geometry.SpaceMorph.PreserveStructure
true if the morph should be done in a way that preserves the structure of the geometry.
In particular, for NURBS objects, true means that only the control points are moved.
The PreserveStructure value does not affect the way meshes and points are morphed.
The default is false.
Since: 5.0