Rhino.DocObjects.GripObject.CurrentLocation
Since: 5.0

Rhino.DocObjects.GripObject.OriginalLocation
Since: 5.0

Rhino.DocObjects.GripObject.Moved
true if the grip has moved from OriginalLocation.
Since: 5.0

Rhino.DocObjects.GripObject.Move(Rhino.Geometry.Transform)
Moves the grip to a new location.
xform:
Transformation applied to the OriginalLocation point.
Since: 5.0

Rhino.DocObjects.GripObject.Move(Rhino.Geometry.Vector3d)
Moves the grip to a new location.
delta:
Translation applied to the OriginalLocation point.
Since: 5.0

Rhino.DocObjects.GripObject.Move(Rhino.Geometry.Point3d)
Moves the grip to a new location.
newLocation:
New location for grip.
Since: 5.0

Rhino.DocObjects.GripObject.UndoMove
Undoes any grip moves made by calling Move.
Since: 5.0

Rhino.DocObjects.GripObject.Weight
The weight of a NURBS control point grip or RhinoMath.UnsetValue
if the grip is not a NURBS control point grip.
Since: 5.0

Rhino.DocObjects.GripObject.OwnerId
Since: 5.0

Rhino.DocObjects.GripObject.NeighborGrip(System.Int32,System.Int32,System.Int32,System.Boolean)
Used to get a grip's logical neighbors, like NURBS curve, surface,
and cage control point grips.
directionR:
-1 to go back one grip, +1 to move forward one grip.  For curves, surfaces
and cages, this is the first parameter direction.
directionS:
-1 to go back one grip, +1 to move forward one grip.  For surfaces and
cages this is the second parameter direction.
directionT:
For cages this is the third parameter direction
wrap:
Returns: logical neighbor or null if the is no logical neighbor
Since: 5.0

Rhino.DocObjects.GripObject.GetGripDirections(Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@)
Sometimes grips have directions.  These directions
can have any length and do not have to be orthogonal.
u:  u direction
v:  v direction
normal:  normal direction
Returns: True if the grip has directions.
Since: 6.0

Rhino.DocObjects.GripObject.GetSurfaceParameters(System.Double@,System.Double@)
Retrieves the NURBS surface 2d parameter space values of this GripObject from the surface it's associated with.
u:
v:
Returns: True on success. Output is unreliable if return is false.
Since: 6.0

Rhino.DocObjects.GripObject.GetCurveCVIndices(System.Int32[]@)
Retrieves the NURBS curve control point indices of this GripObject from the curve it is associated with.
cvIndices: The NURBS curve control point indices.
Returns:
The number of NURBS curve control points managed by this grip.
If the grip is not a curve control point, zero is returned.
Since: 8.10

Rhino.DocObjects.GripObject.GetSurfaceCVIndices(System.Tuple{System.Int32,System.Int32}[]@)
Retrieves the NURBS surface control point indices of this GripObject from the surface it is associated with.
cvIndices: The NURBS surface control point indices as tuples.
Returns:
The number of NURBS surface control points managed by this grip.
If the grip is not a surface control point, zero is returned.
Since: 8.10

Rhino.DocObjects.GripObject.GetCageParameters(System.Double@,System.Double@,System.Double@)
Retrieves the 2d parameter space values of this GripObject from the cage it's associated with.
u:
v:
w:
Returns: True on success. Output is unreliable if return is false.
Since: 6.0

Rhino.DocObjects.GripObject.GetCurveParameters(System.Double@)
Retrieves the 2d parameter space values of this GripObject from the curve it's associated with.
t:
Returns: True on success. Output is unreliable if return is false.
Since: 6.0

Rhino.DocObjects.GripObject.Index
Since: 5.0