Rhino.FileIO.FileFbx
Support for writing Fbx file format

Rhino.FileIO.FileFbx.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileFbxWriteOptions)
Write a Fbx file based on the contents of a RhinoDoc
path: path to write a file to
doc: document to get geometry from
options: options used for generating the Fbx file
Returns: true on success
Since: 8.0

Rhino.FileIO.FileFbx.Read(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileFbxReadOptions)
Read a Fbx file intof a RhinoDoc
path: path to read a file from
doc: document to import geometry into
options: options used for importing the Fbx file
Returns: true on success
Since: 8.0