Rhino.Display.BackgroundStyle
Constants that define how the background of a viewport should be filled.
Since: 5.0

Rhino.Display.BackgroundStyle.SolidColor
Single solid color fill.

Rhino.Display.BackgroundStyle.WallpaperImage
Simple image background wallpaper.

Rhino.Display.BackgroundStyle.Gradient
Two color top/bottom color gradient.

Rhino.Display.BackgroundStyle.Environment
Using a Render Environment.