Rhino.Geometry.Collections.HiddenLineDrawingFullCurveList
Provides access to all the HiddenLineDrawingFullCurve objects in a HiddenLineDrawing object.

Rhino.Geometry.Collections.HiddenLineDrawingFullCurveList.Count
Gets the number of HiddenLineDrawingFullCurve objects.

Rhino.Geometry.Collections.HiddenLineDrawingFullCurveList.Item(System.Int32)
Get the HiddenLineDrawingFullCurve at a given index.
index: Index of HiddenLineDrawingFullCurve to access.
Throws System.IndexOutOfRangeException: Thrown when the index is invalid.
Returns: The HiddenLineDrawingFullCurve at [index].

Rhino.Geometry.Collections.HiddenLineDrawingFullCurveList.GetEnumerator
Gets an enumerator that visits all full curves.
Returns: The enumerator.

Rhino.Geometry.Collections.HiddenLineDrawingFullCurveList.System#Collections#IEnumerable#GetEnumerator
Gets the same enumerator as Rhino.Geometry.Collections.HiddenLineDrawingFullCurveList.GetEnumerator.
Returns: The enumerator.