Rhino.Geometry.Collections.MeshFaceNormalList
Provides access to the Face normals of a Mesh.

Rhino.Geometry.Collections.MeshFaceNormalList.Count
Gets or sets the number of mesh face normals.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceNormalList.Item(System.Int32)
Gets or sets the face normal at the given face index.
The index must be valid or an IndexOutOfRangeException will be thrown.
index: Index of face normal to access.
Throws System.IndexOutOfRangeException: Thrown when the index is invalid.
Returns: The face normal at [index].

Rhino.Geometry.Collections.MeshFaceNormalList.Capacity
Gets or sets the total number of face normals the internal data structure can hold without resizing.
Since: 6.0

Rhino.Geometry.Collections.MeshFaceNormalList.Clear
Clears the Face Normal list on the mesh.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceNormalList.Destroy
Releases all memory allocated to store face normals. The list capacity will be 0 after this call.
Subsequent calls can add new items.
Since: 6.0

Rhino.Geometry.Collections.MeshFaceNormalList.AddFaceNormal(System.Single,System.Single,System.Single)
Appends a face normal to the list of mesh face normals.
x: X component of face normal.
y: Y component of face normal.
z: Z component of face normal.
Returns: The index of the newly added face normal.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceNormalList.AddFaceNormal(System.Double,System.Double,System.Double)
Appends a face normal to the list of mesh face normals.
x: X component of face normal.
y: Y component of face normal.
z: Z component of face normal.
Returns: The index of the newly added face normal.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceNormalList.AddFaceNormal(Rhino.Geometry.Vector3d)
Appends a face normal to the list of mesh face normals.
normal: New face normal.
Returns: The index of the newly added face normal.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceNormalList.AddFaceNormal(Rhino.Geometry.Vector3f)
Appends a face normal to the list of mesh face normals.
normal: New face normal.
Returns: The index of the newly added face normal.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceNormalList.SetFaceNormal(System.Int32,System.Single,System.Single,System.Single)
Sets a face normal vector at an index using three single-precision numbers.
index: An index.
x: A x component.
y: A y component.
z: A z component.
Returns: true on success; false on error.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceNormalList.SetFaceNormal(System.Int32,System.Double,System.Double,System.Double)
Sets a face normal vector at an index using three double-precision numbers.
index: An index.
x: A x component.
y: A y component.
z: A z component.
Returns: true on success; false on error.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceNormalList.SetFaceNormal(System.Int32,Rhino.Geometry.Vector3d)
Sets a face normal vector at an index using a single-precision vector.
index: An index.
normal: A normal vector.
Returns: true on success; false on error.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceNormalList.SetFaceNormal(System.Int32,Rhino.Geometry.Vector3f)
Sets a face normal vector at an index using a single-precision vector.
index: An index.
normal: A normal vector.
Returns: true on success; false on error.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceNormalList.UnitizeFaceNormals
Unitizes all the existing face normals.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceNormalList.ComputeFaceNormals
Computes all the face normals for this mesh based on the physical shape of the mesh.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceNormalList.GetEnumerator
Gets an enumerator that yields all normals (vectors) in this collection.
Returns: The enumerator.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceNormalList.System#Collections#IEnumerable#GetEnumerator
Since: 5.0