Rhino.Geometry.Collections.BrepFaceList
Provides access to all the Faces in a Brep object.

Rhino.Geometry.Collections.BrepFaceList.Count
Gets the number of brep faces.
Since: 5.0

Rhino.Geometry.Collections.BrepFaceList.Item(System.Int32)
Gets the BrepFace at the given index.
The index must be valid or an IndexOutOfRangeException will be thrown.
index: Index of BrepFace to access.
Throws System.IndexOutOfRangeException: Thrown when the index is invalid.
Returns: The BrepFace at [index].

Rhino.Geometry.Collections.BrepFaceList.ShrinkFaces
Shrinks all the underlying surfaces in this Brep.
Sometimes the surfaces extend far beyond the trimming boundaries of the Brep Face.
This function will remove those portions of the surfaces that are not used.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Collections.BrepFaceList.SplitKinkyFaces
Splits any faces with creases into G1 pieces.
Returns: true on success, false on failure.
Remarks: If you need to detect whether splitting occurred,
compare the before and after values of Faces.Count
Since: 5.0

Rhino.Geometry.Collections.BrepFaceList.SplitKinkyFaces(System.Double)
Splits any faces with creases into G1 pieces.
kinkTolerance: Tolerance (in radians) to use for crease detection.
Returns: true on success, false on failure.
Remarks: If you need to detect whether splitting occurred,
compare the before and after values of Faces.Count
Since: 5.0

Rhino.Geometry.Collections.BrepFaceList.SplitKinkyFaces(System.Double,System.Boolean)
Splits any faces with creases into G1 pieces.
kinkTolerance: Tolerance (in radians) to use for crease detection.
compact: If true, the Brep will be compacted if possible.
Returns: true on success, false on failure.
Remarks: If you need to detect whether splitting occurred,
compare the before and after values of Faces.Count
Since: 5.0

Rhino.Geometry.Collections.BrepFaceList.SplitKinkyFace(System.Int32,System.Double)
Splits a single face into G1 pieces.
faceIndex: The index of the face to split.
kinkTolerance: Tolerance (in radians) to use for crease detection.
Returns: true on success, false on failure.
Remarks:
This function leaves deleted stuff in the brep.  Call Brep.Compact() to
remove deleted stuff.
Since: 5.0

Rhino.Geometry.Collections.BrepFaceList.SplitClosedFaces(System.Int32)
Splits closed surfaces so they are not closed.
minimumDegree:
If the degree of the surface < min_degree, the surface is not split.
In some cases, minimumDegree = 2 is useful to preserve piecewise linear
surfaces.
Returns: true if successful.
Since: 5.0

Rhino.Geometry.Collections.BrepFaceList.SplitBipolarFaces
Splits surfaces with two singularities, like spheres, so the results
have at most one singularity.
Returns: true if successful.
Since: 5.0

Rhino.Geometry.Collections.BrepFaceList.SplitFacesAtTangents
Splits all of the faces of a Brep at tangent locations.
Returns: True if successful, false otherwise.
Since: 6.0

Rhino.Geometry.Collections.BrepFaceList.SplitFaceAtTangents(System.Int32)
Splits the face of a Brep at tangent locations.
faceIndex: The index of the face to split.
Returns: True if successful, false otherwise.
Since: 6.0

Rhino.Geometry.Collections.BrepFaceList.HasPerFaceColors
True if one or more faces on the active level have per face color overrides.
Remarks:
Per face colors are a mutable property on Rhino.Geometry.BrepFace and are set with  Rhino.Geometry.BrepFace.PerFaceColor.
Since: 8.18

Rhino.Geometry.Collections.BrepFaceList.ClearPerFaceColors
Removes all per face color overrides on the active level.
Returns: Number of changed faces.
Remarks:
Per face colors are a mutable property on Rhino.Geometry.BrepFace and are set with  Rhino.Geometry.BrepFace.PerFaceColor.
Since: 8.18

Rhino.Geometry.Collections.BrepFaceList.Flip(System.Boolean)
Flips the orientation of faces.
onlyReversedFaces:
If true, clears all BrepFace.OrientationIsReversed flags by calling BrepFace.Transpose()
on each face with a true OrientationIsReversed setting.
If false, all of the faces are flipped regardless of their orientation.
Since: 5.0

Rhino.Geometry.Collections.BrepFaceList.RemoveAt(System.Int32)
Deletes a face at a specified index.
faceIndex: The index of the mesh face.
Since: 5.0

Rhino.Geometry.Collections.BrepFaceList.ExtractFace(System.Int32)
Extracts a face from a Brep.
faceIndex: A face index
Returns: A brep. This can be null.
Since: 5.0

Rhino.Geometry.Collections.BrepFaceList.StandardizeFaceSurface(System.Int32)
Standardizes the relationship between a BrepFace and the 3d surface it
uses.  When done, the face will be the only face that references its 3d
surface, and the orientations of the face and 3d surface will be the same.
faceIndex: The index of the face.
Returns: true if successful.
Since: 5.0

Rhino.Geometry.Collections.BrepFaceList.StandardizeFaceSurfaces
Standardize all faces in the brep.
Since: 5.0

Rhino.Geometry.Collections.BrepFaceList.Add(System.Int32)
Create and add a new face to this list. An incomplete face is added.
The caller must create and fill in the loops used by the face.
surfaceIndex: index of surface in brep's Surfaces list
Returns:
Since: 5.4

Rhino.Geometry.Collections.BrepFaceList.Add(Rhino.Geometry.Surface)
Add a new face to a brep.  This creates a complete face with
new vertices at the surface corners, new edges along the surface
boundary, etc.  The loop of the returned face has four trims that
correspond to the south, east, north, and west side of the
surface in that order.  If you use this version of Add to
add an exiting brep, then you are responsible for using a tool
like JoinEdges() to hook the new face to its neighbors.
surface: surface is copied
Returns:
Since: 5.4

Rhino.Geometry.Collections.BrepFaceList.AddRuledFace(Rhino.Geometry.BrepEdge,System.Boolean,Rhino.Geometry.BrepEdge,System.Boolean)
Add a new face to the brep whose surface geometry is a
ruled surface between two edges.
edgeA:
The south side of the face's surface will run along edgeA.
revEdgeA:
true if the new face's outer boundary orientation along
edgeA is opposite the orientation of edgeA.
edgeB:
The north side of the face's surface will run along edgeA
revEdgeB:
true if the new face's outer boundary orientation along
edgeB is opposite the orientation of edgeB
Returns:
Since: 5.4

Rhino.Geometry.Collections.BrepFaceList.AddConeFace(Rhino.Geometry.BrepVertex,Rhino.Geometry.BrepEdge,System.Boolean)
Add a new face to the brep whose surface geometry is a
ruled cone with the edge as the base and the vertex as
the apex point.
vertex:
The apex of the cone will be at this vertex.
The north side of the surface's parameter
space will be a singular point at the vertex.
edge:
The south side of the face's surface will run along this edge.
revEdge:
true if the new face's outer boundary orientation along
the edge is opposite the orientation of edge.
Returns:
Since: 5.4

Rhino.Geometry.Collections.BrepFaceList.RemoveSlits
Remove slit trims and slit boundaries from each face.
Returns: true if any slits were removed
Since: 5.10

Rhino.Geometry.Collections.BrepFaceList.System#Collections#IEnumerable#GetEnumerator
Gets the same enumerator as Rhino.Geometry.Collections.BrepFaceList.GetEnumerator.
Returns: The enumerator.
Since: 5.0

Rhino.Geometry.Collections.BrepFaceList.GetEnumerator
Gets an enumerators that yields Rhino.Geometry.BrepFace objects.
Returns: The enumerator.
Since: 5.0