Rhino.Display.ColorHSL
Represents an HSL (Hue, Saturation, Luminance) color with double precision floating point channels.
HSL colors are used primarily in Graphical User Interface environments as they provide a
very natural approach to picking colors.

Rhino.Display.ColorHSL.m_a
Alpha values are inverted internally! 0 = opaque; 1 = transparent.

Rhino.Display.ColorHSL.#ctor(System.Drawing.Color)
Constructs a new instance of ColorHSL that is equivalent to an ARGB color.
rgb: ARGB color to mimic.
Remarks: Exact conversions between color spaces are often not possible.
Since: 5.0

Rhino.Display.ColorHSL.#ctor(System.Double,System.Double,System.Double)
Constructs a new instance of ColorHSL with custom channel values.
hue: Hue channel value. Hue channels rotate between 0.0 and 1.0.
saturation: Saturation channel value. Channel will be limited to 0~1.
luminance: Luminance channel value. Channel will be limited to 0~1.
Since: 5.0

Rhino.Display.ColorHSL.#ctor(System.Double,System.Double,System.Double,System.Double)
Constructs a new instance of ColorHSL with custom channel values.
alpha: Alpha channel value. Channel will be limited to 0~1.
hue: Hue channel value. Hue channels rotate between 0.0 and 1.0.
saturation: Saturation channel value. Channel will be limited to 0~1.
luminance: Luminance channel value. Channel will be limited to 0~1.
Since: 5.0

Rhino.Display.ColorHSL.CreateFromRGBA(Rhino.Display.ColorRGBA)
Create the nearest HSL equivalent of a RGBA color.
rgba: Target color in RGBA space.
Returns: The HSL equivalent of the RGBA color.
Since: 7.0

Rhino.Display.ColorHSL.CreateFromCMYK(Rhino.Display.ColorCMYK)
Create the nearest HSL equivalent of a CMYK color.
cmyk: Target color in CMYK space.
Returns: The HSL equivalent of the CMYK color.
Since: 5.0

Rhino.Display.ColorHSL.CreateFromXYZ(Rhino.Display.ColorXYZ)
Create the nearest HSL equivalent of an XYZ color.
xyz: Target color in XYZ space.
Returns: The HSL equivalent of the XYZ color.
Since: 5.0

Rhino.Display.ColorHSL.CreateFromLAB(Rhino.Display.ColorLAB)
Create the nearest HSL equivalent of a LAB color.
lab: Target color in LAB space.
Returns: The HSL equivalent of the LAB color.
Since: 5.0

Rhino.Display.ColorHSL.CreateFromLCH(Rhino.Display.ColorLCH)
Create the nearest HSL equivalent of a LCH color.
lch: Target color in LCH space.
Returns: The HSL equivalent of the LCH color.
Since: 5.0

Rhino.Display.ColorHSL.CreateFromHSV(Rhino.Display.ColorHSV)
Constructs the nearest HSL equivalent of an HSV color.
hsv: Target color in HSV space.
Returns: The HSL equivalent of the HSV color.
Since: 6.0

Rhino.Display.ColorHSL.op_Implicit(Rhino.Display.ColorHSL)~System.Drawing.Color
Implicitly converts a ColorHSL in a .Net library color.
hsl: A HSL color.
Returns: A ARGB .Net library color.

Rhino.Display.ColorHSL.H
Gets or sets the hue channel value.
Hue channels rotate between 0.0 and 1.0.
Since: 5.0

Rhino.Display.ColorHSL.S
Gets or sets the saturation channel value.
Saturation channels are limited to a 0~1 range.
Since: 5.0

Rhino.Display.ColorHSL.L
Gets or sets the luminance channel value.
Luminance channels are limited to a 0~1 range.
Since: 5.0

Rhino.Display.ColorHSL.A
Gets or sets the alpha channel value.
Alpha channels are limited to a 0~1 range.
Since: 5.0

Rhino.Display.ColorHSL.ToArgbColor
Convert HSL color to an equivalent System.Drawing.Color.
Returns: A .Net framework library color value.
Since: 5.0