Rhino.Render.PreviewSceneServer
PreviewSceneServer

Rhino.Render.PreviewSceneServer.CppPointer
The CppPointer of PreviewSceneServer
Since: 6.0

Rhino.Render.PreviewSceneServer.#ctor(System.IntPtr)
Constructor for PreviewSceneServer
Since: 6.0
8.0

Rhino.Render.PreviewSceneServer.Finalize
Destructor for PreviewSceneServer

Rhino.Render.PreviewSceneServer.Dispose
Dispose for PreviewSceneServer
Since: 6.0

Rhino.Render.PreviewSceneServer.Dispose(System.Boolean)
Dispose for PreviewSceneServer

Rhino.Render.PreviewSceneServer.ApplyRotation(System.Double,System.Double,Rhino.Render.IRhRdkPreviewSceneServer_eRotationType)
Set Scene Server Rotation
Since: 6.0

Rhino.Render.PreviewSceneServer.SetSceneScale(System.Double)
Set Scene Server Scale
Since: 7.0