Rhino.FileIO.FileIgs
Support for writing Igs file format

Rhino.FileIO.FileIgs.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileIgsWriteOptions)
Write a Igs file based on the contents of a RhinoDoc
path: path to write a file to
doc: document to get geometry from
options: options used for generating the Igs file
Returns: true on success
Since: 8.0