Rhino.Display.ColorLCH
Represents an LCH (Lightness, A, B) color with double precision floating point channels.
LCH colors (also sometimes called CIELUV) are transformation of the 1931 CIE XYZ color space,
in order to approach perceptual uniformity. They are primarily used in computer graphics which
deal with colored lights.

Rhino.Display.ColorLCH.m_a
Alpha values are inverted internally! 0 = opaque; 1 = transparent!

Rhino.Display.ColorLCH.#ctor(System.Drawing.Color)
Constructs a new instance of ColorLCH that is equivalent to an ARGB color.
rgb: ARGB color to mimic.
Remarks: Exact conversions between color spaces are often not possible.
Since: 5.0

Rhino.Display.ColorLCH.#ctor(System.Double,System.Double,System.Double)
Constructs a new instance of ColorLCH with custom channel values.
lightness: Value of lightness channel. This channel is limited to 0~1.
chroma: Value of chroma channel. This channel is limited to -1~1.
hue: Value of chroma channel. This channel is limited to 0~360.
Since: 5.0

Rhino.Display.ColorLCH.#ctor(System.Double,System.Double,System.Double,System.Double)
Constructs a new instance of ColorLCH with custom channel values.
alpha: Value of Alpha channel. This channel is limited to 0~1.
lightness: Value of Lightness channel. This channel is limited to 0~1.
chroma: Value of Chroma channel. This channel is limited to -1~1.
hue: Value of Hue channel. This channel is limited to 0~360.
Since: 5.0

Rhino.Display.ColorLCH.CreateFromRGBA(Rhino.Display.ColorRGBA)
Create the nearest LCH equivalent of an RGBA color.
rgb: Target color in RGBA space.
Returns: The LCH equivalent of the RGBA color.
Since: 7.1

Rhino.Display.ColorLCH.CreateFromHSL(Rhino.Display.ColorHSL)
Create the nearest LCH equivalent of an HSL color.
hsl: Target color in HSL space.
Returns: The LCH equivalent of the HSL color.
Since: 5.0

Rhino.Display.ColorLCH.CreateFromCMYK(Rhino.Display.ColorCMYK)
Create the nearest LCH equivalent of a CMYK color.
cmyk: Target color in CMYK space.
Returns: The LCH equivalent of the CMYK color.
Since: 5.0

Rhino.Display.ColorLCH.CreateFromXYZ(Rhino.Display.ColorXYZ)
Create the nearest LCH equivalent of an XYZ color.
xyz: Target color in XYZ space.
Returns: The LCH equivalent of the XYZ color.
Since: 5.0

Rhino.Display.ColorLCH.CreateFromLAB(Rhino.Display.ColorLAB)
Create the nearest LCH equivalent of a LAB color.
lab: Target color in LAB space.
Returns: The LCH equivalent of the LAB color.
Since: 5.0

Rhino.Display.ColorLCH.op_Implicit(Rhino.Display.ColorLCH)~System.Drawing.Color
Implicitly converts a LCH color into a .Net library color.
lch: A LCH color.
Returns: A ARGB .Net library color.

Rhino.Display.ColorLCH.L
Gets or sets the Lightness channel.
Since: 5.0

Rhino.Display.ColorLCH.C
Gets or sets the Chroma channel. Chroma is defined from -1.0 to +1.0.
Since: 5.0

Rhino.Display.ColorLCH.H
Gets or sets the Hue channel. The hue channel is limited to the 0~360 degree range.
Since: 5.0

Rhino.Display.ColorLCH.A
Gets or sets the Alpha channel. The Alpha channel is limited to the 0~1 range.
Since: 5.0

Rhino.Display.ColorLCH.MakePositive
Ensure the Chromaticity of this color is positive.
Since: 5.0