Rhino.DocObjects.Tables.HatchPatternTableEventArgs
LinetypeTable event arguments
Since: 8.15

Rhino.DocObjects.Tables.HatchPatternTableEventArgs.Document
The document in which the event occurred.
Since: 8.15

Rhino.DocObjects.Tables.HatchPatternTableEventArgs.EventType
The event type.
Since: 8.15

Rhino.DocObjects.Tables.HatchPatternTableEventArgs.HatchPatternIndex
Index of the hatchpattern.
Since: 8.15

Rhino.DocObjects.Tables.HatchPatternTableEventArgs.NewState
The new state.
Since: 8.15

Rhino.DocObjects.Tables.HatchPatternTableEventArgs.OldState
The old state.
Since: 8.15