Rhino.FileIO.FileCd
Support for writing CD file format

Rhino.FileIO.FileCd.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileCdWriteOptions)
Write a CD file based on the contents of a RhinoDoc
path: path to write a file to
doc: document to get geometry from
options: options used for generating the CD file
Returns: true on success
Since: 8.0