Rhino.Render.LinearWorkflow
This is the interface to linear workflow settings.

Rhino.Render.LinearWorkflow.#ctor
Create a utility object not associated with any document.
Since: 6.0

Rhino.Render.LinearWorkflow.#ctor(Rhino.Render.LinearWorkflow)
Create a utility object not associated with any document from another object.
src:
Since: 6.0

Rhino.Render.LinearWorkflow.CopyFrom(Rhino.Render.FreeFloatingBase)
Copy from another linear workflow object.
src:
Since: 6.0

Rhino.Render.LinearWorkflow.Finalize


Rhino.Render.LinearWorkflow.Dispose
Since: 8.0

Rhino.Render.LinearWorkflow.PreProcessColors
Linear workflow pre-process colors enabled state.
Since: 6.0

Rhino.Render.LinearWorkflow.PreProcessTextures
Linear workflow pre-process textures enabled state.
Since: 6.0

Rhino.Render.LinearWorkflow.PostProcessFrameBuffer
Linear workflow post-process frame buffer enabled state.
Since: 6.0

Rhino.Render.LinearWorkflow.PreProcessGamma
Linear workflow pre-process gamma value. This is currently the same as the post-process gamma value.
Since: 6.0

Rhino.Render.LinearWorkflow.PostProcessGamma
Linear workflow post-process gamma value.
Since: 6.0

Rhino.Render.LinearWorkflow.PostProcessGammaOn
Linear workflow post-process gamma enabled state.
Since: 6.0

Rhino.Render.LinearWorkflow.PostProcessGammaReciprocal
Reciprocal of linear workflow post-process gamma value.
Since: 6.0

Rhino.Render.LinearWorkflow.Hash
Linear workflow hash.
Since: 6.0

Rhino.Render.LinearWorkflow.Equals(System.Object)
Compare two LinearWorkflow objects. They are considered equal if their hashes match.
obj:
Returns:

Rhino.Render.LinearWorkflow.GetHashCode
Get hash code for this object. It is the Hash property cast to int.
Returns: