Rhino.UI.ToolbarGroup
Represents a toolbar group in a Rhino toolbar, or .RUI, file.
Since: 5.0

Rhino.UI.ToolbarGroup.Id
Gets the id of the toolbar group.
Since: 5.0

Rhino.UI.ToolbarGroup.Name
Gets the name of the toolbar group.
Since: 5.0

Rhino.UI.ToolbarGroup.Visible
Gets and sets a toolbar group's visibility.
Since: 5.0

Rhino.UI.ToolbarGroup.IsDocked
Returns true if the toolbar group is docked.
Since: 5.0