Rhino.Geometry.Intersect.PlaneCircleIntersection
Represents all possible cases of a Plane|Circle intersection event.
Since: 5.0

Rhino.Geometry.Intersect.PlaneCircleIntersection.None
No intersections. Either because radius is too small or because circle plane is parallel but not coincident with the intersection plane.

Rhino.Geometry.Intersect.PlaneCircleIntersection.Tangent
Tangent (one point) intersection.

Rhino.Geometry.Intersect.PlaneCircleIntersection.Secant
Secant (two point) intersection.

Rhino.Geometry.Intersect.PlaneCircleIntersection.Parallel
Circle and plane are planar but not coincident.
Parallel indicates no intersection took place.

Rhino.Geometry.Intersect.PlaneCircleIntersection.Coincident
Circle and plane are co-planar, they intersect everywhere.