Rhino.UI.GetColorEventArgs.InputColor
Since: 5.0

Rhino.UI.GetColorEventArgs.SelectedColor
Since: 5.0

Rhino.UI.GetColorEventArgs.IncludeButtonColors
Since: 5.0

Rhino.UI.GetColorEventArgs.Title
Since: 5.0