Rhino.Commands.UndoRedoEventArgs.CommandId
Since: 5.0

Rhino.Commands.UndoRedoEventArgs.UndoSerialNumber
Since: 5.0

Rhino.Commands.UndoRedoEventArgs.IsBeforeBeginRecording
Since: 8.0

Rhino.Commands.UndoRedoEventArgs.IsBeginRecording
Since: 5.0

Rhino.Commands.UndoRedoEventArgs.IsBeforeEndRecording
Since: 8.0

Rhino.Commands.UndoRedoEventArgs.IsEndRecording
Since: 5.0

Rhino.Commands.UndoRedoEventArgs.IsBeginUndo
Since: 5.0

Rhino.Commands.UndoRedoEventArgs.IsEndUndo
Since: 5.0

Rhino.Commands.UndoRedoEventArgs.IsBeginRedo
Since: 5.0

Rhino.Commands.UndoRedoEventArgs.IsEndRedo
Since: 5.0

Rhino.Commands.UndoRedoEventArgs.IsPurgeRecord
Since: 5.0