Rhino.Input.Custom.GetSphere
Class provides user interface to define a sphere.

Rhino.Input.Custom.GetSphere.#ctor
Since: 7.0

Rhino.Input.Custom.GetSphere.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Input.Custom.GetSphere.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 7.0

Rhino.Input.Custom.GetSphere.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.Input.Custom.GetSphere.DefaultSize
Default radius or diameter (based on InDiameterMode)
Since: 7.0

Rhino.Input.Custom.GetSphere.InDiameterMode
Determines if the "size" value is representing a radius or diameter
Since: 7.0

Rhino.Input.Custom.GetSphere.Get(Rhino.Geometry.Sphere@)
Prompt for the getting of a sphere.
sphere: The sphere geometry defined by the user.
Returns: The result of the getting operation.
Since: 7.0

Rhino.Input.Custom.GetSphere.GetMesh(Rhino.Input.Custom.GetSphere.MeshSphereStyle@,System.Int32@,System.Int32@,System.Int32@,System.Int32@,Rhino.Geometry.Sphere@)
Prompt for the getting of a mesh sphere.
style: The style of the mesh sphere.
verticalFaces: The number of UV mesh faces in the vertical direction.
aroundFaces: The number of UV mesh faces in the around direction.
triangleSubdivisions: The number of triangle mesh subdivisions.
quadSubdivisions: The number of quad mesh subdivisions.
sphere: The sphere geometry defined by the user.
Returns: The result of the getting operation.
Since: 7.0