Rhino.FileIO.FileX3dv
Support for writing x3dv file format

Rhino.FileIO.FileX3dv.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileX3dvWriteOptions)
Write a x3dv file based on the contents of a RhinoDoc
path: path to write a file to
doc: document to get geometry from
options: options used for generating the x3dv file
Returns: true on success
Since: 8.0