Rhino.ApplicationSettings.OpenGLSettings
Static methods and properties to control OpenGL settings

Rhino.ApplicationSettings.OpenGLSettings.GetDefaultState
Gets the OpenGL factory settings.
Returns: A new OpenGL state with factory settings.
Since: 6.1

Rhino.ApplicationSettings.OpenGLSettings.GetCurrentState
Gets the current settings.
Returns: A new OpenGL state with current settings.
Since: 6.1

Rhino.ApplicationSettings.OpenGLSettings.RestoreDefaults
Updates from the default setting state.
Since: 6.1

Rhino.ApplicationSettings.OpenGLSettings.UpdateFromState(Rhino.ApplicationSettings.OpenGLSettingsState)
Updates from a particular setting state.
state: The new state that will be set.
Since: 6.1

Rhino.ApplicationSettings.OpenGLSettings.AntialiasLevel
Gets or sets the anti-alias level used by OpenGL viewports
Since: 6.1