Rhino.Render.RenderContent.ExtraRequirementsSetContexts
Since: 5.7

Rhino.Render.RenderContent.ExtraRequirementsSetContexts.UI
Setting extra requirement as a result of user activity.

Rhino.Render.RenderContent.ExtraRequirementsSetContexts.Drop
Setting extra requirement as a result of drag and drop.

Rhino.Render.RenderContent.ExtraRequirementsSetContexts.Program
Setting extra requirement as a result of other (non-user) program activity.