Rhino.FileIO.File3mf
Support for writing 3mf file format

Rhino.FileIO.File3mf.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.File3mfWriteOptions)
Write a 3mf file based on the contents of a RhinoDoc
path: path to write a file to
doc: document to get geometry from
options: options used for generating the Vda file
Returns: true on success
Since: 8.0