Rhino.Render.RdkPlugIn.g_rdk_plugin_dictionary
Dictionary of valid RdkPlugIn's

Rhino.Render.RdkPlugIn.FromPlugInId(System.Guid)
Find loaded RdkPlugIn in the Render Development Kit(RDK) plug-in
dictionary.
plugInId: Plug-in Id to search for
Returns:
If a plug-in with the specified Id is found in the dictionary then the
plug-in object is returned, if not found then null is returned.

Rhino.Render.RdkPlugIn.FromRhinoPlugIn(Rhino.PlugIns.PlugIn)
Search the Render Development Kit(RDK) plug-in dictionary for a render
plug-in with the matching Rhino plug-in Id.
plugIn: Rhino plug-in to search for.
Returns:
If the plug-in is in the RDK dictionary then the dictionary plug-in
object is returned, if not then null is returned.

Rhino.Render.RdkPlugIn.FromRenderContentClassType(System.Type)
Check each RdkPlugIn in the Render Development Kit(RDK) dictionary and
return the first one found that contains the specified content contentType.
type: Class contentType to search for
Returns:
If there is a plug-in the dictionary that registered the requested
contentType then return the plug-in, if not then return null.

Rhino.Render.RdkPlugIn.GetRdkPlugIn(Rhino.PlugIns.PlugIn)
Search the plug-in's dictionary for the specified plug-in and if it is
not found then add it to the dictionary.
plugIn:
Returns:

Rhino.Render.RdkPlugIn.GetRdkPlugIn(System.Guid,System.Int32)
If the specified plug-in is not currently in the plug-in dictionary do
nothing otherwise; see AddPlugInToDictionary for a description of what
happens.
rhinoPlugInId: Id of the plug-in to search for or add.
serialNumber: Plug-in C++ pointer serial number.
Returns:
A plug-in object from the plug-in dictionary or null if there was a
problem adding a new dictionary plug-in.

Rhino.Render.RdkPlugIn.AddPlugInToDictionary(System.IntPtr,System.Guid,System.Int32)
Create a new C++ runtime RDK plug-in object then create a RhinoCommon
RdkPlugIn, attach the C++ pointer to it and set the C++ callback
function pointers to the RdkPlugIn.
rhinoPlugIn:
The C++ pointer to the native CRhinoPlugIn that is causing this RDK
plug-in to get added.
rhinoPlugInId: The plug-in Id
serialNumber: Plug-in C++ pointer serial number
Returns:

Rhino.Render.RdkPlugIn.RenderContentTypeIsRegistered(System.Type)
If there the plug-in dictionary contains a plug-in that registered the
specified content type then return true otherwise; return false;
contentType: Class type to search for.
Returns:
If there the plug-in dictionary contains a plug-in that registered the
specified content contentType then return true otherwise; return false;

Rhino.Render.RdkPlugIn.GetRenderContentType(System.Guid,System.Guid@)
Search the plug-in dictionary for a plug-in for that registered the
specified class type Guid, if it is found then return the class
type and plug-in ID otherwise; return null.
id: Class GUUID attribute value to search for.
pluginId:
Output parameter, will be set to the Id of the plug-in that registered
the class type or Guid.Empty if the type is not found.
Returns:
Returns the class type and Id of the plug-in that registered the class
type if the Id is found otherwise; return null.

Rhino.Render.RdkPlugIn.m_rhino_plug_in_id
CRhinoPlugIn Id that owns this RdkPlugIn

Rhino.Render.RdkPlugIn.m_rdk_plug_in_pointer
The RDK C++ CRdkPlugIn pointer associated with this object

Rhino.Render.RdkPlugIn.m_render_content_types
List of valid RenderContent class types associated with this plug-in.

Rhino.Render.RdkPlugIn.m_rendered_displaymode_types
List of valid RealtimeDisplayMode class types associated with this plug-in.

Rhino.Render.RdkPlugIn.#ctor(System.IntPtr,System.Guid)
Constructor
rdkPlugInPointer:
C++ Pointer to the CRhinoPlugIn that this plug-in is associated with.
rhinoPlugInId: C++ CRhinoPlugIn Id

Rhino.Render.RdkPlugIn.AddRegisteredContentTypes(System.Collections.Generic.IEnumerable{System.Type})
Add list of class types, the type list has been sanitized and should
only contain valid RenderContent class types, this should only be
called from RenderContent.RegisterContent.
types: Types to add to the plug-ins contenet type list.

Rhino.Render.RdkPlugIn.Dispose
Required IDisposable method