Rhino.Commands.CustomUndoEventArgs
Argument package that is passed to a custom undo delegate

Rhino.Commands.CustomUndoEventArgs.CommandId
Since: 5.0

Rhino.Commands.CustomUndoEventArgs.UndoSerialNumber
Since: 5.0

Rhino.Commands.CustomUndoEventArgs.ActionDescription
Since: 5.0

Rhino.Commands.CustomUndoEventArgs.CreatedByRedo
Since: 5.0

Rhino.Commands.CustomUndoEventArgs.Tag
Since: 5.0

Rhino.Commands.CustomUndoEventArgs.Document
Since: 5.0