Rhino.Geometry.Box
Represents the value of a plane and three intervals in
an orthogonal, oriented box that is not necessarily parallel to the world Y, X, Z axes.

Rhino.Geometry.Box.#ctor(Rhino.Geometry.Box)
Copy constructor.
other: The source plane value.
Since: 7.0

Rhino.Geometry.Box.#ctor(Rhino.Geometry.BoundingBox)
Initializes a new Box that mimics a BoundingBox struct.
The orientation plane of the Box is coincident with the
World XY plane.
bbox: BoundingBox to mimic.
Since: 5.0

Rhino.Geometry.Box.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.Interval,Rhino.Geometry.Interval,Rhino.Geometry.Interval)
Initializes a new box from a base Plane and three Intervals.
basePlane: Orientation plane of the box.
xSize: Dimensions along the base plane X-Axis.
ySize: Dimensions along the base plane Y-Axis.
zSize: Dimensions along the base plane Z-Axis.
Since: 5.0

Rhino.Geometry.Box.#ctor(Rhino.Geometry.Plane,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Initializes the smallest box that contains a set of points.
basePlane: Orientation of the box.
points: Points to include, Invalid points will be ignored.
Since: 5.0

Rhino.Geometry.Box.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.GeometryBase)
Initializes a box that contains a generic piece of geometry.
This box will be aligned with an arbitrary plane.
basePlane: Base plane for aligned bounding box.
geometry: Geometry to box.
Since: 5.0

Rhino.Geometry.Box.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.BoundingBox)
Initializes a world aligned box from a base plane and a bounding box.
basePlane: Base plane of bounding box.
boundingbox: Bounding Box in plane coordinates.
Since: 5.0

Rhino.Geometry.Box.Empty
Empty Box. Empty boxes are considered to be invalid.
Since: 5.0

Rhino.Geometry.Box.Unset
Gets a Box whose base plane and axis dimensions are all Unset.
Since: 5.0

Rhino.Geometry.Box.IsValid
Gets the validity of this Box. Boxes are invalid when the base plane or any of
the dimension intervals are invalid or decreasing.
Since: 5.0

Rhino.Geometry.Box.Plane
Gets or sets the orientation plane for this Box.
Since: 5.0

Rhino.Geometry.Box.X
Gets or sets the Interval that describes the dimension of the
Box along the orientation plane X-Axis. Otherwise known as the Width of the Box.
Since: 5.0

Rhino.Geometry.Box.Y
Gets or sets the Interval that describes the dimension of the
Box along the orientation plane Y-Axis. Otherwise known as the Depth of the Box.
Since: 5.0

Rhino.Geometry.Box.Z
Gets or sets the Interval that describes the dimension of the
Box along the orientation plane Z-Axis. Otherwise known as the Height of the Box.
Since: 5.0

Rhino.Geometry.Box.Center
Gets the point that is in the center of the box.
Since: 5.0

Rhino.Geometry.Box.BoundingBox
Gets the world axis aligned Bounding box for this oriented box.
Since: 5.0

Rhino.Geometry.Box.Area
Gets the total surface area of this box.
Since: 5.0

Rhino.Geometry.Box.Volume
Gets the total volume of this box.
Since: 5.0

Rhino.Geometry.Box.PointAt(System.Double,System.Double,System.Double)
Evaluates the box volume at the given unitized parameters.
The box has idealized side length of 1x1x1.
x: Unitized parameter (between 0 and 1 is inside the box) along box X direction.
y: Unitized parameter (between 0 and 1 is inside the box) along box Y direction.
z: Unitized parameter (between 0 and 1 is inside the box) along box Z direction.
Returns: The point at (x,y,z).
Since: 5.0

Rhino.Geometry.Box.ClosestPoint(Rhino.Geometry.Point3d)
Finds the closest point on or in the Box. The box should be Valid for this to work.
point: Sample point.
Returns: The point on or in the box that is closest to the sample point.
Since: 5.0

Rhino.Geometry.Box.ClosestPoint(Rhino.Geometry.Point3d,System.Boolean)
Finds the closest point on or in the Box. The box should be Valid for this to work.
point: Sample point.
includeInterior: If false, the point is projected onto the boundary faces only,
otherwise the interior of the box is also taken into consideration.
Returns: The point on or in the box that is closest to the sample point.
Since: 8.29

Rhino.Geometry.Box.FurthestPoint(Rhino.Geometry.Point3d)
Finds the furthest point on the Box. The Box should be Valid for this to work properly.
point: Sample point.
Returns: The point on the box that is furthest from the sample point.
Since: 5.0

Rhino.Geometry.Box.Inflate(System.Double)
Inflates the box by a given offset in each direction.
Inflating with negative amounts may result in decreasing boxes.
InValid boxes cannot be inflated.
amount: Amount (in model units) to inflate this box in all directions.
Since: 5.0

Rhino.Geometry.Box.Inflate(System.Double,System.Double,System.Double)
Inflates the box by a given offset in each direction.
Inflating with negative amounts may result in decreasing boxes.
InValid boxes cannot be inflated.
xAmount: Amount (in model units) to inflate this box in the x direction.
yAmount: Amount (in model units) to inflate this box in the y direction.
zAmount: Amount (in model units) to inflate this box in the z direction.
Since: 5.0

Rhino.Geometry.Box.Contains(Rhino.Geometry.Point3d)
Determines whether a point is included in this box. This is the same as calling Contains(point,false)
point: Point to test.
Returns: true if the point is on the inside of or coincident with this Box.
Since: 5.0

Rhino.Geometry.Box.Contains(Rhino.Geometry.Point3d,System.Boolean)
Determines whether a point is included in this box.
point: Point to test.
strict: If true, the point needs to be fully on the inside of the Box.
I.e. coincident points will be considered 'outside'.
Returns: true if the point is (strictly) on the inside of this Box.
Since: 5.0

Rhino.Geometry.Box.Contains(Rhino.Geometry.BoundingBox)
Test a bounding box for Box inclusion. This is the same as calling Contains(box,false)
box: Box to test.
Returns: true if the box is on the inside of or coincident with this Box.
Since: 5.0

Rhino.Geometry.Box.Contains(Rhino.Geometry.BoundingBox,System.Boolean)
Test a bounding box for Box inclusion.
box: Box to test.
strict: If true, the bounding box needs to be fully on the inside of this Box.
I.e. coincident boxes will be considered 'outside'.
Returns: true if the box is (strictly) on the inside of this Box.
Since: 5.0

Rhino.Geometry.Box.Contains(Rhino.Geometry.Box)
Test a box for Box inclusion. This is the same as calling Contains(box,false)
box: Box to test.
Returns: true if the box is on the inside of or coincident with this Box.
Since: 5.0

Rhino.Geometry.Box.Contains(Rhino.Geometry.Box,System.Boolean)
Test a box for Box inclusion.
box: Box to test.
strict: If true, the box needs to be fully on the inside of this Box.
I.e. coincident boxes will be considered 'outside'.
Returns: true if the box is (strictly) on the inside of this Box.
Since: 5.0

Rhino.Geometry.Box.Union(Rhino.Geometry.Point3d)
Constructs a union between this Box and the given point.
This grows the box in directions so it contains the point.
point: Point to include.
Since: 5.0

Rhino.Geometry.Box.MakeValid
Attempts to make the Box valid. This is not always possible.
Returns: true if the box was made valid, or if it was valid to begin with.
false if the box remains unchanged.
Since: 5.0

Rhino.Geometry.Box.GetCorners
Gets an array of the 8 corner points of this box.
Returns: An array of 8 corners.
Since: 5.0

Rhino.Geometry.Box.Transform(Rhino.Geometry.Transform)
Transforms this Box using a Transformation matrix. If the Transform does not preserve
Similarity, the dimensions of the resulting box cannot be trusted.
xform: Transformation matrix to apply to this Box.
Returns: true if the Box was successfully transformed, false if otherwise.
Since: 5.0

Rhino.Geometry.Box.RepositionBasePlane(Rhino.Geometry.Point3d)
Repositions the origin of the Base plane for this box without affecting
the physical dimensions.
origin: The new base plane origin.
Since: 5.0

Rhino.Geometry.Box.ToBrep
Constructs a brep representation of this box.
Returns: A Brep representation of this box or null.
Since: 5.0

Rhino.Geometry.Box.ToExtrusion
Constructs an extrusion representation of this box.
Returns: An Extrusion representation of this box or null.
Since: 6.0

Rhino.Geometry.Box.EpsilonEquals(Rhino.Geometry.Box,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:
Since: 5.4