Rhino.Geometry.RegionContainment
Defines enumerated values for closed curve/closed curve relationships.
Since: 5.0

Rhino.Geometry.RegionContainment.Disjoint
There is no common area between the two regions.

Rhino.Geometry.RegionContainment.MutualIntersection
The two curves intersect. There is therefore no full containment relationship either way.

Rhino.Geometry.RegionContainment.AInsideB
Region bounded by curveA (first curve) is inside of curveB (second curve).

Rhino.Geometry.RegionContainment.BInsideA
Region bounded by curveB (second curve) is inside of curveA (first curve).