Rhino.Commands.SelCommand
For adding nestable whole object and subobject selection commands, derive your command from
SelCommand and override the abstract SelFilter and virtual SelSubObjectFilter functions.

Rhino.Commands.SelCommand.SelFilter(Rhino.DocObjects.RhinoObject)
Override this abstract function and return true if object should be selected.
rhObj: The object to check regarding selection status.
Returns: true if the object should be selected; false otherwise.

Rhino.Commands.SelCommand.SelSubObjectFilter(Rhino.DocObjects.RhinoObject,System.Collections.Generic.List{Rhino.Geometry.ComponentIndex})
To select subobjects, override this virtual function, add component indices of the subobjects that
should get selected to indicesToSelect list and return true.
This is called only if the SelFilter returns false and the whole object does not get selected.
rhObj: The object to check regarding selection status.
indicesToSelect: The component indices of the subobjects to select.
Returns:
true if components added to indicesToSelect should get selected.
Since: 7.9

Rhino.Commands.SelCommand.TestLights
Since: 5.0

Rhino.Commands.SelCommand.TestGrips
Since: 5.0

Rhino.Commands.SelCommand.BeQuiet
Since: 5.0