Rhino.DocObjects.MeshObject.IsCustomObject
Since: 6.0

Rhino.DocObjects.MeshObject.MeshGeometry
Since: 5.0

Rhino.DocObjects.MeshObject.SetMesh(Rhino.Geometry.Mesh)
Only for developers who are defining custom subclasses of MeshObject.
Directly sets the internal mesh geometry for this object.  Note that
this function does not work with Rhino's "undo".
mesh:
Returns:
The old mesh geometry that was set for this object
Remarks:
Note that this function does not work with Rhino's "undo".  The typical
approach for adjusting the mesh geometry is to modify the object that you
get when you call the MeshGeometry property and then call CommitChanges.

Rhino.DocObjects.MeshObject.DuplicateMeshGeometry
Since: 5.0

Rhino.DocObjects.MeshObject.CheckMeshes(System.Collections.Generic.IEnumerable{Rhino.DocObjects.MeshObject},Rhino.FileIO.TextLog,Rhino.Geometry.MeshCheckParameters@)
Examines mesh objects and logs a description of what it finds right or wrong.
The various properties the function checks for are described in MeshCheckParameters.
meshObjects: A collection of mesh objects.
textLog: The text log.
parameters: The mesh checking parameter and results.
Returns: true if successful, false otherwise.
Since: 7.0