Rhino.Runtime.RhinoAccounts.IOAuth2Token
Represents an OAuth2 Token that can be used for authorization purposes.

Rhino.Runtime.RhinoAccounts.IOAuth2Token.Exp
The expiration of the token. Expired tokens will be considered invalid by the Rhino Accounts server.
Remarks: An OAuth2 Token can be invalidated at any time even if it has not expired.
Since: 7.0

Rhino.Runtime.RhinoAccounts.IOAuth2Token.Scope
The scope of the token.
Since: 7.0

Rhino.Runtime.RhinoAccounts.IOAuth2Token.RawToken
The raw token that can be passed to various servers for authorization.
Since: 7.0

Rhino.Runtime.RhinoAccounts.IOAuth2Token.IsExpired
true if the token is expired; false otherwise.
Since: 7.0