Rhino.Render.Decal
Represents a decal, or a picture that can be moved on an object.

Rhino.Render.Decal.Dispose
Since: 5.10

Rhino.Render.Decal.Dispose(System.Boolean)
Since: 5.10

Rhino.Render.Decal.Create(Rhino.Render.DecalCreateParams)
Since: 5.10

Rhino.Render.Decal.CRC
The decal CRC identifies a decal by its state. Multiple decals which would be
exactly the same would have the same CRC and are culled from the system.
If you store this value with the intention of using it to find the decal again
later, you must update your stored value whenever the decal state changes.
You can detect when a decal changes by watching for the OnUserDataTransformed event.
Since: 6.0

Rhino.Render.Decal.TextureInstanceId
Gets the texture ID for this decal.
Since: 5.10

Rhino.Render.Decal.TextureRenderCRC(Rhino.Render.TextureRenderHashFlags)
This method is deprecated in favor of TextureRenderHash below.
Since: 7.0
8.0

Rhino.Render.Decal.TextureRenderCRC(Rhino.Render.TextureRenderHashFlags,Rhino.Render.LinearWorkflow)
This method is deprecated in favor of TextureRenderHash below.
Since: 7.0
8.0

Rhino.Render.Decal.TextureRenderHash(Rhino.Render.CrcRenderHashFlags)
Get the texture render hash for the referenced texture using the specified CrcRenderHashFlags.
Since: 8.0
8.5

Rhino.Render.Decal.TextureRenderHash(Rhino.Render.CrcRenderHashFlags,Rhino.Render.LinearWorkflow)
Get the texture render hash for the referenced texture using the specified CrcRenderHashFlags
and linear workflow.
Since: 8.0
8.5

Rhino.Render.Decal.DecalMapping
Gets the decal's mapping.
Since: 5.10
8.0

Rhino.Render.Decal.Mapping
Gets the decal's mapping.
Since: 8.0

Rhino.Render.Decal.DecalProjection
Gets the decal's projection. Used only when mapping is planar.
Since: 5.10
8.0

Rhino.Render.Decal.Projection
Gets the decal's projection. Used only when mapping is planar.
Since: 8.0

Rhino.Render.Decal.MapToInside
Used only when mapping is cylindrical or spherical.
true if texture is mapped to inside of sphere or cylinder, else \e false.
Since: 5.10

Rhino.Render.Decal.Transparency
Gets the decal's transparency in the range 0 to 1.
Since: 5.10

Rhino.Render.Decal.IsVisible
Gets the decal's visibility.
Since: 8.18

Rhino.Render.Decal.Origin
Gets the origin of the decal in world space.
Since: 5.10

Rhino.Render.Decal.VectorUp
For cylindrical and spherical mapping, the vector is unitized.
Returns: The 'up' vector of the decal. For planar mapping the length of the vector is relevant.
Since: 5.10

Rhino.Render.Decal.VectorAcross
Gets the vector across. For cylindrical and spherical mapping, the vector is unitized.
The 'across' vector of the decal. For planar mapping the length of the vector is relevant.
Since: 5.10

Rhino.Render.Decal.Height
Gets the height of the decal. Only used when mapping is cylindrical.
Since: 5.10

Rhino.Render.Decal.Radius
Gets the radius of the decal. Only used when mapping is cylindrical or spherical.
Since: 5.10

Rhino.Render.Decal.StartLatitude
Gets the start angle of the decal's arc of latitude or 'horizontal sweep'. This is actually a LONGITUDINAL angle. Only used when mapping is cylindrical or spherical.
This is deprecated in favor of HorzSweep().
Since: 5.10

Rhino.Render.Decal.EndLatitude
Gets the end angle of the decal's arc of latitude or 'horizontal sweep'. This is actually a LONGITUDINAL angle. Only used when mapping is cylindrical or spherical.
This is deprecated in favor of HorzSweep().
Since: 5.10

Rhino.Render.Decal.StartLongitude
Gets the start angle of the decal's arc of longitude or 'vertical sweep'. This is actually a LATITUDINAL angle. Only used when mapping is spherical.
This is deprecated in favor of VertSweep().
Since: 5.10

Rhino.Render.Decal.EndLongitude
Gets the end angle of the decal's arc of longitude or 'vertical sweep'. This is actually a LATITUDINAL angle. Only used when mapping is spherical.
This is deprecated in favor of VertSweep().
Since: 5.10

Rhino.Render.Decal.HorzSweep(System.Double@,System.Double@)
Gets the angles of the decal's arc of 'horizontal sweep'. Replaces StartLatitude and EndLatitude.
Since: 8.0

Rhino.Render.Decal.VertSweep(System.Double@,System.Double@)
Gets the angles of the decal's arc of 'vertical sweep'. Replaces StartLongitude and EndLongitude.
Since: 8.0

Rhino.Render.Decal.UVBounds(System.Double@,System.Double@,System.Double@,System.Double@)
The UV bounds of the decal. Only used when mapping is UV.
Since: 5.10

Rhino.Render.Decal.GetUVBounds(System.Double@,System.Double@,System.Double@,System.Double@)
The UV bounds of the decal. Only used when mapping is UV.
Since: 8.18

Rhino.Render.Decal.GetTextureMapping
The TextureMapping of the decal.
Since: 7.0

Rhino.Render.Decal.CustomData(System.Guid)
Gets decal custom data for a specified renderer. See Rhino.Plugins.RenderPlugIn.ShowDecalProperties.
Returns: A list of name-value pairs for the custom data properties. If there is no
custom data on the decal for the specified renderer, the list will be empty.
Since: 8.0

Rhino.Render.Decal.CustomData
Gets decal custom data for the current renderer. See Rhino.Plugins.RenderPlugIn.ShowDecalProperties.
Returns: A list of name-value pairs for the custom data properties. If there is no
custom data on the decal for the current renderer, the list will be empty.
Since: 6.0

Rhino.Render.Decal.TryGetColor(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Display.Color4f@,Rhino.Geometry.Point2d@)
Blend a color with the decal color at a given point. Please note that this function is very slow
so you should only use it if you're not overly concerned about performance.
Also please note that this function is actually a 'blend' operation, not a true 'get' operation
and is sensitive to the value passed into the colInOut parameter. The alpha value of colInOut
is used as the blend amount where 0 means 'all decal RGB' and 1 means 'all colInOut RGB'.
If you want to simply GET the decal color, you must pass 0 for colInOut alpha.
point: The point in space or, if the decal is uv-mapped, the uv-coordinate of that point.
normal: The face normal of the given point.
colInOut: Accepts the color to blend the decal color to and returns the blended color.
See the notes above for details.
uvOut: Returns the (u,v) on the texture that the color was read from.
Returns: true if the given point hits the decal, else false.
Since: 5.10

Rhino.Render.Decal.ConstPointer
Since: 5.10
Returns the raw const ON_Decal pointer.

Rhino.Render.Decal.NonConstPointer
Since: 5.10
Returns the raw non-const ON_Decal pointer.