Rhino.Collections.RhinoList`1
Represents a list of generic data. This class is similar to System.Collections.Generic.List(T)
but exposes a few more methods.

Rhino.Collections.RhinoList`1.m_items
Internal array of items. The array will contain trailing invalid items if Capacity > Count.
WARNING! Do not store a reference to this array anywhere! The List class may decide to replace
the internal array with another one.

Rhino.Collections.RhinoList`1.m_size
The number of "valid" elements in m_items (same as m_count in ON_SimpleArray)

Rhino.Collections.RhinoList`1.m_version
The version counter is incremented whenever a change is made to the list.

Rhino.Collections.RhinoList`1.#ctor
Initializes a new, empty list.

Rhino.Collections.RhinoList`1.#ctor(System.Int32)
Initializes an empty list with a certain capacity.
initialCapacity: Number of items this list can store without resizing.

Rhino.Collections.RhinoList`1.#ctor(System.Int32,`0)
Initializes a new list with a specified amount of values.
amount: Number of values to add to this list. Must be equal to or larger than zero.
defaultValue: Value to add, for reference types,
the same item will be added over and over again.

Rhino.Collections.RhinoList`1.#ctor(System.Collections.Generic.IEnumerable{`0})
Initializes this list as a shallow duplicate of another list, array or any other enumerable set of T.
collection: Collection of items to duplicate.

Rhino.Collections.RhinoList`1.#ctor(Rhino.Collections.RhinoList{`0})
Initializes an new list by shallow duplicating another list.
list: List to mimic.

Rhino.Collections.RhinoList`1.ToArray
Constructs an array that contains all items in this list.
Returns: An array containing all items in this list.

Rhino.Collections.RhinoList`1.TrimExcess
Sets the capacity to the actual number of elements in the List,
if that number is less than a threshold value.
Remarks: This function differs from the DotNET implementation of List<T>
since that one only trims the excess if the excess exceeds 10% of the list length.

Rhino.Collections.RhinoList`1.Capacity
Gets or sets the total number of elements the internal data structure can hold without resizing.

Rhino.Collections.RhinoList`1.Count
Gets the number of elements actually contained in the List.

Rhino.Collections.RhinoList`1.NullCount
Gets the number of null references (Nothing in Visual Basic) in this list.
If T is a ValueType, this property always return zero.

Rhino.Collections.RhinoList`1.Item(System.Int32)
Gets or sets the element at the specified index.
index: The zero-based index of the element to get or set.
Returns: The element at the specified index.

Rhino.Collections.RhinoList`1.System#Collections#IList#Item(System.Int32)
Gets or sets the element at the specified index.
index: The zero-based index of the element to get or set.
Returns: The element at the specified index.

Rhino.Collections.RhinoList`1.First
Gets or sets the first item in the list. This is synonymous to calling List[0].

Rhino.Collections.RhinoList`1.Last
Gets or sets the last item in the list. This is synonymous to calling List[Count-1].

Rhino.Collections.RhinoList`1.RemapIndex(System.Int32)
Remap an index in the infinite range onto the List index range.
index: Index to remap.
Returns: Remapped index.

Rhino.Collections.RhinoList`1.System#Collections#IList#IsReadOnly
When implemented by a class, gets a value indicating whether the IList is read-only.
RhinoList is never ReadOnly.

Rhino.Collections.RhinoList`1.System#Collections#IList#IsFixedSize
When implemented by a class, gets a value indicating whether the IList has a fixed size.
RhinoList is never fixed.

Rhino.Collections.RhinoList`1.System#Collections#Generic#ICollection{T}#IsReadOnly
When implemented by a class, gets a value indicating whether the IList is read-only.
RhinoList is never ReadOnly.

Rhino.Collections.RhinoList`1.System#Collections#ICollection#IsSynchronized
When implemented by a class, gets a value indicating whether access to the ICollection is synchronized (thread-safe).
ON_List is never Synchronized.

Rhino.Collections.RhinoList`1.System#Collections#ICollection#SyncRoot
Gets an object that can be used to synchronize access to the ICollection.

Rhino.Collections.RhinoList`1.Clear
Removes all elements from the List.

Rhino.Collections.RhinoList`1.System#Collections#IList#Add(System.Object)
Adds an item to the IList.
item: The Object to add to the IList.
Returns: The position into which the new element was inserted.

Rhino.Collections.RhinoList`1.Add(`0)
Adds an object to the end of the List.
item: Item to append.

Rhino.Collections.RhinoList`1.AddRange(System.Collections.Generic.IEnumerable{`0})
Adds the elements of the specified collection to the end of the List.
collection: The collection whose elements should be added to the end of the List.
The collection itself cannot be a null reference (Nothing in Visual Basic),
but it can contain elements that are a null reference (Nothing in Visual Basic),
if type T is a reference type.

Rhino.Collections.RhinoList`1.AddRange(System.Collections.IEnumerable)
Adds the elements of the specified collection to the end of the List.
collection: The collection whose elements should be added to the end of the List.
The collection itself cannot be a null reference (Nothing in Visual Basic),
but it can contain elements that are a null reference (Nothing in Visual Basic).
Objects in collection which cannot be represented as T will throw exceptions.

Rhino.Collections.RhinoList`1.System#Collections#IList#Insert(System.Int32,System.Object)
Inserts an element into the List at the specified index.
index: The zero-based index at which item should be inserted.
item: The object to insert. The value can be a null reference
(Nothing in Visual Basic) for reference types.

Rhino.Collections.RhinoList`1.Insert(System.Int32,`0)
Inserts an element into the List at the specified index.
index: The zero-based index at which item should be inserted.
item: The object to insert. The value can be a null reference
(Nothing in Visual Basic) for reference types.

Rhino.Collections.RhinoList`1.InsertRange(System.Int32,System.Collections.Generic.IEnumerable{`0})
Inserts the elements of a collection into the List at the specified index.
index: The zero-based index at which the new elements should be inserted.
collection: The collection whose elements should be inserted into the List.
The collection itself cannot be a null reference (Nothing in Visual Basic),
but it can contain elements that are a null reference (Nothing in Visual Basic),
if type T is a reference type.

Rhino.Collections.RhinoList`1.System#Collections#IList#Remove(System.Object)
Removes the first occurrence of a specific object from the List.
item: The object to remove from the List.
The value can be a null reference (Nothing in Visual Basic) for reference types.

Rhino.Collections.RhinoList`1.Remove(`0)
Removes the first occurrence of a specific object from the List.
item: The object to remove from the List.
The value can be a null reference (Nothing in Visual Basic) for reference types.
Returns: true if item is successfully removed; otherwise, false.
This method also returns false if item was not found in the List.

Rhino.Collections.RhinoList`1.RemoveAll(System.Predicate{`0})
Removes the all the elements that match the conditions defined by the specified predicate.
match: The Predicate(T) delegate that defines the conditions of the elements to remove.
Returns: The number of elements removed from the List.

Rhino.Collections.RhinoList`1.RemoveNulls
Removes all elements from the List that are null references (Nothing in Visual Basic).
This function will not do anything if T is not a Reference type.
Returns: The number of nulls removed from the List.

Rhino.Collections.RhinoList`1.RemoveAt(System.Int32)
Removes the element at the specified index of the List.
index: The zero-based index of the element to remove.

Rhino.Collections.RhinoList`1.RemoveRange(System.Int32,System.Int32)
Removes a range of elements from the List.
index: The zero-based starting index of the range of elements to remove.
count: The number of elements to remove.

Rhino.Collections.RhinoList`1.GetRange(System.Int32,System.Int32)
Constructs a shallow copy of a range of elements in the source List.
index: The zero-based List index at which the range starts.
count: The number of elements in the range.
Returns: A shallow copy of a range of elements in the source List.

Rhino.Collections.RhinoList`1.System#Collections#IList#IndexOf(System.Object)
Searches for the specified object and returns the zero-based index of the
first occurrence within the entire List.
item: The object to locate in the List.
The value can be a null reference (Nothing in Visual Basic)
for reference types.
Returns: The zero-based index of the first occurrence of item within
the entire List, if found; otherwise, -1.

Rhino.Collections.RhinoList`1.IndexOf(`0)
Searches for the specified object and returns the zero-based index of the
first occurrence within the entire List.
item: The object to locate in the List.
The value can be a null reference (Nothing in Visual Basic)
for reference types.
Returns: The zero-based index of the first occurrence of item within
the entire List, if found; otherwise, -1.

Rhino.Collections.RhinoList`1.IndexOf(`0,System.Int32)
Searches for the specified object and returns the zero-based index of
the first occurrence within the range of elements in the List that
extends from the specified index to the last element.
item: The object to locate in the List.
The value can be a null reference (Nothing in Visual Basic)
for reference types.
index: The zero-based starting index of the search.
Returns: The zero-based index of the first occurrence of item within
the entire List, if found; otherwise, -1.

Rhino.Collections.RhinoList`1.IndexOf(`0,System.Int32,System.Int32)
Searches for the specified object and returns the zero-based index of the first
occurrence within the range of elements in the List that starts at the specified
index and contains the specified number of elements.
item: The object to locate in the List.
The value can be a null reference (Nothing in Visual Basic)
for reference types.
index: The zero-based starting index of the search.
count: The number of elements in the section to search.
Returns: The zero-based index of the first occurrence of item within
the entire List, if found; otherwise, -1.

Rhino.Collections.RhinoList`1.LastIndexOf(`0)
Searches for the specified object and returns the zero-based
index of the last occurrence within the entire List.
item: The object to locate in the List.
The value can be a null reference (Nothing in Visual Basic) for reference types.
Returns: The zero-based index of the last occurrence of item within
the entire the List, if found; otherwise, -1.

Rhino.Collections.RhinoList`1.LastIndexOf(`0,System.Int32)
Searches for the specified object and returns the zero-based index
of the last occurrence within the range of elements in the List
that extends from the first element to the specified index.
item: The object to locate in the List.
The value can be a null reference (Nothing in Visual Basic) for reference types.
index: The zero-based starting index of the backward search.
Returns: The zero-based index of the last occurrence of item within
the entire the List, if found; otherwise, -1.

Rhino.Collections.RhinoList`1.LastIndexOf(`0,System.Int32,System.Int32)
Searches for the specified object and returns the zero-based index of the
last occurrence within the range of elements in the List that contains
the specified number of elements and ends at the specified index.
item: The object to locate in the List.
The value can be a null reference (Nothing in Visual Basic) for reference types.
index: The zero-based starting index of the backward search.
count: The number of elements in the section to search.
Returns: The zero-based index of the last occurrence of item within
the entire the List, if found; otherwise, -1.

Rhino.Collections.RhinoList`1.BinarySearch(`0)
Searches the entire sorted List for an element using the default comparer
and returns the zero-based index of the element.
item: The object to locate. The value can be a null reference
(Nothing in Visual Basic) for reference types.
Returns: The zero-based index of item in the sorted List, if item is found;
otherwise, a negative number that is the bitwise complement of the index
of the next element that is larger than item or, if there is no larger element,
the bitwise complement of Count.

Rhino.Collections.RhinoList`1.BinarySearch(`0,System.Collections.Generic.IComparer{`0})
Searches the entire sorted List for an element using the specified
comparer and returns the zero-based index of the element.
item: The object to locate. The value can be a null reference
(Nothing in Visual Basic) for reference types.
comparer: The IComparer(T) implementation to use when comparing elements.
Or a null reference (Nothing in Visual Basic) to use the default comparer
Comparer(T)::Default.
Returns: The zero-based index of item in the sorted List, if item is found;
otherwise, a negative number that is the bitwise complement of the index
of the next element that is larger than item or, if there is no larger element,
the bitwise complement of Count.

Rhino.Collections.RhinoList`1.BinarySearch(System.Int32,System.Int32,`0,System.Collections.Generic.IComparer{`0})
Searches the entire sorted List for an element using the specified
comparer and returns the zero-based index of the element.
index: The zero-based starting index of the range to search.
count: The length of the range to search.
item: The object to locate. The value can be a null reference
(Nothing in Visual Basic) for reference types.
comparer: The IComparer(T) implementation to use when comparing elements.
Or a null reference (Nothing in Visual Basic) to use the default comparer
Comparer(T)::Default.
Returns: The zero-based index of item in the sorted List, if item is found;
otherwise, a negative number that is the bitwise complement of the index
of the next element that is larger than item or, if there is no larger element,
the bitwise complement of Count.

Rhino.Collections.RhinoList`1.Contains(`0)
Determines whether an element is in the List.
item: The object to locate in the List.
The value can be a null reference (Nothing in Visual Basic) for reference types.
Returns: true if item is found in the List; otherwise, false.

Rhino.Collections.RhinoList`1.System#Collections#IList#Contains(System.Object)
Determines whether an element is in the List.
item: The object to locate in the List.
The value can be a null reference (Nothing in Visual Basic) for reference types.
Returns: true if item is found in the List; otherwise, false.

Rhino.Collections.RhinoList`1.Exists(System.Predicate{`0})
Determines whether the List contains elements that match the
conditions defined by the specified predicate.
match: The Predicate(T) delegate that defines the conditions of the elements to search for.
Returns: true if the List contains one or more elements that match the
conditions defined by the specified predicate; otherwise, false.

Rhino.Collections.RhinoList`1.Find(System.Predicate{`0})
Searches for an element that matches the conditions defined by the
specified predicate, and returns the first occurrence within the entire List.
match: The Predicate(T) delegate that defines the conditions of the element to search for.
Returns: The first element that matches the conditions defined by the specified predicate,
if found; otherwise, the default value for type T.

Rhino.Collections.RhinoList`1.FindLast(System.Predicate{`0})
Searches for an element that matches the conditions defined by the
specified predicate, and returns the last occurrence within the entire List.
match: The Predicate(T) delegate that defines the conditions of the element to search for.
Returns: The last element that matches the conditions defined by the specified predicate,
if found; otherwise, the default value for type T.

Rhino.Collections.RhinoList`1.FindAll(System.Predicate{`0})
Retrieves all the elements that match the conditions defined by the specified predicate.
match: The Predicate(T) delegate that defines the conditions of the elements to search for.
Returns: A ON_List(T) containing all the elements that match the conditions
defined by the specified predicate, if found; otherwise, an empty ON_List(T).

Rhino.Collections.RhinoList`1.TrueForAll(System.Predicate{`0})
Determines whether every element in the List matches the conditions defined by the specified predicate.
match: The Predicate(T) delegate that defines the conditions to check against the elements.
Returns: true if every element in the List matches the conditions defined by
the specified predicate; otherwise, false. If the list has no elements, the return value is true.

Rhino.Collections.RhinoList`1.ForEach(System.Action{`0})
Performs the specified action on each element of the List.
action: The Action(T) delegate to perform on each element of the List.

Rhino.Collections.RhinoList`1.FindIndex(System.Predicate{`0})
Searches for an element that matches the conditions defined by the
specified predicate, and returns the zero-based index of the first
occurrence within the entire List.
match: The Predicate(T) delegate that defines the conditions of the element to search for.
Returns: The zero-based index of the first occurrence of an element that
matches the conditions defined by match, if found; otherwise, -1.

Rhino.Collections.RhinoList`1.FindIndex(System.Int32,System.Predicate{`0})
Searches for an element that matches the conditions defined by the
specified predicate, and returns the zero-based index of the first
occurrence within the entire List.
startIndex: The zero-based starting index of the search.
match: The Predicate(T) delegate that defines the conditions of the element to search for.
Returns: The zero-based index of the first occurrence of an element that
matches the conditions defined by match, if found; otherwise, -1.

Rhino.Collections.RhinoList`1.FindIndex(System.Int32,System.Int32,System.Predicate{`0})
Searches for an element that matches the conditions defined by the specified predicate,
and returns the zero-based index of the first occurrence within the range of elements
in the List that extends from the specified index to the last element.
startIndex: The zero-based starting index of the search.
count: The number of elements in the section to search.
match: The Predicate(T) delegate that defines the conditions of the element to search for.
Returns: The zero-based index of the first occurrence of an element that
matches the conditions defined by match, if found; otherwise, -1.

Rhino.Collections.RhinoList`1.FindLastIndex(System.Predicate{`0})
Searches for an element that matches the conditions defined by the
specified predicate, and returns the zero-based index of the last
occurrence within the entire List.
match: The Predicate(T) delegate that defines the conditions of the element to search for.
Returns: The zero-based index of the last occurrence of an element that matches
the conditions defined by match, if found; otherwise, -1.

Rhino.Collections.RhinoList`1.FindLastIndex(System.Int32,System.Predicate{`0})
Searches for an element that matches the conditions defined by the
specified predicate, and returns the zero-based index of the last
occurrence within the entire List.
startIndex: The zero-based starting index of the backward search.
match: The Predicate(T) delegate that defines the conditions of the element to search for.
Returns: The zero-based index of the last occurrence of an element that matches
the conditions defined by match, if found; otherwise, -1.

Rhino.Collections.RhinoList`1.FindLastIndex(System.Int32,System.Int32,System.Predicate{`0})
Searches for an element that matches the conditions defined by the
specified predicate, and returns the zero-based index of the last
occurrence within the entire List.
startIndex: The zero-based starting index of the backward search.
count: The number of elements in the section to search.
match: The Predicate(T) delegate that defines the conditions of the element to search for.
Returns: The zero-based index of the last occurrence of an element that matches
the conditions defined by match, if found; otherwise, -1.

Rhino.Collections.RhinoList`1.Sort
Sorts the elements in the entire List using the default comparer.

Rhino.Collections.RhinoList`1.Sort(System.Collections.Generic.IComparer{`0})
Sorts the elements in the entire list using the specified System.Comparison(T)
comparer: The IComparer(T) implementation to use when comparing elements,
or a null reference (Nothing in Visual Basic) to use the default comparer Comparer(T).Default.

Rhino.Collections.RhinoList`1.Sort(System.Comparison{`0})
Sorts the elements in the entire list using the specified comparer.
comparison: The System.Comparison(T) to use when comparing elements.

Rhino.Collections.RhinoList`1.Sort(System.Int32,System.Int32,System.Collections.Generic.IComparer{`0})
Sorts the elements in a range of elements in list using the specified comparer.
index: The zero-based starting index of the range to sort.
count: The length of the range to sort.
comparer: The IComparer(T) implementation to use when comparing
elements, or a null reference (Nothing in Visual Basic) to use the default
comparer Comparer(T).Default.

Rhino.Collections.RhinoList`1.Sort(System.Double[])
Sort this list based on a list of numeric keys of equal length.
The keys array will not be altered.
keys: Numeric keys to sort with.
Remarks: This function does not exist on the DotNET List class.
David thought it was a good idea.

Rhino.Collections.RhinoList`1.Sort(System.Int32[])
Sort this list based on a list of numeric keys of equal length.
The keys array will not be altered.
keys: Numeric keys to sort with.
Remarks: This function does not exist on the DotNET List class.
David thought it was a good idea.

Rhino.Collections.RhinoList`1.Reverse
Reverses the order of the elements in the entire List.

Rhino.Collections.RhinoList`1.Reverse(System.Int32,System.Int32)
Reverses the order of the elements in the specified range.
index: The zero-based starting index of the range to reverse.
count: The number of elements in the range to reverse.

Rhino.Collections.RhinoList`1.AsReadOnly
Constructs a read-only wrapper of this class.
Returns: A wrapper.

Rhino.Collections.RhinoList`1.ConvertAll``1(System.Converter{`0,``0})
Aggregates all results of a conversion function over this table into a new list.
The type returned by the function.
converter: A conversion function that can transform from T to TOutput.
Returns: The new list.

Rhino.Collections.RhinoList`1.CopyTo(`0[])
Copies the entire List to a compatible one-dimensional array,
starting at the beginning of the target array.
array: The one-dimensional Array that is the destination
of the elements copied from List. The Array must have zero-based indexing.

Rhino.Collections.RhinoList`1.CopyTo(`0[],System.Int32)
Copies the entire List to a compatible one-dimensional array,
starting at the specified index of the target array.
array: The one-dimensional Array that is the destination
of the elements copied from List. The Array must have zero-based indexing.
arrayIndex: The zero-based index in array at which copying begins.

Rhino.Collections.RhinoList`1.CopyTo(System.Int32,`0[],System.Int32,System.Int32)
Copies a range of elements from the List to a compatible one-dimensional array,
starting at the specified index of the target array.
index: The zero-based index in the source List at which copying begins.
array: The one-dimensional Array that is the destination of the elements
copied from List. The Array must have zero-based indexing.
arrayIndex: The zero-based index in array at which copying begins.
count: The number of elements to copy.

Rhino.Collections.RhinoList`1.System#Collections#ICollection#CopyTo(System.Array,System.Int32)
Copies the elements of the ICollection to an Array, starting at a particular Array index.
array: The one-dimensional Array that is the destination of the elements
copied from ICollection. The Array must have zero-based indexing.
arrayIndex: The zero-based index in array at which copying begins.

Rhino.Collections.RhinoList`1.Duplicate
Returns a shallow copy of this instance.
If the generic type is comprised of only value types (struct, enum, ptr), then the result will be a deep copy.
Returns: The duplicated list.

Rhino.Collections.RhinoList`1.GetEnumerator
Constructs an enumerator that is capable of iterating over all items in this list.
Returns: The new enumerator.