Rhino.Geometry.Arrowhead
Arrowhead used by annotation

Rhino.Geometry.Arrowhead.#ctor
Constructor
Since: 6.0

Rhino.Geometry.Arrowhead.#ctor(Rhino.DocObjects.DimensionStyle.ArrowType,System.Guid)
Constructor
arrowType:  type of this arrowhead
blockId:  Guid of the block used for user defined display
Since: 6.0

Rhino.Geometry.Arrowhead.BlockId
Id of block used for user-defined arrowhead
Since: 6.0

Rhino.Geometry.Arrowhead.ArrowType
Type of arrowhead used by annotation
Since: 6.0