Rhino.PlugIns.LicenseLease
LicenseLease represents a lease returned from the Cloud Zoo

Rhino.PlugIns.LicenseLease.Pointer
Managed pointer. Do not use.

Rhino.PlugIns.LicenseLease.#ctor(System.IntPtr)
Since: 6.0

Rhino.PlugIns.LicenseLease.#ctor(System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.DateTime,System.DateTime)
Since: 6.0

Rhino.PlugIns.LicenseLease.#ctor(System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.String,System.DateTime,System.DateTime,System.DateTime)
Since: 6.4

Rhino.PlugIns.LicenseLease.ProductId
The ID of the product that this lease is issued to
Since: 6.0

Rhino.PlugIns.LicenseLease.GroupName
Name of Rhino Accounts group that this lease came from
Since: 6.0

Rhino.PlugIns.LicenseLease.GroupId
ID of Rhino Accounts group that this lease came from
Since: 6.0

Rhino.PlugIns.LicenseLease.UserName
Name of Rhino Accounts user that was logged in when this lease was obtained
Since: 6.0

Rhino.PlugIns.LicenseLease.UserId
ID of Rhino Accounts user that was logged in when this lease was obtained
Since: 6.0

Rhino.PlugIns.LicenseLease.ProductTitle
Title of product that this lease is issued to. For example, "Rhino 6"
Since: 6.0

Rhino.PlugIns.LicenseLease.ProductVersion
Version of product that this lease is issued to. For example, "6.0"
Since: 6.0

Rhino.PlugIns.LicenseLease.ProductEdition
Edition of product that this lease is issued to. For example, "Commercial" or "Beta"
Since: 6.0

Rhino.PlugIns.LicenseLease.LeaseId
The ID of this lease.
Since: 6.0

Rhino.PlugIns.LicenseLease.IssuedAt
The date this lease was issued
Since: 6.0

Rhino.PlugIns.LicenseLease.Expiration
The date when this lease will expire
Since: 6.0

Rhino.PlugIns.LicenseLease.RenewableUntil
The date when the license in the cloud zoo entity will expire, if any
Since: 7.25