Rhino.FileIO.FileStlReadOptions
Options for reading a STL file

Rhino.FileIO.FileStlReadOptions.Weld
Since: 8.0

Rhino.FileIO.FileStlReadOptions.WeldAngle
Since: 8.0

Rhino.FileIO.FileStlReadOptions.SplitDisjointMeshes
Since: 8.0

Rhino.FileIO.FileStlReadOptions.STLModelUnits
Since: 8.0

Rhino.FileIO.FileStlReadOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0