Rhino.Render.RenderContent.MatchDataResult
Return values for MatchData function
Since: 5.7

Rhino.Render.RenderContent.MatchDataResult.None
None

Rhino.Render.RenderContent.MatchDataResult.Some
Some

Rhino.Render.RenderContent.MatchDataResult.All
All