Rhino.DocObjects.Tables.LayerTable.LayerType
Layer types created by Rhino.DocObjects.Tables.LayerTable.CreateLayer(Rhino.DocObjects.Layer,Rhino.DocObjects.Tables.LayerTable.LayerType,System.UInt32,System.UInt32).
Since: 8.6

Rhino.DocObjects.Tables.LayerTable.LayerType.NormalLayer
Normal ordinary layer.

Rhino.DocObjects.Tables.LayerTable.LayerType.LinkedInstanceDefinitionParentLayer
Linked instance definition "filename.3dm" parent layer of the instance definition's layer tree.

Rhino.DocObjects.Tables.LayerTable.LayerType.WorkSessionParentLayer
Worksession reference model "filename.3dm" parent layer of the reference model's layer tree.