Rhino.UI.Controls.UndoRecord
Undo Record

Rhino.UI.Controls.UndoRecord.#ctor(System.String,Rhino.UI.Controls.IRdkViewModel)
UndoRecord Constructor
description:
viewModel:
Returns: Return the undo record
Since: 6.0

Rhino.UI.Controls.UndoRecord.Dispose
UndoRecord Dispose
Since: 6.0

Rhino.UI.Controls.UndoRecord.Finalize
UndoRecord Destructor

Rhino.UI.Controls.UndoRecord.Dispose(System.Boolean)
UndoRecord Dispose