Rhino.Render.Fields.ByteArrayField
ByteArray field value class

Rhino.Render.Fields.ByteArrayField.#ctor(Rhino.Render.RenderContent,System.IntPtr)
Constructor
renderContent: RenderContent whose Fields owns this filed.
attachToPointer: Existing C++ pointer to attach to.

Rhino.Render.Fields.ByteArrayField.Value
Gets or sets the field value
Since: 5.1

Rhino.Render.Fields.ByteArrayField.ValueAsObject
Since: 5.7