Rhino.Render.ChangeQueue.MeshInstance
Representation of ChangeQueue MeshInstance

Rhino.Render.ChangeQueue.MeshInstance.ReceiveShadows
Return true if mesh instance should receive shadows
Since: 6.0

Rhino.Render.ChangeQueue.MeshInstance.CastShadows
Return true if mesh instance should cast shadows
Since: 6.0

Rhino.Render.ChangeQueue.MeshInstance.InstanceId
Get the instance identifier for this mesh instance.
Since: 6.0

Rhino.Render.ChangeQueue.MeshInstance.RootId
Get the Guid of the object that is at the root of the MeshInstance ancestry, or Guid.Empty if this has no root.
Since: 7.1

Rhino.Render.ChangeQueue.MeshInstance.ParentId
Get the Guid of the object that is at the parent of the MeshInstance ancestry, or Guid.Empty if there is no parent.
Since: 7.1

Rhino.Render.ChangeQueue.MeshInstance.MeshId
Get the mesh identifier for this mesh instance.
Since: 6.0

Rhino.Render.ChangeQueue.MeshInstance.GroupId
Get identifier that specifies the grouping of these mesh instances - usually based on the object that this originally comprised.
Since: 6.0

Rhino.Render.ChangeQueue.MeshInstance.MeshIndex
Get the mesh index for this mesh instance.
Since: 6.0

Rhino.Render.ChangeQueue.MeshInstance.MaterialId
The Material CRC / RenderHash
Since: 6.0

Rhino.Render.ChangeQueue.MeshInstance.RenderMaterial
RenderMaterial associated with mesh instance
Since: 6.0

Rhino.Render.ChangeQueue.MeshInstance.Transform
Transform for the MeshInstance
Since: 6.0

Rhino.Render.ChangeQueue.MeshInstance.Decals
Read-only access to the decals for this MeshInstance if any. Null if no object
attributes exist for this mesh instance.
Since: 7.0

Rhino.Render.ChangeQueue.MeshInstance.ObjectAttributes
The ObjectAttributes associated with a MeshInstance
Since: 8.0

Rhino.Render.ChangeQueue.MeshInstance.OcsTransform
OCS Transform for the MeshInstance - this is the Object Coordinate System texture mapping transformation set in the texture mapping properties dialog.
(identity means no OCS, potentially just simple WCS/WCS Box)
Since: 7.0

Rhino.Render.ChangeQueue.MeshInstance.Ancestry
Returns a the ancestry information for this object.  Note well - the ancestry records contain complete
copies of the object attributes for each level of the block hierarchy.  Please do not be tempted to
use the ModelObjectId of the instance objects to look them up in the document - the document may have changed since the
change queue entries were added.
Since: 8.2