Rhino.FileIO.FilePly
Support for ply file format

Rhino.FileIO.FilePly.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FilePlyWriteOptions)
Write a ply file based on the contents of a RhinoDoc
filename:
doc:
options:
Returns:
Since: 7.0

Rhino.FileIO.FilePly.Read(System.String,Rhino.RhinoDoc,Rhino.FileIO.FilePlyReadOptions)
Read a PLY file into a RhinoDoc
path: path to read a file from
doc: document to import geometry into
options: options used for importing the PLY file
Returns: true on success
Since: 8.0