Rhino.Geometry.Dimension
Base class for dimensions

Rhino.Geometry.Dimension.GetTextTransform(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.DimensionStyle,System.Double,System.Boolean)
Get the transform for this text object's text geometry
viewport: Viewport where text is being used
style: Dimension's DimensionStyle
textScale: Scale to apply to text
drawForward: Draw text front-facing
Since: 6.0

Rhino.Geometry.Dimension.UpdateDimensionText(Rhino.DocObjects.DimensionStyle,Rhino.UnitSystem)
Remakes dimension text geometry object and sets it on the dimension.
style: The dimension style.
units: The unit system.
Since: 7.34

Rhino.Geometry.Dimension.UseDefaultTextPoint
Since: 6.0

Rhino.Geometry.Dimension.TextPosition
Gets and sets the position of text on the plane.
Since: 6.0

Rhino.Geometry.Dimension.PlainUserText
Since: 6.0

Rhino.Geometry.Dimension.TextFormula
Since: 6.0

Rhino.Geometry.Dimension.TextRotation
Since: 6.0

Rhino.Geometry.Dimension.NumericValue
Gets the numeric value (or measurement), depending on geometry type.
LinearDimension: distance between arrow tips
RadialDimension: radius or diameter depending on type
AngularDimension: angle in radians
Since: 6.0

Rhino.Geometry.Dimension.DetailMeasured
Since: 6.0

Rhino.Geometry.Dimension.DistanceScale
Since: 6.0

Rhino.Geometry.Dimension.ForceArrowPosition
Since: 6.0

Rhino.Geometry.Dimension.ForceTextPosition
Since: 6.0

Rhino.Geometry.Dimension.ForceDimLine
Since: 6.20

Rhino.Geometry.Dimension.ArrowFit
Since: 6.20

Rhino.Geometry.Dimension.ForceDimensionLineBetweenExtensionLines
Since: 6.20

Rhino.Geometry.Dimension.TextFit
Since: 6.20

Rhino.Geometry.Dimension.TextOrientation
Since: 6.0

Rhino.Geometry.Dimension.TextLocation
Since: 6.0

Rhino.Geometry.Dimension.TextAngleType
Since: 6.0

Rhino.Geometry.Dimension.DimensionLineExtension
Since: 6.0

Rhino.Geometry.Dimension.ExtensionLineExtension
Since: 6.0

Rhino.Geometry.Dimension.ExtensionLineOffset
Since: 6.0

Rhino.Geometry.Dimension.FixedLengthExtensionOn
Since: 6.0

Rhino.Geometry.Dimension.FixedExtensionLength
Since: 6.0

Rhino.Geometry.Dimension.BaselineSpacing
Since: 6.0

Rhino.Geometry.Dimension.CentermarkSize
Since: 6.0

Rhino.Geometry.Dimension.CentermarkStyle
Since: 6.0

Rhino.Geometry.Dimension.SuppressExtension1
Since: 6.0

Rhino.Geometry.Dimension.SuppressExtension2
Since: 6.0

Rhino.Geometry.Dimension.ArrowheadType1
Since: 6.0

Rhino.Geometry.Dimension.ArrowheadType2
Since: 6.0

Rhino.Geometry.Dimension.ArrowSize
Since: 6.0

Rhino.Geometry.Dimension.ArrowBlockId1
Since: 6.0

Rhino.Geometry.Dimension.ArrowBlockId2
Since: 6.0

Rhino.Geometry.Dimension.LengthFactor
Since: 6.0

Rhino.Geometry.Dimension.LengthResolution
Since: 6.0

Rhino.Geometry.Dimension.LengthRoundoff
Since: 6.0

Rhino.Geometry.Dimension.Prefix
Since: 6.0

Rhino.Geometry.Dimension.Suffix
Since: 6.0

Rhino.Geometry.Dimension.ZeroSuppression
Since: 6.0

Rhino.Geometry.Dimension.AltUnitsDisplay
Since: 6.0

Rhino.Geometry.Dimension.AltLengthFactor
Since: 6.0

Rhino.Geometry.Dimension.AltLengthResolution
Since: 6.0

Rhino.Geometry.Dimension.AltLengthRoundoff
Since: 6.0

Rhino.Geometry.Dimension.AltPrefix
Since: 6.0

Rhino.Geometry.Dimension.AltSuffix
Since: 6.0

Rhino.Geometry.Dimension.AltZeroSuppression
Since: 6.0

Rhino.Geometry.Dimension.AlternateBelowLine
Since: 6.0

Rhino.Geometry.Dimension.ToleranceFormat
Since: 6.0

Rhino.Geometry.Dimension.ToleranceResolution
Since: 6.0

Rhino.Geometry.Dimension.AltToleranceResolution
Since: 6.0

Rhino.Geometry.Dimension.ToleranceUpperValue
Since: 6.0

Rhino.Geometry.Dimension.ToleranceLowerValue
Since: 6.0

Rhino.Geometry.Dimension.ToleranceHeightScale
Since: 6.0

Rhino.Geometry.Dimension.SetDimensionLengthDisplayWithZeroSuppressionReset(Rhino.DocObjects.DimensionStyle.LengthDisplay)
Since: 6.0

Rhino.Geometry.Dimension.SetAltDimensionLengthDisplayWithZeroSuppressionReset(Rhino.DocObjects.DimensionStyle.LengthDisplay)
Since: 6.0

Rhino.Geometry.Dimension.Explode
Explodes this dimension into its geometric components.
Returns:
An array of Curve and TextEntity objects. If the leader is using user-defined arrowheads, InstanceReferenceGeometry objects will be included.
Since: 8.0