Rhino.FileIO.FileStl
Support for writing STL file format

Rhino.FileIO.FileStl.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileStlWriteOptions)
Write a STL file based on the contents of a RhinoDoc
path: path to write a file to
doc: document to get geometry from
options: options used for generating the STL file
Returns: true on success
Since: 8.0

Rhino.FileIO.FileStl.Read(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileStlReadOptions)
Read a STL file into a RhinoDoc
path: path to read a file from
doc: document to import geometry into
options: options used for importing the STL file
Returns: true on success
Since: 8.0