Rhino.UI.Panels.FloatPanelMode
Used by the FloatPanel method to determine if the floating panel
should be shown or hidden.
Since: 6.2

Rhino.UI.Panels.FloatPanelMode.Show
Show the floating panel

Rhino.UI.Panels.FloatPanelMode.Hide
Hide the floating panel

Rhino.UI.Panels.FloatPanelMode.Toggle
Toggle the visibility state