Rhino.PersistentSettingsHooks.SetHooks
Call this method to create callback hooks used by unmanaged, core Rhino
to access the RhinoCommon PersistentSettings classes.

Rhino.PersistentSettingsHooks.GetPlugInPersistentSettingsPointerFunc(System.Guid,System.UInt32,System.Boolean)
If Create(plugInId) was called then the runtime settings associated
the plug-in are returned otherwise a new PlugInSettings is created
and its settings are returned.  Creating a new plug-in settings
class is used when reading settings in response to a settings file
saved event.
plugInId:
pointerId:
windowPositions:
Returns:

Rhino.PersistentSettingsHooks.InvokeSetingsSaved(System.Guid,System.Boolean,System.Boolean)
Invoke the OnSettingsSaved() call back on the main Rhino UI thread.
plugInId:
thisRhinoIsSaving:
dirty:
Will be true if the settings are in the to be written queue indicating that there is
an additional change that needs to be written.

Rhino.PersistentSettingsHooks.IntPtrToString(System.IntPtr)
Helper method to marshal an unmanaged wchar_t pointer
ptr:
Returns:

Rhino.PersistentSettingsHooks.IntPtrToStringArray(System.IntPtr,System.Int32,System.String[]@)
This method transforms an array of unmanaged character pointers
(pointed to by ptrToStringArray) into an array of managed strings.
ptrToStringArray:
Pointer to an array of unmanaged wchar_t pointers
count:
The total number of wchar_t* in ptrToStringArray
stringArray:
Recipient of the array of managed strings

Rhino.PersistentSettingsHooks.PlugInSettings(System.Guid)
Get the PlugInSettings associated with the given unmanaged plug-in
plugInId:
Returns:

Rhino.PersistentSettingsHooks.PersistentSettings(System.UInt32)
Get runtime settings object from dictionary, called by unmanaged code to
reference a managed object.
pointerId:
Returns:

Rhino.PersistentSettingsHooks.g_dictionary
Dictionary of unmanaged plug-in settings references, these get created
the first time CRhinoPlugIn::Settings() is called.

Rhino.PersistentSettingsHooks.g_persistent_settings
Dictionary of PersistentSettings references associated with unmanaged
objects.  Unmanaged object destructor's are responsible for calling the
ReleasePlugInSettingsPointerFunc to remove items from this dictionary.
This is used to manage references to child nodes and when reading
settings XML files.

Rhino.PersistentSettingsHooks.g_next_persistent_settings_id
Runtime Id used by the g_persistent_settings dictionary

Rhino.PersistentSettingsHooks.g_plug_in_settings_read
Used to manage runtime reading of plug-in settings which will happen
when a settings XML file is modified and a SettingsSaved event is
raised.  Unmanaged object destructor's are responsible for calling the
ReleasePlugInSettingsPointerFunc to remove items from this dictionary.

Rhino.PersistentSettingsHooks.g_next_plug_in_settings_read_id
Runtime Id used by the g_plug_in_settings_read dictionary