Rhino.Render.Skylight.#ctor
Create a utility object not associated with any document
Since: 6.0

Rhino.Render.Skylight.#ctor(Rhino.Render.Skylight)
Create a utility object not associated with any document from another object
src:
Since: 6.0

Rhino.Render.Skylight.Changed
This event is raised when a Skylight property value is changed.
Since: 6.0

Rhino.Render.Skylight.CopyFrom(Rhino.Render.FreeFloatingBase)
Since: 6.0

Rhino.Render.Skylight.Dispose
Since: 8.0

Rhino.Render.Skylight.Enabled
Since: 6.0

Rhino.Render.Skylight.ShadowIntensity
ShadowIntensity is currently unused.
Since: 6.0

Rhino.Render.Skylight.CustomEnvironmentOn
Since: 6.0
8.0

Rhino.Render.Skylight.CustomEnvironment
Since: 6.0
8.0