Rhino.DocObjects.DimensionStyle.MaskType
Text mask drawn with background color or explicit color

Rhino.DocObjects.DimensionStyle.MaskType.BackgroundColor
Text mask drawn with background color

Rhino.DocObjects.DimensionStyle.MaskType.MaskColor
Text mask drawn with explicit color