Rhino.Commands.TransformCommand.SelectObjects(System.String,Rhino.Collections.TransformObjectList)
Selects objects within the command.
prompt: The selection prompt.
list: A list of objects to transform. This is a special list type.
Returns: The operation result.

Rhino.Commands.TransformCommand.SelectObjects(System.String,Rhino.DocObjects.ObjectType,Rhino.Collections.TransformObjectList)
Selects objects within the command.
prompt: The selection prompt.
filter: Geometry filter to limit selection. Use function above if you do not need specific types.
list: A list of objects to transform. This is a special list type.
Returns: The operation result.

Rhino.Commands.TransformCommand.ResetGrips(Rhino.Collections.TransformObjectList)
Sets dynamic grip locations back to starting grip locations. This makes things
like the Copy command work when grips are "copied".
list: A list of object to transform. This is a special list type.