Rhino.Render.RenderSettings
Contains settings used in rendering.

Rhino.Render.RenderSettings.#ctor(Rhino.Render.RenderSettings)
Initialize new instance of the RenderSettings class.
source: If not null, settings are copied from source.
Since: 6.0

Rhino.Render.RenderSettings.#ctor
Initialize a new instance of the RenderSettings class.
Since: 5.0

Rhino.Render.RenderSettings.Duplicate
Makes a free-floating copy of the object.
Since: 8.0

Rhino.Render.RenderSettings.AmbientLight
Gets or sets the ambient light color used in rendering.
Since: 5.0

Rhino.Render.RenderSettings.BackgroundColorTop
Gets or sets the background top color used in rendering.
Sets also the background color if a solid background color is set.
Since: 5.0

Rhino.Render.RenderSettings.BackgroundColorBottom
Gets or sets the background bottom color used in rendering.
Since: 5.0

Rhino.Render.RenderSettings.UseHiddenLights
Gets or sets a value indicating whether to render using lights that are on layers that are off.
Since: 5.0

Rhino.Render.RenderSettings.DepthCue
Gets or sets a value indicating whether to render using depth cues.
These are clues to help the perception of position and orientation of objects in the image.
Since: 5.0

Rhino.Render.RenderSettings.FlatShade
Gets or sets a value indicating whether to render using flat shading.
Since: 5.0

Rhino.Render.RenderSettings.RenderBackfaces
Gets or sets a value indicating whether to render back faces.
Since: 5.0

Rhino.Render.RenderSettings.RenderPoints
Gets or sets a value indicating whether to instruct the rendering engine to show points.
Since: 5.0

Rhino.Render.RenderSettings.RenderCurves
Gets or sets a value indicating whether to instruct the rendering engine to show curves.
Since: 5.0

Rhino.Render.RenderSettings.RenderIsoparams
Gets or sets a value indicating whether to instruct the rendering engine to show isocurves.
Since: 5.0

Rhino.Render.RenderSettings.RenderMeshEdges
Gets or sets a value indicating whether to instruct the rendering engine to show mesh edges.
Since: 5.0

Rhino.Render.RenderSettings.RenderAnnotations
Gets or sets a value indicating whether to instruct the rendering engine to show annotations,
such as linear dimensions or angular dimensions.
Since: 5.0

Rhino.Render.RenderSettings.AntialiasLevel
Gets or sets anti-alias level, used for render quality
Since: 5.0

Rhino.Render.RenderSettings.UseViewportSize
Gets or sets a value indicating whether to use the resolution of the
viewport being rendered or ImageSize when rendering
Since: 5.0

Rhino.Render.RenderSettings.ScaleBackgroundToFit
Gets or sets a value indicating whether to scale the wallpaper in the
background or not. This is meaningful only if the viewport has a wallpaper
and render settings are set to render Wallpaper into the background.
Since: 6.0

Rhino.Render.RenderSettings.TransparentBackground
Gets or sets whether rendering should be done with transparent background.
Since: 6.0

Rhino.Render.RenderSettings.ImageUnitSystem
unit system to use when converting image pixel size and DPI information
into a print size.  Default = inches
Since: 5.11

Rhino.Render.RenderSettings.ImageDpi
Number of dots/inch (dots=pixels) to use when printing and saving
bitmaps. The default is 72.0 dots/inch.
Since: 5.11

Rhino.Render.RenderSettings.ImageSize
Gets or sets a value indicating the size of the rendering result if
UseViewportSize is set to false.  If UseViewportSize is set to true,
then this value is ignored.
Since: 5.0

Rhino.Render.RenderSettings.ShadowmapLevel
0=none, 1=normal, 2=best.
Since: 5.0

Rhino.Render.RenderSettings.BackgroundStyle
How the viewport's background should be filled.
Since: 5.0

Rhino.Render.RenderSettings.LinearWorkflow
If this object is associated with a document, this gets the document linear workflow.
If this object is associated with a File3dm, this gets the File3dm's linear workflow.
Otherwise it gets a 'free-floating' linear workflow object.
Since: 6.0

Rhino.Render.RenderSettings.Dithering
If this object is associated with a document, this gets the document dithering.
If this object is associated with a File3dm, this gets the File3dm's dithering.
Otherwise it gets a 'free-floating' dithering object.
Since: 6.0

Rhino.Render.RenderSettings.RenderChannels
If this object is associated with a document, this gets the document render channels.
Otherwise it gets a 'free-floating' render channels object.
Since: 7.0

Rhino.Render.RenderSettings.GroundPlane
If this object is associated with a document, this gets the document ground plane.
If this object is associated with a File3dm, this gets the File3dm's ground plane.
Otherwise it gets a 'free-floating' ground plane object.
Since: 8.0

Rhino.Render.RenderSettings.SafeFrame
If this object is associated with a document, this gets the document safe-frame.
If this object is associated with a File3dm, this gets the File3dm's safe-frame.
Otherwise it gets a 'free-floating' safe-frame object.
Since: 8.0

Rhino.Render.RenderSettings.Skylight
If this object is associated with a document, this gets the document skylight.
If this object is associated with a File3dm, this gets the File3dm's skylight.
Otherwise it gets a 'free-floating' skylight object.
Since: 8.0

Rhino.Render.RenderSettings.Sun
If this object is associated with a document, this gets the document sun.
If this object is associated with a File3dm, this gets the File3dm's sun.
Otherwise it gets a 'free-floating' sun object.
Since: 8.0

Rhino.Render.RenderSettings.RenderEnvironmentOverride(Rhino.Render.RenderSettings.EnvironmentUsage)
For usage background, this checks if the background style is set to 'Environment'.
For reflection and skylighting, it checks if the relevant custom override is enabled.
Since: 8.0

Rhino.Render.RenderSettings.SetRenderEnvironmentOverride(Rhino.Render.RenderSettings.EnvironmentUsage,System.Boolean)
Set the given environment override on/off. Only works for usage Reflection and Skylighting.
Since: 8.0

Rhino.Render.RenderSettings.RenderEnvironmentId(Rhino.Render.RenderSettings.EnvironmentUsage,Rhino.Render.RenderSettings.EnvironmentPurpose)
Get the id of the render environment for a particular usage.
If usage is Background and the background mode is set to 'Solid Color' or 'Gradient'
(i.e., not 'Environment'), then Guid.Empty will be returned.
Since: 8.0

Rhino.Render.RenderSettings.SetRenderEnvironmentId(Rhino.Render.RenderSettings.EnvironmentUsage,System.Guid)
Set the id of the render environment for a particular usage.
Passing Guid.Empty for usage Skylighting or Reflection will turn the override for that usage off.
Since: 8.0

Rhino.Render.RenderSettings.RenderEnvironment(Rhino.Render.RenderSettings.EnvironmentUsage,Rhino.Render.RenderSettings.EnvironmentPurpose)
Get the render environment for a particular usage. Only works if this render settings is in a document.
If usage is Background and the background mode is set to 'Solid Color' or 'Gradient'
(i.e., not 'Environment'), then null will be returned.
Since: 8.0

Rhino.Render.RenderSettings.SetRenderEnvironment(Rhino.Render.RenderSettings.EnvironmentUsage,Rhino.Render.RenderEnvironment)
Set the render environment for a particular usage.
Passing null for usage Skylighting or Reflection will turn the override for that usage off.
Since: 8.0

Rhino.Render.RenderSettings.PostEffects
If this object is associated with a document, this gets the document post effect data collection.
If this object is associated with a File3dm, this gets the File3dm's post effect data collection.
Otherwise it gets a 'free-floating' post effect data collection object.
Since: 8.0

Rhino.Render.RenderSettings.NamedView
Get or set the given named view
Since: 6.1

Rhino.Render.RenderSettings.Snapshot
Set or get the given snapshot view
Since: 6.1

Rhino.Render.RenderSettings.SpecificViewport
Set or get the given specific viewport
Since: 6.1

Rhino.Render.RenderSettings.RenderSource
Gets or sets the render source Rhino.Render.RenderSettings.RenderingSources enumeration.
Since: 6.1