Rhino.Geometry.AnnotationType
ON::AnnotationType identifies the type of an annotation object derived from ON_Annotation.

Rhino.Geometry.AnnotationType.Unset
Not a valid annotation type.

Rhino.Geometry.AnnotationType.Aligned
Linear distance between two points with dimension line parallel to the dimensioned points.

Rhino.Geometry.AnnotationType.Angular
Angle between two lines.

Rhino.Geometry.AnnotationType.Diameter
Arc or circle diameter dimension.

Rhino.Geometry.AnnotationType.Radius
Arc or circle radius dimension.

Rhino.Geometry.AnnotationType.Rotated
Linear distance between two points with dimension line horizontal, vertical or rotated by a specified amount.

Rhino.Geometry.AnnotationType.Ordinate
Ordinate dimension. Typically used to document an offset distance between the center of a circle and a reference point.

Rhino.Geometry.AnnotationType.ArcLen
Arc length of a curve.

Rhino.Geometry.AnnotationType.CenterMark
Center mark dimension. Typically used to document the center of an arc or circle.

Rhino.Geometry.AnnotationType.Text
Text. Stand alone text with a wide variety of uses.

Rhino.Geometry.AnnotationType.Leader
Leader. Text and a curve with an arrow head.

Rhino.Geometry.AnnotationType.Angular3pt
Angular3pt. Angle defined by 3 points.