Rhino.ApplicationSettings.MiddleMouseMode
Defines enumerated constant values to define what happens when
either the middle mouse button on a three-button mouse is clicked or after pressing the wheel on a wheeled mouse.
Since: 5.0

Rhino.ApplicationSettings.MiddleMouseMode.PopupMenu
Pops up two-part menu at the cursor location.
You can list your favorite commands in the top section.
The bottom section is the list of most recent commands used.

Rhino.ApplicationSettings.MiddleMouseMode.PopupToolbar
Choose a toolbar to pop up at the cursor location.
Create a toolbar containing your favorite commands or object snaps to use as a pop-up toolbar.

Rhino.ApplicationSettings.MiddleMouseMode.RunMacro
Lists a series of commands that run when you click the middle mouse button.