Rhino.Geometry.SquishDeformation
The types of deformation allowed in the squish process

Rhino.Geometry.SquishDeformation.Free
No preference for compression or stretching.

Rhino.Geometry.SquishDeformation.StretchMostly
Strong bias for expansion when the pattern is deformed into the 3-D shape.

Rhino.Geometry.SquishDeformation.StretchOnly
Absolutely no compression when the pattern is deformed into the 3-D shape.

Rhino.Geometry.SquishDeformation.CompressMostly
Strong bias for compression when the pattern is deformed into the 3-D shape.

Rhino.Geometry.SquishDeformation.CompressOnly
Absolutely no expansion when the pattern is deformed into the 3-D shape.

Rhino.Geometry.SquishDeformation.Custom
The Custom option lets you set the parameters used by the custom deformations. There are four parameters you can set:
BndStretch, BndCompress, InteriorStretch, InteriorCompress
The default value for these parameters is 1 and they can be set to any positive number.
A larger value reduces the amount of the specified deformation compared to what happens when all
four parameters are equal. For example, if you want to severely limit interior expansion,
you could do something like:
BndStretch = 1
BndCompress = 1
InteriorStretch = 1
InteriorCompress = 100
If you want to preserve boundary lengths you could use the settings:
BndStretch = 10
BndCompress = 10
InteriorStretch = 1
InteriorCompress = 1