Rhino.Geometry.BrepLoopType
Each brep loop has a defined type, e.g. outer, inner or point on surface.
Since: 5.0

Rhino.Geometry.BrepLoopType.Unknown
Unknown loop type.

Rhino.Geometry.BrepLoopType.Outer
2d loop curves form a simple closed curve with a counterclockwise orientation.

Rhino.Geometry.BrepLoopType.Inner
2d loop curves form a simple closed curve with a clockwise orientation.

Rhino.Geometry.BrepLoopType.Slit
Always closed - used internally during splitting operations.

Rhino.Geometry.BrepLoopType.CurveOnSurface
"loop" is a curve-on-surface made from a single (open or closed) trim that
has type TrimType.CurveOnSurface.

Rhino.Geometry.BrepLoopType.PointOnSurface
"loop" is a PointOnSurface made from a single trim that has
type TrimType.PointOnSurface.