Rhino.Geometry.LineCurve
Represents a linear curve.

Rhino.Geometry.LineCurve.#ctor
Initializes a new instance of the Rhino.Geometry.LineCurve class.
Since: 5.0

Rhino.Geometry.LineCurve.#ctor(Rhino.Geometry.LineCurve)
Initializes a new instance of the Rhino.Geometry.LineCurve class, by
copying values from another linear curve.
Since: 5.0

Rhino.Geometry.LineCurve.#ctor(Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)
Initializes a new instance of the Rhino.Geometry.LineCurve class, by
setting start and end point from two 2D points.
from: A start point.
to: An end point.
Since: 5.0

Rhino.Geometry.LineCurve.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Initializes a new instance of the Rhino.Geometry.LineCurve class, by
setting start and end point from two 3D points.
from: A start point.
to: An end point.
Since: 5.0

Rhino.Geometry.LineCurve.#ctor(Rhino.Geometry.Line)
Initializes a new instance of the Rhino.Geometry.LineCurve class, by
retrieving its value from a line.
line: A line to use as model.
Since: 5.0

Rhino.Geometry.LineCurve.#ctor(Rhino.Geometry.Line,System.Double,System.Double)
Initializes a new instance of the Rhino.Geometry.LineCurve class, by
retrieving its value from a line and setting the domain.
line: A line to use as model.
t0: The new domain start.
t1: The new domain end.
Since: 5.0

Rhino.Geometry.LineCurve.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor used in serialization.
info: Serialization data.
context: Serialization stream.

Rhino.Geometry.LineCurve.Line
Gets or sets the Line value inside this curve.
Since: 5.0