Rhino.AngleUnitSystem
ON::AngleUnitSystem identifies an angle unit system

Rhino.AngleUnitSystem.None
ON::AngleUnitSystem::None indicates no angle unit system
is specified and model angle unit system should be used.

Rhino.AngleUnitSystem.Turns
1 turn = 2pi radians.

Rhino.AngleUnitSystem.Radians
1 turn = 2pi radians.

Rhino.AngleUnitSystem.Degrees
360 arc degrees  = 1 turn = 2pi radians

Rhino.AngleUnitSystem.Minutes
60 arc minutes = 1 arc degree

Rhino.AngleUnitSystem.Seconds
60 arc seconds = 1 arc minute

Rhino.AngleUnitSystem.Gradians
400 gradians = 2pi radians.

Rhino.AngleUnitSystem.Unset
The ON::AngleUnitSystem::Unset is used to indicates no angle unit system
has been specified in user interface code.