Rhino.Display.DisplayPipeline.InferenceLineType
Since: 8.17

Rhino.Display.DisplayPipeline.InferenceLineType.Chord
A chord from P to Q

Rhino.Display.DisplayPipeline.InferenceLineType.Ray
A ray from P through Q

Rhino.Display.DisplayPipeline.InferenceLineType.InfiniteLine
An infinite line through P and Q