Rhino.Runtime.InteropWrappers.SimpleArrayExtrusionPointer
Wrapper for a C++ ON_SimpleArray<ON_Extrusion*> or ON_SimpleArray<constant ON_Extrusion*>
If you are not writing C++ code then this class is not for you.

Rhino.Runtime.InteropWrappers.SimpleArrayExtrusionPointer.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayExtrusionPointer.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayExtrusionPointer.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayExtrusionPointer instance.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayExtrusionPointer.Count
Gets the amount of Extrusions in this array.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayExtrusionPointer.Add(Rhino.Geometry.Extrusion,System.Boolean)
Adds a extrusion to the list.
extrusion: A extrusion to add.
asConst: Whether this extrusion should be treated as non-modifiable.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayExtrusionPointer.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.SimpleArrayExtrusionPointer.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayExtrusionPointer.Dispose(System.Boolean)
disposing:

Rhino.Runtime.InteropWrappers.SimpleArrayExtrusionPointer.ToNonConstArray
Copies the unmanaged array to a managed counterpart.
Returns: The managed array.
Since: 6.0