Rhino.FileIO.FileGHSReadOptions
Options for reading a GHS file

Rhino.FileIO.FileGHSReadOptions.AttachGhsData
Since: 8.0

Rhino.FileIO.FileGHSReadOptions.RemoveColinearPoints
Since: 8.0

Rhino.FileIO.FileGHSReadOptions.ViewType
Since: 8.0

Rhino.FileIO.FileGHSReadOptions.ToDictionary
Since: 8.0
Since: 8.0