Rhino.Geometry.Particle
Represents a simple particle.
This base class only defines position and display properties (size, color, bitmap id).
You will most likely create a class that derives from this particle class to perform some
sort of physical simulation (movement over time or frames).

Rhino.Geometry.Particle.#ctor
Initializes a new instance of the Rhino.Geometry.Particle class.
Since: 5.0

Rhino.Geometry.Particle.ParentSystem
Gets the parent particle system of this particle.
Since: 5.0

Rhino.Geometry.Particle.Index
Index in ParentSystem for this Particle. Can change when the particle
system is modified.
Since: 5.0

Rhino.Geometry.Particle.Location
3d Location of the Particle.
Since: 5.0

Rhino.Geometry.Particle.Size
Since: 5.0

Rhino.Geometry.Particle.Color
Since: 5.0

Rhino.Geometry.Particle.DisplayBitmapIndex
Since: 5.0

Rhino.Geometry.Particle.Update
Base class implementation does nothing.
Since: 5.0