Rhino.DocObjects.SelectionMethod
Defines enumerated values for several kinds of selection methods.
Since: 5.0

Rhino.DocObjects.SelectionMethod.Other
Selected by non-mouse method (SelAll, etc.)

Rhino.DocObjects.SelectionMethod.MousePick
Selected by a mouse click on the object.

Rhino.DocObjects.SelectionMethod.WindowBox
Selected by a mouse selection window box.
Window selection indicates the object is completely contained by the selection rectangle.

Rhino.DocObjects.SelectionMethod.CrossingBox
Selected by a mouse selection crossing box.
A crossing selection indicates the object intersects with the selection rectangle.