Rhino.Geometry.MeshFace
Represents the values of the four indices of a mesh face quad.
If the third and fourth values are the same, this face represents a
triangle.

Rhino.Geometry.MeshFace.#ctor(System.Int32,System.Int32,System.Int32)
Constructs a new triangular Mesh face.
a: Index of first corner.
b: Index of second corner.
c: Index of third corner.
Since: 5.0

Rhino.Geometry.MeshFace.#ctor(System.Int32,System.Int32,System.Int32,System.Int32)
Constructs a new quadrangular Mesh face.
a: Index of first corner.
b: Index of second corner.
c: Index of third corner.
d: Index of fourth corner.
Since: 5.0

Rhino.Geometry.MeshFace.Unset
Gets an Unset MeshFace. Unset faces have Int32.MinValue for all corner indices.
Since: 5.0

Rhino.Geometry.MeshFace.DebuggerDisplayUtil
Internal property that figures out the debugger display for mesh Faces.

Rhino.Geometry.MeshFace.A
Gets or sets the first corner index of the mesh face.
Since: 5.0

Rhino.Geometry.MeshFace.B
Gets or sets the second corner index of the mesh face.
Since: 5.0

Rhino.Geometry.MeshFace.C
Gets or sets the third corner index of the mesh face.
Since: 5.0

Rhino.Geometry.MeshFace.D
Gets or sets the fourth corner index of the mesh face.
If D equals C, the mesh face is considered to be a triangle
rather than a quad.
Since: 5.0

Rhino.Geometry.MeshFace.Item(System.Int32)
Gets or sets the vertex index associated with an entry in this face.
index: A number in interval [0-3] that refers to an index of a vertex in this face.
Returns: The vertex index associated with this mesh face.

Rhino.Geometry.MeshFace.IsValid
Gets a value indicating whether or not this mesh face
is considered to be valid. Note that even valid mesh faces
could potentially be invalid in the context of a specific Mesh,
if one or more of the corner indices exceeds the number of
vertices on the mesh. If you want to perform a complete
validity check, use IsValid(int) instead.
Since: 5.0

Rhino.Geometry.MeshFace.IsValid(System.Int32)
Gets a value indicating whether or not this mesh face
is considered to be valid. Unlike the simple IsValid function,
this function takes upper bound indices into account.
vertexCount: Number of vertices in the mesh that this face is a part of.
Returns: true if the face is considered valid, false if not.
Since: 5.0

Rhino.Geometry.MeshFace.IsValid(Rhino.Geometry.Point3d[])
Gets a value indicating whether or not this mesh face
is considered to be valid. Unlike the simple IsValid function,
this function takes actual point locations into account.
points: Array of vertices with which to validate the face.
Returns: true if the face is considered valid, false if not.
Since: 6.0

Rhino.Geometry.MeshFace.Repair(Rhino.Geometry.Point3d[])
Attempts to repair this mesh face by taking both face indexes and
actual vertex locations into account.
points: Array of vertices with which to consider when repairing the face.
Returns: true if the face was repaired, false if not.
Remarks: This function assumes the face is invalid and attempts to repair unconditionally.  It is
only worthwhile to call Repair on faces where IsValid returns false.
Since: 6.0

Rhino.Geometry.MeshFace.IsValidEx(Rhino.Geometry.Point3d[]@)
Gets a value indicating whether or not this mesh face
is considered to be valid. Unlike the simple IsValid function,
this function takes actual point locations into account.
points: Array of vertices with which to validate the face.
Returns: true if the face is considered valid, false if not.
Since: 6.5

Rhino.Geometry.MeshFace.RepairEx(Rhino.Geometry.Point3d[]@)
Attempts to repair this mesh face by taking both face indexes and
actual vertex locations into account.
points: Array of vertices with which to consider when repairing the face.
Returns: true if the face was repaired, false if not.
Remarks: This function assumes the face is invalid and attempts to repair unconditionally.  It is
only worthwhile to call Repair on faces where IsValid returns false.
This function is the analog of UnsafeNativeMethods.ON_MeshFace_Repair done completely here to avoid
copying the point array.
Since: 6.5

Rhino.Geometry.MeshFace.IsTriangle
Gets a value indicating whether or not this mesh face is a triangle.
A mesh face is considered to be a triangle when C equals D, thus it is
possible for an Invalid mesh face to also be a triangle.
Since: 5.0

Rhino.Geometry.MeshFace.IsQuad
Gets a value indicating whether or not this mesh face is a quad.
A mesh face is considered to be a triangle when C does not equal D,
thus it is possible for an Invalid mesh face to also be a quad.
Since: 5.0

Rhino.Geometry.MeshFace.Set(System.Int32,System.Int32,System.Int32)
Sets all the corners for this face as a triangle.
a: Index of first corner.
b: Index of second corner.
c: Index of third corner.
Since: 5.0

Rhino.Geometry.MeshFace.Set(System.Int32,System.Int32,System.Int32,System.Int32)
Sets all the corners for this face as a quad.
a: Index of first corner.
b: Index of second corner.
c: Index of third corner.
d: Index of fourth corner.
Since: 5.0

Rhino.Geometry.MeshFace.Flip
Reverses the orientation of the face by swapping corners.
The first corner is always maintained.
Since: 5.0

Rhino.Geometry.MeshFace.Equals(Rhino.Geometry.MeshFace)
Returns a value indicating whether the other mesh face
has precisely the same value as the current one.
other: The other mesh face for comparison.
Returns: true if the other face is, also orderly, equal
to the present one; otherwise false.
Since: 6.0

Rhino.Geometry.MeshFace.Equals(System.Object)
Returns a value indicating whether the other object obj
has precisely the same value as the current one.
obj: Any object the represents the other mesh face for comparison.
Returns: true if obj is a mesh face that, also orderly, equals
to the present one; otherwise false.

Rhino.Geometry.MeshFace.GetHashCode
Returns a runtime-stable hash code for the current mesh face.
You are not allowed to rely on persistence of this hash code in
serialization, but for each version of RhinoCommon, this hash code
will be the same for each mesh face.
Returns: A non-unique integer that represents this mesh face.

Rhino.Geometry.MeshFace.op_Equality(Rhino.Geometry.MeshFace,Rhino.Geometry.MeshFace)
Determines whether two Rhino.Geometry.MeshFace structures have equal values.
a: The first MeshFace.
b: The second MeshFace.
Returns: true if the indices of the two points are exactly equal; otherwise false.
Since: 6.0

Rhino.Geometry.MeshFace.op_Inequality(Rhino.Geometry.MeshFace,Rhino.Geometry.MeshFace)
Determines whether two Rhino.Geometry.MeshFace structures have different values.
a: The first MeshFace.
b: The second MeshFace.
Returns: true if the indices of the two points are in any way different; otherwise false.
Since: 6.0

Rhino.Geometry.MeshFace.ToString
Returns a string representation for this Rhino.Geometry.MeshFace.
This is to provide a meaningful visualization of this structure
and is subject to change in newer releases.
Returns: The string representation.

Rhino.Geometry.MeshFace.CompareTo(Rhino.Geometry.MeshFace)
Compares this Rhino.Geometry.MeshFace with another Rhino.Geometry.MeshFace
and returns a value of 1, 0, or -1, referring to dictionary order.
Index evaluation priority is first A, then B, then C, then D.
other: The other Rhino.Geometry.MeshFace to use in comparison.
Returns:
0: if this is identical to other
-1: if this < other. Priority is for index of corner A first, then B, then C, then D.
+1: otherwise.
Since: 6.0