Rhino.Geometry.SubDComponent.SubDComponentPtrTypesAndMasks
ON_SubDComponentPtrTypesAndMasks contains the bit layout used by ON_SubDComponentPtr,
ON_SubDVertexPtr, ON_SubDEdgePtr and ON_SubDFacePtr to pack a component pointer, a
direction bit and a component type into a single unsigned integer.

Rhino.Geometry.SubDComponent.SubDComponentPtrTypesAndMasks.UnsetType
The component type is not set.

Rhino.Geometry.SubDComponent.SubDComponentPtrTypesAndMasks.DirectionMask
Bit storing the component direction (0 = natural, 1 = reversed).

Rhino.Geometry.SubDComponent.SubDComponentPtrTypesAndMasks.VertexType
The component is an ON_SubDVertex.

Rhino.Geometry.SubDComponent.SubDComponentPtrTypesAndMasks.EdgeType
The component is an ON_SubDEdge.

Rhino.Geometry.SubDComponent.SubDComponentPtrTypesAndMasks.FaceType
The component is an ON_SubDFace.

Rhino.Geometry.SubDComponent.SubDComponentPtrTypesAndMasks.TypeMask
Bits storing the component type.

Rhino.Geometry.SubDComponent.SubDComponentPtrTypesAndMasks.FlagsMask
Bits storing the component type and direction.

Rhino.Geometry.SubDComponent.SubDComponentPtrTypesAndMasks.PointerMask
Bits storing the component pointer.