Rhino.UI.ObjectPropertiesPage
Base class used to add object property user interface panels

Rhino.UI.ObjectPropertiesPage.PageIcon(System.Drawing.Size)
Icon to display in the object properties tab control.  Will not get called
if PageIconEmbeddedResourceString is overridden and provides a string for a
successfully loaded icon resource.
sizeInPixels:
The requested icon size in pixels, DPI scaling has been applied.  The
default value is 24 X DPI scale.
Returns:
Since: 6.0

Rhino.UI.ObjectPropertiesPage.Icon
(OBSOLETE - Override PageIcon instead)
Icon to display in the object properties tab control
Since: 5.0

Rhino.UI.ObjectPropertiesPage.PageControl
The control that represents this page. Rhino Windows supports classes
that implement the IWin32Windows interface, are derived from
System.Windows.FrameworkElement or Eto.Forms.Control.  Mac Rhino
supports controls that are derived from NSview or Eto.Forms.Control.
Since: 5.0

Rhino.UI.ObjectPropertiesPage.EnglishPageTitle
English string used to describe this page
Since: 5.0

Rhino.UI.ObjectPropertiesPage.SupportedTypes
Override to specify which objects this page supports
Since: 6.0

Rhino.UI.ObjectPropertiesPage.AllObjectsMustBeSupported
Returns false which only
requires a single item of SupportedTypes to be selected.
Override if you wish to change the above behavior.
Since: 6.7

Rhino.UI.ObjectPropertiesPage.Index
The page navigation control adds buttons in the order the pages are
processed, override this method and return a sort index to move the button
to the beginning of the list.  By default this returns -1 which puts the
button at the end of the list.
Since: 7.0

Rhino.UI.ObjectPropertiesPage.OnCreateParent(System.IntPtr)
Called when the parent container is initially created.
hwndParent:
Since: 5.0

Rhino.UI.ObjectPropertiesPage.OnSizeParent(System.Int32,System.Int32)
Called when the parent containers client rectangle size has changed and
the PageControl has been resized.
width:
height:
Since: 5.0

Rhino.UI.ObjectPropertiesPage.OnActivate(System.Boolean)
Called when this page is activated/deactivated.
active:
If true then this page is on top otherwise it is about to be hidden.
Returns:
If true then the page is hidden and the requested page is not
activated otherwise will not allow you to change the current page.
Default returns true.  The return value is currently ignored.
Since: 5.0

Rhino.UI.ObjectPropertiesPage.OnHelp
Called when the F1 key or help button is pressed, override to display
plug-in specific help for this page.
Since: 5.0

Rhino.UI.ObjectPropertiesPage.ShouldDisplay(Rhino.DocObjects.RhinoObject)
Called when the selected objects list changes, return true if the
object list contains one or more object the page can modify.
rhObj:
Returns:
Since: 5.0
6.0

Rhino.UI.ObjectPropertiesPage.ShouldDisplay(Rhino.UI.ObjectPropertiesPageEventArgs)
Called when the selected objects list changes, return true if the
object list contains one or more object the page can modify.
e:
Returns:
Since: 6.0

Rhino.UI.ObjectPropertiesPage.InitializeControls(Rhino.DocObjects.RhinoObject)
Called on the active page after the selected objects list has changed
to notify the page to initialize its content to reflect the new
object list.
rhObj:
Since: 5.0
6.0

Rhino.UI.ObjectPropertiesPage.UpdatePage(Rhino.UI.ObjectPropertiesPageEventArgs)
Called on the active page after the selected objects list has changed
to notify the page to initialize its content to reflect the new
object list.
e:
Since: 6.0

Rhino.UI.ObjectPropertiesPage.ModifyPage(System.Action{Rhino.UI.ObjectPropertiesPageEventArgs})
Call this method when the page is ready to modify the selected objects
list.  Rhino will suspend UpdatePageNotfictaion, call the passed action
then restore UpdatePageNotfictaion.
callbackAction:
Called when it is safe to modify objects.
Since: 6.0

Rhino.UI.ObjectPropertiesPage.SupportsSubObjects
If your object properties page supports sub-object selection, you
should override this method and return true.  This is ignored for view
pages.  The default implementation returns false.
Since: 6.0

Rhino.UI.ObjectPropertiesPage.LocalPageTitle
Localized page description string, returns the EnglishPageTitle by
default.
Since: 5.0

Rhino.UI.ObjectPropertiesPage.PageType
Override this and return the page you want to replace a specific object
properties page.
Since: 5.11

Rhino.UI.ObjectPropertiesPage.PageIconEmbeddedResourceString
Resource string for a embedded icon resource in the assembly containing
the page instance.  If this returns a valid resource and Rhino can
load the icon the loaded icon will get used directly otherwise;
the PageIcon method will get called.
The page icon embedded resource string.
Since: 6.4

Rhino.UI.ObjectPropertiesPage.RunScript(Rhino.RhinoDoc,Rhino.DocObjects.RhinoObject[])
This method is called when scripting the Rhino Properties command and
choosing this page.
doc: Active Rhino.RhinoDoc
objectList:
List of objects selected by the Properties command.
Returns:
Since: 6.0
6.0

Rhino.UI.ObjectPropertiesPage.RunScript(Rhino.UI.ObjectPropertiesPageEventArgs)
This method is called when scripting the Rhino Properties command and
choosing this page.
e:
Provides access to the selected object list and document.
Returns:
Since: 6.0

Rhino.UI.ObjectPropertiesPage.SelectedObjects
Return a list of Rhino objects to be processed by this object properties page
Since: 5.11

Rhino.UI.ObjectPropertiesPage.AnySelectedObject``1
Return true if any of the selected objects match the given type
Returns:
Since: 6.0

Rhino.UI.ObjectPropertiesPage.AnySelectedObject``1(System.Boolean)
Return true if any of the selected objects match the given type
allMustMatch:
If true then every selected object must match the object type
otherwise; only a single object has to be of the specified type
Returns:
Since: 6.7

Rhino.UI.ObjectPropertiesPage.GetSelectedObjects``1
Get selected objects of a given type
Returns:
Since: 6.0

Rhino.UI.ObjectPropertiesPage.GetSelectedObjects(Rhino.DocObjects.ObjectType)
Get selected objects that match a given filter
filter:
Returns:
Since: 6.0