Rhino.ApplicationSettings.EdgeAnalysisSettings
Contains static methods and properties to modify the visibility of edges in edge-related commands.

Rhino.ApplicationSettings.EdgeAnalysisSettings.GetDefaultState
Gets the factory settings of the application.
Since: 5.0

Rhino.ApplicationSettings.EdgeAnalysisSettings.GetCurrentState
Gets the current settings of the application.
Since: 5.0

Rhino.ApplicationSettings.EdgeAnalysisSettings.RestoreDefaults
Commits the default settings as the current settings.
Since: 5.0

Rhino.ApplicationSettings.EdgeAnalysisSettings.UpdateFromState(Rhino.ApplicationSettings.EdgeAnalysisSettingsState)
Sets all settings to a particular defined joined state.
state: The particular state.
Since: 5.0

Rhino.ApplicationSettings.EdgeAnalysisSettings.ShowEdgeColor
Gets or sets a color used to enhance display
edges in commands like _ShowEdges and _ShowNakedEdges.
Since: 5.0

Rhino.ApplicationSettings.EdgeAnalysisSettings.ShowEdges
Gets or sets a value referring to the group of edges that are targeted.
0 = all.
1 = naked.
2 = non-manifold.
Since: 5.0