Rhino.Input.Custom.OptionToggle.#ctor(System.Boolean,System.String,System.String)
Since: 5.0

Rhino.Input.Custom.OptionToggle.#ctor(System.Boolean,Rhino.UI.LocalizeStringPair,Rhino.UI.LocalizeStringPair)
Since: 5.0

Rhino.Input.Custom.OptionToggle.Dispose
Since: 5.0

Rhino.Input.Custom.OptionToggle.CurrentValue
Since: 5.0

Rhino.Input.Custom.OptionToggle.InitialValue
Since: 5.0