Rhino.Render.Fields.FloatField
float field value class

Rhino.Render.Fields.FloatField.#ctor(Rhino.Render.RenderContent,System.IntPtr)
Constructor
renderContent: RenderContent whose Fields owns this filed.
attachToPointer: Existing C++ pointer to attach to.

Rhino.Render.Fields.FloatField.Value
Gets or sets the field value
Since: 5.1

Rhino.Render.Fields.FloatField.ValueAsObject
Since: 5.7