Rhino.Display.PageViewSpaceChangeEventArgs
PageView space change event arguments.
Since: 5.0

Rhino.Display.PageViewSpaceChangeEventArgs.PageView
The page view on which a different detail object was set active.
Since: 5.0

Rhino.Display.PageViewSpaceChangeEventArgs.NewActiveDetailId
The id of the detail object was set active.  Note, if this id is
equal to Guid.Empty, then the active detail object is the page
view itself.
Since: 5.0

Rhino.Display.PageViewSpaceChangeEventArgs.OldActiveDetailId
The id of the previously active detail object. Note, if this id
is equal to Guid.Empty, then the active detail object was the
page view itself.
Since: 5.0