Rhino.Render.RenderWindow.Create(System.Drawing.Size)
Since: 6.0

Rhino.Render.RenderWindow.Dispose
Since: 6.0

Rhino.Render.RenderWindow.SessionId
Since: 5.11

Rhino.Render.RenderWindow.Cloned
Since: 5.11

Rhino.Render.RenderWindow.ChannelId(Rhino.Render.RenderWindow.StandardChannels)
Since: 5.0

Rhino.Render.RenderWindow.StandardChannelForGuid(System.Guid)
Get the StandardChannels for the given Guid
Since: 7.0

Rhino.Render.RenderWindow.Size
Since: 5.0

Rhino.Render.RenderWindow.SetSize(System.Drawing.Size)
Since: 5.0

Rhino.Render.RenderWindow.SetView(Rhino.DocObjects.ViewInfo)
Since: 6.0

Rhino.Render.RenderWindow.SetProgress(System.String,System.Single)
Accepts a rendering progress value to inform the user of the rendering advances.
text: The progress text.
progress: A progress value in the domain [0.0f; 1.0f].
Since: 5.0

Rhino.Render.RenderWindow.EndAsyncRender(Rhino.Render.RenderWindow.RenderSuccessCode)
Must be called when an asynchronous render has finished or ended for any reason.
successCode: Completed for a correct or canceled render, Failed for errors.
Since: 6.0

Rhino.Render.RenderWindow.OpenChannel(Rhino.Render.RenderWindow.StandardChannels)
Since: 5.0

Rhino.Render.RenderWindow.GetRequestedRenderChannelsAsStandardChannels
Get array of StandardChannels enum values representing the channels requested by the post effect pipeline for this RenderWindow.
Returns: Array of StandardChannels
Since: 7.0

Rhino.Render.RenderWindow.GetRequestedRenderChannels
Get array of Guids representing the channels requested by the post effect pipeline for this RenderWindow.
Returns: Array of Guid
Since: 7.0

Rhino.Render.RenderWindow.IsChannelAvailable(System.Guid)
Query if a channel is available.
Returns: Returns true if the channel is available.
Since: 7.0

Rhino.Render.RenderWindow.IsChannelShown(System.Guid)
Query if a channel is being shown.
Returns: Returns true if the channel is being shown.
Since: 7.0

Rhino.Render.RenderWindow.GetBitmap
Since: 6.0

Rhino.Render.RenderWindow.AddWireframeChannel(Rhino.RhinoDoc,Rhino.DocObjects.ViewportInfo,System.Drawing.Size,System.Drawing.Rectangle)
This method sets the frame buffer size and adds all the necessary wireframe channels automatically.
It also creates the wireframe channel data automatically so that your renderer doesn't have to.
You typically call this method only when your renderer does not support wireframe rendering itself.
If you call this method, then you should not add any wireframe channels returned by GetRenderChannels().
If your renderer is capable of rendering the wireframe channels itself, you should not call this method.
Instead, you must make sure you add the wireframe channels if GetRenderChannels() requests them.
See IRhRdkRenderWindow::GetRenderChannels().
After the wires are rendered, the wireframe post effects will composite them into the final rendered image.
Note: This method should really be called AddWireframeChannels(). [SDK_UNFREEZE] */
doc: The document to display
viewport: The view to display
size: The size of the image without clipping (i.e., if you have a region, it is the
size of the image before you cut the region out.
region: The area of the rendering you want to display.  This should match the size
of the render window itself (i.e, - the one set using SetSize)
Returns: Returns true if all of the wireframe channels were added successfully.
Since: 5.0

Rhino.Render.RenderWindow.AddChannel(Rhino.Render.RenderWindow.StandardChannels)
Add a channel to the frame buffer in addition to the fixed Red, Green, Blue and Alpha channels.
channel: Channel to add
Returns: If the channel existed then true is returned otherwise; returns true if the channel was added or false if not.
Since: 5.0

Rhino.Render.RenderWindow.SetRGBAChannelColors(System.Drawing.Size,Rhino.Display.Color4f[])
Call this method to open the RenderWindow.StandardChannels.RGBA channel and set a block of color values
size: Size of the area to set. No validation is done on this value
colors: Array of Color4f values used to set the RenderWindow.StandardChannels.RGBA
Since: 5.0

Rhino.Render.RenderWindow.SetRGBAChannelColors(System.Drawing.Rectangle,Rhino.Display.Color4f[])
Call this method to open the RenderWindow.StandardChannels.RGBA channel and set a block of color values
rectangle:
rectangle.X is the horizontal pixel position of the left edge. No validation is done on this value.
The caller is responsible for ensuring that it is within the frame buffer.
rectangle.Y is the vertical pixel position of the top edge. No validation is done on this value.
The caller is responsible for ensuring that it is within the frame buffer.
rectangle.Width is the width of the rectangle in pixels. No validation is done on this value.
rectangle.Height is the height of the rectangle in pixels. No validation is done on this value.
colors: Array of Color4f values used to set the RenderWindow.StandardChannels.RGBA
Since: 5.0

Rhino.Render.RenderWindow.Invalidate
Invalidate the entire view window so that the pixels get painted.
Since: 5.0

Rhino.Render.RenderWindow.InvalidateArea(System.Drawing.Rectangle)
Since: 5.0

Rhino.Render.RenderWindow.RegisterPostEffectExecutionControl(Rhino.Render.PostEffects.PostEffectExecutionControl)
Register an instance of PostEffectExecutionControl.
Since: 8.0

Rhino.Render.RenderWindow.SaveDibAsBitmap(System.String)
Save current Dib of RenderWindow as file
Helper function for debugging purposes.
filename:
Since: 6.0

Rhino.Render.RenderWindow.SaveRenderImageAs(System.String,System.Guid,System.Boolean)
Save current RenderWindow contents as
an image file with the given name. The
filetype will be determine.
Pass in render engine Guid if an engine
implements saving to a format that is not
supported by Rhino. Guid.Empty if there is no need for that.
filename: Filename of image file to be created
renderEngineGuid: render engine ID
saveAlpha: True if alpha channel should be saved.
Since: 6.0

Rhino.Render.RenderWindow.SaveRenderImageAs(System.String,System.Boolean)
Like RenderWindow.SaveRenderImageAs(string,Guid,bool), but with
Guid set to Guid.Empty.
filename: Filename of image file to be created
saveAlpha: True if alpha channel should be saved.
Since: 6.0

Rhino.Render.RenderWindow.SetIsRendering(System.Boolean)
Set whether or not rendering is in progress. Added to support raytraced mode.
is_rendering:
Since: 7.1

Rhino.Render.RenderWindow.FromSessionId(System.Guid)
Since: 5.11

Rhino.Render.RenderWindow.SetRenderOutputRect(System.Drawing.Rectangle)
Specify a sub-rectangle of the render window to indicate where the relevant render output has
been written. For example, if a renderer chooses to render at half resolution, it could write
its data to the top left quadrant of the render window, which can be indicated by setting the
render output rectangle.
This is set to the full render window size by default. When the render window size is modified,
the render output rectangle will be set to reflect the new size.
rect: Rectangle
Since: 8.0

Rhino.Render.RenderWindow.GetAdjust
OBSOLETE. NOT IMPLEMENTED.
Since: 6.0
7.0

Rhino.Render.RenderWindow.SetAdjust(Rhino.Render.RenderWindow.ImageAdjust)
OBSOLETE. NOT IMPLEMENTED.
imageAdjust: OBSOLETE
Since: 6.0
7.0