Rhino.FileIO.File3dmHatchPatternTable
Provides access to hatch pattern definitions in the 3dm file.

Rhino.FileIO.File3dmHatchPatternTable.ComponentType
Returns Rhino.DocObjects.ModelComponentType.HatchPattern.
Since: 6.0

Rhino.FileIO.File3dmHatchPatternTable.FindName(System.String)
Finds a HatchPattern given its name.
name: The name of the HatchPattern to be searched.
Returns: An HatchPattern, or null on error.
Since: 6.0

Rhino.FileIO.File3dmHatchPatternTable.FindNameHash(Rhino.FileIO.NameHash)
Finds a HatchPattern given its name hash.
nameHash: The name hash of the HatchPattern to be searched.
Returns: An HatchPattern, or null on error.
Since: 6.0

Rhino.FileIO.File3dmHatchPatternTable.FindIndex(System.Int32)
Retrieves a HatchPattern object based on Index. This search type of search is discouraged.
We are moving towards using only IDs for all tables.
index: The index to search for.
Returns: A HatchPattern object, or null if none was found.
Since: 6.0