Rhino.FileIO.File3ds
Support for writing 3ds file format

Rhino.FileIO.File3ds.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.File3dsWriteOptions)
Write a 3ds file based on the contents of a RhinoDoc
path: path to write a file to
doc: document to get geometry from
options: options used for generating the 3ds file
Returns: true on success
Since: 8.0

Rhino.FileIO.File3ds.Read(System.String,Rhino.RhinoDoc,Rhino.FileIO.File3dsReadOptions)
Read a 3ds file intof a RhinoDoc
path: path to read a file from
doc: document to import geometry into
options: options used for importing the 3ds file
Returns: true on success
Since: 8.0