Rhino.Render.TimeZone
TimeZone

Rhino.Render.TimeZone.#ctor(System.IntPtr)
Construct a TimeZone
pLw:

Rhino.Render.TimeZone.Name
Gets name of a time zone.
Since: 6.0

Rhino.Render.TimeZone.Hours
Gets hours of a time zone.
Since: 6.0

Rhino.Render.TimeZone.Longitude
Returns the Longitude of a major city nearby
Returns: Longitude
Since: 6.15

Rhino.Render.TimeZone.Latitude
Returns the latitude of a major city nearby
Returns: Latitude
Since: 6.15

Rhino.Render.TimeZone.TimeZones
Returns number of available time zones.
Returns: Time zone count.
Since: 6.0

Rhino.Render.TimeZone.TimeZoneAt(System.Int32)
Returns a time zone at given index.
index: index.
Returns: Time zone at index.
Since: 6.0