Rhino.Geometry.Morphs.StretchSpaceMorph
Deforms objects toward or away from a specified axis.

Rhino.Geometry.Morphs.StretchSpaceMorph.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Constructs a stretch space morph.
start: Start of stretch axis.
end: End of stretch axis.>
point: End of new stretch axis.
Since: 5.9

Rhino.Geometry.Morphs.StretchSpaceMorph.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
Constructs a stretch space morph.
start: Start of stretch axis.
end: End of stretch axis.>
length: Length of new stretch axis.
Since: 5.9

Rhino.Geometry.Morphs.StretchSpaceMorph.IsValid
Returns true if the space morph definition is valid, false otherwise.
Since: 5.9

Rhino.Geometry.Morphs.StretchSpaceMorph.MorphPoint(Rhino.Geometry.Point3d)
Morphs an Euclidean point.
point: A point that will be morphed by this object.
Returns: Resulting morphed point.
Since: 5.9

Rhino.Geometry.Morphs.StretchSpaceMorph.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Geometry.Morphs.StretchSpaceMorph.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.9

Rhino.Geometry.Morphs.StretchSpaceMorph.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.