Rhino.FileIO.FileDgnReadOptions
Options for reading a Dgn file

Rhino.FileIO.FileDgnReadOptions.ImportUnreferencedLayers
Since: 8.0

Rhino.FileIO.FileDgnReadOptions.ImportUnreferencedBlocks
Since: 8.0

Rhino.FileIO.FileDgnReadOptions.ImportUnreferencedLineStyles
Since: 8.0

Rhino.FileIO.FileDgnReadOptions.ImportViews
Since: 8.0

Rhino.FileIO.FileDgnReadOptions.GroupCellHeaders
Since: 8.0

Rhino.FileIO.FileDgnReadOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0