Rhino.Geometry.MeshType
Defines enumerated values for various mesh types.
Since: 5.0

Rhino.Geometry.MeshType.Default
The default mesh.

Rhino.Geometry.MeshType.Render
The render mesh.

Rhino.Geometry.MeshType.Analysis
The analysis mesh.

Rhino.Geometry.MeshType.Preview
The preview mesh.

Rhino.Geometry.MeshType.Any
Any mesh that is available.