Rhino.PlugIns.CustomRenderSaveFileType
Custom render output window save file type

Rhino.PlugIns.CustomRenderSaveFileType.#ctor(System.Collections.Generic.IEnumerable{System.String},System.String,Rhino.PlugIns.CustomRenderSaveFileTypes.SaveFileHandler)
Constructor

Rhino.PlugIns.CustomRenderSaveFileType.RuntimeId
Id for this instance

Rhino.PlugIns.CustomRenderSaveFileType.FileExtensions
Custom file extensions for this type for example: "HDR", "HDRI"

Rhino.PlugIns.CustomRenderSaveFileType.Description
File extension description which appears in the file save dialog file
type combo box.

Rhino.PlugIns.CustomRenderSaveFileType.SaveFileCallback
Called by OnSaveCusomtomRenderFile to actually write the file.