Rhino.Runtime.TextFields.InstanceAttributeField


Rhino.Runtime.TextFields.InstanceAttributeField.#ctor(System.String,System.String,System.String)
Block attribute definition.
key:
Attribute key
prompt:
Prompt displayed by the UI when inserting a block
defaultValue:
Default value used when inserting a block
Since: 7.0

Rhino.Runtime.TextFields.InstanceAttributeField.Key
Attribute key
Since: 7.0

Rhino.Runtime.TextFields.InstanceAttributeField.Prompt
Prompt displayed by the UI when inserting a block
Since: 7.0

Rhino.Runtime.TextFields.InstanceAttributeField.DefaultValue
Default value used when inserting a block
Since: 7.0