Rhino.ApplicationSettings.PackageManagerSettings
Settings specific to Rhino's package manager

Rhino.ApplicationSettings.PackageManagerSettings.Sources
semicolon separated list of paths/urls that the package manager uses for sources
Since: 7.1