Rhino.ApplicationSettings.CurvatureAnalysisSettingsState
Represents a snapshot of Rhino.ApplicationSettings.CurvatureAnalysisSettings.

Rhino.ApplicationSettings.CurvatureAnalysisSettingsState.GaussRange
Gets or sets the Gaussian curvature range.
Since: 6.0

Rhino.ApplicationSettings.CurvatureAnalysisSettingsState.MeanRange
Gets or sets the Mean curvature range.
Since: 6.0

Rhino.ApplicationSettings.CurvatureAnalysisSettingsState.MinRadiusRange
Gets or sets the Minimum Radius curvature range.
Since: 6.0

Rhino.ApplicationSettings.CurvatureAnalysisSettingsState.MaxRadiusRange
Gets or sets the Maximum Radius curvature range.
Since: 6.0

Rhino.ApplicationSettings.CurvatureAnalysisSettingsState.Style
Gets or sets the curvature analysis style.
Since: 6.0