Rhino.Render.RenderMaterial.CreateBasicMaterial(Rhino.DocObjects.Material)
Constructs a new basic material from a Material.
material: (optional)The material to create the basic material from.
Returns: A new basic material.
Since: 5.1
7.1

Rhino.Render.RenderMaterial.CreateBasicMaterial(Rhino.DocObjects.Material,Rhino.RhinoDoc)
Since: 6.4

Rhino.Render.RenderMaterial.AssignTo(System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjRef},Rhino.Render.RenderMaterial.AssignToSubFaceChoices,Rhino.Render.RenderMaterial.AssignToBlockChoices,System.Boolean)
Since: 7.13

Rhino.Render.RenderMaterial.AssignTo(Rhino.DocObjects.ObjRef)
Since: 7.13

Rhino.Render.RenderMaterial.FromMaterial(Rhino.DocObjects.Material,Rhino.RhinoDoc)
Constructs a new material from a Material.
material: (optional)The material to create the material from.
doc: The document to associate this material with.
Returns: A new material - either a "Custom" material or a "Physically Based" material depending on the return value of material.IsPhysicallyBased.
Since: 7.1

Rhino.Render.RenderMaterial.CreateImportedMaterial(Rhino.DocObjects.Material,Rhino.RhinoDoc,System.Boolean)
Since: 7.0

Rhino.Render.RenderMaterial.ImportMaterialAndAssignToLayers(Rhino.RhinoDoc,System.String,System.Collections.Generic.IEnumerable{System.Int32})
Imports a material file (.RMTL) and assigns the imported material to one or more layers.
doc: The document to attach the imported material to and which also contains the layers.
file: The full path to the RMTL file to be imported.
layer_indices: An array of indices of the layers to assign the material to.
Returns: True if successful, else false.
Since: 8.0

Rhino.Render.RenderMaterial.PlasterMaterialGuid
Since: 6.0

Rhino.Render.RenderMaterial.PlasticMaterialGuid
Since: 6.0

Rhino.Render.RenderMaterial.PaintMaterialGuid
Since: 6.0

Rhino.Render.RenderMaterial.GlassMaterialGuid
Since: 6.0

Rhino.Render.RenderMaterial.GemMaterialGuid
Since: 6.0

Rhino.Render.RenderMaterial.MetalMaterialGuid
Since: 6.0

Rhino.Render.RenderMaterial.PictureMaterialGuid
Since: 6.0

Rhino.Render.RenderMaterial.TextureTypeFromSlot(Rhino.Render.RenderMaterial.StandardChildSlots)
Since: 7.6

Rhino.Render.RenderMaterial.SlotFromTextureType(Rhino.DocObjects.TextureType)
Since: 7.6

Rhino.Render.RenderMaterial.TextureChildSlotName(Rhino.Render.RenderMaterial.StandardChildSlots)
Override this function to provide information about which texture is used for
the standard (ie - defined in ON_Texture) texture channels.
slot: An valid slot.
Returns: The texture used for the channel.
Since: 5.1

Rhino.Render.RenderMaterial.GetTextureFromUsage(Rhino.Render.RenderMaterial.StandardChildSlots)
Since: 6.0

Rhino.Render.RenderMaterial.GetTextureOnFromUsage(Rhino.Render.RenderMaterial.StandardChildSlots)
Since: 6.0

Rhino.Render.RenderMaterial.GetTextureAmountFromUsage(Rhino.Render.RenderMaterial.StandardChildSlots)
Since: 6.0

Rhino.Render.RenderMaterial.SimulateMaterial(Rhino.DocObjects.Material@,Rhino.Render.RenderTexture.TextureGeneration)
Override this function to provide a Rhino.DocObjects.Material definition for this material
to be used by other rendering engines including the display.
simulation: Set the properties of the input basic material to provide the simulation for this material.
tg: See RenderTexture.TextureGeneration.
Since: 7.0

Rhino.Render.RenderMaterial.SimulateMaterial(Rhino.DocObjects.Material@,System.Boolean)
Override this function to provide a Rhino.DocObjects.Material definition for this material
to be used by other rendering engines including the display.
simulation: Set the properties of the input basic material to provide the simulation for this material.
isForDataOnly: Called when only asking for a hash - don't write any textures to the disk - just provide the filenames they will get.
Since: 5.1
8.0

Rhino.Render.RenderMaterial.SimulateMaterial(System.Boolean)
Call this function to receive the simulation for a RenderMaterial used by the display and other rendering engines.
isForDataOnly: Called when only asking for a hash - don't write any textures to the disk - just provide the filenames they will get.
Returns: The simulation of the render material
Since: 6.0
7.0

Rhino.Render.RenderMaterial.SimulatedMaterial(Rhino.Render.RenderTexture.TextureGeneration)
Since: 7.0
8.0

Rhino.Render.RenderMaterial.ToMaterial(Rhino.Render.RenderTexture.TextureGeneration)
Since: 8.0

Rhino.Render.RenderMaterial.ConvertToPhysicallyBased(Rhino.Render.RenderTexture.TextureGeneration)
Returns a material that is the best approximation of the original, but as a physically based material.
tg: Determines whether simulated textures will be generated as files.
Returns:
Since: 7.0

Rhino.Render.RenderMaterial.DefaultPreviewGeometryType
Set or get the default geometry that appears in preview panes
Since: 5.11

Rhino.Render.RenderMaterial.DefaultPreviewBackgroundType
Set or get the default scene background for the image that appears in
preview panes
Since: 5.11

Rhino.Render.RenderMaterial.DefaultPreviewSize
The default preview geometry size
Since: 5.11

Rhino.Render.RenderMaterial.SmellsLikePlaster
Since: 6.0

Rhino.Render.RenderMaterial.SmellsLikePaint
Since: 6.0

Rhino.Render.RenderMaterial.SmellsLikeMetal
Since: 6.0

Rhino.Render.RenderMaterial.SmellsLikePlastic
Since: 6.0

Rhino.Render.RenderMaterial.SmellsLikeGem
Since: 6.0

Rhino.Render.RenderMaterial.SmellsLikeGlass
Since: 6.0

Rhino.Render.RenderMaterial.SmellsLikeTexturedPlaster
Since: 6.0

Rhino.Render.RenderMaterial.SmellsLikeTexturedPaint
Since: 6.0

Rhino.Render.RenderMaterial.SmellsLikeTexturedMetal
Since: 6.0

Rhino.Render.RenderMaterial.SmellsLikeTexturedPlastic
Since: 6.0

Rhino.Render.RenderMaterial.SmellsLikeTexturedGem
Since: 6.0

Rhino.Render.RenderMaterial.SmellsLikeTexturedGlass
Since: 6.0

Rhino.Render.RenderMaterial.HandleTexturedValue``1(System.String,Rhino.Render.TexturedValue{``0})
Handle a textured content field. Values will be read into an
instance of TexturedColor
slotname:
tc:
Since: 6.12
Returns: true if reading the base value succeeded