Rhino.FileIO.ManifestTable
Maintains an index to every model component that is in the 3dm file.
This is the "more comprehensive" table that contains all objects in all other tables.

Rhino.FileIO.ManifestTable.Parent
Returns the parent object. This is the RhinoDoc, or the File3md file.
Since: 6.0

Rhino.FileIO.ManifestTable.FindId(System.Guid)
Uses the guid to find a model component. Deleted objects cannot be found by id.
The guid is the value that is stored in the .Id property.
In a single document, no two active objects have the same guid. If an object is
replaced with a new object, then the guid  persists. For example, if the _Move command
moves an object, then the moved object inherits its guid from the starting object.
If the Copy command copies an object, then the copy gets a new guid. This guid persists
through file saving/opening operations. This function will not find grip objects.
id: ID of model component to search for.
Returns: Reference to the rhino object with the objectId or null if no such object could be found.
Since: 6.0

Rhino.FileIO.ManifestTable.FindId(System.Guid,Rhino.DocObjects.ModelComponentType)
Uses the guid to find a model component. Deleted objects cannot be found by id.
The guid is the value that is stored in the .Id property.
In a single document, no two active objects have the same guid. If an object is
replaced with a new object, then the guid  persists. For example, if the _Move command
moves an object, then the moved object inherits its guid from the starting object.
If the Copy command copies an object, then the copy gets a new guid. This guid persists
through file saving/opening operations. This function will not find grip objects.
id: ID of model component to search for.
type: The type to be searched. If this is Rhino.DocObjects.ModelComponentType.Unset
then all types are searched.
Returns: Reference to the rhino object with the objectId or null if no such object could be found.
Since: 6.0

Rhino.FileIO.ManifestTable.FindId``1(System.Guid)
Uses the guid to find a model component. Deleted objects cannot be found by id.
The guid is the value that is stored in the .Id property.
In a single document, no two active objects have the same guid. If an object is
replaced with a new object, then the guid  persists. For example, if the _Move command
moves an object, then the moved object inherits its guid from the starting object.
If the Copy command copies an object, then the copy gets a new guid. This guid persists
through file saving/opening operations. This function will not find grip objects.
id: Index of model component to search for.
The type, derived from ModelComponent or ModelComponent itself.
Returns: Reference to the rhino object or null if no such object could be found.
Since: 6.0

Rhino.FileIO.ManifestTable.FindIndex(System.Int32,Rhino.DocObjects.ModelComponentType)
Uses the index to find a model component.
The index is the value that is stored in the .Index property.
index: Index of model component to search for.
type: The type to be searched. Cannot be Rhino.DocObjects.ModelComponentType.Unset.
Returns: Reference to the rhino object or null if no such object could be found.
Since: 6.0

Rhino.FileIO.ManifestTable.FindIndex``1(System.Int32)
Uses the index to find a model component.
The index is the value that is stored in the .Index property.
index: Index of model component to search for.
The type, derived from ModelComponent. Cannot be ModelComponent itself.
Returns: Reference to the rhino object or null if no such object could be found.
Since: 6.0

Rhino.FileIO.ManifestTable.FindName(System.String,Rhino.DocObjects.ModelComponentType,System.Guid)
Uses the name to find a model component.
The name is the value that is stored in the .Name property.
Deleted objects have no name.
name: Name of model component to search for.
type: The type to be searched. Cannot be Rhino.DocObjects.ModelComponentType.Unset.
parent: Parent object id. This is only required for layers.
Returns: Reference to the rhino object or null if no such object could be found.
Since: 6.0

Rhino.FileIO.ManifestTable.FindName``1(System.String,System.Guid)
Uses the name to find a model component.
The name is the value that is stored in the .Name property.
Deleted objects have no name.
The type, derived from ModelComponent. Cannot be ModelComponent itself.
name: Name of model component to search for.
parent: Parent object id. This is only required for layers.
Returns: Reference to the rhino object or null if no such object could be found.
Since: 6.0

Rhino.FileIO.ManifestTable.FindNameHash(Rhino.FileIO.NameHash,Rhino.DocObjects.ModelComponentType)
Uses the hash of the name to find a model component.
Deleted objects have no name.
nameHash: NameHash of model component to search for.
type: The type to be searched. Cannot be Rhino.DocObjects.ModelComponentType.Unset.
Returns: Reference to the rhino object or null if no such object could be found.
Since: 6.0

Rhino.FileIO.ManifestTable.FindNameHash``1(Rhino.FileIO.NameHash)
Uses the hash of the name to find a model component.
Deleted objects have no name.
The type, derived from ModelComponent.
nameHash: Name hash of model component to search for.
Since: 6.0

Rhino.FileIO.ManifestTable.Count
Total number of items in the manifest, including deleted items.
Since: 6.0

Rhino.FileIO.ManifestTable.LongCount
Total number of items in the manifest, including deleted items.
Since: 6.0

Rhino.FileIO.ManifestTable.ComponentType
Returns Rhino.DocObjects.ModelComponentType.Mixed.
Since: 6.0

Rhino.FileIO.ManifestTable.ActiveObjectCount(Rhino.DocObjects.ModelComponentType)
Total number of items in the manifest, including deleted items.
Since: 6.0

Rhino.FileIO.ManifestTable.Rhino#FileIO#ICommonComponentTable{Rhino#DocObjects#ModelComponent}#FindNameHash(Rhino.FileIO.NameHash)
Since: 6.0

Rhino.FileIO.ManifestTable.System#Collections#IEnumerable#GetEnumerator
Since: 6.0

Rhino.FileIO.ManifestTable.GetEnumerator``1
Visits all model components in the document, including default ones.
Returns: An enumerator.
Since: 6.0

Rhino.FileIO.ManifestTable.GetModelComponentTypeFromGenericType``1
Returns the result of the ComponentType property of a ModelComponent.
A model component type.
Returns: A Rhino.DocObjects.ModelComponentType.
Since: 6.0

Rhino.FileIO.ManifestTable.GetEnumerator
Visits all model components in the document, including default ones.
Returns: An enumerator.
Since: 6.0

Rhino.FileIO.ManifestTable.GetEnumerator(Rhino.DocObjects.ModelComponentType)
Returns an enumerators that yields all model components, including default ones,
relating to a particular type.
type: The model component type.
Returns: An enumerator.
Since: 6.0

Rhino.FileIO.ManifestTable.Clear
Marks all items as deleted.
Since: 6.0

Rhino.FileIO.ManifestTable.Contains(Rhino.DocObjects.ModelComponent)
Determines if an items is contained in this table.
item: An item, or null. Null is never contained.
Returns: True if the item is contained; otherwise, false.
Since: 6.0

Rhino.FileIO.ManifestTable.CopyTo(Rhino.DocObjects.ModelComponent[],System.Int32)
Copies the content of this table to an array.
array: The array to copy to.
arrayIndex: The position in the array from which to start copying.
Since: 6.0