Rhino.Geometry.Brep
/// Boundary Representation. A surface or polysurface along with trim curve information.

Rhino.Geometry.Brep.TryConvertBrep(Rhino.Geometry.GeometryBase)
Attempts to convert a generic Geometry object into a Brep.
geometry: Geometry to convert, not all types of GeometryBase can be represented by BReps.
Returns: Brep if a brep form could be created or null if this is not possible. If geometry was of type Brep to
begin with, the same object is returned, i.e. it is not duplicated.
Since: 5.0

Rhino.Geometry.Brep.IsBox
Verifies a Brep is in the form of a solid box.
Returns: true if the Brep is a solid box, false otherwise.
Since: 7.10

Rhino.Geometry.Brep.IsBox(System.Double)
Verifies a Brep is in the form of a solid box.
tolerance: The tolerance used to determine if faces are planar and to compare face normals.
Returns: true if the Brep is a solid box, false otherwise.
Since: 7.10

Rhino.Geometry.Brep.ChangeSeam(Rhino.Geometry.BrepFace,System.Int32,System.Double,System.Double)
Change the seam of a closed trimmed surface.
face: A Brep face with a closed underlying surface.
direction: The parameter direction (0 = U, 1 = V). The face's underlying surface must be closed in this direction.
parameter: The parameter at which to place the seam.
tolerance: Tolerance used to cut up surface.
Returns: A new Brep that has the same geometry as the face with a relocated seam if successful, or null on failure.
Since: 6.4

Rhino.Geometry.Brep.CopyTrimCurves(Rhino.Geometry.BrepFace,Rhino.Geometry.Surface,System.Double)
Copy all trims from a Brep face onto a surface.
trimSource: Brep face which defines the trimming curves.
surfaceSource: The surface to trim.
tolerance: Tolerance to use for rebuilding 3D trim curves.
Returns: A brep with the shape of surfaceSource and the trims of trimSource or null on failure.
Since: 5.0

Rhino.Geometry.Brep.CreateBaseballSphere(Rhino.Geometry.Point3d,System.Double,System.Double)
Creates a brep representation of the sphere with two similar trimmed NURBS surfaces, and no singularities.
center: The center of the sphere.
radius: The radius of the sphere.
tolerance:
Used in computing 2d trimming curves. If >= 0.0, then the max of
ON_0.0001 * radius and RhinoMath.ZeroTolerance will be used.
Returns: A new brep, or null on error.
Since: 6.0

Rhino.Geometry.Brep.CreateDevelopableLoft(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Boolean,System.Boolean,System.Int32)
Creates a single developable surface between two curves.
crv0: The first rail curve.
crv1: The second rail curve.
reverse0: Reverse the first rail curve.
reverse1: Reverse the second rail curve
density: The number of rulings across the surface.
Returns: The output Breps if successful, otherwise an empty array.
Since: 6.10

Rhino.Geometry.Brep.CreateDevelopableLoft(Rhino.Geometry.NurbsCurve,Rhino.Geometry.NurbsCurve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d})
Creates a single developable surface between two curves.
rail0: The first rail curve.
rail1: The second rail curve.
fixedRulings:
Rulings define lines across the surface that define the straight sections on the developable surface,
where rulings[i].X = parameter on first rail curve, and rulings[i].Y = parameter on second rail curve.
Note, rulings will be automatically adjusted to minimum twist.
Returns: The output Breps if successful, otherwise an empty array.
Since: 6.10

Rhino.Geometry.Brep.CutUpSurface(Rhino.Geometry.Surface,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Boolean,System.Double)
Takes a surface and a set of all 3D curves that define a single trimmed surface,
and splits the surface with the curves, keeping the piece that uses all of the curves.
surface: The surface.
curves: The curves.
useEdgeCurves:
The 2D trimming curves are made by pulling back the 3D curves using the fitting tolerance.
If useEdgeCurves is true, the input 3D curves will be used as the edge curves in the result.
Otherwise, the edges will come from pushing up the 2D pullbacks.
tolerance:
The fitting tolerance.
When in doubt, use the document's model absolute tolerance.
Returns:
The resulting Breps is successful, otherwise an empty array.
Note, you may want to join the results into a single Brep.
Remarks:
This function is useful when importing non-3dm files with questionable geometry.
It is also a good way to quickly create a trimmed surface that has multiple inner boundaries without having to call split or trim and then select all of the pieces to throw away.
If the surface is closed, an attempt will be made to move seams so that they avoid the curves.
If that cannot be done, the result may have more than one face.
If the surface is closed in both directions, it is possible that the split will result in two faces that use all of the input curves.
In this case all curves must be oriented counter-clockwise, with respect to the surface normal, around the desired result.
The surface may be extended if it is not large enough to contain the curves.
Noisy singularities will be repaired when possible.
Throws System.ArgumentNullException:
Since: 8.0

Rhino.Geometry.Brep.ExtendBrepFacesToConnect(Rhino.Geometry.BrepFace,Rhino.Geometry.Point3d,Rhino.Geometry.BrepFace,Rhino.Geometry.Point3d,System.Double,System.Double,Rhino.Geometry.Brep@,Rhino.Geometry.Brep@)
Extends Faces to meet and trims the faces to each other. If input faces intersect without extending, the selection point indicates the side to keep
Face0: [in] first face to connect
f0_sel_pt: selection point on first face near the edge to extend.
Face1: [in] second surface
f1_sel_pt: selection point on second face near the edge to extend.
tol: [in] tolerance used for intersecting faces and simplifing extension curve
angleTol: [in] angle tolerance in radians used for simplifying extendsion curve
outBrep0: [out] first face extended and trimmed to connect with the second face
outBrep1: [out] second face extended and trimmed to connect with the first face
Returns: true if valid connection found
Since: 8.9

Rhino.Geometry.Brep.ExtendBrepFacesToConnect(Rhino.Geometry.BrepFace,System.Int32,Rhino.Geometry.BrepFace,System.Int32,System.Double,System.Double,Rhino.Geometry.Brep@,Rhino.Geometry.Brep@)
Extends Faces to meet and trims the faces to each other. If input faces intersect without extending, the selection point indicates the side to keep
Face0: [in] first face to connect
edgeIndex0: [in] edge to extend.
Face1: [in] second surface
edgeIndex1: [in] edge to extend.
tol: [in] tolerance used for intersecting faces and simplifing extension curve
angleTol: [in] angle tolerance in radians used for simplifying extendsion curve
outBrep0: [out] first face extended and trimmed to connect with the second face
outBrep1: [out] second face extended and trimmed to connect with the first face
Returns: true if valid connection found
Since: 8.9

Rhino.Geometry.Brep.CreateFromMesh(Rhino.Geometry.Mesh,System.Boolean)
Create a brep representation of a mesh
mesh:
trimmedTriangles:
if true, triangles in the mesh will be represented by trimmed planes in
the brep. If false, triangles in the mesh will be represented by
untrimmed singular bilinear NURBS surfaces in the brep.
Returns:
Since: 5.1

Rhino.Geometry.Brep.CreateFromBox(Rhino.Geometry.BoundingBox)
Constructs new brep that matches a bounding box.
box: A box to use for creation.
Returns: A new brep; or null on failure.
Since: 5.0

Rhino.Geometry.Brep.CreateFromBox(Rhino.Geometry.Box)
Constructs new brep that matches an aligned box.
box: Box to match.
Returns: A Brep with 6 faces that is similar to the Box.
Since: 5.0

Rhino.Geometry.Brep.CreateFromBox(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Constructs new brep from 8 corner points.
corners:
8 points defining the box corners arranged as the vN labels indicate.
v7_______e6____v6
|\             |\
| e7           | e5
|  \ ______e4_____\
e11 v4         |   v5
|   |        e10   |
|   |          |   |
v3--|---e2----v2   e9
\  e8          \  |
e3 |            e1|
\|             \|
v0_____e0______v1
Returns: A new brep, or null on error.
Since: 5.0

Rhino.Geometry.Brep.CreateFromCylinder(Rhino.Geometry.Cylinder,System.Boolean,System.Boolean)
Constructs a Brep definition of a cylinder.
cylinder: cylinder.IsFinite() must be true.
capBottom: if true end at cylinder.m_height[0] should be capped.
capTop: if true end at cylinder.m_height[1] should be capped.
Returns:
A Brep representation of the cylinder with a single face for the cylinder,
an edge along the cylinder seam, and vertices at the bottom and top ends of this
seam edge. The optional bottom/top caps are single faces with one circular edge
starting and ending at the bottom/top vertex.
Since: 5.0

Rhino.Geometry.Brep.CreateFromTorus(Rhino.Geometry.Torus)
Constructs a Brep definition of a torus.
torus: The torus.
Returns: A Brep representation of the torus if successful, null otherwise.
Since: 8.1

Rhino.Geometry.Brep.CreateFromSphere(Rhino.Geometry.Sphere)
Constructs a Brep definition of a sphere.
sphere: The input sphere provides the orienting plane and radius.
Returns: A Brep if successful, null on error.
Since: 5.0

Rhino.Geometry.Brep.CreateQuadSphere(Rhino.Geometry.Sphere)
Constructs a Brep definition of a quad sphere.
sphere: The input sphere provides the orienting plane and radius.
Returns: A Brep if successful, null on error.
Since: 6.0

Rhino.Geometry.Brep.CreateFromCone(Rhino.Geometry.Cone,System.Boolean)
Constructs a Brep representation of the cone with a single
face for the cone, an edge along the cone seam,
and vertices at the base and apex ends of this seam edge.
The optional cap is a single face with one circular edge
starting and ending at the base vertex.
cone: A cone value.
capBottom: if true the base of the cone should be capped.
Returns: A Brep if successful, null on error.
Since: 5.0

Rhino.Geometry.Brep.CreateFromRevSurface(Rhino.Geometry.RevSurface,System.Boolean,System.Boolean)
Constructs a brep form of a surface of revolution.
surface: The surface of revolution.
capStart:
if true, the start of the revolute is not on the axis of revolution,
and the surface of revolution is closed, then a circular cap will be
added to close of the hole at the start of the revolute.
capEnd:
if true, the end of the revolute is not on the axis of revolution,
and the surface of revolution is closed, then a circular cap will be
added to close of the hole at the end of the revolute.
Returns: A Brep if successful, null on error.
Since: 5.0

Rhino.Geometry.Brep.CreateFromSurface(Rhino.Geometry.Surface)
Constructs a Brep from a surface. The resulting Brep has an outer boundary made
from four trims. The trims are ordered so that they run along the south, east,
north, and then west side of the surface's parameter space.
surface: A surface to convert.
Returns: Resulting brep or null on failure.
Since: 5.0

Rhino.Geometry.Brep.CreateTrimmedPlane(Rhino.Geometry.Plane,Rhino.Geometry.Curve)
Create a Brep trimmed plane.
plane: Plane that will be trimmed.
curve: A simple (no self intersections) closed curve that defines the outer boundary of the trimmed plane.
Returns: Resulting brep or null on failure.
Since: 6.0

Rhino.Geometry.Brep.CreateTrimmedPlane(Rhino.Geometry.Plane,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})
Create a Brep trimmed plane.
plane: Plane that will be trimmed.
curves: A list of curves that form a simple (no self intersections) closed curve that defines the outer boundary of the trimmed plane.
Returns: Resulting brep or null on failure.
Since: 6.0

Rhino.Geometry.Brep.CreatePlanarBreps(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})
Constructs a set of planar breps as outlines by the loops.
inputLoops: Curve loops that delineate the planar boundaries.
Returns: An array of Planar Breps.
Since: 5.0
6.0

Rhino.Geometry.Brep.CreatePlanarBreps(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Double)
Constructs a set of planar breps as outlines by the loops.
inputLoops: Curve loops that delineate the planar boundaries.
tolerance:
Returns: An array of Planar Breps.
Since: 6.0

Rhino.Geometry.Brep.CreatePlanarBreps(Rhino.Geometry.Curve)
Constructs a set of planar breps as outlines by the loops.
inputLoop: A curve that should form the boundaries of the surfaces or polysurfaces.
Returns: An array of Planar Breps.
Since: 5.0
6.0

Rhino.Geometry.Brep.CreatePlanarBreps(Rhino.Geometry.Curve,System.Double)
Constructs a set of planar breps as outlines by the loops.
inputLoop: A curve that should form the boundaries of the surfaces or polysurfaces.
tolerance:
Returns: An array of Planar Breps.
Since: 6.0

Rhino.Geometry.Brep.CreateTrimmedSurface(Rhino.Geometry.BrepFace,Rhino.Geometry.Surface)
Constructs a Brep using the trimming information of a brep face and a surface.
Surface must be roughly the same shape and in the same location as the trimming brep face.
trimSource: BrepFace which contains trimmingSource brep.
surfaceSource: Surface that trims of BrepFace will be applied to.
Returns: A brep with the shape of surfaceSource and the trims of trimSource or null on failure.
Since: 5.0
6.0

Rhino.Geometry.Brep.CreateTrimmedSurface(Rhino.Geometry.BrepFace,Rhino.Geometry.Surface,System.Double)
Constructs a Brep using the trimming information of a brep face and a surface.
Surface must be roughly the same shape and in the same location as the trimming brep face.
trimSource: BrepFace which contains trimmingSource brep.
surfaceSource: Surface that trims of BrepFace will be applied to.
tolerance:
Returns: A brep with the shape of surfaceSource and the trims of trimSource or null on failure.
Since: 6.0

Rhino.Geometry.Brep.CreateFromCornerPoints(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
Makes a Brep with one face from three corner points.
corner1: A first corner.
corner2: A second corner.
corner3: A third corner.
tolerance:
Minimum edge length allowed before collapsing the side into a singularity.
Returns: A boundary representation, or null on error.
Since: 5.0

Rhino.Geometry.Brep.CreateFromCornerPoints(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
Makes a Brep with one face from four corner points.
corner1: A first corner.
corner2: A second corner.
corner3: A third corner.
corner4: A fourth corner.
tolerance:
Minimum edge length allowed before collapsing the side into a singularity.
Returns: A boundary representation, or null on error.
Since: 5.0

Rhino.Geometry.Brep.CreateEdgeSurface(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})
Constructs a coons patch from 2, 3, or 4 curves.
curves: A list, an array or any enumerable set of curves.
Returns: resulting brep or null on failure.
Since: 5.0

Rhino.Geometry.Brep.CreatePlanarBreps(Rhino.Collections.CurveList)
Constructs a set of planar Breps as outlines by the loops.
inputLoops: Curve loops that delineate the planar boundaries.
Returns: An array of Planar Breps or null on error.
Since: 5.0
6.0

Rhino.Geometry.Brep.CreatePlanarBreps(Rhino.Collections.CurveList,System.Double)
Constructs a set of planar Breps as outlines by the loops.
inputLoops: Curve loops that delineate the planar boundaries.
tolerance:
Returns: An array of Planar Breps.
Since: 6.0

Rhino.Geometry.Brep.CreateFromOffsetFace(Rhino.Geometry.BrepFace,System.Double,System.Double,System.Boolean,System.Boolean)
Offsets a face including trim information to create a new brep.
face: the face to offset.
offsetDistance: An offset distance.
offsetTolerance:
Use 0.0 to make a loose offset. Otherwise, the document's absolute tolerance is usually sufficient.
bothSides: When true, offset to both sides of the input face.
createSolid: When true, make a solid object.
Returns:
A new brep if successful. The brep can be disjoint if bothSides is true and createSolid is false,
or if createSolid is true and connecting the offsets with side surfaces fails.
null if unsuccessful.
Since: 5.0

Rhino.Geometry.Brep.CreateSolid(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double)
Constructs closed polysurfaces from surfaces and polysurfaces that bound a region in space.
breps:
The intersecting surfaces and polysurfaces to automatically trim and join into closed polysurfaces.
tolerance:
The trim and join tolerance. If set to RhinoMath.UnsetValue, Rhino's global absolute tolerance is used.
Returns: The resulting polysurfaces on success or null on failure.
Since: 5.0

Rhino.Geometry.Brep.MergeSurfaces(Rhino.Geometry.Surface,Rhino.Geometry.Surface,System.Double,System.Double)
Merges two surfaces into one surface at untrimmed edges.
surface0: The first surface to merge.
surface1: The second surface to merge.
tolerance: Surface edges must be within this tolerance for the two surfaces to merge.
angleToleranceRadians: Edge must be within this angle tolerance in order for contiguous edges to be combined into a single edge.
Returns: The merged surfaces as a Brep if successful, null if not successful.
Since: 6.0

Rhino.Geometry.Brep.MergeSurfaces(Rhino.Geometry.Brep,Rhino.Geometry.Brep,System.Double,System.Double)
Merges two surfaces into one surface at untrimmed edges. Both surfaces must be untrimmed and share an edge.
brep0: The first single-face Brep to merge.
brep1: The second single-face Brep to merge.
tolerance: Surface edges must be within this tolerance for the two surfaces to merge.
angleToleranceRadians: Edge must be within this angle tolerance in order for contiguous edges to be combined into a single edge.
Returns: The merged Brep if successful, null if not successful.
Since: 6.0

Rhino.Geometry.Brep.MergeSurfaces(Rhino.Geometry.Brep,Rhino.Geometry.Brep,System.Double,System.Double,Rhino.Geometry.Point2d,Rhino.Geometry.Point2d,System.Double,System.Boolean)
Merges two surfaces into one surface at untrimmed edges. Both surfaces must be untrimmed and share an edge.
brep0: The first single-face Brep to merge.
brep1: The second single-face Brep to merge.
tolerance: Surface edges must be within this tolerance for the two surfaces to merge.
angleToleranceRadians: Edge must be within this angle tolerance in order for contiguous edges to be combined into a single edge.
point0: 2D pick point on the first single-face Brep. The value can be unset.
point1: 2D pick point on the second single-face Brep. The value can be unset.
roundness: Defines the roundness of the merge. Acceptable values are between 0.0 (sharp) and 1.0 (smooth).
smooth: The surface will be smooth. This makes the surface behave better for control point editing, but may alter the shape of both surfaces.
Returns: The merged Brep if successful, null if not successful.
Since: 6.0

Rhino.Geometry.Brep.CreatePatch(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},Rhino.Geometry.Surface,System.Double)
Constructs a brep patch.
This is the simple version of fit that uses a specified starting surface.
geometry:
Combination of Curves, BrepTrims, Points, PointClouds or Meshes.
Curves and trims are sampled to get points. Trims are sampled for
points and normals.
startingSurface: A starting surface (can be null).
tolerance:
Tolerance used by input analysis functions for loop finding, trimming, etc.
Returns:
Brep fit through input on success, or null on error.
Since: 5.0

Rhino.Geometry.Brep.CreatePatch(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},System.Int32,System.Int32,System.Double)
Constructs a brep patch.
This is the simple version of fit that uses a plane with u x v spans.
It makes a plane by fitting to the points from the input geometry to use as the starting surface.
The surface has the specified u and v span count.
geometry:
A combination of curves, brep trims,
points, point clouds or meshes.
Curves and trims are sampled to get points. Trims are sampled for
points and normals.
uSpans: The number of spans in the U direction.
vSpans: The number of spans in the V direction.
tolerance:
Tolerance used by input analysis functions for loop finding, trimming, etc.
Returns:
A brep fit through input on success, or null on error.
Since: 5.0

Rhino.Geometry.Brep.CreatePatch(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},Rhino.Geometry.Surface,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Double,System.Double,System.Double,System.Boolean[],System.Double)
Constructs a brep patch using all controls
geometry:
A combination of curves, brep trims,
points, point clouds or meshes.
Curves and trims are sampled to get points. Trims are sampled for
points and normals.
startingSurface: A starting surface (can be null).
uSpans:
Number of surface spans used when a plane is fit through points to start in the U direction.
vSpans:
Number of surface spans used when a plane is fit through points to start in the U direction.
trim:
If true, try to find an outer loop from among the input curves and trim the result to that loop
tangency:
If true, try to find brep trims in the outer loop of curves and try to
fit to the normal direction of the trim's surface at those locations.
pointSpacing:
Basic distance between points sampled from input curves.
flexibility:
Determines the behavior of the surface in areas where its not otherwise
controlled by the input.  Lower numbers make the surface behave more
like a stiff material; higher, less like a stiff material.  That is,
each span is made to more closely match the spans adjacent to it if there
is no input geometry mapping to that area of the surface when the
flexibility value is low.  The scale is logarithmic. Numbers around 0.001
or 0.1 make the patch pretty stiff and numbers around 10 or 100 make the
surface flexible.
surfacePull:
Tends to keep the result surface where it was before the fit in areas where
there is on influence from the input geometry
fixEdges:
Array of four elements. Flags to keep the edges of a starting (untrimmed)
surface in place while fitting the interior of the surface.  Order of
flags is left, bottom, right, top
tolerance:
Tolerance used by input analysis functions for loop finding, trimming, etc.
Returns:
A brep fit through input on success, or null on error.
Since: 5.0

Rhino.Geometry.Brep.CreatePipe(Rhino.Geometry.Curve,System.Double,System.Boolean,Rhino.Geometry.PipeCapMode,System.Boolean,System.Double,System.Double)
Creates a single walled pipe.
rail: The rail, or path, curve.
radius: The radius of the pipe.
localBlending:
The shape blending.
If True, Local (pipe radius stays constant at the ends and changes more rapidly in the middle) is applied.
If False, Global (radius is linearly blended from one end to the other, creating pipes that taper from one radius to the other) is applied.
cap: The end cap mode.
fitRail:
If the curve is a polycurve of lines and arcs, the curve is fit and a single surface is created;
otherwise the result is a Brep with joined surfaces created from the polycurve segments.
absoluteTolerance:
The sweeping and fitting tolerance. When in doubt, use the document's absolute tolerance.
angleToleranceRadians:
The angle tolerance. When in doubt, use the document's angle tolerance in radians.
Returns: Array of Breps success.
Since: 5.0

Rhino.Geometry.Brep.CreatePipe(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean,Rhino.Geometry.PipeCapMode,System.Boolean,System.Double,System.Double)
Creates a single walled pipe.
rail: The rail, or path, curve.
railRadiiParameters:
One or more normalized curve parameters where changes in radius occur.
Important: curve parameters must be normalized - ranging between 0.0 and 1.0.
Use Interval.NormalizedParameterAt to calculate these.
radii: One or more radii - one at each normalized curve parameter in railRadiiParameters.
localBlending:
The shape blending.
If True, Local (pipe radius stays constant at the ends and changes more rapidly in the middle) is applied.
If False, Global (radius is linearly blended from one end to the other, creating pipes that taper from one radius to the other) is applied.
cap: The end cap mode.
fitRail:
If the curve is a polycurve of lines and arcs, the curve is fit and a single surface is created;
otherwise the result is a Brep with joined surfaces created from the polycurve segments.
absoluteTolerance:
The sweeping and fitting tolerance. When in doubt, use the document's absolute tolerance.
angleToleranceRadians:
The angle tolerance. When in doubt, use the document's angle tolerance in radians.
Returns: Array of Breps success.
Since: 5.0

Rhino.Geometry.Brep.CreateThickPipe(Rhino.Geometry.Curve,System.Double,System.Double,System.Boolean,Rhino.Geometry.PipeCapMode,System.Boolean,System.Double,System.Double)
Creates a double-walled pipe.
rail: The rail, or path, curve.
radius0: The first radius of the pipe.
radius1: The second radius of the pipe.
localBlending:
The shape blending.
If True, Local (pipe radius stays constant at the ends and changes more rapidly in the middle) is applied.
If False, Global (radius is linearly blended from one end to the other, creating pipes that taper from one radius to the other) is applied.
cap: The end cap mode.
fitRail:
If the curve is a polycurve of lines and arcs, the curve is fit and a single surface is created;
otherwise the result is a Brep with joined surfaces created from the polycurve segments.
absoluteTolerance:
The sweeping and fitting tolerance. When in doubt, use the document's absolute tolerance.
angleToleranceRadians:
The angle tolerance. When in doubt, use the document's angle tolerance in radians.
Returns: Array of Breps success.
Since: 7.0

Rhino.Geometry.Brep.CreateThickPipe(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Boolean,Rhino.Geometry.PipeCapMode,System.Boolean,System.Double,System.Double)
Creates a double-walled pipe.
rail: The rail, or path, curve.
railRadiiParameters:
One or more normalized curve parameters where changes in radius occur.
Important: curve parameters must be normalized - ranging between 0.0 and 1.0.
Use Interval.NormalizedParameterAt to calculate these.
radii0:
One or more radii for the first wall - one at each normalized curve parameter in railRadiiParameters.
radii1:
One or more radii for the second wall - one at each normalized curve parameter in railRadiiParameters.
localBlending:
The shape blending.
If True, Local (pipe radius stays constant at the ends and changes more rapidly in the middle) is applied.
If False, Global (radius is linearly blended from one end to the other, creating pipes that taper from one radius to the other) is applied.
cap: The end cap mode.
fitRail:
If the curve is a polycurve of lines and arcs, the curve is fit and a single surface is created;
otherwise the result is a Brep with joined surfaces created from the polycurve segments.
absoluteTolerance:
The sweeping and fitting tolerance. When in doubt, use the document's absolute tolerance.
angleToleranceRadians:
The angle tolerance. When in doubt, use the document's angle tolerance in radians.
Returns: Array of Breps success.
Since: 7.0

Rhino.Geometry.Brep.CreateFromSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Boolean,System.Double)
Sweep1 function that fits a surface through a profile curve that define the surface cross-sections
and one curve that defines a surface edge.
rail: Rail to sweep shapes along
shape: Shape curve
closed: Only matters if shape is closed
tolerance: Tolerance for fitting surface and rails
Returns: Array of Brep sweep results
Since: 5.0

Rhino.Geometry.Brep.CreateFromSweep(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Boolean,System.Double)
Sweep1 function that fits a surface through profile curves that define the surface cross-sections
and one curve that defines a surface edge.
rail: Rail to sweep shapes along
shapes: Shape curves
closed: Only matters if shapes are closed
tolerance: Tolerance for fitting surface and rails
Returns: Array of Brep sweep results
Since: 5.0

Rhino.Geometry.Brep.CreateFromSweep(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.SweepFrame,Rhino.Geometry.Vector3d,System.Boolean,Rhino.Geometry.SweepBlend,Rhino.Geometry.SweepMiter,System.Double,Rhino.Geometry.SweepRebuild,System.Int32,System.Double)
Sweep1 function that fits a surface through a series of profile curves that define the surface cross-sections
and one curve that defines a surface edge.
rail: Rail to sweep shapes along.
shapes: Shape curves.
startPoint: Optional starting point of sweep. Use Point3d.Unset if you do not want to include a start point.
endPoint: Optional ending point of sweep. Use Point3d.Unset if you do not want to include an end point.
frameType: The frame type.
roadlikeNormal: The roadlike normal directoion. Use Vector3d.Unset if the frame type is not set to roadlike.
closed: Only matters if shapes are closed.
blendType: The shape blending type.
miterType: The mitering type.
tolerance:
rebuildType: The rebuild style.
rebuildPointCount: If rebuild == SweepRebuild.Rebuild, the number of points. Otherwise specify 0.
refitTolerance: If rebuild == SweepRebuild.Refit, the refit tolerance. Otherwise, specify 0.0
Returns: Array of Brep sweep results.
Since: 7.0

Rhino.Geometry.Brep.CreateFromSweepSegmented(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Boolean,System.Double)
Sweep1 function that fits a surface through a profile curve that define the surface cross-sections
and one curve that defines a surface edge. The Segmented version breaks the rail at curvature kinks
and sweeps each piece separately, then put the results together into a Brep.
rail: Rail to sweep shapes along
shape: Shape curve
closed: Only matters if shape is closed
tolerance: Tolerance for fitting surface and rails
Returns: Array of Brep sweep results
Since: 6.14

Rhino.Geometry.Brep.CreateFromSweepSegmented(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Boolean,System.Double)
Sweep1 function that fits a surface through a series of profile curves that define the surface cross-sections
and one curve that defines a surface edge. The Segmented version breaks the rail at curvature kinks
and sweeps each piece separately, then put the results together into a Brep.
rail: Rail to sweep shapes along.
shapes: Shape curves.
closed: Only matters if shapes are closed.
tolerance: Tolerance for fitting surface and rails.
Returns: Array of Brep sweep results.
Since: 6.14

Rhino.Geometry.Brep.CreateFromSweepSegmented(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.SweepFrame,Rhino.Geometry.Vector3d,System.Boolean,Rhino.Geometry.SweepBlend,Rhino.Geometry.SweepMiter,System.Double,Rhino.Geometry.SweepRebuild,System.Int32,System.Double)
Sweep1 function that fits a surface through a series of profile curves that define the surface cross-sections
and one curve that defines a surface edge. The Segmented version breaks the rail at curvature kinks
and sweeps each piece separately, then put the results together into a Brep.
rail: Rail to sweep shapes along.
shapes: Shape curves.
startPoint: Optional starting point of sweep. Use Point3d.Unset if you do not want to include a start point.
endPoint: Optional ending point of sweep. Use Point3d.Unset if you do not want to include an end point.
frameType: The frame type.
roadlikeNormal: The roadlike normal directoion. Use Vector3d.Unset if the frame type is not set to roadlike.
closed: Only matters if shapes are closed.
blendType: The shape blending type.
miterType: The mitering type.
tolerance:
rebuildType: The rebuild style.
rebuildPointCount: If rebuild == SweepRebuild.Rebuild, the number of points. Otherwise specify 0.
refitTolerance: If rebuild == SweepRebuild.Refit, the refit tolerance. Otherwise, specify 0.0
Returns: Array of Brep sweep results.
Since: 7.0

Rhino.Geometry.Brep.CreateFromSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Boolean,System.Double)
General 2 rail sweep. If you are not producing the sweep results that you are after, then
use the SweepTwoRail class with options to generate the swept geometry.
rail1: Rail to sweep shapes along
rail2: Rail to sweep shapes along
shape: Shape curve
closed: Only matters if shape is closed
tolerance: Tolerance for fitting surface and rails
Returns: Array of Brep sweep results
Since: 5.0

Rhino.Geometry.Brep.CreateFromSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Boolean,System.Double)
General 2 rail sweep. If you are not producing the sweep results that you are after, then
use the SweepTwoRail class with options to generate the swept geometry.
rail1: Rail to sweep shapes along
rail2: Rail to sweep shapes along
shapes: Shape curves
closed: Only matters if shapes are closed
tolerance: Tolerance for fitting surface and rails
Returns: Array of Brep sweep results
Since: 5.0

Rhino.Geometry.Brep.CreateFromSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Double,Rhino.Geometry.SweepRebuild,System.Int32,System.Double,System.Boolean)
Sweep2 function that fits a surface through profile curves that define the surface cross-sections
and two curves that defines the surface edges.
rail1: Rail to sweep shapes along
rail2: Rail to sweep shapes along
shapes: Shape curves
start: Optional starting point of sweep. Use Point3d.Unset if you do not want to include a start point.
end: Optional ending point of sweep. Use Point3d.Unset if you do not want to include an end point.
closed: Only matters if shapes are closed.
tolerance: Tolerance for fitting surface and rails.
rebuild: The rebuild style.
rebuildPointCount: If rebuild == SweepRebuild.Rebuild, the number of points. Otherwise specify 0.
refitTolerance: If rebuild == SweepRebuild.Refit, the refit tolerance. Otherwise, specify 0.0
preserveHeight: Removes the association between the height scaling from the width scaling
Returns: Array of Brep sweep results
Since: 6.16

Rhino.Geometry.Brep.CreateFromSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Double,Rhino.Geometry.SweepRebuild,System.Int32,System.Double,System.Boolean,System.Boolean)
Sweep2 function that fits a surface through profile curves that define the surface cross-sections
and two curves that defines the surface edges.
rail1: Rail to sweep shapes along
rail2: Rail to sweep shapes along
shapes: Shape curves
start: Optional starting point of sweep. Use Point3d.Unset if you do not want to include a start point.
end: Optional ending point of sweep. Use Point3d.Unset if you do not want to include an end point.
closed: Only matters if shapes are closed.
tolerance: Tolerance for fitting surface and rails.
rebuild: The rebuild style.
rebuildPointCount: If rebuild == SweepRebuild.Rebuild, the number of points. Otherwise specify 0.
refitTolerance: If rebuild == SweepRebuild.Refit, the refit tolerance. Otherwise, specify 0.0
preserveHeight: Removes the association between the height scaling from the width scaling
autoAdjust:
Set to true to have shape curves adjusted, sorted, and matched automatically.
This will produce results comparable to Rhino's Sweep2 command.
Set to false to not have shape curves adjusted, sorted, and matched automatically.
Returns: Array of Brep sweep results
Since: 7.19

Rhino.Geometry.Brep.CreateFromSweepInParts(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d},System.Boolean,System.Double)
Makes a 2 rail sweep. Like CreateFromSweep but the result is split where parameterization along a rail changes abruptly.
rail1: Rail to sweep shapes along
rail2: Rail to sweep shapes along
shapes: Shape curves    ///
rail_params: Shape parameters
closed: Only matters if shapes are closed
tolerance: Tolerance for fitting surface and rails
Returns: Array of Brep sweep results
Since: 6.0

Rhino.Geometry.Brep.CreateFromTaperedExtrude(Rhino.Geometry.Curve,System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d,System.Double,Rhino.Geometry.ExtrudeCornerType,System.Double,System.Double)
Extrude a curve to a taper making a brep (potentially more than 1)
curveToExtrude: the curve to extrude
distance: the distance to extrude
direction: the direction of the extrusion
basePoint: the base point of the extrusion
draftAngleRadians: angle of the extrusion
cornerType:
tolerance: tolerance to use for the extrusion
angleToleranceRadians: angle tolerance to use for the extrusion
Returns: array of breps on success
Since: 6.0

Rhino.Geometry.Brep.CreateFromTaperedExtrude(Rhino.Geometry.Curve,System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d,System.Double,Rhino.Geometry.ExtrudeCornerType)
Extrude a curve to a taper making a brep (potentially more than 1)
curveToExtrude: the curve to extrude
distance: the distance to extrude
direction: the direction of the extrusion
basePoint: the base point of the extrusion
draftAngleRadians: angle of the extrusion
cornerType:
Returns: array of breps on success
Remarks: tolerances used are based on the active doc tolerance
Since: 5.1
6.0

Rhino.Geometry.Brep.CreateFromTaperedExtrudeWithRef(Rhino.Geometry.Curve,Rhino.Geometry.Vector3d,System.Double,System.Double,Rhino.Geometry.Plane,System.Double)
Creates one or more Breps by extruding a curve a distance along an axis with draft angle.
curve: The curve to extrude.
direction: The extrusion direction.
distance: The extrusion distance.
draftAngle: The extrusion draft angle in radians.
plane:
The end of the extrusion will be parallel to this plane, and "distance" from the plane's origin.
The plane's origin is generally be a point on the curve. For planar curves, a natural choice for the
plane's normal direction will be the normal direction of the curve's plane. In any case,
plane.Normal = direction may make sense.
tolerance: The intersecting and trimming tolerance.
Returns: An array of Breps if successful.
Since: 6.14

Rhino.Geometry.Brep.CreateBlendSurface(Rhino.Geometry.BrepFace,Rhino.Geometry.BrepEdge,Rhino.Geometry.Interval,System.Boolean,Rhino.Geometry.BlendContinuity,Rhino.Geometry.BrepFace,Rhino.Geometry.BrepEdge,Rhino.Geometry.Interval,System.Boolean,Rhino.Geometry.BlendContinuity)
Makes a surface blend between two surface edges.
face0: First face to blend from.
edge0: First edge to blend from.
domain0: The domain of edge0 to use.
rev0: If false, edge0 will be used in its natural direction. If true, edge0 will be used in the reversed direction.
continuity0: Continuity for the blend at the start.
face1: Second face to blend from.
edge1: Second edge to blend from.
domain1: The domain of edge1 to use.
rev1: If false, edge1 will be used in its natural direction. If true, edge1 will be used in the reversed direction.
continuity1: Continuity for the blend at the end.
Returns: Array of Breps if successful.
Since: 6.0

Rhino.Geometry.Brep.CreateBlendShape(Rhino.Geometry.BrepFace,Rhino.Geometry.BrepEdge,System.Double,System.Boolean,Rhino.Geometry.BlendContinuity,Rhino.Geometry.BrepFace,Rhino.Geometry.BrepEdge,System.Double,System.Boolean,Rhino.Geometry.BlendContinuity)
Makes a curve blend between points on two surface edges. The blend will be tangent to the surfaces and perpendicular to the edges.
face0: First face to blend from.
edge0: First edge to blend from.
t0: Location on first edge for first end of blend curve.
rev0: If false, edge0 will be used in its natural direction. If true, edge0 will be used in the reversed direction.
continuity0: Continuity for the blend at the start.
face1: Second face to blend from.
edge1: Second edge to blend from.
t1: Location on second edge for second end of blend curve.
rev1: If false, edge1 will be used in its natural direction. If true, edge1 will be used in the reversed direction.
continuity1: >Continuity for the blend at the end.
Returns: The blend curve on success. null on failure
Since: 6.0

Rhino.Geometry.Brep.CreateFilletSurface(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,System.Boolean,System.Double)
Creates a constant-radius round surface between two surfaces.
face0: First face to fillet from.
uv0: A parameter face0 at the side you want to keep after filleting.
face1: Second face to fillet from.
uv1: A parameter face1 at the side you want to keep after filleting.
radius: The fillet radius.
extend: If true, then when one input surface is longer than the other, the fillet surface is extended to the input surface edges.
tolerance: The tolerance. When in doubt, use the document's model absolute tolerance.
Returns: Array of Breps if successful.
Since: 6.0

Rhino.Geometry.Brep.CreateFilletSurface(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,System.Boolean,System.Boolean,System.Double,Rhino.Geometry.Brep[]@,Rhino.Geometry.Brep[]@)
Creates a constant-radius round surface between two surfaces.
face0: First face to fillet from.
uv0: A parameter face0 at the side you want to keep after filleting.
face1: Second face to fillet from.
uv1: A parameter face1 at the side you want to keep after filleting.
radius: The fillet radius.
trim: If true, the input faces will be trimmed, if false, the input faces will be split.
extend: If true, then when one input surface is longer than the other, the fillet surface is extended to the input surface edges.
tolerance: The tolerance. When in doubt, use the document's model absolute tolerance.
outBreps0: The trim or split results of the Brep owned by face0.
outBreps1: The trim or split results of the Brep owned by face1.
Returns: Array of Breps if successful.
Since: 6.0

Rhino.Geometry.Brep.CreateChamferSurface(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,System.Boolean,System.Double)
Creates a ruled surface as a bevel between two input surface edges.
face0: First face to chamfer from.
uv0: A parameter face0 at the side you want to keep after chamfering.
radius0: The distance from the intersection of face0 to the edge of the chamfer.
face1: Second face to chamfer from.
uv1: A parameter face1 at the side you want to keep after chamfering.
radius1: The distance from the intersection of face1 to the edge of the chamfer.
extend: If true, then when one input surface is longer than the other, the chamfer surface is extended to the input surface edges.
tolerance: The tolerance. When in doubt, use the document's model absolute tolerance.
Returns: Array of Breps if successful.
Since: 6.0

Rhino.Geometry.Brep.CreateChamferSurface(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,System.Boolean,System.Boolean,System.Double,Rhino.Geometry.Brep[]@,Rhino.Geometry.Brep[]@)
Creates a ruled surface as a bevel between two input surface edges.
face0: First face to chamfer from.
uv0: A parameter face0 at the side you want to keep after chamfering.
radius0: The distance from the intersection of face0 to the edge of the chamfer.
face1: Second face to chamfer from.
uv1: A parameter face1 at the side you want to keep after chamfering.
radius1: The distance from the intersection of face1 to the edge of the chamfer.
trim: If true, the input faces will be trimmed, if false, the input faces will be split.
extend: If true, then when one input surface is longer than the other, the chamfer surface is extended to the input surface edges.
tolerance: The tolerance. When in doubt, use the document's model absolute tolerance.
outBreps0: The trim or split results of the Brep owned by face0.
outBreps1: The trim or split results of the Brep owned by face1.
Returns: Array of Breps if successful.
Since: 6.0

Rhino.Geometry.Brep.CreateFilletEdges(Rhino.Geometry.Brep,System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},Rhino.Geometry.BlendType,Rhino.Geometry.RailType,System.Double)
Fillets, chamfers, or blends the edges of a brep.
brep: The brep to fillet, chamfer, or blend edges.
edgeIndices: An array of one or more edge indices where the fillet, chamfer, or blend will occur.
startRadii: An array of starting fillet, chamfer, or blend radaii, one for each edge index.
endRadii: An array of ending fillet, chamfer, or blend radaii, one for each edge index.
blendType: The blend type.
railType: The rail type.
tolerance: The tolerance to be used to perform calculations.
Returns: Array of Breps if successful.
Since: 6.0

Rhino.Geometry.Brep.CreateFilletEdges(Rhino.Geometry.Brep,System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},Rhino.Geometry.BlendType,Rhino.Geometry.RailType,System.Boolean,System.Double,System.Double)
Fillets, chamfers, or blends the edges of a brep.
brep: The brep to fillet, chamfer, or blend edges.
edgeIndices: An array of one or more edge indices where the fillet, chamfer, or blend will occur.
startRadii: An array of starting fillet, chamfer, or blend radaii, one for each edge index.
endRadii: An array of ending fillet, chamfer, or blend radaii, one for each edge index.
blendType: The blend type.
railType: The rail type.
setbackFillets: UJse setback fillets (only used with blendType=Rhino.Geometry.BlendType.Blend)
tolerance: The tolerance to be used to perform calculations.
angleTolerance: Angle tolerance to be used to perform calculations [radians].
Returns: Array of Breps if successful.
Since: 8.6

Rhino.Geometry.Brep.CreateFilletEdgesVariableRadius(Rhino.Geometry.Brep,System.Collections.Generic.IEnumerable{System.Int32},System.Collections.Generic.IDictionary{System.Int32,System.Collections.Generic.IList{Rhino.Geometry.BrepEdgeFilletDistance}},Rhino.Geometry.BlendType,Rhino.Geometry.RailType,System.Boolean,System.Double,System.Double)
Fillets, chamfers, or blends the edges of a brep.
brep: The brep to fillet, chamfer, or blend edges.
edgeIndices: An array of one or more edge indices where the fillet, chamfer, or blend will occur.
edgeDistances: A dictionary with key the edge index on the input brep, and value a list of Rhino.Geometry.BrepEdgeFilletDistance items to apply.
blendType: The blend type.
railType: The rail type.
setbackFillets: UJse setback fillets (only used with blendType=Rhino.Geometry.BlendType.Blend)
tolerance: The tolerance to be used to perform calculations.
angleTolerance: Angle tolerance to be used to perform calculations [radians].
Returns: Array of Breps if successful.
Since: 8.6

Rhino.Geometry.Brep.CreateOffsetBrep(Rhino.Geometry.Brep,System.Double,System.Boolean,System.Boolean,System.Double,Rhino.Geometry.Brep[]@,Rhino.Geometry.Brep[]@)
Offsets a Brep.
brep: The Brep to offset.
distance:
The distance to offset. This is a signed distance value with respect to
face normals and flipped faces.
solid:
If true, then the function makes a closed solid from the input and offset
surfaces by lofting a ruled surface between all of the matching edges.
extend:
If true, then the function maintains the sharp corners when the original
surfaces have sharps corner. If False, then the function creates fillets
at sharp corners in the original surfaces.
tolerance: The offset tolerance.
outBlends: The results of the calculation.
outWalls: The results of the calculation.
Returns:
Array of Breps if successful. If the function succeeds in offsetting, a
single Brep will be returned. Otherwise, the array will contain the
offset surfaces, outBlends will contain the set of blends used to fill
in gaps (if extend is false), and outWalls will contain the set of wall
surfaces that was supposed to join the offset to the original (if solid
is true).
Since: 6.0

Rhino.Geometry.Brep.CreateOffsetBrep(Rhino.Geometry.Brep,System.Double,System.Boolean,System.Boolean,System.Boolean,System.Double,Rhino.Geometry.Brep[]@,Rhino.Geometry.Brep[]@)
Offsets a Brep.
brep: The Brep to offset.
distance:
The distance to offset. This is a signed distance value with respect to
face normals and flipped faces.
solid:
If true, then the function makes a closed solid from the input and offset
surfaces by lofting a ruled surface between all of the matching edges.
extend:
If true, then the function maintains the sharp corners when the original
surfaces have sharps corner. If False, then the function creates fillets
at sharp corners in the original surfaces.
shrink:
If true, then the function shrinks the underlying surfaces to their face's outer boundary loop.
tolerance: The offset tolerance.
outBlends: The results of the calculation.
outWalls: The results of the calculation.
Returns:
Array of Breps if successful. If the function succeeds in offsetting, a
single Brep will be returned. Otherwise, the array will contain the
offset surfaces, outBlends will contain the set of blends used to fill
in gaps (if extend is false), and outWalls will contain the set of wall
surfaces that was supposed to join the offset to the original (if solid
is true).
Since: 7.5

Rhino.Geometry.Brep.RemoveFins
Recursively removes any Brep face with a naked edge. This function is only useful for non-manifold Breps.
Returns: true if successful, false if everything is removed or if the result has any Brep edges with more than two Brep trims.
Since: 7.0

Rhino.Geometry.Brep.CreateFromJoinedEdges(Rhino.Geometry.Brep,System.Int32,Rhino.Geometry.Brep,System.Int32,System.Double)
Joins two naked edges, or edges that are coincident or close together, from two Breps.
brep0: The first Brep.
edgeIndex0: The edge index on the first Brep.
brep1: The second Brep.
edgeIndex1: The edge index on the second Brep.
joinTolerance: The join tolerance.
Returns: The resulting Brep if successful, null on failure.
Since: 6.0

Rhino.Geometry.Brep.CreateFromLoft(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.LoftType,System.Boolean)
Constructs one or more Breps by lofting through a set of curves.
curves:
The curves to loft through. This function will not perform any curve sorting. You must pass in
curves in the order you want them lofted. This function will not adjust the directions of open
curves. Use Curve.DoDirectionsMatch and Curve.Reverse to adjust the directions of open curves.
This function will not adjust the seams of closed curves. Use Curve.ChangeClosedCurveSeam to
adjust the seam of closed curves.
start:
Optional starting point of loft. Use Point3d.Unset if you do not want to include a start point.
end:
Optional ending point of loft. Use Point3d.Unset if you do not want to include an end point.
loftType: type of loft to perform.
closed: true if the last curve in this loft should be connected back to the first one.
Returns:
Constructs a closed surface, continuing the surface past the last curve around to the
first curve. Available when you have selected three shape curves.
Since: 5.0

Rhino.Geometry.Brep.CreateFromLoft(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.LoftType,System.Boolean,System.Double)
Constructs one or more Breps by lofting through a set of curves.
curves:
The curves to loft through. This function will not perform any curve sorting. You must pass in
curves in the order you want them lofted. This function will not adjust the directions of open
curves. Use Curve.DoDirectionsMatch and Curve.Reverse to adjust the directions of open curves.
This function will not adjust the seams of closed curves. Use Curve.ChangeClosedCurveSeam to
adjust the seam of closed curves.
start:
Optional starting point of loft. Use Point3d.Unset if you do not want to include a start point.
end:
Optional ending point of loft. Use Point3d.Unset if you do not want to include an end point.
loftType: type of loft to perform.
closed: true if the last curve in this loft should be connected back to the first one.
angleTol: angle tolerance, in radians, used to perform the loft.
Returns:
Constructs a closed surface, continuing the surface past the last curve around to the
first curve. Available when you have selected three shape curves.
Since: 8.21

Rhino.Geometry.Brep.CreateFromLoftRebuild(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.LoftType,System.Boolean,System.Int32)
Constructs one or more Breps by lofting through a set of curves. Input for the loft is simplified by
rebuilding to a specified number of control points.
curves:
The curves to loft through. This function will not perform any curve sorting. You must pass in
curves in the order you want them lofted. This function will not adjust the directions of open
curves. Use Curve.DoDirectionsMatch and Curve.Reverse to adjust the directions of open curves.
This function will not adjust the seams of closed curves. Use Curve.ChangeClosedCurveSeam to
adjust the seam of closed curves.
start:
Optional starting point of loft. Use Point3d.Unset if you do not want to include a start point.
end:
Optional ending point of lost. Use Point3d.Unset if you do not want to include an end point.
loftType: type of loft to perform.
closed: true if the last curve in this loft should be connected back to the first one.
rebuildPointCount: A number of points to use while rebuilding the curves. 0 leaves turns this parameter off.
Returns:
Constructs a closed surface, continuing the surface past the last curve around to the
first curve. Available when you have selected three shape curves.
Since: 5.0

Rhino.Geometry.Brep.CreateFromLoftRebuild(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.LoftType,System.Boolean,System.Double,System.Int32)
Constructs one or more Breps by lofting through a set of curves. Input for the loft is simplified by
rebuilding to a specified number of control points.
curves:
The curves to loft through. This function will not perform any curve sorting. You must pass in
curves in the order you want them lofted. This function will not adjust the directions of open
curves. Use Curve.DoDirectionsMatch and Curve.Reverse to adjust the directions of open curves.
This function will not adjust the seams of closed curves. Use Curve.ChangeClosedCurveSeam to
adjust the seam of closed curves.
start:
Optional starting point of loft. Use Point3d.Unset if you do not want to include a start point.
end:
Optional ending point of lost. Use Point3d.Unset if you do not want to include an end point.
loftType: type of loft to perform.
closed: true if the last curve in this loft should be connected back to the first one.
angleTol: angle tolerance, in radians, used to perform the loft.
rebuildPointCount: A number of points to use while rebuilding the curves. 0 leaves turns this parameter off.
Returns:
Constructs a closed surface, continuing the surface past the last curve around to the
first curve. Available when you have selected three shape curves.
Since: 8.21

Rhino.Geometry.Brep.CreateFromLoftRefit(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.LoftType,System.Boolean,System.Double)
Constructs one or more Breps by lofting through a set of curves. Input for the loft is simplified by
refitting to a specified tolerance.
curves:
The curves to loft through. This function will not perform any curve sorting. You must pass in
curves in the order you want them lofted. This function will not adjust the directions of open
curves. Use Curve.DoDirectionsMatch and Curve.Reverse to adjust the directions of open curves.
This function will not adjust the seams of closed curves. Use Curve.ChangeClosedCurveSeam to
adjust the seam of closed curves.
start:
Optional starting point of loft. Use Point3d.Unset if you do not want to include a start point.
end:
Optional ending point of lost. Use Point3d.Unset if you do not want to include an end point.
loftType: type of loft to perform.
closed: true if the last curve in this loft should be connected back to the first one.
refitTolerance: A distance to use in refitting, or 0 if you want to turn this parameter off.
Returns:
Constructs a closed surface, continuing the surface past the last curve around to the
first curve. Available when you have selected three shape curves.
Since: 5.0

Rhino.Geometry.Brep.CreateFromLoftRefit(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.LoftType,System.Boolean,System.Double,System.Double)
Constructs one or more Breps by lofting through a set of curves. Input for the loft is simplified by
refitting to a specified tolerance.
curves:
The curves to loft through. This function will not perform any curve sorting. You must pass in
curves in the order you want them lofted. This function will not adjust the directions of open
curves. Use Curve.DoDirectionsMatch and Curve.Reverse to adjust the directions of open curves.
This function will not adjust the seams of closed curves. Use Curve.ChangeClosedCurveSeam to
adjust the seam of closed curves.
start:
Optional starting point of loft. Use Point3d.Unset if you do not want to include a start point.
end:
Optional ending point of lost. Use Point3d.Unset if you do not want to include an end point.
loftType: type of loft to perform.
closed: true if the last curve in this loft should be connected back to the first one.
angleTol: angle tolerance, in radians, used to perform the loft.
refitTolerance: A distance to use in refitting, or 0 if you want to turn this parameter off.
Returns:
Constructs a closed surface, continuing the surface past the last curve around to the
first curve. Available when you have selected three shape curves.
Since: 8.21

Rhino.Geometry.Brep.CreateFromLoft(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Boolean,Rhino.Geometry.BrepTrim,Rhino.Geometry.BrepTrim,Rhino.Geometry.LoftType,System.Boolean)
Constructs one or more Breps by lofting through a set of curves, optionally matching start and
end tangents of surfaces when first and/or last loft curves are surface edges
curves:
The curves to loft through. This function will not perform any curve sorting. You must pass in
curves in the order you want them lofted. This function will not adjust the directions of open
curves. Use Curve.DoDirectionsMatch and Curve.Reverse to adjust the directions of open curves.
This function will not adjust the seams of closed curves. Use Curve.ChangeClosedCurveSeam to
adjust the seam of closed curves.
start:
Optional starting point of loft. Use Point3d.Unset if you do not want to include a start point.
"start" and "StartTangent" cannot both be true.
end:
Optional ending point of loft. Use Point3d.Unset if you do not want to include an end point.
"end and "EndTangent" cannot both be true.
StartTangent:
If StartTangent is true and the first loft curve is a surface edge, the loft will match the tangent
of the surface behind that edge.
EndTangent:
If EndTangent is true and the first loft curve is a surface edge, the loft will match the tangent
of the surface behind that edge.
StartTrim:
BrepTrim from the surface edge where start tangent is to be matched
EndTrim:
BrepTrim from the surface edge where end tangent is to be matched
loftType: type of loft to perform.
closed: true if the last curve in this loft should be connected back to the first one.
Returns:
Constructs a closed surface, continuing the surface past the last curve around to the
first curve. Available when you have selected three shape curves.
Since: 7.0

Rhino.Geometry.Brep.CreatePlanarUnion(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},Rhino.Geometry.Plane,System.Double)
CreatePlanarUnion
breps: The planar regions on which to perform the union operation.
plane: The plane in which all the input breps lie
tolerance: Tolerance to use for union operation.
Returns: An array of Brep results or null on failure.
Since: 7.0

Rhino.Geometry.Brep.CreatePlanarUnion(Rhino.Geometry.Brep,Rhino.Geometry.Brep,Rhino.Geometry.Plane,System.Double)
CreatePlanarUnion
b0: The first brep to union.
b1: The first brep to union.
plane: The plane in which all the input breps lie
tolerance: Tolerance to use for union operation.
Returns: An array of Brep results or null on failure.
Since: 7.0

Rhino.Geometry.Brep.CreatePlanarDifference(Rhino.Geometry.Brep,Rhino.Geometry.Brep,Rhino.Geometry.Plane,System.Double)
CreatePlanarDifference
b0: The first brep to intersect.
b1: The first brep to intersect.
plane: The plane in which all the input breps lie
tolerance: Tolerance to use for Difference operation.
Returns: An array of Brep results or null on failure.
Since: 7.0

Rhino.Geometry.Brep.CreatePlanarIntersection(Rhino.Geometry.Brep,Rhino.Geometry.Brep,Rhino.Geometry.Plane,System.Double)
CreatePlanarIntersection
b0: The first brep to intersect.
b1: The second brep to intersect.
plane: The plane in which all the input breps lie
tolerance: Tolerance to use for intersection operation.
Returns: An array of Brep results or null on failure.
Since: 7.0

Rhino.Geometry.Brep.CreateBooleanUnion(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double)
Compute the Boolean Union of a set of Breps.
breps: Breps to union.
tolerance: Tolerance to use for union operation.
Returns: An array of Brep results or null on failure.
Since: 5.0

Rhino.Geometry.Brep.CreateBooleanUnion(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double,System.Boolean)
Compute the Boolean Union of a set of Breps.
breps: Breps to union.
tolerance: Tolerance to use for union operation.
manifoldOnly: If true, non-manifold input breps are ignored.
Returns: An array of Brep results or null on failure.
Since: 6.0

Rhino.Geometry.Brep.CreateBooleanUnion(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double,System.Boolean,Rhino.Geometry.Point3d[]@,Rhino.Geometry.Point3d[]@,Rhino.Geometry.Point3d[]@)
Compute the Boolean Union of a set of Breps.
breps: Breps to union.
tolerance: Tolerance to use for union operation.
manifoldOnly: If true, non-manifold input breps are ignored.
nakedEdgePoints:
If Boolean failed because the intersection hit a naked edge, a point will be added where the intersection hits the edge.
badIntersectionPoints:
If Boolean failed because an intersection ends on the interior of both surfaces, a point is added.This happens when the surface intersector fails.
nonManifoldEdgePoints:
If Boolean failed because the intersection hit a non-manifold edge, a point will be added where the intersection hits the edge.
Returns: An array of Brep results or null on failure.
Since: 8.0

Rhino.Geometry.Brep.CreateBooleanIntersection(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double)
Compute the Solid Intersection of two sets of Breps.
firstSet: First set of Breps.
secondSet: Second set of Breps.
tolerance: Tolerance to use for intersection operation.
Returns: An array of Brep results or null on failure.
Remarks: The solid orientation of the breps make a difference when calling this function
Since: 5.0

Rhino.Geometry.Brep.CreateBooleanIntersection(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double,System.Boolean)
Compute the Solid Intersection of two sets of Breps.
firstSet: First set of Breps.
secondSet: Second set of Breps.
tolerance: Tolerance to use for intersection operation.
manifoldOnly: If true, non-manifold input breps are ignored.
Returns: An array of Brep results or null on failure.
Remarks: The solid orientation of the breps make a difference when calling this function
Since: 6.0

Rhino.Geometry.Brep.CreateBooleanIntersection(Rhino.Geometry.Brep,Rhino.Geometry.Brep,System.Double)
Compute the Solid Intersection of two Breps.
firstBrep: First Brep for boolean intersection.
secondBrep: Second Brep for boolean intersection.
tolerance: Tolerance to use for intersection operation.
Returns: An array of Brep results or null on failure.
Remarks: The solid orientation of the breps make a difference when calling this function
Since: 5.0

Rhino.Geometry.Brep.CreateBooleanIntersection(Rhino.Geometry.Brep,Rhino.Geometry.Brep,System.Double,System.Boolean)
Compute the Solid Intersection of two Breps.
firstBrep: First Brep for boolean intersection.
secondBrep: Second Brep for boolean intersection.
tolerance: Tolerance to use for intersection operation.
manifoldOnly: If true, non-manifold input breps are ignored.
Returns: An array of Brep results or null on failure.
Remarks: The solid orientation of the breps make a difference when calling this function
Since: 6.0

Rhino.Geometry.Brep.CreateBooleanDifference(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double)
Compute the Solid Difference of two sets of Breps.
firstSet: First set of Breps (the set to subtract from).
secondSet: Second set of Breps (the set to subtract).
tolerance: Tolerance to use for difference operation.
Returns: An array of Brep results or null on failure.
Remarks: The solid orientation of the breps make a difference when calling this function
Since: 5.0

Rhino.Geometry.Brep.CreateBooleanDifference(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double,System.Boolean)
Compute the Solid Difference of two sets of Breps.
firstSet: First set of Breps (the set to subtract from).
secondSet: Second set of Breps (the set to subtract).
tolerance: Tolerance to use for difference operation.
manifoldOnly: If true, non-manifold input breps are ignored.
Returns: An array of Brep results or null on failure.
Remarks: The solid orientation of the breps make a difference when calling this function
Since: 6.0

Rhino.Geometry.Brep.CreateBooleanDifference(Rhino.Geometry.Brep,Rhino.Geometry.Brep,System.Double)
Compute the Solid Difference of two Breps.
firstBrep: First Brep for boolean difference.
secondBrep: Second Brep for boolean difference.
tolerance: Tolerance to use for difference operation.
Returns: An array of Brep results or null on failure.
Remarks: The solid orientation of the breps make a difference when calling this function
Since: 5.0

Rhino.Geometry.Brep.CreateBooleanDifference(Rhino.Geometry.Brep,Rhino.Geometry.Brep,System.Double,System.Boolean)
Compute the Solid Difference of two Breps.
firstBrep: First Brep for boolean difference.
secondBrep: Second Brep for boolean difference.
tolerance: Tolerance to use for difference operation.
manifoldOnly: If true, non-manifold input breps are ignored.
Returns: An array of Brep results or null on failure.
Remarks: The solid orientation of the breps make a difference when calling this function
Since: 6.0

Rhino.Geometry.Brep.CreateBooleanDifferenceWithIndexMap(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double,System.Boolean,System.Int32[]@)
Compute the solid difference between two sets of Breps.
firstSet: The set to be differenced from.
secondSet: The set to difference with.
tolerance: Tolerance to use for the boolean operation.
manifoldOnly: If true, non-manifold input breps are ignored.
indexMap: results[i] is the result if subtracting something from firstSet[indexMap[i]].
Returns: An array of Brep results or null on failure. May be empty if all of the firstSet is differenced away.
Since: 8.13

Rhino.Geometry.Brep.CreateBooleanSplit(Rhino.Geometry.Brep,Rhino.Geometry.Brep,System.Double)
Splits shared areas of Breps and creates separate Breps from the shared and unshared parts.
firstBrep: The Brep to split.
secondBrep: The cutting Brep.
tolerance: Tolerance to use for splitting operation. When in doubt, use the document's model absolute tolerance.
Returns: An array of Brep if successful, an empty array on failure.
Since: 6.16

Rhino.Geometry.Brep.CreateBooleanSplit(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double)
Splits shared areas of Breps and creates separate Breps from the shared and unshared parts.
firstSet: The Breps to split.
secondSet: The cutting Breps.
tolerance: Tolerance to use for splitting operation. When in doubt, use the document's model absolute tolerance.
Returns: An array of Brep if successful, an empty array on failure.
Since: 6.16

Rhino.Geometry.Brep.CreateShell(Rhino.Geometry.Brep,System.Collections.Generic.IEnumerable{System.Int32},System.Double,System.Double)
Creates a hollowed out shell from a solid Brep. Function only operates on simple, solid, manifold Breps.
brep: The solid Brep to shell.
facesToRemove: The indices of the Brep faces to remove. These surfaces are removed and the remainder is offset inward, using the outer parts of the removed surfaces to join the inner and outer parts.
distance: The distance, or thickness, for the shell. This is a signed distance value with respect to face normals and flipped faces.
tolerance: The offset tolerance. When in doubt, use the document's absolute tolerance.
Returns: An array of Brep results or null on failure.
Since: 5.4

Rhino.Geometry.Brep.JoinBreps(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double)
Joins the breps in the input array at any overlapping edges to form
as few as possible resulting breps. There may be more than one brep in the result array.
brepsToJoin: A list, an array or any enumerable set of breps to join.
tolerance: 3d distance tolerance for detecting overlapping edges.
Returns: New joined breps on success, null on failure.
Since: 5.0

Rhino.Geometry.Brep.JoinBreps(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double,System.Double)
Joins the breps in the input array at any overlapping edges to form
as few as possible resulting breps. There may be more than one brep in the result array.
brepsToJoin: A list, an array or any enumerable set of breps to join.
tolerance:
3d distance tolerance for detecting overlapping edges.
When in doubt, use the document's model absolute tolerance.
angleTolerance:
Angle tolerance, in radians, used for merging edges.
When in doubt, use the document's model angle tolerance.
Returns: New joined breps on success, null on failure.
Since: 8.3

Rhino.Geometry.Brep.JoinBreps(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double,System.Double,System.Collections.Generic.List{System.Int32[]}@)
Joins the breps in the input array at any overlapping edges to form
as few as possible resulting breps. There may be more than one brep in the result array.
brepsToJoin: A list, an array or any enumerable set of breps to join.
tolerance:
3d distance tolerance for detecting overlapping edges.
When in doubt, use the document's model absolute tolerance.
angleTolerance:
Angle tolerance, in radians, used for merging edges.
When in doubt, use the document's model angle tolerance.
indexMap:
List of integer arrays, one for each joined result, containing all input Brep indices that went into making each result.
Note, this can be null.
Returns: New joined breps on success, null on failure.
Since: 8.5

Rhino.Geometry.Brep.SplitDisjointPieces(Rhino.Geometry.Brep)
Separates, or splits, a disjoint Brep into separate Breps.
brep: The disjoint Brep to separate.
Returns: An array of Brep pieces if successful, otherwise an empty array if the Brep is not disjoint or on error.
Since: 8.15

Rhino.Geometry.Brep.SplitDisjointPieces(Rhino.Geometry.Brep,System.Collections.Generic.List{System.Int32[]}@)
Separates, or splits, a disjoint Brep into separate Breps.
brep: The disjoint Brep to separate.
indexMap:
List of integer arrays, one for each result, containing all input Brep face indices that went into making each result.
Note, this can be null.
Returns: An array of Brep pieces if successful, otherwise an empty array if the Brep is not disjoint or on error.
Since: 8.15

Rhino.Geometry.Brep.MergeBreps(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double)
Combines two or more breps into one. A merge is like a boolean union that keeps the inside pieces. This
function creates non-manifold Breps which in general are unusual in Rhino. You may want to consider using
JoinBreps or CreateBooleanUnion functions instead.
brepsToMerge: must contain more than one Brep.
tolerance: the tolerance to use when merging.
Returns: Single merged Brep on success. Null on error.
Since: 5.0

Rhino.Geometry.Brep.CreateContourCurves(Rhino.Geometry.Brep,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
Constructs the contour curves for a brep at a specified interval.
brepToContour: A brep or polysurface.
contourStart: A point to start.
contourEnd: A point to use as the end.
interval: The interaxial offset in world units.
Returns: An array with intersected curves. This array can be empty.
Since: 5.0

Rhino.Geometry.Brep.CreateContourCurves(Rhino.Geometry.Brep,Rhino.Geometry.Plane)
Constructs the contour curves for a brep, using a slicing plane.
brepToContour: A brep or polysurface.
sectionPlane: A plane.
Returns: An array with intersected curves. This array can be empty.
Since: 5.0

Rhino.Geometry.Brep.CreateCurvatureAnalysisMesh(Rhino.Geometry.Brep,Rhino.ApplicationSettings.CurvatureAnalysisSettingsState)
Create an array of analysis meshes for the brep using the specified settings.
Meshes aren't set on the brep.
brep:
state:  CurvatureAnalysisSettingsState
Returns: true if meshes were created
Since: 6.0

Rhino.Geometry.Brep.CreateFromMatch(Rhino.Geometry.BrepEdge,Rhino.Geometry.Curve,Rhino.Geometry.MatchSrfSettings,Rhino.Geometry.Brep@,Rhino.Geometry.Brep@)
Match an edge to the target curve using the settings provided
edge: The edge to match. This need to be an untrimmed surface edge.
targetCurve: The curve to match to. This needs to be a Rhino.Geometry.BrepEdge if tangent or curvature matching is requested.
settings: The settings used for matching
matched: If successful, this contains the matched brep
target: If successful and Rhino.Geometry.MatchSrfSettings.Average is true, this contains the changed target brep.
Returns:
Since: 8.21

Rhino.Geometry.Brep.CreateFromMatch(Rhino.Geometry.BrepEdge,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},Rhino.Geometry.MatchSrfSettings,Rhino.Geometry.Brep@,Rhino.Geometry.Brep@)
Match an edge to the target curves using the settings provided
edge: The edge to match. This need to be an untrimmed surface edge.
targetCurves: The curves to match to. These need to be Rhino.Geometry.BrepEdge if tangent or curvature matching is requested.
settings: The settings used for matching
matched: If successful, this contains the matched brep
target: If successful and Rhino.Geometry.MatchSrfSettings.Average is true, this contains the changed target brep.
Returns:
Since: 8.21

Rhino.Geometry.Brep.#ctor
Initializes a new empty brep
Since: 5.4

Rhino.Geometry.Brep.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor used in serialization.

Rhino.Geometry.Brep.Vertices
Gets the brep vertices list accessor.
Since: 5.5

Rhino.Geometry.Brep.Surfaces
Parametric surfaces used by faces
Since: 5.4

Rhino.Geometry.Brep.Edges
Gets the brep edges list accessor.
Since: 5.0

Rhino.Geometry.Brep.Trims
Gets the brep trims list accessor.
Since: 5.1

Rhino.Geometry.Brep.Loops
Gets the brep loop list accessor.
Since: 5.0

Rhino.Geometry.Brep.Faces
Gets the brep faces list accessor.
Since: 5.0

Rhino.Geometry.Brep.Curves2D
Parameter space trimming curves (used by trims)
Since: 5.6

Rhino.Geometry.Brep.Curves3D
Pointers to 3d curves (used by edges)
Since: 5.6

Rhino.Geometry.Brep.IsSolid
Determines whether this brep is a solid, or a closed oriented manifold.
Since: 5.0

Rhino.Geometry.Brep.SolidOrientation
Gets the solid orientation state of this Brep.
Since: 5.0

Rhino.Geometry.Brep.IsManifold
Gets a value indicating whether or not the Brep is manifold.
Non manifold breps have at least one edge that is shared among three or more faces.
Since: 5.0

Rhino.Geometry.Brep.IsOrientedManifold(System.Boolean@,System.Boolean@)
Test a Brep to see if it is an oriented manifold.
Non manifold Breps have at least one edge that is shared among three or more faces.
isOriented:
Set to true if the Brep is an oriented manifold, or false if the Brep is not an oriented manifold.
hasBoundary:
Set to true if the Brep has a boundary edge, or false if the Brep does not have a boundary edge.
Returns:
If the Brep is a manifold, true is returned. Otherwise false is returned.
Since: 8.26

Rhino.Geometry.Brep.IsSurface
Returns true if the Brep has a single face and that face is geometrically the same
as the underlying surface.  I.e., the face has trivial trimming.
In this case, the surface is the first face surface. The flag
Brep.Faces[0].OrientationIsReversed records the correspondence between the surface's
natural parametric orientation and the orientation of the Brep.
trivial trimming here means that there is only one loop curve in the brep
and that loop curve is the same as the underlying surface boundary.
Since: 5.0

Rhino.Geometry.Brep.HasRegionTopology
Returns true if the Brep has region topology information, false otherwise.
Since: 7.13

Rhino.Geometry.Brep.DestroyRegionTopology
Destroys a Brep's region topology information.
Since: 7.13

Rhino.Geometry.Brep.GetRegions
Gets an array containing all regions in this brep.
Returns: An array of regions in this brep. This array can be empty, but not null.
Since: 5.0

Rhino.Geometry.Brep.Duplicate
Copies this brep.
Returns: A brep.
Since: 5.0

Rhino.Geometry.Brep.DuplicateBrep
Same as Rhino.Geometry.Brep.Duplicate, but already performs a cast to a brep.
This cast always succeeds.
Returns: A brep.
Since: 5.0

Rhino.Geometry.Brep.DuplicateSubBrep(System.Collections.Generic.IEnumerable{System.Int32})
Copy a subset of this Brep into another Brep.
faceIndices:
array of face indices in this brep to copy.
(If any values in faceIndices are out of range or if faceIndices contains
duplicates, this function will return null.)
Returns: A brep, or null on error.
Since: 5.0

Rhino.Geometry.Brep.DuplicateEdgeCurves
Duplicate all the edges of this Brep.
Returns: An array of edge curves.
Since: 5.0

Rhino.Geometry.Brep.DuplicateEdgeCurves(System.Boolean)
Duplicate edges of this Brep.
nakedOnly:
If true, then only the "naked" edges are duplicated.
If false, then all edges are duplicated.
Returns: Array of edge curves on success.
Since: 5.0

Rhino.Geometry.Brep.DuplicateNakedEdgeCurves(System.Boolean,System.Boolean)
Duplicate naked edges of this Brep.
nakedOuter: Return naked edges that are part of an outer loop.
nakedInner: Return naked edges that are part of an inner loop.
Returns: Array of edge curves on success.
Since: 5.7

Rhino.Geometry.Brep.GetConnectedComponents
If this Brep has two or more connected components, then duplicates of the connected components are returned.
Returns: An array of connected components, or an empty array.
Since: 7.18

Rhino.Geometry.Brep.GetTangentConnectedComponents(System.Double,System.Boolean)
If this Brep has two or more components connected by tangent edges,
then duplicates of the connected components are returned.
angleTolerance: The angle tolerance, in radians, used to determine tangent edges.
includeMeshes: If true, any cached meshes on this Brep are copied to the returned Breps.
Returns: An array of tangent edge connected components, or an empty array.
Since: 8.7

Rhino.Geometry.Brep.GetWireframe(System.Int32)
Constructs all the Wireframe curves for this Brep.
density: Wireframe density. Valid values range between -1 and 99.
Returns: An array of Wireframe curves or null on failure.
Since: 5.0

Rhino.Geometry.Brep.DuplicateVertices
Duplicate all the corner vertices of this Brep.
Returns: An array or corner vertices.
Since: 5.0

Rhino.Geometry.Brep.Flip
Reverses entire brep orientation of all faces.
Since: 5.0

Rhino.Geometry.Brep.IsDuplicate(Rhino.Geometry.Brep,System.Double)
See if this and other are same brep geometry.
other: other brep.
tolerance: tolerance to use when comparing control points.
Returns: true if breps are the same.
Since: 5.0

Rhino.Geometry.Brep.IsValidTopology(System.String@)
Tests the brep to see if its topology information is valid.
log:
If the brep topology is not valid, then a brief English description of
the problem is appended to the log.  The information appended to log is
suitable for low-level debugging purposes by programmers and is not
intended to be useful as a high level user interface tool.
Returns: true if the topology is valid; false otherwise.
Since: 5.0

Rhino.Geometry.Brep.IsValidGeometry(System.String@)
Expert user function that tests the brep to see if its geometry information is valid.
The value of brep.IsValidTopology() must be true before brep.IsValidGeometry() can be
safely called.
log:
If the brep geometry is not valid, then a brief description of the problem
in English is assigned to this out parameter. The information is suitable for
low-level debugging purposes by programmers and is not intended to be
useful as a high level user interface tool. Otherwise, System.String.Empty.
Returns: A value that indicates whether the geometry is valid.
Since: 5.0

Rhino.Geometry.Brep.IsValidTolerancesAndFlags(System.String@)
Expert user function that tests the brep to see if its tolerances and
flags are valid.  The values of brep.IsValidTopology() and
brep.IsValidGeometry() must be true before brep.IsValidTolerancesAndFlags()
can be safely called.
log:
If the brep tolerance or flags are not valid, then a brief description
of the problem in English is assigned to this out parameter. The information is
suitable for low-level debugging purposes by programmers and is not
intended to be useful as a high level user interface tool. Otherwise, System.String.Empty.
Returns: A value that indicates
Since: 5.0

Rhino.Geometry.Brep.ClosestPoint(Rhino.Geometry.Point3d)
Finds a point on the brep that is closest to testPoint.
testPoint: Base point to project to brep.
Returns: The point on the Brep closest to testPoint or Point3d.Unset if the operation failed.
Since: 5.0

Rhino.Geometry.Brep.ClosestPoint(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d@,Rhino.Geometry.ComponentIndex@,System.Double@,System.Double@,System.Double,Rhino.Geometry.Vector3d@)
Finds a point on the Brep that is closest to testPoint.
The method searches all Brep faces looking for the one closest to testPoint.
When found, if the closest point falls on the inactive region of the face, then
the method finds the face's edge that is closest to testPoint.
testPoint: Base point to project to surface.
closestPoint: Location of the closest Brep point.
ci: Component index of the Brep component that contains the closest point.
Possible component index types are ComponentIndexType.BrepEdge and ComponentIndexType.BrepFace.
s: If ci.ComponentIndexType == ComponentIndexType.BrepEdge, then s is the parameter of the closest edge point.
t: If ci.ComponentIndexType == ComponentIndexType.BrepFace, then (s,t) is the parameter of the closest face point.
maximumDistance:
If maximumDistance > 0, then only points whose distance is <= maximumDistance will be returned.
Using a positive value of maximumDistance can substantially speed up the search.
normal:
If ci.ComponentIndexType == ComponentIndexType.BrepEdge, then this is the tangent to the edge at s.
If ci.ComponentIndexType == ComponentIndexType.BrepFace, then this is the normal to the face at (s,t).
Returns: true if the operation succeeded, false otherwise.
Since: 5.0

Rhino.Geometry.Brep.FindCoincidentBrepComponents(Rhino.Geometry.Point3d,System.Double,System.Int32[]@,System.Int32[]@,System.Int32[]@)
Find the indices of all brep faces, edges and vertices that are within tolerance of a test-point.
point: Test point.
tolerance: Coincidence tolerance.
faces: Array of BrepFace indices.
edges: Array of BrepEdge indices.
vertices: Array of BrepVertex indices.
Since: 6.2

Rhino.Geometry.Brep.AssignIndices(System.Int32[],System.Boolean[])
Set all indexed values in a Boolean array to true.
Utility function for above.
ints: Array of indices.
bools: Boolean array.

Rhino.Geometry.Brep.IsPointInside(Rhino.Geometry.Point3d,System.Double,System.Boolean)
Determines if point is inside a Brep.  This question only makes sense when
the brep is a closed and manifold.  This function does not check for
closed or manifold, so result is not valid in those cases.  Intersects
a line through point with brep, finds the intersection point Q closest
to point, and looks at face normal at Q.  If the point Q is on an edge
or the intersection is not transverse at Q, then another line is used.
point: 3d point to test.
tolerance:
3d distance tolerance used for intersection and determining strict inclusion.
A good default is RhinoMath.SqrtEpsilon.
strictlyIn:
if true, point is in if inside brep by at least tolerance.
if false, point is in if truly in or within tolerance of boundary.
Returns:
true if point is in, false if not.
Since: 5.0

Rhino.Geometry.Brep.GetPointInside(System.Double,Rhino.Geometry.Point3d@)
Finds a point inside of a solid Brep.
tolerance:
Used for intersecting rays and is not necessarily related to the distance from the brep to the found point.
When in doubt, use the document's model absolute tolerance.
point: A point inside the solid Brep.
Returns:
Returns false if the input is not solid and manifold, if the Brep's bounding box is less than 2.0 * tolerance wide,
or if no point could be found due to ray shooting or other errors. Otherwise, true is returned.
Since: 6.19

Rhino.Geometry.Brep.CapPlanarHoles(System.Double)
Returns a new Brep that is equivalent to this Brep with all planar holes capped.
tolerance: Tolerance to use for capping.
Returns: New brep on success. null on error.
Since: 5.0

Rhino.Geometry.Brep.Join(Rhino.Geometry.Brep,System.Double,System.Boolean)
If any edges of this brep overlap edges of otherBrep, merge a copy of otherBrep into this
brep joining all edges that overlap within tolerance.
otherBrep: Brep to be added to this brep.
tolerance: 3d distance tolerance for detecting overlapping edges.
compact: if true, set brep flags and tolerances, remove unused faces and edges.
Returns: true if any edges were joined.
Remarks:
if no edges overlap, this brep is unchanged.
otherBrep is copied if it is merged with this, and otherBrep is always unchanged
Use this to join a list of breps in a series.
When joining multiple breps in series, compact should be set to false.
Call compact on the last Join.
Since: 5.0

Rhino.Geometry.Brep.JoinNakedEdges(System.Double)
Joins naked edge pairs within the same brep that overlap within tolerance.
tolerance: The tolerance value.
Returns: number of joins made.
Since: 5.0

Rhino.Geometry.Brep.MergeCoplanarFaces(System.Double)
Merges adjacent coplanar faces into single faces.
tolerance:
Tolerance for determining when edges are adjacent.
When in doubt, use the document's ModelAbsoluteTolerance property.
Returns: true if faces were merged, false if no faces were merged.
Since: 5.0

Rhino.Geometry.Brep.MergeCoplanarFaces(System.Double,System.Double)
Merges adjacent coplanar faces into single faces.
tolerance:
Tolerance for determining when edges are adjacent.
When in doubt, use the document's ModelAbsoluteTolerance property.
angleTolerance:
Angle tolerance, in radians, for determining when faces are parallel.
When in doubt, use the document's ModelAngleToleranceRadians property.
Returns: true if faces were merged, false if no faces were merged.
Since: 6.10

Rhino.Geometry.Brep.MergeCoplanarFaces(System.Int32,System.Double,System.Double)
Merges coplanar faces adjacent to Brep face into a single face.
faceIndex: The index of the Brep face to search.
tolerance:
Tolerance for determining when edges are adjacent.
When in doubt, use the document's ModelAbsoluteTolerance property.
angleTolerance:
Angle tolerance, in radians, for determining when faces are parallel.
When in doubt, use the document's ModelAngleToleranceRadians property.
Returns: true if faces were merged, false if no faces were merged.
Since: 7.19

Rhino.Geometry.Brep.MergeCoplanarFaces(System.Int32,System.Int32,System.Double,System.Double)
Merges two coplanar, adjacent Brep faces into a single face.
faceIndex0: The index of the first Brep face.
faceIndex1: The index of the second Brep face.
tolerance:
Tolerance for determining when edges are adjacent.
When in doubt, use the document's ModelAbsoluteTolerance property.
angleTolerance:
Angle tolerance, in radians, for determining when faces are parallel.
When in doubt, use the document's ModelAngleToleranceRadians property.
Returns: true if faces were merged, false if no faces were merged.
Since: 7.19

Rhino.Geometry.Brep.Split(Rhino.Geometry.Brep,System.Double)
Splits a Brep into pieces using a Brep as a cutter.
cutter: The Brep to use as a cutter.
intersectionTolerance: The tolerance with which to compute intersections.
Returns: A new array of Breps. This array can be empty.
Since: 5.0

Rhino.Geometry.Brep.Split(Rhino.Geometry.Brep,System.Double,System.Boolean@)
Splits a Brep into pieces using a Brep as a cutter.
cutter: The Brep to use as a cutter.
intersectionTolerance: The tolerance with which to compute intersections.
toleranceWasRaised:
Set to true if the split failed at intersectionTolerance but succeeded
when the tolerance was increased to twice intersectionTolerance.
Returns: A new array of Breps. This array can be empty.
Since: 5.0

Rhino.Geometry.Brep.Split(System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},System.Double)
Splits a Brep into pieces using Breps as cutters.
cutters: One or more Breps to use as cutters.
intersectionTolerance: The tolerance with which to compute intersections.
Returns: A new array of Breps. This array can be empty.
Since: 6.13

Rhino.Geometry.Brep.Split(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Double)
Splits a Brep into pieces using curves, at least partially on the Brep, as cutters.
cutters: The splitting curves. Only the portion of the curve on the Brep surface will be used for cutting.
intersectionTolerance: The tolerance with which to compute intersections.
Returns: A new array of Breps. This array can be empty.
Since: 6.13

Rhino.Geometry.Brep.Split(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},Rhino.Geometry.Vector3d,System.Boolean,System.Double)
Splits a Brep into pieces using a combination of curves, to be extruded, and Breps as cutters.
cutters: The curves, surfaces, faces and Breps to be used as cutters. Any other geometry is ignored.
normal: A construction plane normal, used in deciding how to extrude a curve into a cutter.
planView: Set true if the assume view is a plan, or parallel projection, view.
intersectionTolerance: The tolerance with which to compute intersections.
Returns: A new array of Breps. This array can be empty.
Remarks:
A Curve in cutters is extruded to produce a surface to use as a cutter. The extrusion direction is chosen, as in the Rhino Split command,
based on the properties of the active view. In particular the construction plane Normal and whether the active view is a plan view,
a parallel projection with construction plane normal as the view direction. If planView is false and the curve is planar then the curve
is extruded perpendicular to the curve, otherwise the curve is extruded in the normal direction.
Since: 6.13

Rhino.Geometry.Brep.Trim(Rhino.Geometry.Brep,System.Double)
Trims a brep with an oriented cutter. The parts of the brep that lie inside
(opposite the normal) of the cutter are retained while the parts to the
outside (in the direction of the normal) are discarded.  If the Cutter is
closed, then a connected component of the Brep that does not intersect the
cutter is kept if and only if it is contained in the inside of cutter.
That is the region bounded by cutter opposite from the normal of cutter,
If cutter is not closed all these components are kept.
cutter: A cutting brep.
intersectionTolerance: A tolerance value with which to compute intersections.
Returns: This Brep is not modified, the trim results are returned in an array.
Since: 5.0

Rhino.Geometry.Brep.Trim(Rhino.Geometry.Plane,System.Double)
Trims a Brep with an oriented cutter.  The parts of Brep that lie inside
(opposite the normal) of the cutter are retained while the parts to the
outside ( in the direction of the normal ) are discarded. A connected
component of Brep that does not intersect the cutter is kept if and only
if it is contained in the inside of Cutter.  That is the region bounded by
cutter opposite from the normal of cutter, or in the case of a Plane cutter
the half space opposite from the plane normal.
cutter: A cutting plane.
intersectionTolerance: A tolerance value with which to compute intersections.
Returns: This Brep is not modified, the trim results are returned in an array.
Since: 5.0

Rhino.Geometry.Brep.UnjoinEdges(System.Collections.Generic.IEnumerable{System.Int32})
Un-joins, or separates, edges within the Brep. Note, seams in closed surfaces will not separate.
edgesToUnjoin: The indices of the Brep edges to un-join.
Returns: This Brep is not modified, the trim results are returned in an array.
Since: 6.0

Rhino.Geometry.Brep.JoinEdges(System.Int32,System.Int32,System.Double,System.Boolean)
Joins two naked edges, or edges that are coincident or close together.
edgeIndex0: The first edge index.
edgeIndex1: The second edge index.
joinTolerance: The join tolerance.
compact:
If joining more than one edge pair and want the edge indices of subsequent pairs to remain valid,
set to false. But then call Brep.Compact() on the final result.
Returns: true if successful, false otherwise.
Since: 6.0

Rhino.Geometry.Brep.TransformComponent(System.Collections.Generic.IEnumerable{Rhino.Geometry.ComponentIndex},Rhino.Geometry.Transform,System.Double,System.Double,System.Boolean)
Transform an array of Brep components, bend neighbors to match, and leave the rest fixed.
components: The Brep components to transform.
xform: The transformation to apply.
tolerance: The desired fitting tolerance to use when bending faces that share edges with both fixed and transformed components.
timeLimit:
If the deformation is extreme, it can take a long time to calculate the result.
If time_limit > 0, then the value specifies the maximum amount of time in seconds you want to spend before giving up.
useMultipleThreads: True if multiple threads can be used.
Returns: true if successful, false otherwise.
Since: 6.0

Rhino.Geometry.Brep.GetArea
Compute the Area of the Brep. If you want proper Area data with moments
and error information, use the AreaMassProperties class.
Returns: The area of the Brep.
Since: 5.0

Rhino.Geometry.Brep.GetArea(System.Double,System.Double)
Compute the Area of the Brep. If you want proper Area data with moments
and error information, use the AreaMassProperties class.
relativeTolerance: Relative tolerance to use for area calculation.
absoluteTolerance: Absolute tolerance to use for area calculation.
Returns: The area of the Brep.
Since: 5.0

Rhino.Geometry.Brep.GetVolume
Compute the Volume of the Brep. If you want proper Volume data with moments
and error information, use the VolumeMassProperties class.
Returns: The volume of the Brep.
Since: 5.0

Rhino.Geometry.Brep.GetVolume(System.Double,System.Double)
Compute the Volume of the Brep. If you want proper Volume data with moments
and error information, use the VolumeMassProperties class.
relativeTolerance: Relative tolerance to use for area calculation.
absoluteTolerance: Absolute tolerance to use for area calculation.
Returns: The volume of the Brep.
Since: 5.0

Rhino.Geometry.Brep.InsetFaces(System.Collections.Generic.IEnumerable{System.Int32},System.Double,System.Boolean,System.Boolean,System.Boolean,System.Double,System.Double)
Individually insets faces of a brep by offsetting the faces outer edges inward and inner edges out then splitting the face with the offset curves.
faceIndices: the indices of the faces to inset
distance: The distance to offset along the face
loose: If true, offset by moving edit points otherwise offset within tolerance.
ignoreSeams: If true, the seam edges are not offset and adjacent edges are extended to meet the seam. Otherwise offset normally.
creaseCorners: If true, splitting curves will be made between the creases on edge curves and creases on the inset curves.
tolerance: The fitting tolerance for the offset. When in doubt, use the document's absolute tolerance.
angleTolerance: The angle tolerance in radians for identifying creases when creasing corners.  When in doubt, use the document's angle tolerance.
Returns: The brep with inset faces on success. Null on error.
Since: 8.8

Rhino.Geometry.Brep.PushPullExtend(System.Int32,Rhino.Geometry.Transform,System.Double)
If the brep.Faces[faceIndex] is planar, and all the adjacent faces are planar, this function transforms brep.Faces[faceIndex]
with the transform parameter and recomputes the adjacent faces. See the PushPull commands extend mode.
faceIndex: The index of the face being transformed
transform: The transformation
tolerance: The tolerance for planarity checks. When in doubt, use the document's absolute tolerance.
Returns: The brep with the transformed face on success. Null on error.
Since: 8.16

Rhino.Geometry.Brep.AddTrimCurve(Rhino.Geometry.Curve)
Add a 2d curve used by the brep trims
curve:
Returns:
Index used to reference this geometry in the trimming curve list
Since: 5.4

Rhino.Geometry.Brep.AddEdgeCurve(Rhino.Geometry.Curve)
Add a 3d curve used by the brep edges
curve:
Returns:
Index used to reference this geometry in the edge curve list
Since: 5.4

Rhino.Geometry.Brep.AddSurface(Rhino.Geometry.Surface)
Adds a 3D surface used by BrepFace.
surface: A copy of the surface is added to this brep.
Returns:
Index that should be used to reference the geometry.
-1 is returned if the input is not acceptable.
Since: 5.0

Rhino.Geometry.Brep.Append(Rhino.Geometry.Brep)
Appends a copy of another brep to this and updates indices of appended
brep parts.  Duplicates are not removed
other:
Since: 5.4

Rhino.Geometry.Brep.SetVertices
This function can be used to compute vertex information for a
b-rep when everything but the Vertices array is properly filled in.
It is intended to be used when creating a Brep from a
definition that does not include explicit vertex information.
Since: 5.4

Rhino.Geometry.Brep.SetTrimIsoFlags
This function can be used to set the BrepTrim::m_iso
flag. It is intended to be used when creating a Brep from
a definition that does not include compatible parameter space
type information.
Since: 5.4

Rhino.Geometry.Brep.SetTolerancesBoxesAndFlags
Set tolerances and flags in a Brep.
Since: 6.0

Rhino.Geometry.Brep.SetTolerancesBoxesAndFlags(System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Set tolerances and flags in a Brep.
bLazy: If true, only flags and tolerances that are not set will be calculated.
bSetVertexTolerances: Set true to compute BrepVertex tolerances.
bSetEdgeTolerances: Set true to compute BrepEdge tolerances.
bSetTrimTolerances: Set true to compute BrepTrim tolerances.
bSetTrimIsoFlags: Set true to compute BrepTrim.IsoStatus values.
bSetTrimTypeFlags: Set true to compute BrepTrim.TrimType values.
bSetLoopTypeFlags: Set true to compute BrepLoop.BrepLoopType values.
bSetTrimBoxes: Set true to compute BrepTrim bounding boxes.
Since: 6.0

Rhino.Geometry.Brep.RebuildTrimsForV2(Rhino.Geometry.BrepFace,Rhino.Geometry.NurbsSurface)
No support is available for this function.
Expert user function used by MakeValidForV2 to convert trim
curves from one surface to its NURBS form. After calling this function,
you need to change the surface of the face to a NurbsSurface.
face:
Face whose underlying surface has a parameterization that is different
from its NURBS form.
nurbsSurface: NURBS form of the face's underlying surface.
Remarks:
Don't call this function unless you know exactly what you are doing.
Since: 5.0

Rhino.Geometry.Brep.MakeValidForV2
No support is available for this function.
Expert user function that converts all geometry in Brep to NURB form.
Remarks:
Don't call this function unless you know exactly what you are doing.
Since: 6.0

Rhino.Geometry.Brep.Compact
Deletes any unreferenced objects from arrays, re-indexes as needed, and
shrinks arrays to minimum required size. Uses CUllUnused* members to
delete any unreferenced objects from arrays.
Since: 5.0

Rhino.Geometry.Brep.Repair(System.Double)
Fills in missing or fixes incorrect component information from a Brep.
Useful when reading Brep information from other file formats that do not
provide as complete of a Brep definition as required by Rhino.
tolerance: The repair tolerance. When in doubt, use the document's model absolute tolerance.
Returns: True on success.
Since: 6.0

Rhino.Geometry.Brep.CutUpSurface(Rhino.Geometry.Surface,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Boolean,System.Double,System.Double)
Splits, or cuts up, a surface. Designed to split the underlying surface of a Brep face with edge curves.
surface: The surface to cut up.
curves:
The edge curves with consistent orientation.
The curves should lie on the surface.
flip: If true, the input curves are oriented clockwise.
fitTolerance: The fitting tolerance.
keepTolerance: Used to decide which face to keep. For best results, should be at least 2 * fitTolerance.
Returns: The Brep pieces if successful, an empty array on failure.
Since: 8.12

Rhino.Geometry.Brep.RemoveHoles(System.Double)
Remove all inner loops, or holes, in a Brep.
tolerance: The tolerance. When in doubt, use the document's model absolute tolerance.
Returns: The Brep without holes if successful, null otherwise.
Since: 6.0

Rhino.Geometry.Brep.RemoveHoles(System.Collections.Generic.IEnumerable{Rhino.Geometry.ComponentIndex},System.Double)
Removes inner loops, or holes, in a Brep.
loops: A list of BrepLoop component indexes, where BrepLoop.LoopType == Rhino.Geometry.BrepLoopType.Inner.
tolerance: The tolerance. When in doubt, use the document's model absolute tolerance.
Returns: The Brep without holes if successful, null otherwise.
Since: 6.8

Rhino.Geometry.Brep.CullUnusedFaces
Culls faces with m_face_index == -1.
Returns: true if operation succeeded; false otherwise.
Since: 5.0

Rhino.Geometry.Brep.CullUnusedLoops
Culls loops with m_loop_index == -1.
Returns: true if operation succeeded; false otherwise.
Since: 5.0

Rhino.Geometry.Brep.CullUnusedTrims
Culls trims with m_trim_index == -1.
Returns: true if operation succeeded; false otherwise.
Since: 5.0

Rhino.Geometry.Brep.CullUnusedEdges
Culls edges with m_edge_index == -1.
Returns: true if operation succeeded; false otherwise.
Since: 5.0

Rhino.Geometry.Brep.CullUnusedVertices
Culls vertices with m_vertex_index == -1.
Returns: true if operation succeeded; false otherwise.
Since: 5.0

Rhino.Geometry.Brep.CullUnused3dCurves
Culls 2d curves not referenced by a trim.
Returns: true if operation succeeded; false otherwise.
Since: 5.0

Rhino.Geometry.Brep.CullUnused2dCurves
Culls 3d curves not referenced by an edge.
Returns: true if operation succeeded; false otherwise.
Since: 5.0

Rhino.Geometry.Brep.CullUnusedSurfaces
Culls surfaces not referenced by a face.
Returns: true if operation succeeded; false otherwise.
Since: 5.0

Rhino.Geometry.Brep.Standardize
Standardizes all trims, edges, and faces in the brep.
After standardizing, there may be unused curves and surfaces in the
brep.  Call Brep.Compact to remove these unused curves and surfaces.
Since: 5.0