Rhino.Runtime.RhinoAccounts.RhinoAccountsGroup
Represents a Rhino Accounts group.

Rhino.Runtime.RhinoAccounts.RhinoAccountsGroup.#ctor(System.String,System.String)
Represents a group in Rhino Accounts. Groups are a collection of individual members that can share resources.
id:
name:
Since: 7.0

Rhino.Runtime.RhinoAccounts.RhinoAccountsGroup.Id
The id of the group. The id is unique to a group within Rhino Accounts.
Since: 7.0

Rhino.Runtime.RhinoAccounts.RhinoAccountsGroup.Name
The name of the group. The name can be changed at anytime by group members.
Since: 7.0