Rhino.FileIO.File3dsReadOptions
Options for reading a 3ds file

Rhino.FileIO.File3dsReadOptions.Unweld
Since: 8.0

Rhino.FileIO.File3dsReadOptions.UnweldAngle
Since: 8.0

Rhino.FileIO.File3dsReadOptions.ImportLights
Since: 8.0

Rhino.FileIO.File3dsReadOptions.ImportCameras
Since: 8.0

Rhino.FileIO.File3dsReadOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0