Rhino.DocObjects.ObjectAttributes
Attributes (color, material, layer,...) associated with a rhino object

Rhino.DocObjects.ObjectAttributes.IsDocumentControlled
Since: 5.0

Rhino.DocObjects.ObjectAttributes.#ctor
Since: 5.0

Rhino.DocObjects.ObjectAttributes.Duplicate
Constructs a copy of this Rhino.DocObjects.ObjectAttributes instance.
Returns: A new instance on success, or null on failure.
Since: 5.0

Rhino.DocObjects.ObjectAttributes.Mode
An object must be in one of three modes: normal, locked or hidden.
If an object is in normal mode, then the object's layer controls visibility
and selectability. If an object is locked, then the object's layer controls
visibility by the object cannot be selected. If the object is hidden, it is
not visible and it cannot be selected.
Since: 5.0

Rhino.DocObjects.ObjectAttributes.Transform(Rhino.Geometry.Transform)
Apply a transformation.
xform: The transformation.
Returns: true if successful, false otherwise.
Since: 6.0

Rhino.DocObjects.ObjectAttributes.IsInstanceDefinitionObject
Use this query to determine if an object is part of an instance definition.
Since: 5.0

Rhino.DocObjects.ObjectAttributes.Visible
Gets or sets an object's visibility.
Since: 5.0

Rhino.DocObjects.ObjectAttributes.CastsShadows
Gets or sets an object's casts shadows property, or whether or not an object casts shadows on other objects and a ground plane.
Since: 6.0

Rhino.DocObjects.ObjectAttributes.ReceivesShadows
Gets or sets an object's receives shadows property, or whether or not an object receives shadows from other objects.
Since: 6.0

Rhino.DocObjects.ObjectAttributes.LinetypeSource
The Linetype used to display an object is specified in one of two ways.
If LinetypeSource is ON::linetype_from_layer, then the object's layer ON_Layer::Linetype() is used.
If LinetypeSource is ON::linetype_from_object, then value of m_linetype is used.
Since: 5.0

Rhino.DocObjects.ObjectAttributes.ColorSource
The color used to display an object is specified in one of three ways.
If ColorSource is ON::color_from_layer, then the object's layer ON_Layer::Color() is used.
If ColorSource is ON::color_from_object, then value of m_color is used.
If ColorSource is ON::color_from_material, then the diffuse color of the object's
render material is used.  See ON_3dmObjectAttributes::MaterialSource() to
determine where to get the definition of the object's render material.
Since: 5.0

Rhino.DocObjects.ObjectAttributes.PlotColorSource
The color used to plot an object on paper is specified in one of three ways.
If PlotColorSource is ON::plot_color_from_layer, then the object's layer ON_Layer::PlotColor() is used.
If PlotColorSource is ON::plot_color_from_object, then value of PlotColor() is used.
Since: 5.0

Rhino.DocObjects.ObjectAttributes.PlotWeightSource
Since: 5.0

Rhino.DocObjects.ObjectAttributes.GetCustomSectionStyle
Get an optional custom section style associated with these attributes.
Since: 8.0

Rhino.DocObjects.ObjectAttributes.SetCustomSectionStyle(Rhino.DocObjects.SectionStyle)
Since: 8.0

Rhino.DocObjects.ObjectAttributes.RemoveCustomSectionStyle
Since: 8.0

Rhino.DocObjects.ObjectAttributes.SectionAttributesSource
Where section attributes are read from
Since: 8.0

Rhino.DocObjects.ObjectAttributes.LinetypePatternScale
Per object linetype scale
Since: 8.0

Rhino.DocObjects.ObjectAttributes.HatchBackgroundFillColor
Fill color for hatches (default is Color.Empty)
Since: 8.0

Rhino.DocObjects.ObjectAttributes.HatchBoundaryVisible
Draw the bounrdaries for a hatch (default is false)
Since: 8.0

Rhino.DocObjects.ObjectAttributes.ClippingPlaneLabelStyle
Defines how a label for a clipping plane object should be shown
Since: 8.0

Rhino.DocObjects.ObjectAttributes.GetCustomLinetype
Get an optional custom linetype associated with these attributes. If null,
then the attributes use the linetype index to determine it's linetype
Since: 8.0

Rhino.DocObjects.ObjectAttributes.SetCustomLinetype(Rhino.DocObjects.Linetype)
Since: 8.0

Rhino.DocObjects.ObjectAttributes.RemoveCustomLinetype
Since: 8.0

Rhino.DocObjects.ObjectAttributes.HasDisplayModeOverride(System.Guid)
Determines if an object has a display mode override for a given viewport.
viewportId: Id of a Rhino Viewport.
Returns: true if the object has a display mode override for the viewport; otherwise, false.
Since: 5.0

Rhino.DocObjects.ObjectAttributes.GetDisplayModeOverride(System.Guid)
Returns the id of the display mode of an objects. Object display modes are view based. Thus, it is possible to have an object display different in different views.
viewportId: Id of a Rhino Viewport.
Returns: A display node id if the object has a display mode override for the viewport; otherwise Guid.Empty is returned.
Since: 6.18

Rhino.DocObjects.ObjectAttributes.SetDisplayModeOverride(Rhino.Display.DisplayModeDescription)
By default, objects are drawn using the display mode of the viewport that
the object is being drawn in. Setting a specific display mode, instructs
Rhino to always use that display mode, regardless of the viewport's mode.
This version affects the object's display mode for all viewports.
mode: The display mode.
Returns: true if setting was successful.
Since: 5.0

Rhino.DocObjects.ObjectAttributes.SetDisplayModeOverride(Rhino.Display.DisplayModeDescription,System.Guid)
By default, objects are drawn using the display mode of the viewport that
the object is being drawn in. Setting a specific display mode, instructs
Rhino to always use that display mode, regardless of the viewport's mode.
This version sets a display mode for a specific viewport.
mode: The display mode.
rhinoViewportId: The Rhino viewport ID.
Returns: true on success.
Since: 5.0

Rhino.DocObjects.ObjectAttributes.RemoveDisplayModeOverride
By default, objects are drawn using the display mode of the viewport that
the object is being drawn in. Setting a specific display mode, instructs
Rhino to always use that display mode, regardless of the viewport's mode.
This function resets an object to use the viewport's display mode for all
viewports.
Since: 5.0

Rhino.DocObjects.ObjectAttributes.RemoveDisplayModeOverride(System.Guid)
By default, objects are drawn using the display mode of the viewport that
the object is being drawn in. Setting a specific display mode, instructs
Rhino to always use that display mode, regardless of the viewport's mode.
This function resets an object to use the viewport's display mode.
rhinoViewportId: viewport that display mode overrides should be cleared from.
Since: 5.0

Rhino.DocObjects.ObjectAttributes.AddHideInDetailOverride(System.Guid)
Make this object hidden in a given detail
detailId:
Returns:
Since: 6.1

Rhino.DocObjects.ObjectAttributes.RemoveHideInDetailOverride(System.Guid)
Remove hidden in detail flag for a specific detail
detailId:
Returns:
Since: 6.1

Rhino.DocObjects.ObjectAttributes.HasHideInDetailOverrideSet(System.Guid)
Is this object supposed to be hidden in a given detail
detailId:
Returns:
Since: 6.1

Rhino.DocObjects.ObjectAttributes.GetHideInDetailOverrides
Get list of details that this object is supposed to be hidden in
Returns:
Since: 6.1

Rhino.DocObjects.ObjectAttributes.CustomMeshingParameters
Returns or sets the per-object render meshing parameters, which controls the object's render mesh density.
If this property is null, then the object uses the document's render meshing parameters.
To remove the per-object render meshing parameters, set this property to null.
Since: 7.6

Rhino.DocObjects.ObjectAttributes.EnableCustomMeshingParameters
En/disables the custom meshing parameters enabled state.
Since: 9.0

Rhino.DocObjects.ObjectAttributes.ObjectId
Every object has a Guid (globally unique identifier, also known as UUID, or universally
unique identifier). The default value is Guid.Empty.
When an object is added to a model, the value is checked.  If the value is Guid.Empty, a
new Guid is created. If the value is not null but it is already used by another object
in the model, a new Guid is created. If the value is not Guid.Empty and it is not used by
another object in the model, then that value persists. When an object is updated, by
a move for example, the value of ObjectId persists.
This value is the same as the one returned by object.Id.
Since: 5.0

Rhino.DocObjects.ObjectAttributes.Name
Gets or sets an object optional text name.
More than one object in a model can have the same name and
some objects may have no name.
Since: 5.0

Rhino.DocObjects.ObjectAttributes.Url
Objects may have an URL. There are no restrictions on what value this
URL may have. As an example, if the object came from a commercial part
library, the URL might point to the definition of that part.
Since: 6.8

Rhino.DocObjects.ObjectAttributes.LayerIndex
Gets or sets an associated layer index.
Layer definitions in an OpenNURBS model are stored in a layer table.
The layer table is conceptually an array of ON_Layer classes.  Every
OpenNURBS object in a model is on some layer.  The object's layer
is specified by zero based indices into the ON_Layer array.
Since: 5.0

Rhino.DocObjects.ObjectAttributes.LinetypeIndex
Gets or sets the linetype index.
Linetype definitions in an OpenNURBS model are stored in a linetype table.
The linetype table is conceptually an array of ON_Linetype classes. Every
OpenNURBS object in a model references some linetype.  The object's linetype
is specified by zero based indices into the ON_Linetype array.
Index 0 is reserved for continuous linetype (no pattern).
Since: 5.0

Rhino.DocObjects.ObjectAttributes.MaterialIndex
Gets or sets the material index.
If you want something simple and fast, set the index of
the rendering material.
Since: 5.0
Rhino.DocObjects.ObjectAttributes.RenderMaterial

Rhino.DocObjects.ObjectAttributes.MaterialSource
Determines if the simple material should come from the object or from it's layer.
High quality rendering plug-ins should use m_rendering_attributes.
Since: 5.0
Rhino.DocObjects.ObjectAttributes.RenderMaterial

Rhino.DocObjects.ObjectAttributes.RenderMaterial
Sets the render material for the object - higher level function for setting MaterialSource and MaterialIndex
Since: 7.8

Rhino.DocObjects.ObjectAttributes.Decals
Gets all object decals associated with this object.
Since: 5.10

Rhino.DocObjects.ObjectAttributes.OCSMappingChannelId
The mapping channel id to use when calling MappingChannel to retrieve the OCS mapping if there is one.
Returns: The mapping channel id to use when calling MappingChannel to retrieve the OCS mapping if there is one.
Since: 7.17

Rhino.DocObjects.ObjectAttributes.ObjectFrame
Since: 8.0

Rhino.DocObjects.ObjectAttributes.SetObjectFrame(Rhino.Geometry.Transform)
Since: 8.0

Rhino.DocObjects.ObjectAttributes.SetObjectFrame(Rhino.Geometry.Plane)
Since: 8.0

Rhino.DocObjects.ObjectAttributes.ClearRenderingAttributes
Clears, or resets the rendering attributes.
Since: 8.28

Rhino.DocObjects.ObjectAttributes.File3dmMeshModifiers
Get an object that provides access to mesh modifiers when the attributes is for a File3dmObject.
Since: 8.0

Rhino.DocObjects.ObjectAttributes.MaterialRefs
If you are developing a high quality plug-in renderer, and a user is
assigning a custom render material to this object, then add rendering
material information to the MaterialRefs dictionary.
Note to developers:
As soon as the MaterialRefs dictionary contains items rendering
material queries slow down.  Do not populate the MaterialRefs
dictionary when setting the MaterialIndex will take care of your needs.
Since: 5.10

Rhino.DocObjects.ObjectAttributes.ObjectColor
If ON::color_from_object == ColorSource, then color is the object's display color.
Since: 5.0

Rhino.DocObjects.ObjectAttributes.PlotColor
If plot_color_from_object == PlotColorSource, then PlotColor is the object's plotting color.
Since: 5.0

Rhino.DocObjects.ObjectAttributes.HasMapping
A mapping from any plug-in source is associated with these attributes
Need to do this here to respond correctly to ModifyObjectAttributes event
Since: 5.10

Rhino.DocObjects.ObjectAttributes.DrawColor(Rhino.RhinoDoc)
Gets an object's draw color, which is based on the object's color source
document: The object's documnt.
Returns: The draw color.
Since: 5.0

Rhino.DocObjects.ObjectAttributes.DrawColor(Rhino.RhinoDoc,System.Guid)
Gets an object's draw color, which is based on the object's color source
document: The object's documnt.
viewportId: The id of the viewport.
Returns: The draw color.
Since: 5.0

Rhino.DocObjects.ObjectAttributes.ComputedPlotColor(Rhino.RhinoDoc)
Since: 5.6

Rhino.DocObjects.ObjectAttributes.ComputedPlotColor(Rhino.RhinoDoc,System.Guid)
Since: 5.6

Rhino.DocObjects.ObjectAttributes.ComputedPlotWeight(Rhino.RhinoDoc)
Since: 5.6

Rhino.DocObjects.ObjectAttributes.ComputedPlotWeight(Rhino.RhinoDoc,System.Guid)
Since: 5.6

Rhino.DocObjects.ObjectAttributes.DisplayOrder
Display order used to force objects to be drawn on top or behind each other.
Larger numbers draw on top of smaller numbers.
0  = draw object in standard depth buffered order
<0 = draw object behind "normal" draw order objects
>0 = draw object on top of "normal" draw order objects
Since: 5.10

Rhino.DocObjects.ObjectAttributes.PlotWeight
Plot weight in millimeters.
=0.0 means use the default width
<0.0 means don't plot (visible for screen display, but does not show on plot)
Since: 5.0

Rhino.DocObjects.ObjectAttributes.ObjectDecoration
Used to indicate an object has a decoration (like an arrowhead on a curve)
Since: 5.0

Rhino.DocObjects.ObjectAttributes.WireDensity
When a surface object is displayed in wireframe, this controls
how many isoparametric wires are used.
value    number of isoparametric wires
-1       boundary wires (off)
0        boundary and knot wires
1        boundary and knot wires and, if there are no interior knots, a single interior wire.
N>=2     boundary and knot wires and (N+1) interior wires.
Since: 5.0

Rhino.DocObjects.ObjectAttributes.ViewportId
If ViewportId is nil, the object is active in all viewports. If ViewportId is not nil, then
this object is only active in a specific view. This field is primarily used to assign page
space objects to a specific page, but it can also be used to restrict model space to a
specific view.
Since: 5.0

Rhino.DocObjects.ObjectAttributes.Space
Starting with V4, objects can be in either model space or page space.
If an object is in page space, then ViewportId is not nil and
identifies the page it is on.
Since: 5.0

Rhino.DocObjects.ObjectAttributes.GroupCount
number of groups object belongs to.
Since: 5.0

Rhino.DocObjects.ObjectAttributes.GetGroupList
Returns an array of GroupCount group indices.  If GroupCount is zero, then GetGroupList() returns null.
Returns: An array of group indices. null might be returned in place of an empty array.
Since: 5.0

Rhino.DocObjects.ObjectAttributes.IsInGroup(System.Int32)
Determines if an object belong to a group or not.
groupIndex: The index that will be tested.
Returns:
Since: 8.11

Rhino.DocObjects.ObjectAttributes.AddToGroup(System.Int32)
Adds object to the group with specified index by appending index to
group list.
If the object is already in group, nothing is changed.
groupIndex: The index that will be added.
Since: 5.0

Rhino.DocObjects.ObjectAttributes.RemoveFromGroup(System.Int32)
removes object from the group with specified index.
If the object is not in the group, nothing is changed.
groupIndex: The index that will be removed.
Since: 5.0

Rhino.DocObjects.ObjectAttributes.RemoveFromAllGroups
Removes object from all groups.
Since: 5.0

Rhino.DocObjects.ObjectAttributes.SetUserString(System.String,System.String)
Attach a user string (key,value combination) to this geometry.
key: id used to retrieve this string.
value: string associated with key. If null, the key will be removed
Returns: true on success.
Since: 5.0

Rhino.DocObjects.ObjectAttributes.GetUserString(System.String)
Gets a user string.
key: id used to retrieve the string.
Returns: string associated with the key if successful. null if no key was found.
Since: 5.0

Rhino.DocObjects.ObjectAttributes.UserStringCount
Since: 5.0

Rhino.DocObjects.ObjectAttributes.GetUserStrings
Gets an independent copy of the collection of (user text key, user text value) pairs attached to this object.
Returns: A collection of key strings and values strings. This
Since: 5.0

Rhino.DocObjects.ObjectAttributes.DeleteUserString(System.String)
Since: 6.0

Rhino.DocObjects.ObjectAttributes.DeleteAllUserStrings
Since: 6.0