Rhino.PersistentSettingsSavedEventArgs
Event argument passed to the Rhino.PlugIns.PlugIn.SettingsSaved event.

Rhino.PersistentSettingsSavedEventArgs.SavedByThisRhino
Will be true if this instance of Rhino is writing the settings file
or false if a different instance of Rhino has modified the settings
file.
Since: 6.0

Rhino.PersistentSettingsSavedEventArgs.PlugInSettings
The old PlugIn settings
Rhino.PlugIns.PlugIn.Settings
Rhino.PlugIns.PlugIn.SettingsSaved
Since: 6.0

Rhino.PersistentSettingsSavedEventArgs.CommandSettings(System.String)
The new command settings
englishCommandName:
English command to find settings for
Returns:
Since: 6.0