Rhino.DocObjects.Tables.LayerTable.Document
Document that owns this table.
Since: 5.0

Rhino.DocObjects.Tables.LayerTable.Count
Returns number of layers in the layer table, including deleted layers.
Since: 5.0

Rhino.DocObjects.Tables.LayerTable.ActiveCount
Returns number of layers in the layer table, excluding deleted layers.
Since: 5.0

Rhino.DocObjects.Tables.LayerTable.Item(System.Int32)
Conceptually, the layer table is an array of layers.
The operator[] can be used to get individual layers. A layer is
either active or deleted and this state is reported by Layer.IsDeleted.
index: zero based array index.
Returns:
Reference to the layer.  If layer_index is out of range, the current
layer is returned. Note that this reference may become invalid after
AddLayer() is called.

Rhino.DocObjects.Tables.LayerTable.CurrentLayerIndex
At all times, there is a "current" layer.  Unless otherwise specified, new objects
are assigned to the current layer. The current layer is never locked, hidden, or deleted.
Returns: Zero based layer table index of the current layer.
Since: 5.0

Rhino.DocObjects.Tables.LayerTable.SetCurrentLayerIndex(System.Int32,System.Boolean)
At all times, there is a "current" layer. Unless otherwise specified, new objects
are assigned to the current layer. The current layer is never locked, hidden, or deleted.
layerIndex:
Value for new current layer. 0 <= layerIndex < LayerTable.Count.
The layer's mode is automatically set to NormalMode.
quiet:
if true, then no warning message box pops up if the current layer request can't be satisfied.
Returns: true if current layer index successfully set.
Since: 5.0

Rhino.DocObjects.Tables.LayerTable.CurrentLayer
At all times, there is a "current" layer. Unless otherwise specified,
new objects are assigned to the current layer. The current layer is
never locked, hidden, or deleted.
Returns reference to the current layer. Note that this reference may
become invalid after a call to AddLayer().
Since: 5.0

Rhino.DocObjects.Tables.LayerTable.ComponentType
Since: 6.0

Rhino.DocObjects.Tables.LayerTable.GetSorted
Gets an array of layer indices that are sorted by the values of Rhino.DocObjects.Layer.SortIndex.
Returns: An array of layer indices.
Since: 7.34

Rhino.DocObjects.Tables.LayerTable.SortByLayerName(System.Boolean)
Sort layers, in the layer table, by their name in either ascending or descending order.
This function sorts layers in the same manner as Rhino's Layers panel.
bAscending: Sort in ascending (true) or descending (false) order.
Remarks:
This function changes the value of Rhino.DocObjects.Layer.SortIndex.
It does not change the index order of layers in the layer table.
Since: 8.2

Rhino.DocObjects.Tables.LayerTable.Find(System.String,System.Boolean)
Finds the layer with a given name. If multiple layers exist that have the same name, the
first match layer index will be returned.
Deleted layers have no name.
layerName: name of layer to search for. The search ignores case.
ignoreDeletedLayers: true means don't search deleted layers.
Returns:
index of the layer with the given name.
If no layer is found, the index of the default layer, -1, is returned.
Since: 5.0
6.0

Rhino.DocObjects.Tables.LayerTable.FindNext(System.Int32,System.String,System.Boolean)
Since: 5.0
6.0

Rhino.DocObjects.Tables.LayerTable.FindNext(System.Int32,System.String)
Use FindName(name, index).
index: Do not use.
layerName: Do not use.
Returns: Do not use.
Since: 6.0

Rhino.DocObjects.Tables.LayerTable.FindByFullPath(System.String,System.Boolean)
Since: 5.0
6.0

Rhino.DocObjects.Tables.LayerTable.FindByFullPath(System.String,System.Int32)
Searches for a layer using the fully qualified name, that includes ancestors.
Deleted layers have no name.
layerPath: The full layer name.
notFoundReturnValue: Should be -1 to get the index of the OpenNURBS default layer,
or UnsetIntIndex to get an always-out-of-bound value.
Returns: The index of the found layer, or notFoundReturnValue.
Since: 6.0

Rhino.DocObjects.Tables.LayerTable.Find(System.Guid,System.String,System.Boolean)
Finds a layer with a given name and matching parent ID.
parentId: A valid layer ID.
layerName: name of layer to search for. The search ignores case.
ignoreDeletedLayers: If true, deleted layers are not checked. NOT SUPPORTED FOR NAME SEARCH, only for Guids.
Returns:
>=0 index of the layer with the given name
-1  no layer has the given name.
Since: 6.0
6.0

Rhino.DocObjects.Tables.LayerTable.Find(System.Guid,System.String,System.Int32)
Finds a layer with a given name and matching parent ID.
parentId: A valid layer ID.
layerName: name of layer to search for. The search ignores case.
notFoundReturnValue: Should be -1 to get the index of the OpenNURBS default layer,
or UnsetIntIndex to get an always-out-of-bound value.
Returns: The index of the found layer, or notFoundReturnValue.
Since: 6.0

Rhino.DocObjects.Tables.LayerTable.Find(System.Guid,System.Boolean)
Finds a layer with a matching ID.
layerId: A valid layer ID.
ignoreDeletedLayers: If true, deleted layers are not checked.
Returns:
>=0 index of the layer with the given name
-1  no layer has the given name.
Since: 5.0
6.0

Rhino.DocObjects.Tables.LayerTable.Find(System.Guid,System.Boolean,System.Int32)
Finds a layer with a matching ID.
layerId: A valid layer ID.
ignoreDeletedLayers: If true, deleted layers are not checked.
notFoundReturnValue: Should be -1 to get the index of the OpenNURBS default layer,
or UnsetIntIndex to get an always-out-of-bound value.
Returns: The index of the found layer, or notFoundReturnValue.
Since: 6.0

Rhino.DocObjects.Tables.LayerTable.FindName(System.String)
Finds the layer with a given name. If multiple layers exist that have the same name, the
first match layer index will be returned.
Deleted layers have no name.
The default layer is NOT included in the search. If required, use the overload with startIndex input.
layerName: name of layer to search for. The search ignores case.
Returns:
A layer, or null.
Since: 6.0

Rhino.DocObjects.Tables.LayerTable.FindName(System.String,System.Int32)
Finds the next layer that has an index equal or higher than the searched value.
Search in case-insensitive.
startIndex: If you specify RhinoMath.UnsetIntIndex, then also default layers will be included.
This is the first index that will be tested.
layerName: The layer to search for.
Returns: A layer, or null.
Since: 6.0

Rhino.DocObjects.Tables.LayerTable.FindNameHash(Rhino.FileIO.NameHash)
Finds a Layer given its name hash.
nameHash: The name hash of the Layer to be searched.
Returns: An Layer, or null on error.
Since: 6.0

Rhino.DocObjects.Tables.LayerTable.FindIndex(System.Int32)
Retrieves a Layer object based on Index. This search type of search is discouraged.
We are moving towards using only IDs for all tables.
index: The index to search for.
Returns: A Layer object, or null if none was found.
Since: 6.0

Rhino.DocObjects.Tables.LayerTable.Add(Rhino.DocObjects.Layer)
Adds a new layer with specified definition to the layer table.
layer:
definition of new layer. The information in layer is copied. If layer.Name is empty
the a unique name of the form "Layer 01" will be automatically created.
Returns:
>=0 index of new layer
-1  layer not added because a layer with that name already exists.
Since: 5.0

Rhino.DocObjects.Tables.LayerTable.System#Collections#Generic#ICollection{Rhino#DocObjects#Layer}#Add(Rhino.DocObjects.Layer)
Since: 5.0

Rhino.DocObjects.Tables.LayerTable.Add(System.String,System.Drawing.Color)
Adds a new layer with specified definition to the layer table.
layerName: Name for new layer. Cannot be a null or zero-length string.
layerColor: Color of new layer. Alpha components will be ignored.
Returns:
>=0 index of new layer
-1  layer not added because a layer with that name already exists.
Since: 5.0

Rhino.DocObjects.Tables.LayerTable.AddReferenceLayer(Rhino.DocObjects.Layer)
Adds a new reference layer with specified definition to the layer table
Reference layers are not saved in files.
layer:
definition of new layer. The information in layer is copied. If layer.Name is empty
the a unique name of the form "Layer 01" will be automatically created.
Returns:
>=0 index of new layer
-1  layer not added because a layer with that name already exists.
Since: 5.0

Rhino.DocObjects.Tables.LayerTable.Add
Adds a new layer with default definition to the layer table.
Returns: index of new layer.
Since: 5.0

Rhino.DocObjects.Tables.LayerTable.AddReferenceLayer
Adds a new reference layer with default definition to the layer table.
Reference layers are not saved in files.
Returns: index of new layer.
Since: 5.0

Rhino.DocObjects.Tables.LayerTable.AddPath(System.String)
Adds all of the layer in the specified layer path, beginning with the root.
Layer paths contain one or more valid layers names, with each name separated by Rhino.DocObjects.ModelComponent.NamePathSeparator.
For example, "Grandfather::Father::Son".
layerPath: The layer path.
Returns: The index of the last layer created if successful, Rhino.RhinoMath.UnsetIntIndex on failure.
Since: 8.0

Rhino.DocObjects.Tables.LayerTable.AddPath(System.String,System.Drawing.Color)
Adds all of the layer in the specified layer path, beginning with the root.
Layer paths contain one or more valid layers names, with each name separated by Rhino.DocObjects.ModelComponent.NamePathSeparator.
For example, "Grandfather::Father::Son".
layerPath: The layer path.
layerColor: The color of newly created layers. The colors of layers that already exist will not be changed.
Returns: The index of the last layer created if successful, Rhino.RhinoMath.UnsetIntIndex on failure.
Since: 8.0

Rhino.DocObjects.Tables.LayerTable.CreateLayer(Rhino.DocObjects.Layer,Rhino.DocObjects.Tables.LayerTable.LayerType,System.UInt32,System.UInt32)
Basic tool used by the add layer methods.
newLayer:
Settings for new layer. These are copied to the layer table entry and any user data on layer is moved to the layer table entry.
layerType: Type type of layer to create.
worksessionReferenceModelSerialNumber:
Worksession reference model serial number, where:
0: Layer is not a reference layer.
1: Layer is a reference layer but not part of a worksession reference file.
2-1000: Reserved for future use.
>1000: Worksession reference model serial number.
linkedInstanceDefinitionSerialNumber:
Linked instance definition serial number, where:
0: Layer is not from a liked instance definition.
1-1000: Reserved for future use.
>1000: Linked instance definition serial number.
Returns: The index of the last layer created if successful, Rhino.RhinoMath.UnsetIntIndex on failure.
Since: 8.6

Rhino.DocObjects.Tables.LayerTable.Modify(Rhino.DocObjects.Layer,System.Int32,System.Boolean)
Modifies layer settings.
newSettings: This information is copied.
layerIndex:
zero based index of layer to set.  This must be in the range 0 <= layerIndex < LayerTable.Count.
quiet: if false, information message boxes pop up when illegal changes are attempted.
Returns:
true if successful. false if layerIndex is out of range or the settings attempt
to lock or hide the current layer.
Since: 5.0

Rhino.DocObjects.Tables.LayerTable.Modify(Rhino.DocObjects.Layer,System.Guid,System.Boolean)
Modifies layer settings.
newSettings: This information is copied.
layerId:
Id of layer.
quiet: if false, information message boxes pop up when illegal changes are attempted.
Returns:
true if successful. false if layerIndex is out of range or the settings attempt
to lock or hide the current layer.
Since: 6.0

Rhino.DocObjects.Tables.LayerTable.ForceLayerVisible(System.Guid)
Makes a layer and all of its parent layers visible.
layerId: The layer ID to be made visible.
Returns: true if the operation succeeded.
Since: 5.0

Rhino.DocObjects.Tables.LayerTable.ForceLayerVisible(System.Int32)
Makes a layer and all of its parent layers visible.
layerIndex: The layer index to be made visible.
Returns: true if the operation succeeded.
Since: 5.0

Rhino.DocObjects.Tables.LayerTable.UndoModify(System.Int32,System.UInt32)
Restores the layer to its previous state,
if the layer has been modified and the modification can be undone.
layerIndex: The layer index to be used.
undoRecordSerialNumber: The undo record serial number. Pass 0 not to specify one.
Returns: true if this layer had been modified and the modifications were undone.
Since: 5.0

Rhino.DocObjects.Tables.LayerTable.UndoModify(System.Int32)
Restores the layer to its previous state,
if the layer has been modified and the modification can be undone.
layerIndex: The layer index to be used.
Returns: true if this layer had been modified and the modifications were undone.
Since: 5.0

Rhino.DocObjects.Tables.LayerTable.UndoModify(System.Guid,System.UInt32)
Restores the layer to its previous state,
if the layer has been modified and the modification can be undone.
layerId: The layer Id to be used.
undoRecordSerialNumber: The undo record serial number. Pass 0 not to specify one.
Returns: true if this layer had been modified and the modifications were undone.
Since: 6.0

Rhino.DocObjects.Tables.LayerTable.UndoModify(System.Guid)
Restores the layer to its previous state,
if the layer has been modified and the modification can be undone.
layerId: The layer Id to be used.
Returns: true if this layer had been modified and the modifications were undone.
Since: 6.0

Rhino.DocObjects.Tables.LayerTable.Delete(System.Int32,System.Boolean)
Deletes layer.
layerIndex:
zero based index of layer to delete. This must be in the range 0 <= layerIndex < LayerTable.Count.
quiet:
If true, no warning message box appears if a layer the layer cannot be
deleted because it is the current layer or it contains active geometry.
Returns:
true if successful. false if layerIndex is out of range or the layer cannot be
deleted because it is the current layer or because it layer contains active geometry.
Since: 5.0

Rhino.DocObjects.Tables.LayerTable.Delete(Rhino.DocObjects.Layer)
Deletes layer.
layer:
Layer to be deleted.
///
Returns:
true if successful. false if layerIndex is out of range or the layer cannot be
deleted because it is the current layer or because it layer contains active geometry.
Since: 6.0

Rhino.DocObjects.Tables.LayerTable.Delete(System.Guid,System.Boolean)
Deletes layer.
layerId:
Id of the layer to be deleted.
quiet:
If true, no warning message box appears if a layer the layer cannot be
deleted because it is the current layer or it contains active geometry.
Returns:
true if successful. false if layerIndex is out of range or the layer cannot be
deleted because it is the current layer or because it layer contains active geometry.
Since: 6.0

Rhino.DocObjects.Tables.LayerTable.Delete(Rhino.DocObjects.Layer,System.Boolean)
Deletes layer.
layer:
Layer to be deleted.
quiet:
If true, no warning message box appears if a layer the layer cannot be
deleted because it is the current layer or it contains active geometry.
Returns:
true if successful. false if layerIndex is out of range or the layer cannot be
deleted because it is the current layer or because it layer contains active geometry.
Since: 6.0

Rhino.DocObjects.Tables.LayerTable.Delete(System.Collections.Generic.IEnumerable{System.Int32},System.Boolean)
Deletes layers.
layerIndices: An enumeration containing the indices of the layers to delete.
quiet:
If true, no warning message boxes will appear.
Returns: the number of layers that were deleted.
Since: 8.0

Rhino.DocObjects.Tables.LayerTable.Purge(System.Int32,System.Boolean)
Deletes a layer and all geometry objects on a layer
layerIndex:
zero based index of layer to delete. This must be in the range 0 <= layerIndex < LayerTable.Count.
quiet:
If true, no warning message box appears if a layer the layer cannot be
deleted because it is the current layer.
Returns:
true if successful. false if layerIndex is out of range or the layer cannot be
deleted because it is the current layer.
Since: 5.5

Rhino.DocObjects.Tables.LayerTable.Purge(System.Guid,System.Boolean)
Deletes a layer and all geometry objects on a layer.
layerId:
Id of the layer to purge.
quiet:
If true, no warning message box appears if a layer the layer cannot be
deleted because it is the current layer.
Returns:
true if successful. false if layerIndex is out of range or the layer cannot be
deleted because it is the current layer.
Since: 6.0

Rhino.DocObjects.Tables.LayerTable.Undelete(System.Int32)
Undeletes a layer that has been deleted by DeleteLayer().
layerIndex:
zero based index of layer to undelete.
This must be in the range 0 <= layerIndex < LayerTable.Count.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.LayerTable.GetUnusedLayerName(System.Boolean)
Gets the next unused layer name used as default when creating new layers.
ignoreDeleted:
If this is true then Rhino may use a name used by a deleted layer.
Returns: An unused layer name string.
Since: 5.0
6.0

Rhino.DocObjects.Tables.LayerTable.GetUnusedLayerName
Gets the next unused layer name used as default when creating new layers.
Returns: An unused layer name string.
Since: 6.0

Rhino.DocObjects.Tables.LayerTable.GetSelected(System.Collections.Generic.List{System.Int32}@)
Returns the indices of layers that are selected on the Layer user interface.
layerIndices: The indices of selected layers.
Returns: true if the layer user interface is visible, false otherwise.

Rhino.DocObjects.Tables.LayerTable.Select(System.Collections.Generic.IEnumerable{System.Int32},System.Boolean)
Selects layers in the Layer user interface.
layerIndices: The indices of layers to select.
bDeselect: If true, then any previously selected layers will be unselected.
Returns: true if the layer user interface is visible, false otherwise.
Since: 6.0

Rhino.DocObjects.Tables.LayerTable.Duplicate(System.Int32,System.Boolean,System.Boolean)
Duplicates, or copies, a layer. Duplicated layers are added to the document.
layerIndex: The index of the layer to duplicate.
duplicateObjects: If true, then layer objects will also be duplicated and added to the document.
duplicateSublayers: If true, then all sub-layers of the layer will be duplicated.
Returns: The indices of the newly added layers if successful, an empty array on failure.
Since: 6.18

Rhino.DocObjects.Tables.LayerTable.Duplicate(System.Collections.Generic.IEnumerable{System.Int32},System.Boolean,System.Boolean)
Duplicates, or copies, one or more layers. Duplicated layers are added to the document.
layerIndices: The indices of layers to duplicate.
duplicateObjects: If true, then layer objects will also be duplicated and added to the document.
duplicateSublayers: If true, then all sub-layers of the layer will be duplicated.
Returns: The indices of the newly added layers if successful, an empty array on failure.
Since: 6.18

Rhino.DocObjects.Tables.LayerTable.GetEnumerator
Since: 5.0

Rhino.DocObjects.Tables.LayerTable.Sort(System.Collections.Generic.IEnumerable{System.Int32})
Updates the layer sort order
layerIndices: The sort order.
Since: 8.0