Rhino.FileIO.FileSwReadOptions
Options used when reading a SW file

Rhino.FileIO.FileSwReadOptions.ImportPartsAsBlocks
Since: 8.0

Rhino.FileIO.FileSwReadOptions.RotateYtoZ
Since: 8.0

Rhino.FileIO.FileSwReadOptions.ImportConstructionGeometry
Since: 8.0

Rhino.FileIO.FileSwReadOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Import function
Returns:
Since: 8.0