Rhino.ApplicationSettings.ModelAidSettings
Contains static methods and properties to modify model aid settings.

Rhino.ApplicationSettings.ModelAidSettings.GetCurrentState
Gets the current settings.
Returns: A new model aid state with current settings.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettings.GetDefaultState
Gets the factory settings.
Returns: A new model aid state with factory settings.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettings.UpdateFromState(Rhino.ApplicationSettings.ModelAidSettingsState)
Updates from a particular setting state.
state: The new states that will be set.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettings.GridSnap
Gets or sets the enabled state of Rhino's grid snap modeling aid.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettings.Ortho
Gets or sets the enabled state of Rhino's ortho modeling aid.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettings.Planar
Gets or sets the enabled state of Rhino's Planar modeling aid.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettings.ProjectSnapToCPlane
Gets or sets the enabled state of Rhino's Project modeling aid.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettings.UseHorizontalDialog
Gets or sets the enabled state of Rhino's use horizontal dialog modeling aid.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettings.ExtendTrimLines
Gets or sets the enabled state of Rhino's extend trim lines.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettings.ExtendToApparentIntersection
Gets or sets the enabled state of Rhino's extend to apparent intersections.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettings.AltPlusArrow
true means Alt+arrow is used for nudging.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettings.DisplayControlPolygon
Gets or sets the enabled state of Rhino's display control polygon.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettings.HighlightControlPolygon
Gets or sets the enabled state of Rhino's highlight dialog modeling aid.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettings.Osnap
Enables or disables Rhino's object snap modeling aid.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettings.SnapToLocked
Gets or sets the locked state of the snap modeling aid.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettings.SnapToOccluded
Since: 8.0

Rhino.ApplicationSettings.ModelAidSettings.SnapToFiltered
Since: 8.0

Rhino.ApplicationSettings.ModelAidSettings.OnlySnapToSelected
Since: 8.0

Rhino.ApplicationSettings.ModelAidSettings.OrthoUseZ
Gets or sets whether Ortho will snap to the CPlane Z axis
Since: 8.0

Rhino.ApplicationSettings.ModelAidSettings.UniversalConstructionPlaneMode
Gets or sets the locked state of the snap modeling aid.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettings.AutoAlignCPlane
Gets or sets whether the cplane will automatically align to the selection
Since: 8.0

Rhino.ApplicationSettings.ModelAidSettings.AutoCPlaneAlignment
//0 = object, 1 = world, 2 = view
Since: 8.0

Rhino.ApplicationSettings.ModelAidSettings.StickyAutoCPlane
Gets or set whether the auto cplane will stay even after deselection
Since: 8.0

Rhino.ApplicationSettings.ModelAidSettings.OrientAutoCPlaneToView
Gets or sets whether the auto cplane will rotate towards the view after aligning to the selection
Since: 8.7

Rhino.ApplicationSettings.ModelAidSettings.OrthoAngle
Gets or sets the base orthogonal angle.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettings.NudgeKeyStep
Gets or sets the nudge step amount.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettings.CtrlNudgeKeyStep
Gets or sets the Ctrl-key based nudge step amount.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettings.ShiftNudgeKeyStep
Gets or sets the Shift-key based nudge step amount.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettings.OsnapPickboxRadius
Enables or disables Rhino's planar modeling aid.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettings.NudgeMode
0 = world, 1 = cplane, 2 = view, 3 = UVN, -1 = not set.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettings.ControlPolygonDisplayDensity
Gets or sets the control polygon display density.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettings.OsnapCursorMode
Gets or sets the OSnap cursor mode.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettings.OsnapModes
Returns or sets Rhino's current object snap mode.
The mode is a bitwise value based on the OsnapModes enumeration.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettings.MousePickboxRadius
radius of mouse pick box in pixels.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettings.PointDisplay
Gets or sets the point display mode.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettings.AutoGumballEnabled
When AutoGumball is on, a gumball automatically appears
when objects are pre-picked.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettings.SnappyGumballEnabled
When SnappyGumball is on, a dragging a gumball moves the center point.
When snappy gumball is off, dragging a gumball moves the mouse down point.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettings.GumballExtrudeMergeFaces
When ExtrudeMergeFaces is true the gumball will attempt to merge
faces if possible after extruding a face
Since: 8.0

Rhino.ApplicationSettings.ModelAidSettings.GumballAutoReset
When GumballAutoReset is on the gumball resets its orientation after a drag
When GumballAutoReset is off the gumball orientation is kept to where it was dragged
Since: 8.10