Rhino.Input.Custom.OptionDouble.#ctor(System.Double)
Since: 5.0

Rhino.Input.Custom.OptionDouble.#ctor(System.Double,System.Double,System.Double)
Initializes a new instance of the Rhino.Input.Custom.OptionDouble class with lower and upper limits.
initialValue: The initial number .
lowerLimit: The minimum value.
upperLimit: The maximum value.
Since: 5.0

Rhino.Input.Custom.OptionDouble.#ctor(System.Double,System.Boolean,System.Double)
Initializes a new instance of the double option class.
initialValue: The initial number .
setLowerLimit:
If true, limit sets the lower limit and upper limit is undefined.
If false, limit sets the upper limit and lower limit is undefined.
limit: The lower limit if setLowerLimit is true; otherwise, the upper limit.
Since: 5.0

Rhino.Input.Custom.OptionDouble.Dispose
Since: 5.0

Rhino.Input.Custom.OptionDouble.CurrentValue
Since: 5.0

Rhino.Input.Custom.OptionDouble.InitialValue
Since: 5.0