Rhino.Runtime.IZooClientUtilities
Interface implemented in ZooClient and added to Rhino via dependency injection

Rhino.Runtime.IZooClientUtilities.Initialize(System.Object)
verify:
Returns:
Since: 6.0

Rhino.Runtime.IZooClientUtilities.Echo(System.Object,System.String)
verify:
message:
Returns:
Since: 6.0

Rhino.Runtime.IZooClientUtilities.ShowRhinoExpiredMessage(Rhino.Runtime.Mode,System.Int32@)
mode:
result:
Returns:
Since: 6.0

Rhino.Runtime.IZooClientUtilities.GetLicense(System.Object,Rhino.Runtime.ZooClientParameters)
verify:
parameters:
Returns:
Since: 6.0

Rhino.Runtime.IZooClientUtilities.ReturnLicense(System.Object,System.Guid)
verify:
productId:
Returns:
Since: 6.0

Rhino.Runtime.IZooClientUtilities.ReturnLicense(System.Object,System.String,System.Guid)
verify:
productPath:
productId:
Returns:
Since: 6.0

Rhino.Runtime.IZooClientUtilities.CheckOutLicense(System.Object,System.Guid)
Checks out a loaned out license from the owning Zoo.
Since: 6.0

Rhino.Runtime.IZooClientUtilities.CheckInLicense(System.Object,System.Guid)
Checks in a checked out license to the owning Zoo.
Since: 6.0

Rhino.Runtime.IZooClientUtilities.ConvertLicense(System.Object,System.Guid)
Converts a standalone license to a network license.
Since: 6.0

Rhino.Runtime.IZooClientUtilities.DeleteLicense(System.Object,System.Guid)
31-Mar-2015 Dale Fugier, http://mcneel.myjetbrains.com/youtrack/issue/MR-1725
Deletes a license along with its license file.
Since: 6.0

Rhino.Runtime.IZooClientUtilities.GetLicenseType(System.Object,System.Guid)
Returns the type of a specified product license
Since: 6.0

Rhino.Runtime.IZooClientUtilities.IsCheckOutEnabled(System.Object)
Returns whether or not license checkout is enabled
Since: 6.0

Rhino.Runtime.IZooClientUtilities.GetLicenseStatus(System.Object)
Returns the current status of every license for ui purposes
Since: 6.0

Rhino.Runtime.IZooClientUtilities.GetOneLicenseStatus(System.Object,System.Guid)
Returns the current status of a license for ui purposes
Since: 6.0

Rhino.Runtime.IZooClientUtilities.ShowBuyLicenseUi(System.Object,System.Guid)
verify:
productId:
Since: 6.0

Rhino.Runtime.IZooClientUtilities.AskUserForLicense(System.Object,Rhino.Runtime.ZooClientParameters)
verify:
parameters:
Returns:
Since: 6.0

Rhino.Runtime.IZooClientUtilities.LicenseOptionsHandler(System.Object,Rhino.Runtime.ZooClientParameters)
verify:
parameters:
Returns:
Since: 6.0

Rhino.Runtime.IZooClientUtilities.ShowLicenseValidationUi(System.Object,System.String)
Shows user interface to validate and register a license.
Returns true if the license is successfully validated; false otherwise
Since: 6.0

Rhino.Runtime.IZooClientUtilities.GetRegisteredOwnerInfo(System.Object,System.Guid,System.String@,System.String@)
Returns the registered owner and organization of a license
4-Sept-2014 Dale Fugier, http://mcneel.myjetbrains.com/youtrack/issue/RH-28623
Since: 6.0

Rhino.Runtime.IZooClientUtilities.LoginToCloudZoo
Logs the user in to the cloud zoo. This logs out the current user and voids any existing leases.
Since: 6.0

Rhino.Runtime.IZooClientUtilities.LogoutOfCloudZoo
Logs the user out of the cloud zoo. This logs out the current user and voids any existing leases.
Since: 6.0

Rhino.Runtime.IZooClientUtilities.LoggedInUserAvatar
Returns the logged in user's avatar picture.
Returns a default avatar if the user does not have an avatar or if the avatar could not be fetched.
Since: 6.0

Rhino.Runtime.IZooClientUtilities.LoggedInUserName
Returns the name of the logged in user, or null if the user is not logged in.
Since: 6.0

Rhino.Runtime.IZooClientUtilities.UserIsLoggedIn
Returns true if the user is logged in; else returns false.
A logged in user does not guarantee that the auth tokens managed by the CloudZooManager instance are valid.
Since: 6.0

Rhino.Runtime.IZooClientUtilities.GetCurrentTime
Gets the current time, trying to access an NTP server before using local time.
Returns:
Since: 6.0