Rhino.PrivateMeshCommands.MeshTypes.Angle.Angle3DSignedReferralOf(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Returns a quantity related to the angle, in the domain [0-4)
that is strictly increasingly monotonic given the angle.
This funcion does not give any additional advantanges over
SignedAngle3D, except it is faster.
v0: Unitized vector V0
v1: Unitized vector V1
sign: The normal of the plane that explains whether v0 is earlier in counterclockwise terms than v1
Returns: A number between 0 (same vector) and 4 (completely opposite)