Rhino.FileIO.FileObjWriteOptions.NGons
Since: 7.0

Rhino.FileIO.FileObjWriteOptions.NGons.None
Ngons will not be created, nor will they be exported if they already exist

Rhino.FileIO.FileObjWriteOptions.NGons.Preserve
If ngons already exist, they will be used as is, no ngons will be created

Rhino.FileIO.FileObjWriteOptions.NGons.Create
Ngons will be created, if possible, by calling Mesh.Ngons.AddPlanarNgons