Rhino.PlugIns.LicenseUtils
License Manager Utilities.

Rhino.PlugIns.LicenseUtils.Initialize
Initializes the license manager.
Since: 5.0

Rhino.PlugIns.LicenseUtils.ShowRhinoExpiredMessage(Rhino.Runtime.Mode,System.Int32@)
Show Rhino or Beta expired message
mode:
result:
Returns:
Since: 6.0

Rhino.PlugIns.LicenseUtils.Echo(System.String)
Test connectivity with the Zoo.
Since: 5.0

Rhino.PlugIns.LicenseUtils.ShowLicenseValidationUi(System.String)
ShowLicenseValidationUi
Since: 5.0

Rhino.PlugIns.LicenseUtils.GetLicense(System.String,System.Guid,System.Guid,System.Int32,System.String,Rhino.PlugIns.LicenseCapabilities,System.String,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate)
20-May-2013 Dale Fugier
This (internal) version of Rhino.PlugIns.LicenseUtils.GetLicense
is used by Rhino.PlugIns.PlugIn objects.

Rhino.PlugIns.LicenseUtils.GetLicense(Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,Rhino.PlugIns.VerifyLicenseKeyDelegate,Rhino.PlugIns.VerifyPreviousVersionLicenseDelegate,System.Int32,System.Int32,System.String,System.String,System.String,System.Guid,System.Guid)
Since: 6.0

Rhino.PlugIns.LicenseUtils.GetLicense(Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,System.Int32,System.Int32,System.String,System.String,System.String,System.Guid,System.Guid)
This version of Rhino.PlugIns.LicenseUtils.GetLicense
is used by Rhino C++ plug-ins.
Since: 6.0

Rhino.PlugIns.LicenseUtils.AskUserForLicense(System.Int32,System.Boolean,System.Object,System.String,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,Rhino.PlugIns.VerifyLicenseKeyDelegate,Rhino.PlugIns.VerifyPreviousVersionLicenseDelegate,System.String,System.String,System.Guid,System.Guid,Rhino.PlugIns.LicenseCapabilities)
Since: 6.0

Rhino.PlugIns.LicenseUtils.ValidateLicenseNoPrompt(System.Int32,System.String,System.String,System.String,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,Rhino.PlugIns.VerifyLicenseKeyDelegate,Rhino.PlugIns.VerifyPreviousVersionLicenseDelegate,System.String,System.String,System.Guid,System.Guid,Rhino.PlugIns.LicenseCapabilities)
RH-92777: Validates a stand-alone license key for the given account email against
the validation server, asking the user for no input (the validation wizard still
shows progress), locking it to this computer on success. Used by the
rhinoN://license protocol handler.

Rhino.PlugIns.LicenseUtils.AskUserForLicense(System.Int32,System.Boolean,System.Object,System.String,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,System.String,System.String,System.Guid,System.Guid,Rhino.PlugIns.LicenseCapabilities)
This version of Rhino.PlugIns.LicenseUtils.AskUserForLicense
is used by Rhino C++ plug-ins.
Since: 6.0

Rhino.PlugIns.LicenseUtils.ReturnLicense(System.String,System.Guid,System.String)
This (internal) version of Rhino.PlugIns.LicenseUtils.ReturnLicense is used
is used by Rhino.PlugIns.PlugIn objects.

Rhino.PlugIns.LicenseUtils.ReturnLicense(System.Guid)
OBSOLETE - REMOVE WHEN POSSIBLE.
Since: 5.0

Rhino.PlugIns.LicenseUtils.CheckOutLicense(System.Guid)
Checks out a license that is on loan from a Zoo server
on a permanent basis.
productId:
The Guid of the product that you want to check out.
Returns:
true if the license was checked out successful.
false if not successful or on error.
Since: 5.0

Rhino.PlugIns.LicenseUtils.CheckInLicense(System.Guid)
Checks in a previously checked out license to
the Zoo server from which it was checked out.
productId:
The Guid of the product that you want to check in.
Returns:
true if the license was checked in successful.
false if not successful or on error.
Since: 5.0

Rhino.PlugIns.LicenseUtils.ConvertLicense(System.Guid)
Converts a product license from a standalone node
to a network node.
productId:
The Guid of the product that you want to check in.
Returns:
true if the license was successfully converted.
false if not successful or on error.
Since: 5.0

Rhino.PlugIns.LicenseUtils.DeleteLicense(System.Guid)
Deletes a license along with its license file.
Since: 6.0

Rhino.PlugIns.LicenseUtils.GetLicenseType(System.Guid)
Returns the contentType of a specified product license
Since: 5.0

Rhino.PlugIns.LicenseUtils.IsCheckOutEnabled
Returns whether or not license checkout is enabled.
Since: 5.0

Rhino.PlugIns.LicenseUtils.GetLicenseStatus
Returns the current status of every license for UI purposes.
Since: 5.0

Rhino.PlugIns.LicenseUtils.GetOneLicenseStatus(System.Guid)
Returns the current status of a license for UI purposes.
Since: 5.5

Rhino.PlugIns.LicenseUtils.GetLicenseCapabilities(System.Int32)
Converts an integer to a LicenseCapabilities flag
Since: 5.5

Rhino.PlugIns.LicenseUtils.LicenseOptionsHandler(System.Guid,System.Guid,System.String,System.Boolean)
Since: 6.0

Rhino.PlugIns.LicenseUtils.ShowBuyLicenseUi(System.Guid)
Since: 5.5

Rhino.PlugIns.LicenseUtils.GetRegisteredOwnerInfo(System.Guid,System.String@,System.String@)
This (internal) version GetRegisteredOwnerInfo is used RhinoCommon plug-ins.

Rhino.PlugIns.LicenseUtils.LoginToCloudZoo
Since: 6.0

Rhino.PlugIns.LicenseUtils.LogoutOfCloudZoo
Since: 6.0