Rhino.Geometry.Extrusion
Represents an extrusion, or objects such as beams or linearly extruded elements,
that can be represented by profile curves and two miter planes at the extremes.

Rhino.Geometry.Extrusion.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected serialization constructor.
info: The serialization data.
context: The serialization context stream.

Rhino.Geometry.Extrusion.Create(Rhino.Geometry.Curve,System.Double,System.Boolean)
Creates an extrusion of a 3d curve (which must be planar) and a height.
planarCurve:
Planar curve used as profile
height:
If the height > 0, the bottom of the extrusion will be in plane and
the top will be height units above the plane.
If the height < 0, the top of the extrusion will be in plane and
the bottom will be height units below the plane.
The plane used is the one that is returned from the curve's TryGetPlane function.
cap:
If the curve is closed and cap is true, then the resulting extrusion is capped.
Returns:
If the input is valid, then a new extrusion is returned. Otherwise null is returned
Since: 5.1

Rhino.Geometry.Extrusion.Create(Rhino.Geometry.Curve,Rhino.Geometry.Plane,System.Double,System.Boolean)
Create an extrusion from a 3d curve, a plane and a height.
curve: A continuous 3d curve.
plane: A plane. The 3d curve is projected to this plane
and the result is passed to Rhino.Geometry.Extrusion.SetOuterProfile(Rhino.Geometry.Curve,System.Boolean).
height:
If the height > 0, the bottom of the extrusion will be in plane and
the top will be height units above the plane.
If the height < 0, the top of the extrusion will be in plane and
the bottom will be height units below the plane.
The plane used is the one that is returned from the curve's TryGetPlane function.
cap:
If the curve is closed and cap is true, then the resulting extrusion is capped.
Returns:
If the input is valid, then a new extrusion is returned. Otherwise null is returned
Since: 8.0

Rhino.Geometry.Extrusion.CreateBoxExtrusion(Rhino.Geometry.Box,System.Boolean)
Gets an extrusion from a box.
box: IsValid must be true.
cap: If true, the base and the top of the box will be capped. Defaults to true.
Returns: Extrusion on success. null on failure.
Since: 6.0

Rhino.Geometry.Extrusion.CreateCylinderExtrusion(Rhino.Geometry.Cylinder,System.Boolean,System.Boolean)
Gets an extrusion form of a cylinder.
cylinder: IsFinite must be true.
capBottom: If true, the end at cylinder.Height1 will be capped.
capTop: If true, the end at cylinder.Height2 will be capped.
Returns: Extrusion on success. null on failure.
Since: 5.0

Rhino.Geometry.Extrusion.CreatePipeExtrusion(Rhino.Geometry.Cylinder,System.Double,System.Boolean,System.Boolean)
Gets an extrusion form of a pipe.
cylinder: IsFinite must be true.
otherRadius:
If cylinder.Radius is less than other radius, then the cylinder will be the inside
of the pipe.
capTop: If true, the end at cylinder.Height2 will be capped.
capBottom: If true, the end at cylinder.Height1 will be capped.
Returns: Extrusion on success. null on failure.
Since: 5.0

Rhino.Geometry.Extrusion.#ctor
Initializes a new instance of the Rhino.Geometry.Extrusion class.
Since: 5.0

Rhino.Geometry.Extrusion.ToBrep(System.Boolean)
Constructs a brep form of the extrusion. The outer profile is always the first face of the brep.
If there are inner profiles, additional brep faces are created for each profile. If the
outer profile is closed, then end caps are added as the last two faces of the brep.
splitKinkyFaces:
If true and the profiles have kinks, then the faces corresponding to those profiles are split
so they will be G1.
Returns: A brep with a similar shape like this extrusion, or null on error.
Since: 5.0

Rhino.Geometry.Extrusion.GetBrepFormComponentIndex(Rhino.Geometry.ComponentIndex)
Convert a component index that identifies a part of this extrusion
to a component index that identifies a part of the Brep created
by Extrusion.ToBrep(false).
extrusionComponentIndex: The extrusion component index.
Returns: The Brep component index if successful. Otherwise, Rhino.Geometry.ComponentIndex.Unset is returned.
Since: 8.1

Rhino.Geometry.Extrusion.SetPathAndUp(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)
Allows to set the two points at the extremes and the up vector.
a: The start point.
b: The end point.
up: The up vector.
Returns: true if the operation succeeded; otherwise false.
Setting up=a-b will make the operation fail.
Since: 5.0

Rhino.Geometry.Extrusion.PathStart
Gets the start point of the path.
Since: 5.0

Rhino.Geometry.Extrusion.PathEnd
Gets the end point of the path.
Since: 5.0

Rhino.Geometry.Extrusion.PathTangent
Gets the up vector of the path.
Since: 5.0

Rhino.Geometry.Extrusion.MiterPlaneNormalAtStart
Gets or sets the normal of the miter plane at the start in profile coordinates.
In profile coordinates, 0,0,1 always maps to the extrusion axis
Since: 5.0

Rhino.Geometry.Extrusion.MiterPlaneNormalAtEnd
Gets or sets the normal of the miter plane at the end in profile coordinates.
In profile coordinates, 0,0,1 always maps to the extrusion axis
Since: 5.0

Rhino.Geometry.Extrusion.IsMiteredAtStart
Returns a value indicating whether a miter plane at start is defined.
Since: 5.0

Rhino.Geometry.Extrusion.IsMiteredAtEnd
Gets a value indicating whether a miter plane at the end is defined.
Since: 5.0

Rhino.Geometry.Extrusion.IsSolid
Gets a value indicating whether there is no gap among all surfaces constructing this object.
Since: 5.0

Rhino.Geometry.Extrusion.IsCappedAtBottom
Gets a value indicating whether the surface that fills the bottom profile is existing.
Since: 5.0

Rhino.Geometry.Extrusion.IsCappedAtTop
Gets a value indicating whether the surface that fills the top profile is existing.
Since: 5.0

Rhino.Geometry.Extrusion.CapCount
Gets the amount of capping surfaces.
Since: 5.0

Rhino.Geometry.Extrusion.GetProfileTransformation(System.Double)
Gets the transformation that maps the XY profile curve to its 3d location.
s:
0.0 = starting profile
1.0 = ending profile.
Returns: A Transformation. The transform is Invalid on failure.
Since: 5.0

Rhino.Geometry.Extrusion.GetProfilePlane(System.Double)
Gets the 3D plane containing the profile curve at a normalized path parameter.
s:
0.0 = starting profile
1.0 = ending profile.
Returns: A plane. The plane is Invalid on failure.
Remarks:
When no mitering is happening, GetPathPlane() and GetProfilePlane() return the same plane.
Since: 5.0

Rhino.Geometry.Extrusion.GetPathPlane(System.Double)
Gets the 3D plane perpendicular to the path at a normalized path parameter.
s:
0.0 = starting profile
1.0 = ending profile.
Returns: A plane. The plane is Invalid on failure.
Remarks:
When no mitering is happening, GetPathPlane() and GetProfilePlane() return the same plane.
Since: 5.0

Rhino.Geometry.Extrusion.SetOuterProfile(Rhino.Geometry.Curve,System.Boolean)
Sets the outer profile of the extrusion.
outerProfile: curve in the XY plane or a 2D curve.
cap:
If outerProfile is a closed curve, then cap determines if the extrusion
has end caps. If outerProfile is an open curve, cap is ignored.
Returns:
true if the profile was set. If the outer profile is closed, then the
extrusion may also have inner profiles. If the outer profile is open,
the extrusion may not have inner profiles. If the extrusion already
has a profile, the set will fail.
Since: 5.0

Rhino.Geometry.Extrusion.AddInnerProfile(Rhino.Geometry.Curve)
Adds an inner profile.
innerProfile: Closed curve in the XY plane or a 2d curve.
Returns: true if the profile was set.
Since: 5.0

Rhino.Geometry.Extrusion.ProfileCount
Gets the amount of profile curves.
Since: 5.0

Rhino.Geometry.Extrusion.Profile3d(System.Int32,System.Double)
Gets a transversal isocurve of the extruded profile.
profileIndex:
0 <= profileIndex < ProfileCount
The outer profile has index 0.
s:
0.0 <= s <= 1.0
A relative parameter controlling which profile is returned.
0 = bottom profile and 1 = top profile.
Returns: The profile.
Since: 5.0

Rhino.Geometry.Extrusion.Profile3d(Rhino.Geometry.ComponentIndex)
Gets one of the profiles.
ci: The index of this profile.
Returns: The profile.
Since: 5.0

Rhino.Geometry.Extrusion.WallEdge(Rhino.Geometry.ComponentIndex)
Gets one of the longitudinal curves along the beam or extrusion.
ci: The index of this profile.
Returns: The profile.
Since: 5.0

Rhino.Geometry.Extrusion.WallSurface(Rhino.Geometry.ComponentIndex)
Gets one of the longitudinal surfaces of the extrusion.
ci: The index specifying which precise item to retrieve.
Returns: The surface.
Since: 5.0

Rhino.Geometry.Extrusion.PathLineCurve
Gets the line-like curve that is the conceptual axis of the extrusion.
Returns: The path as a line curve.
Since: 5.0

Rhino.Geometry.Extrusion.ProfileIndex(System.Double)
Gets the index of the profile curve at a domain related to a parameter.
profileParameter: Parameter on profile curve.
Returns:
-1 if profileParameter does not correspond to a point on the profile curve.
When the profileParameter corresponds to the end of one profile and the
beginning of the next profile, the index of the next profile is returned.
Since: 5.0

Rhino.Geometry.Extrusion.GetMesh(Rhino.Geometry.MeshType)
Obtains a reference to a specified type of mesh for this extrusion.
meshType: The mesh type.
Returns: A mesh.
Since: 5.6

Rhino.Geometry.Extrusion.SetMesh(Rhino.Geometry.Mesh,Rhino.Geometry.MeshType)
Sets a specified type of mesh for this extrusion.
mesh: The mesh.
meshType: The mesh type.
Returns: True on success.
Since: 8.3

Rhino.Geometry.Extrusion.GetWireframe
Constructs all the Wireframe curves for this Extrusion.
Returns: An array of Wireframe curves.
Since: 5.6