Rhino.LengthValue
Represents a length with an associated unit system and a string
representation of that length. This allows for going back and
forth from numerical representation of a length and a string
representation without "guessing" at the initial string

Rhino.LengthValue.Finalize
passively reclaim native allocated ON_LenghtValue*

Rhino.LengthValue.Dispose
actively reclaim native allocated ON_LenghtValue*
Since: 6.0

Rhino.LengthValue.Create(System.String,Rhino.Input.StringParserSettings,System.Boolean@)
Create from string
s: string to parse
ps:
parsedAll: true if the whole string was parsed
Since: 6.0

Rhino.LengthValue.Create(System.Double,Rhino.UnitSystem,Rhino.LengthValue.StringFormat)
Create from Length and UnitSystem
length: Numeric length value
us: Unit system
format:
Since: 6.0

Rhino.LengthValue.Create(System.Double,Rhino.UnitSystem,Rhino.LengthValue.StringFormat,System.UInt32)
Create from Length and UnitSystem
length: Numeric length value
us: Unit system
format:
localeId:
Since: 6.0

Rhino.LengthValue.Length
Length value in this instance's current unit system
Returns:
Since: 6.0

Rhino.LengthValue.Length(Rhino.UnitSystem)
Length value in a given unit system
units:
Returns:
Since: 6.0

Rhino.LengthValue.LengthString
Return length as a string
Returns:
Since: 6.0

Rhino.LengthValue.ChangeLength(System.Double)
Changes the numeric value in a LengthValue and leaves all of the other info unchanged
UnitSystem, ParseSettings and StringFormat stay as they were
newLength:
Returns: A new LengthValue
Since: 6.0

Rhino.LengthValue.ChangeUnitSystem(Rhino.UnitSystem)
Change the UnitSystem of a LengthValue
The numeric value of Length is scaled by new_us / current unit system
so that the absolute length stays the same
newUnits:
Returns:
Since: 6.0

Rhino.LengthValue.ParseSettings
Parse settings
Since: 6.0

Rhino.LengthValue.UnitSystem
UnitSystem used by this LengthValue
Since: 6.0

Rhino.LengthValue.LengthStringFormat
Returns the StringFormat from this LengthValue
Since: 6.0

Rhino.LengthValue.ContextLocaleId
returns the context LocaleId from this LengthValue
Since: 6.0

Rhino.LengthValue.ContextAngleUnitSystem
Returns the context AngleUnitSystem from this LengthValue's ParseSettings
Since: 6.0

Rhino.LengthValue.IsUnset
Test IsUnset
Returns:
Since: 6.0