Rhino.Display.DisplayBitmapDrawList.#ctor
Since: 5.0

Rhino.Display.DisplayBitmapDrawList.BoundingBox
Since: 5.0

Rhino.Display.DisplayBitmapDrawList.MaximumCachedSortLists
Maximum number of cached sort order index lists stored on this class.
Default is 10, but depending on the number of points in this list you
may get better performance by setting this value to a certain percentage
of the point count.
Since: 5.0

Rhino.Display.DisplayBitmapDrawList.SortAngleTolerance
Angle in radians used to determine if an index list is "parallel enough"
to a viewports camera angle. Default is 0.0873 radians (5 degrees)
Since: 5.0

Rhino.Display.DisplayBitmapDrawList.Sort(Rhino.Geometry.Vector3d)
Since: 5.0

Rhino.Display.DisplayBitmapDrawList.SetPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Since: 5.0

Rhino.Display.DisplayBitmapDrawList.SetPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Drawing.Color)
Since: 5.0

Rhino.Display.DisplayBitmapDrawList.SetPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{System.Drawing.Color})
Since: 5.0