Rhino.FileIO.FilePdfReadOptions
Options for reading a PDF file

Rhino.FileIO.FilePdfReadOptions.PreserveModelScale
Since: 8.0

Rhino.FileIO.FilePdfReadOptions.RhinoScale
Since: 8.0

Rhino.FileIO.FilePdfReadOptions.PdfUnits
Since: 8.0

Rhino.FileIO.FilePdfReadOptions.PDFScale
Since: 8.0

Rhino.FileIO.FilePdfReadOptions.ImportFillsAsHatches
Since: 8.0

Rhino.FileIO.FilePdfReadOptions.LoadText
Since: 8.0

Rhino.FileIO.FilePdfReadOptions.ToDictionary
Since: 8.0