Rhino.Geometry.LengthMassProperties
Contains static initialization methods and allows access to the computed
metrics of length, length centroid, and length moments in curves.

Rhino.Geometry.LengthMassProperties.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Geometry.LengthMassProperties.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0

Rhino.Geometry.LengthMassProperties.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.Geometry.LengthMassProperties.Compute(Rhino.Geometry.Curve)
Calculates the length mass properties of a curve.
curve: The curve to measure.
Returns: The LengthMassProperties for the given curve, or null on failure.
Since: 7.6

Rhino.Geometry.LengthMassProperties.Compute(Rhino.Geometry.Curve,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Calculates the length mass properties of a curve.
curve: The curve to measure.
length: true to calculate length.
firstMoments: true to calculate length first moments, length, and length centroid.
secondMoments: true to calculate length second moments.
productMoments: true to calculate length product moments.
Returns: The LengthMassProperties for the given curve, or null on failure.
Since: 7.6

Rhino.Geometry.LengthMassProperties.Compute(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})
Calculates the length mass properties of an enumeration of curves.
curves:
Returns: The LengthMassProperties for the given enumeration of curves, or null on failure.
Since: 7.6

Rhino.Geometry.LengthMassProperties.Compute(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Calculates the length mass properties of an enumeration of curves.
curves: An enumeration of curves.
length: true to calculate length.
firstMoments: true to calculate length first moments, length, and length centroid.
secondMoments: true to calculate length second moments.
productMoments: true to calculate length product moments.
Returns: The LengthMassProperties for the given enumeration of curves, or null on failure.
Since: 7.6

Rhino.Geometry.LengthMassProperties.Length
Gets the length solution.
Since: 7.6

Rhino.Geometry.LengthMassProperties.LengthError
Gets the uncertainty in the length calculation.
Since: 7.6

Rhino.Geometry.LengthMassProperties.Centroid
Gets the length centroid in the world coordinate system.
Since: 7.6

Rhino.Geometry.LengthMassProperties.CentroidError
Gets the uncertainty in the centroid calculation.
Since: 7.6

Rhino.Geometry.LengthMassProperties.WorldCoordinatesFirstMoments
Returns the world coordinate first moments if they were able to be calculated.
X is integral of "x dm" over the length
Y is integral of "y dm" over the length
Z is integral of "z dm" over the length.
Since: 7.6

Rhino.Geometry.LengthMassProperties.WorldCoordinatesFirstMomentsError
Uncertainty in world coordinates first moments calculation.
Since: 7.6

Rhino.Geometry.LengthMassProperties.WorldCoordinatesSecondMoments
Returns the world coordinate second moments if they were able to be calculated.
X is integral of "xx dm" over the length
Y is integral of "yy dm" over the length
Z is integral of "zz dm" over the length.
Since: 7.6

Rhino.Geometry.LengthMassProperties.WorldCoordinatesSecondMomentsError
Uncertainty in world coordinates second moments calculation.
Since: 7.6

Rhino.Geometry.LengthMassProperties.WorldCoordinatesProductMoments
Returns the world coordinate product moments if they were able to be calculated.
X is integral of "xy dm" over the length
Y is integral of "yz dm" over the length
Z is integral of "zx dm" over the length.
Since: 7.6

Rhino.Geometry.LengthMassProperties.WorldCoordinatesProductMomentsError
Uncertainty in world coordinates second moments calculation.
Since: 7.6

Rhino.Geometry.LengthMassProperties.WorldCoordinatesMomentsOfInertia
The moments of inertia about the world coordinate axes.
X = integral of (y^2 + z^2) dm
Y = integral of (z^2 + x^2) dm
Z = integral of (z^2 + y^2) dm.
Remarks:
What is meant by "moments of inertia" varies widely in textbooks and papers.
The values returned here are the integrals listed in the Summary section.
Some applications may want the values from WorldCoordinatesSecondMoments
instead of the values returned here.
Since: 7.6

Rhino.Geometry.LengthMassProperties.WorldCoordinatesMomentsOfInertiaError
Uncertainty in world coordinates moments of inertia calculation.
Since: 7.6

Rhino.Geometry.LengthMassProperties.WorldCoordinatesRadiiOfGyration
Radii of gyration with respect to world coordinate system.
X = sqrt(integral of (y^2 + z^2) dm/M)
Y = sqrt(integral of (z^2 + x^2) dm/M)
Z = sqrt(integral of (z^2 + y^2) dm/M)
Remarks:
What is meant by "radii of gyration" varies widely in textbooks and papers.
The values returned here are the integrals listed in the Returns section.
Since: 7.6

Rhino.Geometry.LengthMassProperties.CentroidCoordinatesSecondMoments
Second moments with respect to centroid coordinate system.
X = integral of (x-x0)^2 dm
Y = integral of (y-y0)^2 dm
Z = integral of (z-z0)^2 dm
where (x0,y0,z0) = centroid.
Since: 7.6

Rhino.Geometry.LengthMassProperties.CentroidCoordinatesSecondMomentsError
Uncertainty in centroid coordinates second moments calculation.
Since: 7.6

Rhino.Geometry.LengthMassProperties.CentroidCoordinatesProductMoments
Product moments with respect to centroid coordinate system.
Since: 7.6

Rhino.Geometry.LengthMassProperties.CentroidCoordinatesProductMomentsError
Uncertainty in product moments with respect to centroid coordinate system.
Since: 7.6

Rhino.Geometry.LengthMassProperties.CentroidCoordinatesMomentsOfInertia
Moments of inertia with respect to centroid coordinate system.
X = integral of ((y-y0)^2 + (z-z0)^2) dm
Y = integral of ((z-z0)^2 + (x-x0)^2) dm
Z = integral of ((z-z0)^2 + (y-y0)^2) dm
where (x0,y0,z0) = centroid.
Remarks:
What is meant by "moments of inertia" varies widely in textbooks and papers.
The values returned here are the integrals listed in the Summary section.
Some applications may want the values from WorldCoordinatesSecondMoments
instead of the values returned here.
Since: 7.6

Rhino.Geometry.LengthMassProperties.CentroidCoordinatesMomentsOfInertiaError
Uncertainty in centroid coordinates moments of inertia calculation.
Since: 7.6

Rhino.Geometry.LengthMassProperties.CentroidCoordinatesRadiiOfGyration
Radii of gyration with respect to centroid coordinate system.
X = sqrt(integral of ((y-y0)^2 + (z-z0)^2) dm/M)
Y = sqrt(integral of ((z-z0)^2 + (x-x0)^2) dm/M)
Z = sqrt(integral of ((z-z0)^2 + (y-y0)^2) dm/M)
where (x0,y0,z0) = centroid.
Remarks:
What is meant by "radii of gyration" varies widely in textbooks and papers.
The values returned here are the integrals listed in the Returns section.
Since: 7.6

Rhino.Geometry.LengthMassProperties.WorldCoordinatesPrincipalMoments(System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@)
Calculates the eigenvalues and eigenvectors of moments matrix in world coordinates.
x: Principal moment.
xaxis: Principal axis for x.
y: Principal moment.
yaxis: Principal axis for y.
z: Principal moment.
zaxis: Principal axis for z.
Returns: true if successful.
Since: 7.6

Rhino.Geometry.LengthMassProperties.WorldCoordinatesPrincipalMomentsOfInertia(System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@)
Calculates the principal moments of inertia and principal axes with respect to world coordinates.
x: Principal moment.
xaxis: Principal axis for x.
y: Principal moment.
yaxis: Principal axis for y.
z: Principal moment.
zaxis: Principal axis for z.
Returns: true if successful.
Since: 7.6

Rhino.Geometry.LengthMassProperties.CentroidCoordinatesPrincipalMoments(System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@)
Calculates the eigenvalues and eigenvectors of the moments matrix with respect to centroid coordinates.
x: Principal moment.
xaxis: Principal axis for x.
y: Principal moment.
yaxis: Principal axis for y.
z: Principal moment.
zaxis: Principal axis for z.
Returns: true if successful.
Since: 7.6

Rhino.Geometry.LengthMassProperties.CentroidCoordinatesPrincipalMomentsOfInertia(System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@)
Calculates the principal moments of inertia and principal axes with respect to centroid coordinates.
x: Principal moment.
xaxis: Principal axis for x.
y: Principal moment.
yaxis: Principal axis for y.
z: Principal moment.
zaxis: Principal axis for z.
Returns: true if successful.
Since: 7.6