Rhino.Runtime.InteropWrappers.MeshPointDataStruct
This is only needed when passing values to the Rhino C++ core, ignore
for .NET plug-ins.

Rhino.Runtime.InteropWrappers.MeshPointDataStruct.m_et
This is only needed when passing values to the Rhino C++ core, ignore
for .NET plug-ins.

Rhino.Runtime.InteropWrappers.MeshPointDataStruct.m_ci_type
This is only needed when passing values to the Rhino C++ core, ignore
for .NET plug-ins.

Rhino.Runtime.InteropWrappers.MeshPointDataStruct.m_ci_index
This is only needed when passing values to the Rhino C++ core, ignore
for .NET plug-ins.

Rhino.Runtime.InteropWrappers.MeshPointDataStruct.m_edge_index
This is only needed when passing values to the Rhino C++ core, ignore
for .NET plug-ins.

Rhino.Runtime.InteropWrappers.MeshPointDataStruct.m_face_index
This is only needed when passing values to the Rhino C++ core, ignore
for .NET plug-ins.

Rhino.Runtime.InteropWrappers.MeshPointDataStruct.m_Triangle
This is only needed when passing values to the Rhino C++ core, ignore
for .NET plug-ins.

Rhino.Runtime.InteropWrappers.MeshPointDataStruct.m_t0
This is only needed when passing values to the Rhino C++ core, ignore
for .NET plug-ins.

Rhino.Runtime.InteropWrappers.MeshPointDataStruct.m_t1
This is only needed when passing values to the Rhino C++ core, ignore
for .NET plug-ins.

Rhino.Runtime.InteropWrappers.MeshPointDataStruct.m_t2
This is only needed when passing values to the Rhino C++ core, ignore
for .NET plug-ins.

Rhino.Runtime.InteropWrappers.MeshPointDataStruct.m_t3
This is only needed when passing values to the Rhino C++ core, ignore
for .NET plug-ins.

Rhino.Runtime.InteropWrappers.MeshPointDataStruct.m_Px
This is only needed when passing values to the Rhino C++ core, ignore
for .NET plug-ins.

Rhino.Runtime.InteropWrappers.MeshPointDataStruct.m_Py
This is only needed when passing values to the Rhino C++ core, ignore
for .NET plug-ins.

Rhino.Runtime.InteropWrappers.MeshPointDataStruct.m_Pz
This is only needed when passing values to the Rhino C++ core, ignore
for .NET plug-ins.