Rhino.DocObjects.TextureType
The TextureType controls how the pixels in the bitmap
are interpreted.
Since: 5.6

Rhino.DocObjects.TextureType.None


Rhino.DocObjects.TextureType.Bitmap
Deprecated - this should be diffuse

Rhino.DocObjects.TextureType.Diffuse
The diffuse color of the material, ideally the albedo.

Rhino.DocObjects.TextureType.Bump
bump map

Rhino.DocObjects.TextureType.Transparency
Deprecated - see Opacity.  This has always actually meant opacity in Rhino, so there is nothing to change.

Rhino.DocObjects.TextureType.Opacity
value = alpha

Rhino.DocObjects.TextureType.Emap
Emap/Environment texture

Rhino.DocObjects.TextureType.PBR_BaseColor
Physically based materials only - base color.  Re-uses diffuse texture slot.

Rhino.DocObjects.TextureType.PBR_Subsurface
Physically based materials only - subsurface (greyscale)

Rhino.DocObjects.TextureType.PBR_SubsurfaceScattering
Physically based materials only - subsurface scattering

Rhino.DocObjects.TextureType.PBR_SubsurfaceScatteringRadius
Physically based materials only - subsurface scattering radius (greyscale)

Rhino.DocObjects.TextureType.PBR_Metallic
Physically based materials only - metallic (greyscale)

Rhino.DocObjects.TextureType.PBR_Specular
Physically based materials only - specular (greyscale)

Rhino.DocObjects.TextureType.PBR_SpecularTint
Physically based materials only - specular tint (greyscale)

Rhino.DocObjects.TextureType.PBR_Roughness
Physically based materials only - roughness (greyscale)

Rhino.DocObjects.TextureType.PBR_Anisotropic
Physically based materials only - anisotropic (greyscale)

Rhino.DocObjects.TextureType.PBR_Anisotropic_Rotation
Physically based materials only - anisotropic rotation 0 = 0, 255 = 360

Rhino.DocObjects.TextureType.PBR_Sheen
Physically based materials only - sheen (greyscale)

Rhino.DocObjects.TextureType.PBR_SheenTint
Physically based materials only - sheen tint (greyscale)

Rhino.DocObjects.TextureType.PBR_Clearcoat
Physically based materials only - clearcoat (greyscale)

Rhino.DocObjects.TextureType.PBR_ClearcoatRoughness
Physically based materials only - clearcoat roughness (greyscale)

Rhino.DocObjects.TextureType.PBR_OpacityIor
Physically based materials only - ior (greyscale - remaps from 1.0 to 2.0)

Rhino.DocObjects.TextureType.PBR_OpacityRoughness
Physically based materials only - transparency roughness (greyscale)

Rhino.DocObjects.TextureType.PBR_Emission
Physically based materials only - emission (greyscale)

Rhino.DocObjects.TextureType.PBR_AmbientOcclusion
Physically based materials only - occlusion (greyscale)

Rhino.DocObjects.TextureType.PBR_Displacement
Physically based materials only - normal 8-bit RGB, alpha is ignored

Rhino.DocObjects.TextureType.PBR_ClearcoatBump
Physically based materials only - clearcoat normal  or bump (normal map, RGB)

Rhino.DocObjects.TextureType.PBR_Alpha
Physically based materials only - clearcoat normal  or bump (normal map, RGB)