Rhino.Display.PointStyle
Defines styles used for drawing points.

Rhino.Display.PointStyle.Simple
Square

Rhino.Display.PointStyle.ControlPoint
Square with white center

Rhino.Display.PointStyle.ActivePoint
Like a control point but includes vertical/horizontal crosshair lines.

Rhino.Display.PointStyle.X
X shape

Rhino.Display.PointStyle.RoundSimple
Circular

Rhino.Display.PointStyle.RoundControlPoint
Circular with white center

Rhino.Display.PointStyle.RoundActivePoint
Round control point with crosshair lines

Rhino.Display.PointStyle.Circle
Circle or ring shape when secondarySize is set

Rhino.Display.PointStyle.Square
Square or diamond shape when rotated

Rhino.Display.PointStyle.Triangle
Triangular shape

Rhino.Display.PointStyle.Heart
Heart shape

Rhino.Display.PointStyle.Chevron
Chevron shape (two directional arrows)

Rhino.Display.PointStyle.Clover
Three unioned circles

Rhino.Display.PointStyle.Tag
Tag shape

Rhino.Display.PointStyle.Asterisk
* shape

Rhino.Display.PointStyle.Pin
Map style pin symbol. secondarySize defines hole zie in pin

Rhino.Display.PointStyle.ArrowTail
Arrow shape with tail as definition point. Shape is offset from tail by secondarySize.

Rhino.Display.PointStyle.ArrowTip
Arrow shape with tip as definition point. Shape is offset from tip by secondarySize.

Rhino.Display.PointStyle.VariableDot
Solid filled, single color square

Rhino.Display.PointStyle.SolidSquare
Solid filled, single color square

Rhino.Display.PointStyle.RoundDot
Solid filled, single color circle, same as SolidRound

Rhino.Display.PointStyle.SolidRound
Solid filled, single color circle

Rhino.Display.PointStyle.SolidCircle
Solid filled, single color circle

Rhino.Display.PointStyle.None
No style (unset)