Rhino.DocObjects.ObjectType
Defines binary mask values for each object type that can be found in a document.
Since: 5.0

Rhino.DocObjects.ObjectType.None
Nothing.

Rhino.DocObjects.ObjectType.Point
A point.

Rhino.DocObjects.ObjectType.PointSet
A point set or cloud.

Rhino.DocObjects.ObjectType.Curve
A curve.

Rhino.DocObjects.ObjectType.Surface
A surface.

Rhino.DocObjects.ObjectType.Brep
A brep.

Rhino.DocObjects.ObjectType.Mesh
A mesh.

Rhino.DocObjects.ObjectType.Light
A rendering light.

Rhino.DocObjects.ObjectType.Annotation
An annotation.

Rhino.DocObjects.ObjectType.InstanceDefinition
A block definition.

Rhino.DocObjects.ObjectType.InstanceReference
A block reference.

Rhino.DocObjects.ObjectType.TextDot
A text dot.

Rhino.DocObjects.ObjectType.Grip
Selection filter value - not a real object type.

Rhino.DocObjects.ObjectType.Detail
A detail.

Rhino.DocObjects.ObjectType.Hatch
A hatch.

Rhino.DocObjects.ObjectType.MorphControl
A morph control.

Rhino.DocObjects.ObjectType.SubD
A SubD object.

Rhino.DocObjects.ObjectType.BrepLoop
A brep loop.

Rhino.DocObjects.ObjectType.BrepVertex
a brep vertex.

Rhino.DocObjects.ObjectType.PolysrfFilter
Selection filter value - not a real object type.

Rhino.DocObjects.ObjectType.EdgeFilter
Selection filter value - not a real object type.

Rhino.DocObjects.ObjectType.PolyedgeFilter
Selection filter value - not a real object type.

Rhino.DocObjects.ObjectType.MeshVertex
A mesh vertex.

Rhino.DocObjects.ObjectType.MeshEdge
A mesh edge.

Rhino.DocObjects.ObjectType.MeshFace
A mesh face.

Rhino.DocObjects.ObjectType.Cage
A cage.

Rhino.DocObjects.ObjectType.Phantom
A phantom object.

Rhino.DocObjects.ObjectType.ClipPlane
A clipping plane.

Rhino.DocObjects.ObjectType.Extrusion
An extrusion.

Rhino.DocObjects.ObjectType.AnyObject
All bits set.