Rhino.Commands.Style
Defines bitwise mask flags for different styles of commands, such as
Hidden or DoNotRepeat.
Since: 5.0

Rhino.Commands.Style.None
No flag is defined.

Rhino.Commands.Style.Hidden
Also known as a "test" command. The command name does not auto-complete
when typed on the command line an is therefore not discoverable. Useful
for writing commands that users don't normally have access to.

Rhino.Commands.Style.ScriptRunner
For commands that want to run scripts as if they were typed at the command
line (like RhinoScript's RunScript command)

Rhino.Commands.Style.Transparent
Transparent commands can be run inside of other commands.
The command does not modify the contents of the model's geometry in any way.
Examples of transparent commands include commands that change views and toggle
snap states.  Any command that adds or deletes, a view cannot be transparent.

Rhino.Commands.Style.DoNotRepeat
The command should not be repeated by pressing "ENTER" immediately after
the command finishes.

Rhino.Commands.Style.NotUndoable
By default, all commands are undo-able.

Rhino.Commands.Style.System
reserved