Rhino.UI.ShowPanelEventArgs
Panels.Show event arguments

Rhino.UI.ShowPanelEventArgs.#ctor(System.Guid,System.UInt32,System.Boolean)
Since: 6.0

Rhino.UI.ShowPanelEventArgs.Show
Will be true if showing or false if hiding
Since: 6.0