Rhino.FileIO.Nrbf.BinaryType.Primitive
The type is defined by Rhino.FileIO.Nrbf.PrimitiveType and it is not a string.

Rhino.FileIO.Nrbf.BinaryType.String
The type is a
length prefixed string.

Rhino.FileIO.Nrbf.BinaryType.Object
The type is the System.Object.

Rhino.FileIO.Nrbf.BinaryType.SystemClass
The type is a class or a struct defined in mscorlib.

Rhino.FileIO.Nrbf.BinaryType.Class
The type is a class or a struct.

Rhino.FileIO.Nrbf.BinaryType.ObjectArray
The type is a single-dimensional array of objects.

Rhino.FileIO.Nrbf.BinaryType.StringArray
The type is a single-dimensional array of strings.

Rhino.FileIO.Nrbf.BinaryType.PrimitiveArray
The type is a single-dimensional array of a primitive type.