Rhino.DocObjects.CurveObject
A Rhino Object that represents curve geometry and attributes

Rhino.DocObjects.CurveObject.CurveGeometry
Returns the underlying curve geometry.
Since: 5.0

Rhino.DocObjects.CurveObject.DuplicateCurveGeometry
Returns a copy of the underlying curve geometry.
Since: 5.0

Rhino.DocObjects.CurveObject.GetLinetypeSegments
Converts the linetype pattern of the curve into curve segments and points
based on the active Rhino viewport.
Returns: An array of curve and point objects if successful.
Since: 8.4

Rhino.DocObjects.CurveObject.GetLinetypeSegments(Rhino.Display.RhinoViewport)
Converts the linetype pattern of the curve into curve segments and points
based on the specified Rhino viewport.
viewport: The Rhino viewport used to generate the curve segments and points.
Returns: An array of curve and point objects if successful.
Since: 8.4