Rhino.FileIO.FileRaw
Support for writing Raw file format

Rhino.FileIO.FileRaw.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileRawWriteOptions)
Write a raw file based on the contents of a RhinoDoc
path: path to write a file to
doc: document to get geometry from
options: options used for generating the raw file
Returns: true on success
Since: 8.0

Rhino.FileIO.FileRaw.Read(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileRawReadOptions)
Read a raw file into a RhinoDoc
path: path to read a file from
doc: document to import geometry into
options: options used for importing the raw file
Returns: true on success
Since: 8.0