Rhino.Render.ChangeQueue.DisplayRenderSettings
ChangeQueue DisplayRenderSettings

Rhino.Render.ChangeQueue.DisplayRenderSettings.#ctor(System.IntPtr)
Construct a ChangeQueue DisplayRenderSettings
pSettings:

Rhino.Render.ChangeQueue.DisplayRenderSettings.CullBackFaces
True if backfaces should be culled
Since: 6.0

Rhino.Render.ChangeQueue.DisplayRenderSettings.ForceFlatShading
True if flat shading is forced
Since: 6.0

Rhino.Render.ChangeQueue.DisplayRenderSettings.SceneLightingOn
True if scene lighting is enabled
Since: 6.0