Rhino.PrivateMeshCommands.Operations.Utils.UnsafeUtil.Remove(System.Int32*,System.Int32*,System.Int32)
Deletes an item in place by shifting all surviving items left.
Return is NOT the same as in C++ std.
start: The first item
end: One past the last item
remove: An item to remove
Returns: Returns the number of items that were removed

Rhino.PrivateMeshCommands.Operations.Utils.UnsafeUtil.Rotate(System.Int32*,System.Int32*,System.Int32*)
Rotates the order of the elements in the range [first,last),
in such a way that the element pointed by middle becomes the new first element.
start: The first item
end: One past the last item
middle: This will be the first item

Rhino.PrivateMeshCommands.Operations.Utils.UnsafeUtil.Reverse(System.Int32*,System.Int32*)
Reverses the order of the elements in the range [first,last).
first: The first item
end: One past the last item

Rhino.PrivateMeshCommands.Operations.Utils.UnsafeUtil.Copy(System.Double*,System.Double*,System.Int32)
Copies a series of length doubles from source to destination.
This is NOT the same as std Copy, but rather similar to memcpy.
destination: The place to copy to.
source: The place to copy from.
length: Defines an amount of doubles