Rhino.DocObjects.RhinoObject
Represents an object in the document.
RhinoObjects should only ever be creatable by the RhinoDoc.

Rhino.DocObjects.RhinoObject.NonConstPointer
!!!DO NOT CALL THIS FUNCTION UNLESS YOU ARE WORKING WITH CUSTOM RHINO OBJECTS!!!
Returns: A pointer.

Rhino.DocObjects.RhinoObject.NextRuntimeSerialNumber
Gets the runtime serial number that will be assigned to
the next Rhino Object that is created.
Since: 5.0

Rhino.DocObjects.RhinoObject.FromRuntimeSerialNumber(System.UInt32)
Get a Rhino object for a unique runtime serial number
serialNumber:
Returns:
Since: 6.0

Rhino.DocObjects.RhinoObject.MeshObjects(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},Rhino.Geometry.MeshingParameters,Rhino.Geometry.Mesh[]@,Rhino.DocObjects.ObjectAttributes[]@)
Meshes Rhino objects.
rhinoObjects: The Rhino objects to mesh.
parameters: The parameters used to create the meshes.
meshes: The created meshes are appended to this array.
attributes: The object attributes that coincide with each created mesh are appended to this array.
Returns: The results of the calculation.
Since: 5.9

Rhino.DocObjects.RhinoObject.MeshObjects(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},Rhino.Geometry.MeshingParameters,Rhino.Geometry.Mesh[]@,Rhino.DocObjects.ObjectAttributes[]@,System.Boolean)
Meshes Rhino objects.
rhinoObjects: The Rhino objects to mesh.
parameters: The parameters used to create the meshes.
meshes: The created meshes are appended to this array.
attributes: The object attributes that coincide with each created mesh are appended to this array.
useWorkerThread: Set true to compute meshes in a worker thread.
Returns: The results of the calculation.
Since: 8.4

Rhino.DocObjects.RhinoObject.MeshObjects(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},Rhino.Geometry.MeshingParameters@,System.Boolean@,Rhino.Geometry.Mesh[]@,Rhino.DocObjects.ObjectAttributes[]@)
Meshes Rhino objects.
rhinoObjects: The Rhino objects to mesh.
parameters: The parameters used to create the meshes. The meshing parameters may change.
simpleDialog: true to display the simple mesh parameters dialog, false to display the detailed mesh parameters dialog.
meshes: The created meshes are appended to this array.
attributes: The object attributes that coincide with each created mesh are appended to this array.
Returns: The results of the calculation.
Since: 5.9

Rhino.DocObjects.RhinoObject.MeshObjects(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},Rhino.Geometry.MeshingParameters@,System.Int32@,Rhino.Geometry.Transform,Rhino.Geometry.Mesh[]@,Rhino.DocObjects.ObjectAttributes[]@)
Meshes Rhino objects.
rhinoObjects: The Rhino objects to mesh.
parameters: The parameters used to create the meshes. The meshing parameters may change.
uiStyle: The user interface style, where: -1 = no interface, 0 = simple dialog, 1 = details dialog, 2 = script or batch mode
xform: Transform to be used for export with origin, or Z to Y up, etc.
meshes: The created meshes are appended to this array.
attributes: The object attributes that coincide with each created mesh are appended to this array.
Returns: The results of the calculation.
Since: 6.0

Rhino.DocObjects.RhinoObject.GetRenderMeshes(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},System.Boolean,System.Boolean)
Gets the render meshes of some objects.
rhinoObjects: An array, a list, or any enumerable set of Rhino objects.
okToCreate: true if the method is allowed to instantiate new meshes if they do not exist.
returnAllObjects: true if all objects should be returned.
Returns: An array of object references.
Since: 5.0
Rhino.DocObjects.RhinoObject.RenderMeshes(Rhino.Geometry.MeshType,Rhino.DocObjects.ViewportInfo,System.Collections.Generic.List{Rhino.DocObjects.InstanceObject},Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Flags@,Rhino.PlugIns.PlugIn,Rhino.Display.DisplayPipelineAttributes)
8.0

Rhino.DocObjects.RhinoObject.GetRenderMeshesWithUpdatedTCs(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Gets the render meshes of some objects.
rhinoObjects: An array, a list, or any enumerable set of Rhino objects.
okToCreate: true if the method is allowed to instantiate new meshes if they do not exist.
returnAllObjects: true if all objects should be returned.
skipHiddenObjects: true if hidden objects should be ignored.
updateMeshTCs: true if the TCs should be updated with a texture mapping.
Returns: An array of object references.
Since: 7.3
Rhino.DocObjects.RhinoObject.RenderMeshes(Rhino.Geometry.MeshType,Rhino.DocObjects.ViewportInfo,System.Collections.Generic.List{Rhino.DocObjects.InstanceObject},Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Flags@,Rhino.PlugIns.PlugIn,Rhino.Display.DisplayPipelineAttributes)
8.0

Rhino.DocObjects.RhinoObject.GetFillSurfaces(Rhino.DocObjects.RhinoObject,Rhino.DocObjects.ClippingPlaneObject)
Return list of fill surfaces if any for object and clipping plane.
rhinoObject: Object to clip
clippingPlaneObject: Clipping plane to use
Returns:
Since: 6.7

Rhino.DocObjects.RhinoObject.GetFillSurfaces(Rhino.DocObjects.RhinoObject,System.Collections.Generic.IEnumerable{Rhino.DocObjects.ClippingPlaneObject})
Return list of fill surfaces if any for object and clipping plane. Fills are trimmed by
clipping planes that did not generate them.
rhinoObject: Object to clip
clippingPlaneObjects: Enumeration of clipping plane objects
Returns: Array of Brep containing fully trimmed fills if there were any generated.
Since: 6.7

Rhino.DocObjects.RhinoObject.GetFillSurfaces(Rhino.DocObjects.RhinoObject,System.Collections.Generic.IEnumerable{Rhino.DocObjects.ClippingPlaneObject},System.Boolean)
Return list of fill surfaces if any for object and clipping plane.
rhinoObject: Object to clip
clippingPlaneObjects: Enumeration of clipping plane objects
unclippedFills: Use true to get fills that are not trimmed by all clipping planes
Returns: Array of Brep containing fills if there were any generated, trimmed if unclippedFills was false
Since: 6.7

Rhino.DocObjects.RhinoObject.GetTightBoundingBox(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},Rhino.Geometry.BoundingBox@)
Gets a world XY-plane aligned tight bounding box from a collection of Rhino objects.
rhinoObjects: A collection of Rhino objects.
boundingBox: A tight bounding box.
Returns:
Since: 7.0

Rhino.DocObjects.RhinoObject.GetTightBoundingBox(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},Rhino.Geometry.Plane,Rhino.Geometry.BoundingBox@)
Gets a plane aligned tight bounding box from a collection of Rhino objects.
rhinoObjects: A collection of Rhino objects.
plane: A valid alignment plane.
boundingBox: A tight bounding box.
Returns:
Since: 7.0

Rhino.DocObjects.RhinoObject.ComponentType
Returns Rhino.DocObjects.ModelComponentType.ModelGeometry.
Since: 6.0

Rhino.DocObjects.RhinoObject.IsDeleted
true if the object is deleted. Deleted objects are kept by the document
for undo purposes. Call RhinoDoc.UndeleteObject to undelete an object.
Since: 5.0

Rhino.DocObjects.RhinoObject.IsReference
Gets a value indicating if an object is a reference object. An object from a work session
reference model is a reference object and cannot be modified. An object is
a reference object if, and only if, it is on a reference layer.
Since: 5.0

Rhino.DocObjects.RhinoObject.ObjectType
Gets the Rhino-based object type.
Since: 5.0

Rhino.DocObjects.RhinoObject.Document
Gets the document that owns this object.
Since: 5.0

Rhino.DocObjects.RhinoObject.Geometry
Gets the underlying geometry for this object.
All rhino objects are composed of geometry and attributes.
Since: 5.0

Rhino.DocObjects.RhinoObject.Attributes
Gets or sets the object attributes.
Since: 5.0

Rhino.DocObjects.RhinoObject.RuntimeSerialNumber
Gets the objects runtime serial number.
Since: 5.0

Rhino.DocObjects.RhinoObject.IsSolid
Returns true if object is a closed solid, otherwise false.
Since: 7.6

Rhino.DocObjects.RhinoObject.IsDeletable
Some objects cannot be deleted, like grips on lights and annotation objects.
Since: 5.0

Rhino.DocObjects.RhinoObject.IsInstanceDefinitionGeometry
true if the object is used as part of an instance definition.
Since: 5.0

Rhino.DocObjects.RhinoObject.IsNormal
An object must be in one of three modes: normal, locked or hidden.
If an object is in normal mode, then the object's layer controls visibility
and selectability. If an object is locked, then the object's layer controls
visibility by the object cannot be selected. If the object is hidden, it is
not visible and it cannot be selected.
Since: 5.0

Rhino.DocObjects.RhinoObject.IsLocked
An object must be in one of three modes: normal, locked or hidden.
If an object is in normal mode, then the object's layer controls visibility
and selectability. If an object is locked, then the object's layer controls
visibility by the object cannot be selected. If the object is hidden, it is
not visible and it cannot be selected.
Since: 5.0

Rhino.DocObjects.RhinoObject.IsHidden
An object must be in one of three modes: normal, locked or hidden.
If an object is in normal mode, then the object's layer controls visibility
and selectability. If an object is locked, then the object's layer controls
visibility by the object cannot be selected. If the object is hidden, it is
not visible and it cannot be selected.
Since: 5.0

Rhino.DocObjects.RhinoObject.WorksessionReferenceSerialNumber
Obsolete - use ReferenceModelSerialNumber
Since: 6.3

Rhino.DocObjects.RhinoObject.ReferenceModelSerialNumber
When a component is in a model for reference, this value identifies the reference model.
Remarks:
Reference components are not saved in .3dm archives.
Typically this value is set and locked by the code that adds a component to a model.
This value is not saved in .3dm archives.
Since: 6.12

Rhino.DocObjects.RhinoObject.InstanceDefinitionModelSerialNumber
When a component is in a model as part of the information required for a linked instance definition,
this value identifies the linked instance definition reference model.
Remarks:
Reference components are not saved in .3dm archives.
Typically this value is set and locked by the code that adds a component to a model.
This value is not saved in .3dm archives.
Since: 6.12

Rhino.DocObjects.RhinoObject.Visible
Gets the object visibility.
Since: 5.0

Rhino.DocObjects.RhinoObject.DuplicateGeometry
Constructs a deep (full) copy of the geometry.
Returns: A copy of the internal geometry.
Since: 5.0

Rhino.DocObjects.RhinoObject.CommitChanges
Moves changes made to this RhinoObject into the RhinoDoc.
Returns:
true if changes were made.
Since: 5.0

Rhino.DocObjects.RhinoObject.MemoryEstimate
Computes an estimate of the number of bytes that this object is using in memory.
Note that this is a runtime memory estimate and does not directly compare to the
amount of space take up by the object when saved to a file.
Returns: The estimated number of bytes this object occupies in memory.
Since: 5.0

Rhino.DocObjects.RhinoObject.Id
Every object has a Guid (globally unique identifier, also known as UUID, or universally
unique identifier). The default value is Guid.Empty.
When an object is added to a model, the value is checked.  If the value is Guid.Empty, a
new Guid is created. If the value is not null but it is already used by another object
in the model, a new Guid is created. If the value is not Guid.Empty and it is not used by
another object in the model, then that value persists. When an object is updated, by
a move for example, the value of ObjectId persists.
This value is the same as the one returned by this.Attributes.ObjectId.
Since: 5.0

Rhino.DocObjects.RhinoObject.Name
Rhino objects have optional text names.  More than one object in
a model can have the same name and some objects may have no name.
Since: 5.0

Rhino.DocObjects.RhinoObject.GroupCount
Number of groups object belongs to.
Since: 5.0

Rhino.DocObjects.RhinoObject.GetGroupList
Allocates an array of group indices of length GroupCount.
If Rhino.DocObjects.RhinoObject.GroupCount is 0, then this method returns null.
Returns: An array of group indices, or null if Rhino.DocObjects.RhinoObject.GroupCount is 0.
Since: 5.0

Rhino.DocObjects.RhinoObject.IsSelected(System.Boolean)
Check selection state.
checkSubObjects:
(false is good default)
If true and the entire object is not selected, and some subset of the object
is selected, like some edges of a surface, then 3 is returned.
If false and the entire object is not selected, then zero is returned.
Returns:
0 = object is not selected.
1 = object is selected.
2 = entire object is selected persistently.
3 = one or more proper sub-objects are selected.
Since: 5.0

Rhino.DocObjects.RhinoObject.IsSubObjectSelected(Rhino.Geometry.ComponentIndex)
Check sub-object selection state.
componentIndex: Index of sub-object to check.
Returns: true if the sub-object is selected.
Remarks: A sub-object cannot be persistently selected.
Since: 5.0

Rhino.DocObjects.RhinoObject.GetSelectedSubObjects
Get a list of all selected sub-objects.
Returns: An array of sub-object indices, or null if there are none.
Since: 5.0

Rhino.DocObjects.RhinoObject.IsSelectable(System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Reports if an object can be selected.
ignoreSelectionState:
If true, then selected objects are selectable.
If false, then selected objects are not selectable.
ignoreGripsState:
If true, then objects with grips on can be selected.
If false, then the value returned by the object's IsSelectableWithGripsOn() function decides if the object can be selected.
ignoreLayerLocking:
If true, then objects on locked layers are selectable.
If false, then objects on locked layers are not selectable.
ignoreLayerVisibility:
If true, then objects on hidden layers are selectable.
If false, then objects on hidden layers are not selectable.
Returns: true if object is capable of being selected.
Remarks:
Objects that are locked, hidden, or on locked or hidden layers
cannot be selected. If IsSelectableWithGripsOn() returns false,
then an that object is not selectable if it has grips turned on.
Since: 5.0

Rhino.DocObjects.RhinoObject.IsSelectable
Reports if an object can be selected.
Returns: true if object is capable of being selected.
Remarks:
Objects that are locked, hidden, or on locked or hidden layers
cannot be selected. If IsSelectableWithGripsOn() returns false,
then an that object is not selectable if it has grips turned on.
Since: 5.0

Rhino.DocObjects.RhinoObject.IsSubObjectSelectable(Rhino.Geometry.ComponentIndex,System.Boolean)
Reports if a sub-object can be selected.
componentIndex: index of sub-object to check.
ignoreSelectionState:
If true, then selected objects are selectable.
If false, then selected objects are not selectable.
Returns: true if the specified sub-object can be selected.
Remarks:
Objects that are locked, hidden, or on locked or hidden layers
cannot be selected. If IsSelectableWithGripsOn() returns false,
then that object is not selectable if it has grips turned on.
Since: 5.0

Rhino.DocObjects.RhinoObject.Select(System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Selects an object.
on: The new selection state; true activates selection.
syncHighlight:
If true, then the object is highlighted if it is selected
and unhighlighted if is not selected.
Highlighting can be and stay out of sync, as its specification is independent.
persistentSelect:
Objects that are persistently selected stay selected when a command terminates.
ignoreGripsState:
If true, then objects with grips on can be selected.
If false, then the value returned by the object's IsSelectableWithGripsOn() function
decides if the object can be selected when it has grips turned on.
ignoreLayerLocking:
If true, then objects on locked layers can be selected.
If false, then objects on locked layers cannot be selected.
ignoreLayerVisibility:
If true, then objects on hidden layers can be selectable.
If false, then objects on hidden layers cannot be selected.
Returns:
0: object is not selected.
1: object is selected.
2: object is selected persistently.
Remarks:
Objects that are locked, hidden, or on locked or hidden layers
cannot be selected. If IsSelectableWithGripsOn() returns false,
then an that object is not selectable if it has grips turned on.
Since: 5.0

Rhino.DocObjects.RhinoObject.Select(System.Boolean)
Selects an object.
on: The new selection state; true activates selection.
Returns:
0: object is not selected.
1: object is selected.
2: object is selected persistently.
Remarks:
Objects that are locked, hidden, or on locked or hidden layers
cannot be selected. If IsSelectableWithGripsOn() returns false,
then an that object is not selectable if it has grips turned on.
Since: 5.0

Rhino.DocObjects.RhinoObject.Select(System.Boolean,System.Boolean)
Selects an object.
on: The new selection state; true activates selection.
syncHighlight:
If true, then the object is highlighted if it is selected
and not highlighted if is not selected.
Highlighting can be and stay out of sync, as its specification is independent.
Returns:
0: object is not selected.
1: object is selected.
2: object is selected persistently.
Remarks:
Objects that are locked, hidden, or on locked or hidden layers
cannot be selected. If IsSelectableWithGripsOn() returns false,
then an that object is not selectable if it has grips turned on.
Since: 5.0

Rhino.DocObjects.RhinoObject.SelectSubObject(Rhino.Geometry.ComponentIndex,System.Boolean,System.Boolean)
Reports if an object can be selected.
componentIndex: Index of sub-object to check.
select: The new selection state; true activates selection.
syncHighlight:
(default=true)
If true, then the object is highlighted if it is selected
and unhighlighted if is not selected.
Returns:
0: object is not selected
1: object is selected
2: object is selected persistently.
Remarks:
Objects that are locked, hidden, or on locked or hidden layers
cannot be selected. If IsSelectableWithGripsOn() returns false,
then an that object is not selectable if it has grips turned on.
Since: 5.0

Rhino.DocObjects.RhinoObject.SelectSubObject(Rhino.Geometry.ComponentIndex,System.Boolean,System.Boolean,System.Boolean)
Reports if an object can be selected.
componentIndex: Index of sub-object to check.
select: The new selection state; true activates selection.
syncHighlight:
(default=true)
If true, then the object is highlighted if it is selected
and unhighlighted if is not selected.
persistentSelect: When true, selection persists even after the current command
terminates.
Returns:
0: object is not selected
1: object is selected
2: object is selected persistently.
Remarks:
Objects that are locked, hidden, or on locked or hidden layers
cannot be selected. If IsSelectableWithGripsOn() returns false,
then an that object is not selectable if it has grips turned on.
Since: 6.0

Rhino.DocObjects.RhinoObject.UnselectAllSubObjects
Removes selection from all sub-objects.
Returns: The number of unselected sub-objects.
Since: 5.0

Rhino.DocObjects.RhinoObject.IsHighlighted(System.Boolean)
Check highlight state.
checkSubObjects:
If true and the entire object is not highlighted, and some subset of the object
is highlighted, like some edges of a surface, then 3 is returned.
If false and the entire object is not highlighted, then zero is returned.
Returns:
0: object is not highlighted.
1: entire object is highlighted.
3: one or more proper sub-objects are highlighted.
Since: 5.0

Rhino.DocObjects.RhinoObject.Highlight(System.Boolean)
Modifies the highlighting of the object.
enable: true if highlighting should be enabled.
Returns: true if the object is now highlighted.
Since: 5.0

Rhino.DocObjects.RhinoObject.IsSubObjectHighlighted(Rhino.Geometry.ComponentIndex)
Determines if a sub-object is highlighted.
componentIndex: A sub-object component index.
Returns: true if the sub-object is highlighted.
Since: 5.0

Rhino.DocObjects.RhinoObject.GetHighlightedSubObjects
Gets a list of all highlighted sub-objects.
Returns: An array of all highlighted sub-objects; or null is there are none.
Since: 5.0

Rhino.DocObjects.RhinoObject.HighlightSubObject(Rhino.Geometry.ComponentIndex,System.Boolean)
Highlights a sub-object.
componentIndex: A sub-object component index.
highlight: true if the sub-object should be highlighted.
Returns: true if the sub-object is now highlighted.
Since: 5.0

Rhino.DocObjects.RhinoObject.UnhighlightAllSubObjects
Removes highlighting from all sub-objects.
Returns: The number of changed sub-objects.
Since: 5.0

Rhino.DocObjects.RhinoObject.GripsOn
Gets or sets the activation state of object default editing grips.
Since: 5.0

Rhino.DocObjects.RhinoObject.GripsSelected
true if grips are turned on and at least one is selected.
Since: 5.0

Rhino.DocObjects.RhinoObject.EnableCustomGrips(Rhino.DocObjects.Custom.CustomObjectGrips)
Turns on/off the object's editing grips.
customGrips: The custom object grips.
Returns:
true if the call succeeded.  If you attempt to add custom grips to an
object that does not support custom grips, then false is returned.
Since: 5.0

Rhino.DocObjects.RhinoObject.GetGrips
Returns grips for this object If grips are enabled. If grips are not
enabled, returns null.
Returns: An array of grip objects; or null if there are no grips.
Since: 5.0

Rhino.DocObjects.RhinoObject.EnableVisualAnalysisMode(Rhino.Display.VisualAnalysisMode,System.Boolean)
Used to turn analysis modes on and off.
mode: A visual analysis mode.
enable: true if the mode should be activated; false otherwise.
Returns: true if this object supports the analysis mode.
Since: 5.0

Rhino.DocObjects.RhinoObject.InVisualAnalysisMode
Reports if any visual analysis mode is currently active for an object.
Returns: true if an analysis mode is active; otherwise false.
Since: 5.0

Rhino.DocObjects.RhinoObject.InVisualAnalysisMode(Rhino.Display.VisualAnalysisMode)
Reports if a visual analysis mode is currently active for an object.
mode:
The mode to check for.
Use null if you want to see if any mode is active.
Returns: true if the specified analysis mode is active; otherwise false.
Since: 5.0

Rhino.DocObjects.RhinoObject.GetActiveVisualAnalysisModes
Gets a list of currently enabled analysis modes for this object.
Returns: An array of visual analysis modes. The array can be empty, but not null.
Since: 5.0

Rhino.DocObjects.RhinoObject.ShortDescription(System.Boolean)
Gets a localized short descriptive name of the object.
plural: true if the descriptive name should in plural.
Returns: A string with the short localized descriptive name.
Since: 5.0

Rhino.DocObjects.RhinoObject.ShortDescriptionWithClosedStatus(System.Boolean,System.Boolean,System.Int32@)
Gets a localized short descriptive name of the object, along with it's open/closed status.
prepend: true if "open" or "closed" should be prepended to the descriptive name.
plural: true if the descriptive name should in plural.
status: The open/closed status, where: 0 = undefined, 1 = open, 2 = closed.
Returns: A string with the short localized descriptive name.
Since: 8.0

Rhino.DocObjects.RhinoObject.Description(Rhino.FileIO.TextLog)
Get a brief description of a object, including it's attributes and geometry.
textLog: A text log for collecting the description.
Since: 6.0

Rhino.DocObjects.RhinoObject.IsPictureFrame
Returns true if the object is a picture frame.
A picture frame object is an object that displays a texture map in all views.
Since: 7.9

Rhino.DocObjects.RhinoObject.IsMeshable(Rhino.Geometry.MeshType)
Returns true if the object is capable of having a mesh of the specified type
meshType:
Returns:
Since: 5.0

Rhino.DocObjects.RhinoObject.SetRenderMeshParameters(Rhino.Geometry.MeshingParameters)
Sets the per-object meshing parameters for this object.
When set, this object will use these meshing parameters when generating a render mesh,
instead of those provided by the document.
mp:
The per-object meshing parameters.
Note: if null, then the per-object meshing parameters will be removed, and this object will
revert to using the meshing parameters provided by the document.
Returns: True if successful, false otherwise.
Since: 7.0

Rhino.DocObjects.RhinoObject.GetRenderMeshParameters
Returns the meshing parameters that this object uses for generating render meshes.
If this object does not have per-object meshing parameters, then the document's meshing parameters are returned.
Returns: The render meshing parameters.
Since: 5.0

Rhino.DocObjects.RhinoObject.GetRenderMeshParameters(System.Boolean)
Returns the meshing parameters that this object uses for generating render meshes.
returnDocumentParametersIfUnset:
If true, then return the per-object meshing parameters for this object.
If this object does not have per-object meshing parameters, then the document's meshing parameters are returned.
If false, then return the per-object meshing parameters for this object.
If this object does not have per-object meshing parameters, then null is returned.
Returns: The render meshing parameters if successful, null otherwise.
Since: 7.0

Rhino.DocObjects.RhinoObject.MeshCount(Rhino.Geometry.MeshType,Rhino.Geometry.MeshingParameters)
RhinoObjects can have several different types of meshes and
different numbers of meshes.  A b-rep can have a render and
an analysis mesh on each face.  A mesh object has a single
render mesh and no analysis mesh. Curve, point, and annotation
objects have no meshes.
meshType: type of mesh to count
parameters:
if not null and if the object can change its mesh (like a brep),
then only meshes that were created with these mesh parameters are counted.
Returns: number of meshes
Since: 5.0

Rhino.DocObjects.RhinoObject.CreateMeshes(Rhino.Geometry.MeshType,Rhino.Geometry.MeshingParameters,System.Boolean)
Create meshes used to render and analyze surface and polysurface objects.
meshType: type of meshes to create
parameters:
in parameters that control the quality of the meshes that are created
ignoreCustomParameters:
Default should be false. Should the object ignore any custom meshing
parameters on the object's attributes
Returns: number of meshes created
Since: 5.0

Rhino.DocObjects.RhinoObject.GetMeshes(Rhino.Geometry.MeshType)
Get existing meshes used to render and analyze surface and polysurface objects.
meshType:
Returns: An array of meshes.
Since: 5.0

Rhino.DocObjects.RhinoObject.TryGetGumballFrame(Rhino.UI.Gumball.GumballFrame@)
If a Rhino object has been manipulated by Rhino's gumball, and the gumball is not in its default position,
then the object's repositioned gumball frame is returned.
frame: The gumball frame.
Returns: true if the object has a gumball frame, otherwise false.
Since: 7.0

Rhino.DocObjects.RhinoObject.ObjectFrame
Since: 8.0

Rhino.DocObjects.RhinoObject.ObjectFrame(Rhino.DocObjects.RhinoObject.ObjectFrameFlags)
Since: 8.0

Rhino.DocObjects.RhinoObject.SetObjectFrame(Rhino.Geometry.Transform)
Since: 8.0

Rhino.DocObjects.RhinoObject.SetObjectFrame(Rhino.Geometry.Plane)
Since: 8.0

Rhino.DocObjects.RhinoObject.SupportsRenderPrimitiveList(Rhino.DocObjects.ViewportInfo,System.Boolean)
Determines if custom render meshes will be built for a particular object.
viewport: The viewport being rendered.
preview:
Type of mesh to build. If attributes is non-null then a smaller mesh may be
generated in less time, false is meant when actually rendering.
Returns:
Returns true if custom render mesh(es) will get built for this object.
Since: 5.7
6.0

Rhino.DocObjects.RhinoObject.SupportsRenderPrimitiveList(Rhino.DocObjects.ViewportInfo,Rhino.Display.DisplayPipelineAttributes)
Determines if custom render meshes will be built for a particular object.
viewport: The viewport being rendered.
attrs:
Type of mesh to build. If attributes is non-null then a smaller mesh may be
generated in less time, false is meant when actually rendering.
Returns:
Returns true if custom render mesh(es) will get built for this object.
Since: 6.0
8.0

Rhino.DocObjects.RhinoObject.GetRenderPrimitiveList(Rhino.DocObjects.ViewportInfo,System.Boolean)
Build custom render mesh(es) for this object.
viewport: The viewport being rendered.
preview:
Type of mesh to build, if preview is true then a smaller mesh may be
generated in less time, false is meant when actually rendering.
Returns:
Returns a RenderPrimitiveList if successful otherwise returns null.
Since: 5.7
6.0

Rhino.DocObjects.RhinoObject.GetRenderPrimitiveList(Rhino.DocObjects.ViewportInfo,Rhino.Display.DisplayPipelineAttributes)
Build custom render mesh(es) for this object.
viewport: The viewport being rendered.
attrs:
Attributes for the view mode you are supplying meshes for.  Will be null if this is a modal rendering.
Returns:
Returns a RenderPrimitiveList if successful otherwise returns null.
Since: 6.0
8.0

Rhino.DocObjects.RhinoObject.HasCustomRenderMeshes(Rhino.Geometry.MeshType,Rhino.DocObjects.ViewportInfo,Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Flags@,Rhino.PlugIns.PlugIn,Rhino.Display.DisplayPipelineAttributes)
Returns true if the object will has a set of custom render primitives - ie, CustomRenderMeshes will return non-null.
mt: The mesh type requested (render or analysis).
vp: The viewport being rendered.
flags: See MeshProvider.Flags
plugin: The requesting plug-in (typically the calling plugin)
attrs: Display attributes for the caller - null if this is a full rendering.
Returns: Returns true if the object will has a set of custom render primitives
/// Rhino.DocObjects.RhinoObject.RenderMeshes(Rhino.Geometry.MeshType,Rhino.DocObjects.ViewportInfo,System.Collections.Generic.List{Rhino.DocObjects.InstanceObject},Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Flags@,Rhino.PlugIns.PlugIn,Rhino.Display.DisplayPipelineAttributes)
Since: 8.0

Rhino.DocObjects.RhinoObject.RenderMeshes(Rhino.Geometry.MeshType,Rhino.DocObjects.ViewportInfo,System.Collections.Generic.List{Rhino.DocObjects.InstanceObject},Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Flags@,Rhino.PlugIns.PlugIn,Rhino.Display.DisplayPipelineAttributes)
Returns a set of custom render primitives for this object.
mt: The mesh type requested (render or analysis).
vp: The viewport being rendered
ancestry: The ancestry tree - only used for by-parent object properties assignments.
flags: See MeshProvider.Flags
plugin: The requesting plug-in (typically the calling plugin)
attrs: Display attributes for the caller - null if this is a full rendering.
Returns:  Returns a set of custom render primitives for this object
Rhino.DocObjects.RhinoObject.HasCustomRenderMeshes(Rhino.Geometry.MeshType,Rhino.DocObjects.ViewportInfo,Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Flags@,Rhino.PlugIns.PlugIn,Rhino.Display.DisplayPipelineAttributes)
Since: 8.0

Rhino.DocObjects.RhinoObject.CustomRenderMeshesBoundingBox(Rhino.Geometry.MeshType,Rhino.DocObjects.ViewportInfo,Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Flags@,Rhino.PlugIns.PlugIn,Rhino.Display.DisplayPipelineAttributes,Rhino.Geometry.BoundingBox@)
Returns the bounding box of custom render primitives for this object .
mt: The mesh type requested (render or analysis).
vp: The viewport being rendered
flags: See MeshProvider.Flags
plugin: The requesting plug-in (typically the calling plugin)
attrs: Display attributes for the caller - null if this is a full rendering.
boundingBox: The requested bounding box
Returns: True if the process was a success
Since: 8.0

Rhino.DocObjects.RhinoObject.TryGetRenderPrimitiveBoundingBox(Rhino.DocObjects.ViewportInfo,System.Boolean,Rhino.Geometry.BoundingBox@)
Get the bounding box for the custom render meshes associated with this
object.
viewport: The viewport being rendered.
preview:
Type of mesh to build, if preview is true then a smaller mesh may be
generated in less time, false is meant when actually rendering.
boundingBox:
This will be set to BoundingBox.Unset on failure otherwise it will be
the bounding box for the custom render meshes associated with this
object.
Returns:
Returns true if the bounding box was successfully calculated otherwise
returns false on error.
Since: 5.7
6.0

Rhino.DocObjects.RhinoObject.TryGetRenderPrimitiveBoundingBox(Rhino.DocObjects.ViewportInfo,Rhino.Display.DisplayPipelineAttributes,Rhino.Geometry.BoundingBox@)
Get the bounding box for the custom render meshes associated with this
object.
viewport: The viewport being rendered.
attrs:
Attributes for the view mode you are supplying meshes for.  Will be null if this is a modal rendering.
boundingBox:
This will be set to BoundingBox.Unset on failure otherwise it will be
the bounding box for the custom render meshes associated with this
object.
Returns:
Returns true if the bounding box was successfully calculated otherwise
returns false on error.
Since: 6.0
8.0

Rhino.DocObjects.RhinoObject.GetSubObjects
Explodes the object into sub-objects. It is up to the caller to add the returned objects to the document.
Returns: An array of Rhino objects, or null if this object cannot be exploded.
Since: 5.0

Rhino.DocObjects.RhinoObject.HasDynamicTransform
True if the object has a dynamic transformation
Since: 5.0

Rhino.DocObjects.RhinoObject.GetDynamicTransform(Rhino.Geometry.Transform@)
While an object is being dynamically transformed (dragged, rotated, ...),
the current transformation can be retrieved and used for creating
dynamic display.
transform:
Returns:
True if the object is being edited and its transformation
is available.  False if the object is not being edited,
in which case the identity transform is returned.
Since: 5.0

Rhino.DocObjects.RhinoObject.GetTextureMapping(System.Int32)
channel:
Returns:
Since: 5.7

Rhino.DocObjects.RhinoObject.GetTextureMapping(System.Int32,Rhino.Geometry.Transform@)
Get objects texture mapping
channel:
objectTransform:
Returns:
Since: 5.7

Rhino.DocObjects.RhinoObject.SetTextureMapping(System.Int32,Rhino.Render.TextureMapping)
channel:
tm:
Returns:
Since: 6.0

Rhino.DocObjects.RhinoObject.SetTextureMapping(System.Int32,Rhino.Render.TextureMapping,Rhino.Geometry.Transform)
Sets texture mapping and mapping object transform for a channel
channel:
tm: The TextureMapping to set into this channel, or null to remove a texture mapping from a channel.
objectTransform: Mapping channel object transform
Returns:
Since: 6.26

Rhino.DocObjects.RhinoObject.HasTextureMapping
Returns true if this object has a texture mapping form any source (pluginId)
Returns:
Since: 6.0

Rhino.DocObjects.RhinoObject.GetTextureChannels
Get a list of the texture mapping channel Id's associated with object.
Returns:
Returns an array of channel Id's or an empty list if there are not mappings.
Since: 5.7

Rhino.DocObjects.RhinoObject.RenderMaterial
Gets the render material associated with this object or null if there
is none.  This does not pay attention to the material source and will
not check parent objects or layers for a RenderMaterial.
Since: 5.7

Rhino.DocObjects.RhinoObject.GetRenderMaterial(System.Boolean)
Gets the RenderMaterial that this object uses based on it's attributes
and the document that the object is associated with. If there is no
RenderMaterial associated with this object then null is returned.  If
null is returned you should call GetMaterial to get the material used
to render this object.
frontMaterial:
If true, gets the material used to render the object's front side
otherwise; gets the material used to render the back side of the
object.
Returns:
If there is a RenderMaterial associated with this objects' associated
Material then it is returned otherwise; null is returned.
Since: 5.10

Rhino.DocObjects.RhinoObject.GetRenderMaterial(Rhino.Geometry.ComponentIndex,System.Guid,Rhino.DocObjects.ObjectAttributes)
Gets the RenderMaterial associated with this object if there is one. If
there is no RenderMaterial associated with this object then null is
returned.  If null is returned you should call GetMaterial to get the
material used to render this object.
componentIndex:
Returns the RenderMaterial associated with the specified sub object or
the objects top level material if it is set to
Rhino.Geometry.ComponentIndex.Unset
plugInId:
The plug-in specific material to look for.
attributes:
Optional object attributes used to determine the material source, if
null the objects attributes are used.
Returns:
Returns the Rhino.DocObjects.RhinoObject.RenderMaterial associated with the sub object
identified by componentIndex if the component index is set to
Rhino.Geometry.ComponentIndex.Unset then the top level
RenderMaterail is returned.  If this method returns null it means there
is no RenderMaterial associated with the object or  sub object so you
should may GetMaterial get the objects generic material.
Since: 6.0

Rhino.DocObjects.RhinoObject.GetRenderMaterial(Rhino.Geometry.ComponentIndex,System.Guid)
Gets the RenderMaterial associated with this object if there is one. If
there is no RenderMaterial associated with this object then null is
returned.  If null is returned you should call GetMaterial to get the
material used to render this object.
componentIndex:
Returns the RenderMaterial associated with the specified sub object or
the objects top level material if it is set to
Rhino.Geometry.ComponentIndex.Unset
plugInId:
The plug-in specific material to look for.
Returns:
Returns the Rhino.DocObjects.RhinoObject.RenderMaterial associated with the sub object
identified by componentIndex if the component index is set to
Rhino.Geometry.ComponentIndex.Unset then the top level
RenderMaterail is returned.  If this method returns null it means there
is no RenderMaterial associated with the object or sub object so you
should may GetMaterial get the objects generic material.
Since: 6.0

Rhino.DocObjects.RhinoObject.GetRenderMaterial(Rhino.Geometry.ComponentIndex)
Gets the RenderMaterial associated with this object if there is one. If
there is no RenderMaterial associated with this object then null is
returned.  If null is returned you should call GetMaterial to get the
material used to render this object.
componentIndex:
Returns the RenderMaterial associated with the specified sub object or
the objects top level material if it is set to ComponentIndex.Unset
Returns:
Returns the Rhino.DocObjects.RhinoObject.RenderMaterial associated with the sub object
identified by componentIndex if the component index is set to
Rhino.Geometry.ComponentIndex.Unset then the top level
RenderMaterail is returned.  If this method returns null it means there
is no RenderMaterial associated with the object or  sub object so you
should may GetMaterial get the objects generic material.
Since: 6.0

Rhino.DocObjects.RhinoObject.HasSubobjectMaterials
Will be true if the object contains sub object meshes with materials
that are different than the top level object.
Since: 6.0

Rhino.DocObjects.RhinoObject.SubobjectMaterialComponents
Since: 6.0

Rhino.DocObjects.RhinoObject.GetMaterial(System.Boolean)
Gets material that this object uses based on it's attributes and the document
that the object is associated with.  In the rare case that a document is not
associated with this object, null will be returned.
frontMaterial:
If true, gets the material used to render the object's front side
Returns:
Since: 5.0

Rhino.DocObjects.RhinoObject.GetMaterial(Rhino.Geometry.ComponentIndex,System.Guid,Rhino.DocObjects.ObjectAttributes)
Get the Material associated with the sub object
identified by componentIndex if the component index is
set to ComponentIndex.Unset then the top level material
is returned.
componentIndex:
Returns the material associated with the specified sub object or the
objects top level material if it is set to ComponentIndex.Unset
plugInId:
The plug-in specific material to look for.
attributes:
Optional object attributes used to determine the material source, if
null the objects attributes are used.
Returns:
Returns the Material associated with the sub object
identified by componentIndex if the component index is set to
ComponentIndex.Unset then the top level material is returned.
Since: 6.0

Rhino.DocObjects.RhinoObject.GetMaterial(Rhino.Geometry.ComponentIndex,System.Guid)
Get the Material associated with the sub object
identified by componentIndex if the component index is
set to ComponentIndex.Unset
then the top level material is returned.
componentIndex:
Returns the material associated with the specified sub object or the
objects top level material if it is set to ComponentIndex.Unset
plugInId:
The plug-in specific material to look for.
Returns:
Returns the Material associated with the sub object
identified by componentIndex if the component index is set to
ComponentIndex.Unset
then the top level material is returned.
Since: 6.0

Rhino.DocObjects.RhinoObject.GetMaterial(Rhino.Geometry.ComponentIndex)
Get the Material associated with the sub object
identified by componentIndex if the component index is
set to ComponentIndex.Unset
then the top level material is returned.
componentIndex:
Returns the material associated with the specified sub object or the
objects top level material if it is set to ComponentIndex.Unset
Returns:
Returns the Material associated with the sub object
identified by componentIndex if the component index is
set to ComponentIndex.Unset then the top level material
is returned.
Since: 6.0

Rhino.DocObjects.RhinoObject.GetCustomRenderMeshParameter(System.Guid,System.String)
Query the object for the value of a given named custom render mesh parameter.
providerId: Id of the custom render mesh provider
parameterName: Name of the parameter
Returns: IConvertible. Note that you can't directly cast from object, instead you have to use the Convert mechanism.
Since: 6.0

Rhino.DocObjects.RhinoObject.SetCustomRenderMeshParameter(System.Guid,System.String,System.Object)
Set the named custom render mesh parameter value for this object.
providerId: Id of the custom render mesh provider
parameterName:
value:
Returns:
Since: 6.0

Rhino.DocObjects.RhinoObject.OnDraw(Rhino.Display.DrawEventArgs)
Called when Rhino wants to draw this object
e:

Rhino.DocObjects.RhinoObject.GetBoundingBox(Rhino.Display.RhinoViewport)
Called when Rhino wants the bounding box of this object. Viewpoert can be null.
This is the default base class version that will go through to the C++ base class if it is called from the custom object
viewport: For objects like labels or lights, the viewport in which
the bounding box should be calculated. Otherwise null.
Returns: The bounding box.

Rhino.DocObjects.RhinoObject.GetTightBoundingBox(Rhino.Geometry.BoundingBox@,System.Boolean,Rhino.Geometry.Transform)
Get tight bounding box of this Rhino object. The Rhino object is not modified.
tightBox: Beginning and resulting tight box
growBox: If true and the input tight_bbox is valid, then returned tight_bbox is the union of the input tight_bbox and the tight bounding box of this Rhino object.
xform:  If useXform==true, the tight bounding box of the transformed Rhino object is calculated.
Returns: true if the returned tight_bbox is set to a valid bounding box.

Rhino.DocObjects.RhinoObject.OnDuplicate(Rhino.DocObjects.RhinoObject)
Called when this a new instance of this object is created and copied from
an existing object
source:

Rhino.DocObjects.RhinoObject.OnDeleteFromDocument(Rhino.RhinoDoc)
This call informs an object it is about to be deleted.
Some objects, like clipping planes, need to do a little extra cleanup
before they are deleted.
doc:

Rhino.DocObjects.RhinoObject.OnAddToDocument(Rhino.RhinoDoc)
This call informs an object it is about to be added to the list of
active objects in the document.
doc:

Rhino.DocObjects.RhinoObject.IsActiveInViewport(Rhino.Display.RhinoViewport)
Determine if this object is active in a particular viewport.
viewport:
Remarks:
The default implementation tests for space and viewport id. This
handles things like testing if a page space object is visible in a
modeling view.
Returns: True if the object is active in viewport
Since: 5.0

Rhino.DocObjects.RhinoObject.OnPick(Rhino.Input.Custom.PickContext)
Called to determine if this object or some sub-portion of this object should be
picked given a pick context.
context:

Rhino.DocObjects.RhinoObject.OnPicked(Rhino.Input.Custom.PickContext,System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjRef})
Called when this object has been picked
context:
pickedItems:
Items that were picked. This parameter is enumerable because there may
have been multiple sub-objects picked

Rhino.DocObjects.RhinoObject.OnSelectionChanged
Called when the selection state of this object has changed

Rhino.DocObjects.RhinoObject.OnTransform(Rhino.Geometry.Transform)
Called when a transformation has been applied to the geometry
transform:

Rhino.DocObjects.RhinoObject.OnSpaceMorph(Rhino.Geometry.SpaceMorph)
Called when a space morph has been applied to the geometry.
Currently this only works for CustomMeshObject instances
morph:

Rhino.DocObjects.RhinoObject.SetCopyHistoryOnReplace(System.Boolean)
If this object has a history record, the CopyOnReplace field is set
When an object is replaced in a document and the old object has a history record with
this field set, the history record is copied and attached to the new object.
That allows a descendant object to continue the history linkage after
it is edited.
bCopy:
Since: 7.1

Rhino.DocObjects.RhinoObject.CopyHistoryOnReplace
Gets the setting of the CopyOnReplace field in this object's history
Returns:
true if this object has history and the field is set
false otherwise
Since: 7.1

Rhino.DocObjects.RhinoObject.HasHistoryRecord
Returns whether this object has a history record
Returns:
Since: 7.1

Rhino.DocObjects.RhinoObject.SetHistory(Rhino.DocObjects.HistoryRecord)
For expert use only.
Sets the history record that describes how this object was created.
This information is used to update this object when Rhino history is enabled and an input object changes.
history: The history record.
Returns: true if successful, otherwise false.
Since: 8.0

Rhino.DocObjects.RhinoObject.HistoryParents
Gets the ids of the parent Rhino objects of this object.
Returns: An array of Rhino object ids if successful, an empty array if the object has no parents or on error.
Since: 8.13

Rhino.DocObjects.RhinoObject.HistoryChildren
Gets the ids of the child Rhino objects of this object.
Returns: An array of Rhino object ids if successful, an empty array if the object has no children or on error.
Since: 8.13