Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.GetGridMetrics(System.Int32@,System.Int32@,System.Int32@,System.Int32@)
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.GetStatisticsHeaderHeight
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.UUID
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.Clear
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.Add(Rhino.UI.Controls.ThumbnailUI.Thumbnail)
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.Get(System.Guid@)
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.Mode
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.SetMode(Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList_Modes,System.Boolean)
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.Shape
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.GetSize
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.SetClientText(System.String)
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.SetCustomBitmapSize(System.Int32,System.Int32)
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.ShowLabels
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList.SetShowLabels(System.Boolean)
Since: 6.0
6.6