Rhino.Render.RenderContentChangedEventArgs
EventArgs for the RenderContentChanged event

Rhino.Render.RenderContentChangedEventArgs.ChangeContext
Since: 5.7

Rhino.Render.RenderContentChangedEventArgs.OldContent
Since: 6.0