Rhino.UI.NamedColorList
A list of color name/value pairs.

Rhino.UI.NamedColorList.Name
The name of the color list, which may be displayed to the user.
Since: 7.0

Rhino.UI.NamedColorList.#ctor(System.String)
Initializes a new instance of the ColorList with the specified name.
name: Name of the list (required)
Since: 7.0

Rhino.UI.NamedColorList.#ctor(System.String,System.Collections.Generic.IEnumerable{Rhino.UI.NamedColor})
Initializes a new instance of the ColorList with the specified name and entries.
name: Name of the list (required)
entries: Initial set of color entries for the list
Since: 7.0

Rhino.UI.NamedColorList.Default
Get the Rhino applications named color list.
Since: 7.0

Rhino.UI.NamedColorList.FromNamedParametersEventArgs(System.String,Rhino.Runtime.NamedParametersEventArgs)
Extract a color list from the specified NamedParametersEventArgs.
listName:
args:
Returns:

Rhino.UI.NamedColorList.ToNamedParametersEventArgs
Internal helper to convert the named color list to a argument list which can
be passed to a unmanaged function.
Returns: