Rhino.DocObjects.Tables.StringTable
Collection of document user data strings

Rhino.DocObjects.Tables.StringTable.Document
Document that owns this object table.
Since: 5.0

Rhino.DocObjects.Tables.StringTable.Count
The number of user data strings in the current document.
Since: 5.0

Rhino.DocObjects.Tables.StringTable.DocumentDataCount
Since: 6.0

Rhino.DocObjects.Tables.StringTable.DocumentUserTextCount
Since: 6.0

Rhino.DocObjects.Tables.StringTable.GetKey(System.Int32)
Since: 5.0

Rhino.DocObjects.Tables.StringTable.GetValue(System.Int32)
Since: 5.0

Rhino.DocObjects.Tables.StringTable.GetValue(System.String)
Since: 5.0

Rhino.DocObjects.Tables.StringTable.GetValue(System.String,System.String)
Gets a user data string from the document.
section: The section at which to get the value.
entry: The entry to search for.
Returns: The user data.
Since: 5.0

Rhino.DocObjects.Tables.StringTable.GetSectionNames
Returns a list of all the section names for user data strings in the document.
By default a section name is a key that is prefixed with a string separated by a backslash.
Returns: An array of section names. This can be empty, but not null.
Since: 5.0

Rhino.DocObjects.Tables.StringTable.GetEntryNames(System.String)
Return list of all entry names for a given section of user data strings in the document.
section: The section from which to retrieve section names.
Returns: An array of section names. This can be empty, but not null.
Since: 5.0

Rhino.DocObjects.Tables.StringTable.SetString(System.String,System.String,System.String)
Adds or sets a user data string to the document.
section: The section.
entry: The entry name.
value: The entry value.
Returns:
The previous value if successful and a previous value existed.
Since: 5.0

Rhino.DocObjects.Tables.StringTable.SetString(System.String,System.String)
Adds or sets a user data string to the document.
key: The key.
value: The entry value.
Returns:
The previous value if successful and a previous value existed.
Since: 5.0

Rhino.DocObjects.Tables.StringTable.Delete(System.String,System.String)
Removes user data strings from the document.
section: name of section to delete. If null, all sections will be deleted.
entry: name of entry to delete. If null, all entries will be deleted for a given section.
Since: 5.0

Rhino.DocObjects.Tables.StringTable.Delete(System.String)
Since: 5.0