Rhino.Geometry.BrepRegionFaceSide
Represents a side of a Rhino.Geometry.BrepRegion entity.

Rhino.Geometry.BrepRegionFaceSide.Brep
The brep this side belongs to.
Since: 5.0

Rhino.Geometry.BrepRegionFaceSide.Region
The region this side belongs to.
Since: 5.0

Rhino.Geometry.BrepRegionFaceSide.SurfaceNormalPointsIntoRegion
Gets true if BrepFace's surface normal points into region; false otherwise.
Since: 5.0

Rhino.Geometry.BrepRegionFaceSide.Face
Gets the face this side belongs to.
Since: 5.0

Rhino.Geometry.BrepRegionFaceSide.NonConstOperation
