Rhino.Render.ExtensionMethods.ToSimulatedTextureProjectionMode(Rhino.Render.TextureProjectionMode)
Since: 8.15

Rhino.Render.ExtensionMethods.ToTextureProjectionMode(Rhino.Render.SimulatedTexture.ProjectionModes)
Since: 8.15

Rhino.Render.ExtensionMethods.ToEnvironmentMappingMode(Rhino.Render.SimulatedTexture.EnvironmentMappingModes)
Since: 8.15

Rhino.Render.ExtensionMethods.ToSimulatedEnvironmentMappingMode(Rhino.Render.TextureEnvironmentMappingMode)
Since: 8.15