Rhino.UI.PanelIds
Standard Rhino panel ids.

Rhino.UI.PanelIds.Materials
Rhino Materials panel.
Since: 5.0

Rhino.UI.PanelIds.Environment
Rhino Environment panel.
Since: 5.0

Rhino.UI.PanelIds.Texture
Rhino Texture panel.
Since: 5.3

Rhino.UI.PanelIds.LightManager
Rhino Lights panel.
Since: 5.0

Rhino.UI.PanelIds.Sun
Rhino Sun panel.
Since: 5.0

Rhino.UI.PanelIds.GroundPlane
Rhino Ground Plane panel.
Since: 5.0

Rhino.UI.PanelIds.Layers
Rhino Layer panel.
Since: 5.0

Rhino.UI.PanelIds.ObjectProperties
Rhino Object Properties panel.
Since: 5.0

Rhino.UI.PanelIds.Display
Rhino Display Properties panel.
Since: 5.0

Rhino.UI.PanelIds.ContextHelp
Rhino Context-Sensitive Help panel.
Since: 5.0

Rhino.UI.PanelIds.Notes
Rhino Notes panel.
Since: 5.9

Rhino.UI.PanelIds.Rendering
Rhino Rendering Properties panel.
Since: 6.0

Rhino.UI.PanelIds.Libraries
Rhino Render Libraries panel.
Since: 5.9

Rhino.UI.PanelIds.FileExplorer
Rhino File Explorer panel.
Since: 8.0

Rhino.UI.PanelIds.BoxEdit
Rhino BoxEdit panel.
Since: 7.20

Rhino.UI.PanelIds.Command
Command control bar Id, for internal use only, don't want to provide
way for plug-in's to hide the command control bar. This is used by
the dock site restoration code in Rhino.UI to ensure the command prompt
is visible when Rhino starts.