Rhino.Geometry.BrepFace.ShrinkDisableSide
Defines bitwise mask flags indicating what side of a surface to not shrink.
Since: 6.0

Rhino.Geometry.BrepFace.ShrinkDisableSide.ShrinkAllSides
Shrink on all four sides.

Rhino.Geometry.BrepFace.ShrinkDisableSide.DoNotShrinkWestSide
Do not shrink on the west side of domain.

Rhino.Geometry.BrepFace.ShrinkDisableSide.DoNotShrinkSouthSide
Do not shrink on the south side of domain.

Rhino.Geometry.BrepFace.ShrinkDisableSide.DoNotShrinkEastSide
Do not shrink on the east side of domain.

Rhino.Geometry.BrepFace.ShrinkDisableSide.DoNotShrinkNorthSide
Do not shrink on the north side of domain.