Rhino.Geometry.NurbsCurve
Represents a Non Uniform Rational B-Splines (NURBS) curve.

Rhino.Geometry.NurbsCurve.CreateFromLine(Rhino.Geometry.Line)
Gets a non-rational, degree 1 NURBS curve representation of the line.
Returns: Curve on success, null on failure.
Since: 5.0

Rhino.Geometry.NurbsCurve.CreateFromArc(Rhino.Geometry.Arc)
Gets a rational degree 2 NURBS curve representation
of the arc. Note that the parameterization of NURBS curve
does not match arc's transcendental parameterization.
arc:
Returns: Curve on success, null on failure.
Since: 5.0

Rhino.Geometry.NurbsCurve.MakeUniform
Changes a NURBS curve so each control point affects the curve exactly the same way.
This make the knot vectors uniform without changing the control point locations.
This will change the object shape slightly.
Returns: True if successful, false otherwise.
Since: 8.24

Rhino.Geometry.NurbsCurve.MatchToCurve(Rhino.Geometry.Curve,System.Double,System.Double,System.Double,System.Int32)
Constructs a NURBS curve with the start and end matching the start and end of targetCurve, and Greville points on targetCurve.
targetCurve: The target curve.
maxEndDistance:
If maxEndDistance dist > 0, the curve's start must be within maxEndDistance of targetCurve start.
If maxEndDistance dist > 0, the curve's end must be within maxEndDistance of targetCurve end.
maxInteriorDistance:
If maxInteriorDistance > 0, all interior Greville points of the curve must be within maxInteriorDistance of targetCurve.
matchTolerance: The matching tolerance.
maxLevel:
If maxLevel > 0, the result will be refined up to that many times, attempting to get the result within matchTolerance.
If matchTolerance <= 0, no refinement will be done.
In any case, the parameters closest points on targetCurve of the Greville points of the curve must be monotonic increasing.
Returns: Curve on success, null on failure.
Since: 8.0

Rhino.Geometry.NurbsCurve.UVNDirectionsAt(System.Double,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@)
Calculates the u, V, and N directions of a NURBS curve at a parameter similar to the method used by Rhino's MoveUVN command.
t: The evaluation parameter.
uDir: The U direction.
vDir: The V direction.
nDir: The N direction.
Returns: true if successful, false otherwise.
Since: 7.0

Rhino.Geometry.NurbsCurve.MakeCompatible(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Int32,System.Int32,System.Double,System.Double)
For expert use only. From the input curves, make an array of compatible NURBS curves.
curves: The input curves.
startPt: The start point. To omit, specify Point3d.Unset.
endPt: The end point. To omit, specify Point3d.Unset.
simplifyMethod: The simplify method.
numPoints: The number of rebuild points.
refitTolerance: The refit tolerance.
angleTolerance: The angle tolerance in radians.
Returns: The output NURBS surfaces if successful.
Since: 6.0

Rhino.Geometry.NurbsCurve.CreateFromFitPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Double,System.Boolean)
Fits a NURBS curve to a dense, ordered set of points.
points: An enumeration of 3D points.
tolerance: The fitting tolerance. When in doubt, use the document's model absolute tolerance.
periodic: Set true to create a periodic curve.
Returns: A NURBS curve if successful, or null on failure.
Since: 8.0

Rhino.Geometry.NurbsCurve.CreateFromFitPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Double,System.Int32,System.Boolean,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Fits a NURBS curve to a dense, ordered set of points.
points: An enumeration of 3D points.
tolerance: The fitting tolerance. When in doubt, use the document's model absolute tolerance.
degree: The desired degree of the output curve.
periodic: Set true to create a periodic curve.
startTangent: The tangent direction at the start of the curve. If unknown, set to Rhino.Geometry.Vector3d.Unset.
endTangent: The tangent direction at the end of the curve. If unknown, set to Rhino.Geometry.Vector3d.Unset.
Returns: A NURBS curve if successful, or null on failure.
Since: 8.0

Rhino.Geometry.NurbsCurve.CreateParabolaFromVertex(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Creates a parabola from vertex and end points.
vertex: The vertex point.
startPoint: The start point.
endPoint: The end point
Returns: A 2 degree NURBS curve if successful, false otherwise.
Since: 6.0

Rhino.Geometry.NurbsCurve.CreateParabolaFromFocus(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Creates a parabola from focus and end points.
focus: The focal point.
startPoint: The start point.
endPoint: The end point
Returns: A 2 degree NURBS curve if successful, false otherwise.
Since: 6.0

Rhino.Geometry.NurbsCurve.CreateParabolaFromPoints(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Creates a parabola from three points.
startPoint: The start point.
innerPoint: A point on the curve.
endPoint: The end point
Returns: A 2 degree NURBS curve if successful, false otherwise.
Since: 8.0

Rhino.Geometry.NurbsCurve.CreateFromArc(Rhino.Geometry.Arc,System.Int32,System.Int32)
Create a uniform non-rational cubic NURBS approximation of an arc.
arc:
degree: >=1
cvCount: CV count >=5
Returns: NURBS curve approximation of an arc on success
Since: 6.0

Rhino.Geometry.NurbsCurve.CreateNonRationalArcBezier(System.Int32,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double,System.Double)
Creates a non-rational approximation of a rational arc as a single bezier segment
degree: The degree of the non-rational approximation, can be either 3, 4, or 5
center: The arc center
start: A point in the direction of the start point of the arc
end: A point in the direction of the end point of the arc
radius: The radius of the arc
tanSlider: a number between zero and one which moves the tangent control point toward the mid control point of an equivalent quadratic rational arc
midSlider: a number between zero and one which moves the mid control points toward the mid control point of an equivalent quadratic rational arc
Returns: The approximated arc.
Since: 8.0

Rhino.Geometry.NurbsCurve.CreateHSpline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Construct an H-spline from a sequence of interpolation points
points: Points to interpolate
Returns:
Since: 7.0

Rhino.Geometry.NurbsCurve.CreateHSpline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Construct an H-spline from a sequence of interpolation points and
optional start and end derivative information
points: Points to interpolate
startTangent: Unit tangent vector or Unset
endTangent: Unit tangent vector or Unset
Returns: NURBS curve approximation of an arc on success
Since: 7.0

Rhino.Geometry.NurbsCurve.CreateSubDFriendly(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Boolean,System.Boolean)
Create a NURBS curve, that is suitable for calculations like lofting SubD objects, through a sequence of curves.
points:
An enumeration of points. Adjacent points must not be equal.
If periodicClosedCurve is false, there must be at least two points.
If periodicClosedCurve is true, there must be at least three points and it is not necessary to duplicate the first and last points.
When periodicClosedCurve is true and the first and last points are equal, the duplicate last point is automatically ignored.
interpolatePoints:
True if the curve should interpolate the points. False if points specify control point locations.
In either case, the curve will begin at the first point and end at the last point.
periodicClosedCurve:
True to create a periodic closed curve. Do not duplicate the start/end point in the point input.
Returns: A SubD friendly NURBS curve is successful, null otherwise.
Since: 7.0

Rhino.Geometry.NurbsCurve.CreateSubDFriendly(Rhino.Geometry.Curve)
Create a NURBS curve, that is suitable for calculations like lofting SubD objects, from an existing curve.
curve: Curve to rebuild as a SubD friendly curve.
Returns: A SubD friendly NURBS curve is successful, null otherwise.
Since: 7.0

Rhino.Geometry.NurbsCurve.CreateSubDFriendly(Rhino.Geometry.Curve,System.Int32,System.Boolean)
Create a NURBS curve, that is suitable for calculations like lofting SubD objects, from an existing curve.
curve: Curve to rebuild as a SubD friendly curve.
pointCount:
Desired number of control points. If periodicClosedCurve is true, the number must be >= 6, otherwise the number must be >= 4.
periodicClosedCurve: True if the SubD friendly curve should be closed and periodic. False in all other cases.
Returns: A SubD friendly NURBS curve is successful, null otherwise.
Since: 7.0

Rhino.Geometry.NurbsCurve.CreatePlanarRailFrames(System.Collections.Generic.IEnumerable{System.Double},Rhino.Geometry.Vector3d)
Computes planar rail sweep frames at specified parameters.
parameters: A collection of curve parameters.
normal: Unit normal to the plane.
Returns: An array of planes if successful, or an empty array on failure.
Since: 7.0

Rhino.Geometry.NurbsCurve.CreateRailFrames(System.Collections.Generic.IEnumerable{System.Double})
Computes relatively parallel rail sweep frames at specified parameters.
parameters: A collection of curve parameters.
Returns: An array of planes if successful, or an empty array on failure.
Since: 7.0

Rhino.Geometry.NurbsCurve.CreateFromCircle(Rhino.Geometry.Circle)
Gets a rational degree 2 NURBS curve representation
of the circle. Note that the parameterization of NURBS curve
does not match circle's transcendental parameterization.
Use GetRadianFromNurbFormParameter() and
GetParameterFromRadian() to convert between the NURBS curve
parameter and the transcendental parameter.
Returns: Curve on success, null on failure.
Since: 5.0

Rhino.Geometry.NurbsCurve.CreateFromCircle(Rhino.Geometry.Circle,System.Int32,System.Int32)
Create a uniform non-rational cubic NURBS approximation of a circle.
circle:
degree: >=1
cvCount: CV count >=5
Returns: NURBS curve approximation of a circle on success
Since: 6.0

Rhino.Geometry.NurbsCurve.CreateFromEllipse(Rhino.Geometry.Ellipse)
Gets a rational degree 2 NURBS curve representation of the ellipse.
Note that the parameterization of the NURBS curve does not match
with the transcendental parameterization of the ellipsis.
Returns: A NURBS curve representation of this ellipse or null if no such representation could be made.
Since: 5.0

Rhino.Geometry.NurbsCurve.IsDuplicate(Rhino.Geometry.NurbsCurve,Rhino.Geometry.NurbsCurve,System.Boolean,System.Double)
Determines if two curves are similar.
curveA: First curve used in comparison.
curveB: Second curve used in comparison.
ignoreParameterization: if true, parameterization and orientation are ignored.
tolerance: tolerance to use when comparing control points.
Returns: true if curves are similar within tolerance.
Since: 5.0

Rhino.Geometry.NurbsCurve.Create(System.Boolean,System.Int32,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Constructs a 3D NURBS curve from a list of control points.
periodic: If true, create a periodic uniform curve. If false, create a clamped uniform curve.
degree: (>=1) degree=order-1.
points: control vertex locations.
Returns:
new NURBS curve on success
null on error.
Since: 5.0

Rhino.Geometry.NurbsCurve.#ctor(Rhino.Geometry.NurbsCurve)
Initializes a NURBS curve by copying its values from another NURBS curve.
other: The other curve. This value can be null.
Since: 5.0

Rhino.Geometry.NurbsCurve.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor for internal use.
info: Serialization data.
context: Serialization stream.

Rhino.Geometry.NurbsCurve.#ctor(System.Int32,System.Int32)
Constructs a new NURBS curve with a specific degree and control point count.
degree: Degree of curve. Must be equal to or larger than 1 and smaller than or equal to 11.
pointCount: Number of control-points.
Since: 5.0

Rhino.Geometry.NurbsCurve.#ctor(System.Int32,System.Boolean,System.Int32,System.Int32)
Constructs a new NURBS curve with knot and CV memory allocated.
dimension: >=1.
rational: true to make a rational NURBS.
order: (>= 2) The order=degree+1.
pointCount: (>= order) number of control vertices.
Since: 5.0

Rhino.Geometry.NurbsCurve.Order
Gets the order of the curve. Order = Degree + 1.
Since: 5.0

Rhino.Geometry.NurbsCurve.IsRational
Gets a value indicating whether or not the curve is rational.
Rational curves have control-points with custom weights.
Since: 5.0

Rhino.Geometry.NurbsCurve.Knots
Gets access to the knots (or "knot vector") of this NURBS curve.
Since: 5.0

Rhino.Geometry.NurbsCurve.Points
Gets access to the control points of this NURBS curve.
Since: 5.0

Rhino.Geometry.NurbsCurve.SetEndCondition(System.Boolean,Rhino.Geometry.NurbsCurve.NurbsCurveEndConditionType,Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)
Set end condition of a NURBS curve to point, tangent and curvature.
bSetEnd: true: set end of curve, false: set start of curve
continuity: Position: set start or end point, Tangency: set point and tangent, Curvature: set point, tangent and curvature
point: point to set
tangent: tangent to set
Returns: true on success, false on failure.
Since: 6.0

Rhino.Geometry.NurbsCurve.SetEndCondition(System.Boolean,Rhino.Geometry.NurbsCurve.NurbsCurveEndConditionType,Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Set end condition of a NURBS curve to point, tangent and curvature.
bSetEnd: true: set end of curve, false: set start of curve
continuity: Position: set start or end point, Tangency: set point and tangent, Curvature: set point, tangent and curvature
point: point to set
tangent: tangent to set
curvature: curvature to set
Returns: true on success, false on failure.
Since: 6.0

Rhino.Geometry.NurbsCurve.IncreaseDegree(System.Int32)
Increase the degree of this curve.
desiredDegree: The desired degree.
Degrees should be number between and including 1 and 11.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.NurbsCurve.HasBezierSpans
Returns true if the NURBS curve has Bezier spans (all distinct knots have multiplicity = degree)
Since: 5.0

Rhino.Geometry.NurbsCurve.MakePiecewiseBezier(System.Boolean)
Clamps ends and adds knots so the NURBS curve has Bezier spans
(all distinct knots have multiplicity = degree).
setEndWeightsToOne:
If true and the first or last weight is not one, then the first and
last spans are re-parameterized so that the end weights are one.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.NurbsCurve.Reparameterize(System.Double)
Use a linear fractional transformation to re-parameterize the NURBS curve.
This does not change the curve's domain.
c:
re-parameterization constant (generally speaking, c should be > 0). The
control points and knots are adjusted so that
output_nurbs(t) = input_nurbs(lambda(t)), where lambda(t) = c*t/( (c-1)*t + 1 ).
Note that lambda(0) = 0, lambda(1) = 1, lambda'(t) > 0,
lambda'(0) = c and lambda'(1) = 1/c.
Returns: true if successful.
Remarks:
The CV and knot values are values are changed so that output_nurbs(t) = input_nurbs(lambda(t)).
Since: 5.0

Rhino.Geometry.NurbsCurve.Append(Rhino.Geometry.NurbsCurve)
Appends a NURBS curve to this curve.
nurbsCurve: The NURBS curve to append.
Returns:
Since: 7.13

Rhino.Geometry.NurbsCurve.GrevilleParameter(System.Int32)
Gets the greville (edit point) parameter that belongs
to the control point at the specified index.
index: Index of Greville (Edit) point.
Since: 5.0

Rhino.Geometry.NurbsCurve.GrevillePoint(System.Int32)
Gets the Greville parameter that belongs
to the control point at the specified index.
index: Index of Greville point.
Since: 5.0

Rhino.Geometry.NurbsCurve.GrevilleParameters
Gets all Greville parameters for this curve.
Since: 5.0

Rhino.Geometry.NurbsCurve.GrevillePoints
Gets all Greville points for this curve.
Since: 5.0

Rhino.Geometry.NurbsCurve.GrevillePoints(System.Boolean)
Gets Greville points for this curve.
all: If true, then all Greville points are returns. If false, only edit points are returned.
Returns: A list of points if successful, null otherwise.
Since: 6.18

Rhino.Geometry.NurbsCurve.SetGrevillePoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Sets all Greville edit points for this curve.
points:
The new point locations. The number of points should match
the number of point returned by NurbsCurve.GrevillePoints(false).
Returns: true if successful, false otherwise.
Since: 6.4

Rhino.Geometry.NurbsCurve.EpsilonEquals(Rhino.Geometry.NurbsCurve,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:
Since: 5.4

Rhino.Geometry.NurbsCurve.ConvertSpanToBezier(System.Int32)
Converts a span of the NURBS curve into a Bezier.
spanIndex: The span index, where (0 <= spanIndex <= Points.Count - Order).
Returns: Bezier curve if successful, null otherwise.
Since: 7.25

Rhino.Geometry.NurbsCurve.CreateSpiral(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d,System.Double,System.Double,System.Double,System.Double)
Creates a C1 cubic NURBS approximation of a helix or spiral. For a helix,
you may have radius0 == radius1. For a spiral radius0 == radius1 produces
a circle. Zero and negative radii are permissible.
axisStart: Helix's axis starting point or center of spiral.
axisDir: Helix's axis vector or normal to spiral's plane.
radiusPoint:
Point used only to get a vector that is perpendicular to the axis. In
particular, this vector must not be (anti)parallel to the axis vector.
pitch:
The pitch, where a spiral has a pitch = 0, and pitch > 0 is the distance
between the helix's "threads".
turnCount: The number of turns in spiral or helix. Positive
values produce counter-clockwise orientation, negative values produce
clockwise orientation. Note, for a helix, turnCount * pitch = length of
the helix's axis.
radius0: The starting radius.
radius1: The ending radius.
Returns: NurbsCurve on success, null on failure.
Since: 5.2

Rhino.Geometry.NurbsCurve.CreateSpiral(Rhino.Geometry.Curve,System.Double,System.Double,Rhino.Geometry.Point3d,System.Double,System.Double,System.Double,System.Double,System.Int32)
Create a C2 non-rational uniform cubic NURBS approximation of a swept helix or spiral.
railCurve: The rail curve.
t0: Starting portion of rail curve's domain to sweep along.
t1: Ending portion of rail curve's domain to sweep along.
radiusPoint:
Point used only to get a vector that is perpendicular to the axis. In
particular, this vector must not be (anti)parallel to the axis vector.
pitch:
The pitch. Positive values produce counter-clockwise orientation,
negative values produce clockwise orientation.
turnCount:
The turn count. If != 0, then the resulting helix will have this many
turns. If = 0, then pitch must be != 0 and the approximate distance
between turns will be set to pitch. Positive values produce counter-clockwise
orientation, negative values produce clockwise orientation.
radius0:
The starting radius. At least one radii must be nonzero. Negative values
are allowed.
radius1:
The ending radius. At least one radii must be nonzero. Negative values
are allowed.
pointsPerTurn:
Number of points to interpolate per turn. Must be greater than 4.
When in doubt, use 12.
Returns: NurbsCurve on success, null on failure.
Since: 5.2