Rhino.Geometry.Polyline
Represents an ordered set of points connected by linear segments.
Polylines are closed if start and end points coincide.

Rhino.Geometry.Polyline.#ctor
Initializes a new empty polyline.
Since: 5.0

Rhino.Geometry.Polyline.#ctor(System.Int32)
Initializes a new empty polyline with an initial capacity.
initialCapacity: Number of vertices this polyline can contain without resizing.
Since: 5.0

Rhino.Geometry.Polyline.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Initializes a new polyline from a collection of points.
collection: Points to copy into the local vertex array.
Since: 5.0

Rhino.Geometry.Polyline.IsValid
Gets a value that indicates whether this polyline is valid.
Valid polylines have at least one segment, no Invalid points and no zero length segments.
Closed polylines with only two segments are also not considered valid.
Since: 5.0

Rhino.Geometry.Polyline.SegmentCount
Gets the number of segments for this polyline.
Since: 5.0

Rhino.Geometry.Polyline.IsClosed
Test a polyline to see if it is closed.
Since: 5.0

Rhino.Geometry.Polyline.IsClosedWithinTolerance(System.Double)
Test a polyline to see if it is closed.
tolerance: The tolerance.
Returns:
Returns true if polyline has 4 or more points, the distance between the
start and end points is <= tolerance, and there is a
point in the polyline whose distance from the start and end
points is > tolerance.
Since: 5.0

Rhino.Geometry.Polyline.IsConvexLoop(System.Boolean)
Determines if a polyline is convex.
strictlyConvex: If false, collinear segments are considered convex.
Returns: True if the polyline is a closed, convex loop.
Since: 8.28

Rhino.Geometry.Polyline.Length
Gets the total length of the polyline.
Since: 5.0

Rhino.Geometry.Polyline.SegmentAt(System.Int32)
Gets the line segment at the given index.
index: Index of segment to retrieve.
Returns: Line segment at index or Line.Unset on failure.
Since: 5.0

Rhino.Geometry.Polyline.PointAt(System.Double)
Gets the point on the polyline at the given parameter.
The integer part of the parameter indicates the index of the segment.
t: Polyline parameter.
Returns: The point on the polyline at t.
Since: 5.0

Rhino.Geometry.Polyline.TangentAt(System.Double)
Gets the unit tangent vector along the polyline at the given parameter.
The integer part of the parameter indicates the index of the segment.
t: Polyline parameter.
Returns: The tangent along the polyline at t.
Since: 5.0

Rhino.Geometry.Polyline.Trim(Rhino.Geometry.Interval)
Constructs a polyline out of a parameter sub-domain in this curve.
domain: The sub-domain of the polyline.
The integer part of the domain parameters indicate the index of the segment.
Returns: The polyline as defined by the sub-domain, or null on failure.
Since: 5.0

Rhino.Geometry.Polyline.ClosestPoint(Rhino.Geometry.Point3d)
Gets the point on the polyline which is closest to a test-point.
testPoint: Point to approximate.
Returns: The point on the polyline closest to testPoint.
Since: 5.0

Rhino.Geometry.Polyline.ClosestParameter(Rhino.Geometry.Point3d)
Gets the parameter along the polyline which is closest to a test-point.
testPoint: Point to approximate.
Returns: The parameter along the polyline closest to testPoint.
Since: 5.0

Rhino.Geometry.Polyline.GetSegments
Constructs an array of line segments that make up the entire polyline.
Returns: An array of line segments or null if the polyline contains fewer than 2 points.
Since: 5.0

Rhino.Geometry.Polyline.ToNurbsCurve
Constructs a nurbs curve representation of this polyline.
Returns: A Nurbs curve shaped like this polyline or null on failure.
Since: 5.0

Rhino.Geometry.Polyline.ToPolylineCurve
Constructs a polyline curve representation of this polyline.
Returns: A curve shaped like this polyline or null on failure.
Since: 6.0

Rhino.Geometry.Polyline.DeleteShortSegments(System.Double)
Removes all points that are closer than tolerance to the previous point.
Start and end points are left intact.
tolerance: Vertices closer together than tolerance will be removed.
Returns: Number of points (and segments) removed.
Since: 5.0

Rhino.Geometry.Polyline.CollapseShortSegments(System.Double)
Collapses all segments until none are shorter than tolerance.
This function is significantly slower than DeleteShortSegments,
since it recursively operates on the shortest segment.
When a segment is collapsed the end-points are placed in the center of the segment.
tolerance: Tolerance to use during collapsing.
Returns: The number of segments that were collapsed.
Rhino.Geometry.Polyline.DeleteShortSegments(System.Double)
Since: 5.0

Rhino.Geometry.Polyline.ReduceSegments(System.Double)
Constructs a reduction of this polyline by recursively removing the least significant segments.
tolerance: Tolerance for reduction. Whenever a vertex of the polyline is more
significant than tolerance, it will be included in the reduction.
Returns: The number of vertices that disappeared due to reduction.
Since: 5.0

Rhino.Geometry.Polyline.MergeColinearSegments(System.Double,System.Boolean)
Merge co-linear consecutive segments in a polyline.
This method will automatically remove any zero-length segments as well.
angleTolerance: The angle tolerance between adjacent segments for collinearity test.
includeSeam: If true, the seam point of a closed polyline will be moved forwards if it is collinear too.
Returns: Number of segments removed from the entire polyline.
Since: 6.3

Rhino.Geometry.Polyline.Smooth(System.Double)
Smoothen the polyline segments by averaging adjacent vertices.
Smoothing requires a polyline with exclusively valid vertices.
amount: Amount to smooth. Zero equals no smoothing, one equals complete smoothing.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Polyline.BreakAtAngles(System.Double)
Breaks this polyline into sections at sharp kinks.
Closed polylines will also be broken at the first and last vertex.
angle: Angle (in radians) between adjacent segments for a break to occur.
Returns: An array of polyline segments, or null on error.
Since: 5.0

Rhino.Geometry.Polyline.CenterPoint
Compute the center point of the polyline as the weighted average of all segments.
Returns: The weighted average of all segments.
Since: 5.0

Rhino.Geometry.Polyline.CreateInscribedPolygon(Rhino.Geometry.Circle,System.Int32)
Create a regular polygon inscribed in a circle. The vertices of the polygon will be on the circle.
circle: The circle.
sideCount: The number of sides
Returns: A closed polyline if successful, null otherwise.
Since: 6.10

Rhino.Geometry.Polyline.CreateCircumscribedPolygon(Rhino.Geometry.Circle,System.Int32)
Create a regular polygon circumscribe about a circle. The midpoints of the polygon's edges will be tangent to the circle.
circle: The circle.
sideCount: The number of sides
Returns: A closed polyline if successful, null otherwise.
Since: 6.10

Rhino.Geometry.Polyline.CreateStarPolygon(Rhino.Geometry.Circle,System.Double,System.Int32)
Create a regular star polygon. The star begins at circle.PointAt(0) and the vertices
alternate between being on circle and begin on a concentric circle of other_radius.
circle: The circle.
radius: The radius of other circle.
cornerCount: The number of corners on the circle. There will be 2*cornerCount sides and 2*cornerCount vertices.
Returns: A closed polyline if successful, null otherwise.
Since: 6.10

Rhino.Geometry.Polyline.TriangulateClosedPolyline
Attempts to create a list of triangles which represent a
triangulation of a closed polyline
Returns:
Since: 5.0

Rhino.Geometry.Polyline.RemoveNearlyEqualSubsequentPoints(System.Double)
Removes one copy of a point that is equal to the previous or later point, by an absolute tolerance factor.
tolerance:
Since: 7.1

Rhino.Geometry.Polyline.CreateByJoiningLines(System.Collections.Generic.IEnumerable{Rhino.Geometry.Line},System.Double,System.Boolean)
Creates polylines by joining lines.
lines: An array, a list or any enumerable of lines.
tolerance: The threshold distance for joining lines.
splitAtIntersections: If true, splits lines at intersections.
Since: 8.0

Rhino.Geometry.Polyline.Duplicate
Returns a deep copy of this polyline instance.
Returns: The duplicated polyline.
Since: 6.0