Rhino.Geometry.Collections.MeshVertexNormalList
Provides access to the Vertex Normals of a Mesh.

Rhino.Geometry.Collections.MeshVertexNormalList.Count
Gets or sets the number of mesh vertex normals.
Since: 5.0

Rhino.Geometry.Collections.MeshVertexNormalList.Capacity
Gets or sets the amount of vertex normals that the list can hold without resizing.
Since: 6.0

Rhino.Geometry.Collections.MeshVertexNormalList.Item(System.Int32)
Gets or sets the vertex at the given index.
The index must be valid or an IndexOutOfRangeException will be thrown.
index: Index of control vertex to access.
Throws System.IndexOutOfRangeException: Thrown when the index is invalid.
Returns: The control vertex at [index].

Rhino.Geometry.Collections.MeshVertexNormalList.Clear
Clears the vertex normal collection on the mesh.
Since: 5.0

Rhino.Geometry.Collections.MeshVertexNormalList.Destroy
Releases all memory allocated to store vertex normals. The list capacity will be 0 after this call.
Subsequent calls can add new items.
Since: 6.0

Rhino.Geometry.Collections.MeshVertexNormalList.Add(System.Single,System.Single,System.Single)
Adds a new vertex normal at the end of the list.
x: X component of new vertex normal.
y: Y component of new vertex normal.
z: Z component of new vertex normal.
Returns: The index of the newly added vertex normal.
Since: 5.0

Rhino.Geometry.Collections.MeshVertexNormalList.Add(System.Double,System.Double,System.Double)
Adds a new vertex normal at the end of the list.
x: X component of new vertex normal.
y: Y component of new vertex normal.
z: Z component of new vertex normal.
Returns: The index of the newly added vertex normal.
Since: 5.0

Rhino.Geometry.Collections.MeshVertexNormalList.Add(Rhino.Geometry.Vector3f)
Adds a new vertex normal at the end of the list.
normal: new vertex normal.
Returns: The index of the newly added vertex normal.
Since: 5.0

Rhino.Geometry.Collections.MeshVertexNormalList.Add(Rhino.Geometry.Vector3d)
Adds a new vertex normal at the end of the list.
normal: new vertex normal.
Returns: The index of the newly added vertex normal.
Since: 5.0

Rhino.Geometry.Collections.MeshVertexNormalList.AddRange(Rhino.Geometry.Vector3f[])
Appends a collection of normal vectors.
normals: Normals to append.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Collections.MeshVertexNormalList.SetNormal(System.Int32,System.Single,System.Single,System.Single)
Sets or adds a normal to the list.
If [index] is less than [Count], the existing vertex normal at [index] will be modified.
If [index] equals [Count], a new vertex normal is appended to the end of the list.
If [index] is larger than [Count], the function will return false.
index: Index of vertex normal to set.
x: X component of vertex normal.
y: Y component of vertex normal.
z: Z component of vertex normal.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Collections.MeshVertexNormalList.SetNormal(System.Int32,System.Double,System.Double,System.Double)
Sets or adds a vertex normal to the list.
If [index] is less than [Count], the existing vertex normal at [index] will be modified.
If [index] equals [Count], a new vertex normal is appended to the end of the list.
If [index] is larger than [Count], the function will return false.
index: Index of vertex normal to set.
x: X component of vertex normal.
y: Y component of vertex normal.
z: Z component of vertex normal.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Collections.MeshVertexNormalList.SetNormal(System.Int32,Rhino.Geometry.Vector3f)
Sets or adds a vertex normal to the list.
If [index] is less than [Count], the existing vertex normal at [index] will be modified.
If [index] equals [Count], a new vertex normal is appended to the end of the vertex list.
If [index] is larger than [Count], the function will return false.
index: Index of vertex normal to set.
normal: The new normal at the index.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Collections.MeshVertexNormalList.SetNormal(System.Int32,Rhino.Geometry.Vector3d)
Sets or adds a vertex normal to the list.
If [index] is less than [Count], the existing vertex normal at [index] will be modified.
If [index] equals [Count], a new vertex normal is appended to the end of the list.
If [index] is larger than [Count], the function will return false.
index: Index of vertex normal to set.
normal: The new normal at the index.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Collections.MeshVertexNormalList.SetNormals(Rhino.Geometry.Vector3f[])
Sets all normal vectors in one go. This method destroys the current normal array if it exists.
normals: Normals for the entire mesh.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Collections.MeshVertexNormalList.ToFloatArray
Copies all vertex normals to a linear array of float in x,y,z order
Returns: The float array.
Since: 6.0

Rhino.Geometry.Collections.MeshVertexNormalList.ComputeNormals
Computes the vertex normals based on the physical shape of the mesh.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Collections.MeshVertexNormalList.UnitizeNormals
Unitizes all vertex normals.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Collections.MeshVertexNormalList.Flip
Reverses direction of all vertex normals
This is the same as Mesh.Flip(true, false, false)
Since: 5.0

Rhino.Geometry.Collections.MeshVertexNormalList.System#Collections#Generic#ICollection{Rhino#Geometry#Vector3f}#Add(Rhino.Geometry.Vector3f)
Since: 5.0

Rhino.Geometry.Collections.MeshVertexNormalList.GetEnumerator
Gets an enumerator that yields all normals (vectors) in this collection.
Returns: The enumerator.
Since: 5.0

Rhino.Geometry.Collections.MeshVertexNormalList.System#Collections#IEnumerable#GetEnumerator
Since: 5.0