Rhino.Geometry.BlendContinuity
Used in curve and surface blending and matching functions.
Since: 5.0

Rhino.Geometry.BlendContinuity.Position
G0: The curves or surfaces touch at the join point (position).

Rhino.Geometry.BlendContinuity.Tangency
G1: The curves or surfaces also share a common tangent direction at the join point (tangent).

Rhino.Geometry.BlendContinuity.Curvature
G2: The curves or surfaces also share a common center of curvature at the join point (curvature).