Rhino.FileIO.FileGts
Support for writing Gts file format

Rhino.FileIO.FileGts.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileGtsWriteOptions)
Write a Gts file based on the contents of a RhinoDoc
path: path to write a file to
doc: document to get geometry from
options: options used for generating the Gts file
Returns: true on success
Since: 8.0