Rhino.PrivateMeshCommands.Refinements.CreaseDefiner.TypeAt(System.Int32)
This should only return the applied rule:
LogicVertexType.Smooth, LogicVertexType.Crease, or LogicVertexType.Fixed.
Other combinations are errors.