Rhino.Geometry.Light.Attenuation
Types of light attenuation available.
Since: 7.0

Rhino.Geometry.Light.Attenuation.Constant
Constant light attenuation, meaning no light energy fall-off.

Rhino.Geometry.Light.Attenuation.Linear
Linear light attenuation, meaning linear light energy fall-off.

Rhino.Geometry.Light.Attenuation.InverseSquared
Inverse squared light attenuation, meaning light energy falls off in spherical order.