Rhino.Runtime.Skin
Represents a customized environment that changes the appearance of Rhino.
Skin DLLs must contain a single class that derives from the Skin class.

Rhino.Runtime.Skin.ActiveSkin
Any time Rhino is running there is at most one skin being used (and
possibly no skin).  If a RhinoCommon based Skin class is being used, use
ActiveSkin to get at the instance of this Skin class. May return null
if no Skin is being used or if the skin is not a RhinoCommon based skin.
Since: 5.0

Rhino.Runtime.Skin.#ctor
Initializes a new instance of the Rhino.Runtime.Skin class.

Rhino.Runtime.Skin.ShowSplash
Is called when the splash screen should be shown.

Rhino.Runtime.Skin.ShowHelp
Called when the "help" splash screen should be shown. Default
implementation just calls ShowSplash()

Rhino.Runtime.Skin.HideSplash
Is called when the splash screen should be hidden.

Rhino.Runtime.Skin.OnMainFrameWindowCreated
Is called when the main frame window is created.

Rhino.Runtime.Skin.OnLicenseCheckCompleted
Is called when the license check is completed.

Rhino.Runtime.Skin.OnBuiltInCommandsRegistered
Is called when built-in commands are registered.

Rhino.Runtime.Skin.OnBeginLoadAtStartPlugIns(System.Int32)
Is called when the first plug-in that loads at start-up is going to be loaded.
expectedCount: The complete amount of plug-ins.

Rhino.Runtime.Skin.OnBeginLoadPlugIn(System.String)
Is called when a specific plug-in is going to be loaded.
description: The plug-in description.

Rhino.Runtime.Skin.OnEndLoadPlugIn
Is called after each plug-in has been loaded.

Rhino.Runtime.Skin.OnEndLoadAtStartPlugIns
Is called after all of the load at start plug-ins have been loaded.

Rhino.Runtime.Skin.MainRhinoIcon
If you want to provide a custom icon for your skin.

Rhino.Runtime.Skin.ApplicationName
If you want to provide a custom name for your skin.

Rhino.Runtime.Skin.Settings
Gets access to the skin persistent settings.
Since: 5.0