Rhino.DocObjects.ModelComponentType
The ON_ModelComponent::Type enum has a value for each explicit component type
and two special values, Unset and Mixed. Use an ON_ModelComponentTypeIterator
instance to iterate over the ON_ModelComponent::Type values.

Rhino.DocObjects.ModelComponentType.Unset
No value set.

Rhino.DocObjects.ModelComponentType.Image
Embedded image (bitmap) components.

Rhino.DocObjects.ModelComponentType.TextureMapping
Texture mapping.

Rhino.DocObjects.ModelComponentType.Material
Material.

Rhino.DocObjects.ModelComponentType.RenderMaterial
Render material. Deprecated in favor of Material.

Rhino.DocObjects.ModelComponentType.LinePattern
Line pattern (linetype).

Rhino.DocObjects.ModelComponentType.Layer
Layer.

Rhino.DocObjects.ModelComponentType.Group
Group.

Rhino.DocObjects.ModelComponentType.TextStyle
Text style.

Rhino.DocObjects.ModelComponentType.DimStyle
AnnotationDimension style.

Rhino.DocObjects.ModelComponentType.RenderLight
Render light.

Rhino.DocObjects.ModelComponentType.HatchPattern
Hatch pattern.

Rhino.DocObjects.ModelComponentType.InstanceDefinition
Instance definition.

Rhino.DocObjects.ModelComponentType.ModelGeometry
Model objects (points, curves, surfaces, ..., annotation, page details, ...), including objects referenced by instance definitions.

Rhino.DocObjects.ModelComponentType.HistoryRecord
History record.

Rhino.DocObjects.ModelComponentType.RenderContent
Render content.

Rhino.DocObjects.ModelComponentType.EmbeddedFile
Embedded file for render texture.

Rhino.DocObjects.ModelComponentType.ObsoleteValue
This value was never used and is now obsolete.

Rhino.DocObjects.ModelComponentType.SectionStyle
Section style attributes

Rhino.DocObjects.ModelComponentType.NumOf
Number of items above.

Rhino.DocObjects.ModelComponentType.Mixed
Multiple component types. Used when a component type filter must include all explicit component types.