Rhino.PlugIns.LicenseStatus
LicenseStatus class.

Rhino.PlugIns.LicenseStatus.PluginId
The ID of the plug-in that owns this license information
Since: 6.0

Rhino.PlugIns.LicenseStatus.ProductId
The id of the product or plug in.
Since: 5.0

Rhino.PlugIns.LicenseStatus.BuildType
The build contentType of the product, where:
100 = A release build, either commercial, education, NFR, etc.
200 = A evaluation build
300 = A beta build, such as a WIP.
Since: 5.0

Rhino.PlugIns.LicenseStatus.LicenseTitle
The title of the license. (e.g. "Rhinoceros 6.0 Commercial")
Since: 5.0

Rhino.PlugIns.LicenseStatus.SerialNumber
The "for display only" product license or serial number.
Since: 5.0

Rhino.PlugIns.LicenseStatus.LicenseType
The license contentType. (e.g. Standalone, Network, etc.)
Since: 5.0

Rhino.PlugIns.LicenseStatus.ExpirationDate
The date and time the license will expire.
This value can be null if:
1.) The license contentType is "Standalone" and the license does not expire.
2.) The license contentType is "Network".
3.) The license contentType is "NetworkCheckedOut" and the checkout does not expire
Note, date and time is in local time coordinates.
Since: 5.0

Rhino.PlugIns.LicenseStatus.CheckOutExpirationDate
The date and time the checked out license will expire.
Note, this is only set if m_license_type = Standalone or CloudZoo
and if "limited license checkout" was enabled on the Zoo server in the case of Standalone.
Note, date and time is in local time coordinates.
Since: 5.0

Rhino.PlugIns.LicenseStatus.RegisteredOwner
The registered owner of the product. (e.g. "Dale Fugier")
Since: 5.0

Rhino.PlugIns.LicenseStatus.RegisteredOrganization
The registered organization of the product (e.g. "Robert McNeel and Associates")
Since: 5.0

Rhino.PlugIns.LicenseStatus.ProductIcon
The product's icon. Note, this can be null.
Since: 5.0

Rhino.PlugIns.LicenseStatus.CloudZooLeaseIsValid
Returns true if the Cloud Zoo Lease represented by this instance is actively being managed by the Cloud Zoo Manager; else returns false.
Since: 6.0

Rhino.PlugIns.LicenseStatus.CloudZooLeaseExpiration
Returns the expiration date of the lease this instance represents.
Since: 6.4

Rhino.PlugIns.LicenseStatus.#ctor
Public constructor.
Since: 5.0