Rhino.RhinoDocObserverArgs
Arguments passed to Rhino.IRhinoDocObserver methods.

Rhino.RhinoDocObserverArgs.#ctor(Rhino.RhinoDoc)
Since: 6.0

Rhino.RhinoDocObserverArgs.Doc
Document
Since: 6.0

Rhino.RhinoDocObserverArgs.RuntimeSerialNumber
Document runtime serial number, will be different across Rhino sessions.
Since: 6.0