Rhino.DocObjects.PhysicallyBasedMaterial.#ctor
Since: 6.12

Rhino.DocObjects.PhysicallyBasedMaterial.Material
Since: 7.0

Rhino.DocObjects.PhysicallyBasedMaterial.SetTexture(Rhino.DocObjects.Texture,Rhino.DocObjects.TextureType)
Set the texture that corresponds with the specified texture type for this material.
texture: An instance of Rhino.DocObjects.Texture
which: Use Rhino.DocObjects.TextureType
Returns:
Since: 7.0

Rhino.DocObjects.PhysicallyBasedMaterial.GetTexture(Rhino.DocObjects.TextureType)
Get the texture that corresponds with the specified texture type for this material.
which:
Returns:
Since: 7.0

Rhino.DocObjects.PhysicallyBasedMaterial.GetTextures
Get array of textures that this material uses
Returns:
Since: 7.0

Rhino.DocObjects.PhysicallyBasedMaterial.SynchronizeLegacyMaterial
Since: 7.0

Rhino.DocObjects.PhysicallyBasedMaterial.BaseColor
Since: 7.0

Rhino.DocObjects.PhysicallyBasedMaterial.BRDF
Since: 7.0

Rhino.DocObjects.PhysicallyBasedMaterial.SubsurfaceScatteringColor
Since: 7.0

Rhino.DocObjects.PhysicallyBasedMaterial.Subsurface
Since: 7.0

Rhino.DocObjects.PhysicallyBasedMaterial.SubsurfaceScatteringRadius
Since: 7.0

Rhino.DocObjects.PhysicallyBasedMaterial.Metallic
Since: 7.0

Rhino.DocObjects.PhysicallyBasedMaterial.Specular
Since: 7.0

Rhino.DocObjects.PhysicallyBasedMaterial.ReflectiveIOR
Since: 7.0

Rhino.DocObjects.PhysicallyBasedMaterial.SpecularTint
Since: 7.0

Rhino.DocObjects.PhysicallyBasedMaterial.Roughness
Since: 7.0

Rhino.DocObjects.PhysicallyBasedMaterial.Anisotropic
Since: 7.0

Rhino.DocObjects.PhysicallyBasedMaterial.AnisotropicRotation
Since: 7.0

Rhino.DocObjects.PhysicallyBasedMaterial.Sheen
Since: 7.0

Rhino.DocObjects.PhysicallyBasedMaterial.SheenTint
Since: 7.0

Rhino.DocObjects.PhysicallyBasedMaterial.Clearcoat
Since: 7.0

Rhino.DocObjects.PhysicallyBasedMaterial.ClearcoatRoughness
Since: 7.0

Rhino.DocObjects.PhysicallyBasedMaterial.OpacityIOR
Since: 7.0

Rhino.DocObjects.PhysicallyBasedMaterial.Opacity
Since: 7.0

Rhino.DocObjects.PhysicallyBasedMaterial.OpacityRoughness
Since: 7.0

Rhino.DocObjects.PhysicallyBasedMaterial.Alpha
Since: 7.1

Rhino.DocObjects.PhysicallyBasedMaterial.UseBaseColorTextureAlphaForObjectAlphaTransparencyTexture
Since: 7.1

Rhino.DocObjects.PhysicallyBasedMaterial.Emission
Since: 7.0