Rhino.Render.RenderContent.ShowContentChooserFlags
Since: 5.1
7.9

Rhino.Render.RenderContent.ShowContentChooserFlags.None
Deprecated

Rhino.Render.RenderContent.ShowContentChooserFlags.HideNewTab
Deprecated

Rhino.Render.RenderContent.ShowContentChooserFlags.HideExistingTab
Deprecated

Rhino.Render.RenderContent.ShowContentChooserFlags.MultipleSelection
Deprecated