Rhino.UI.PanelContainers
Class used to manage dock bar specific instances of a panel

Rhino.UI.PanelContainers.Instance(System.Guid)
Find an instance associated with a specific container Id
containerId:
The container Id to search for
Returns:
Returns the PanelInstance associated with a specific container or null
if there is none.

Rhino.UI.PanelContainers.FindOrCreateInstance(System.Guid,Rhino.UI.PanelDefinition,System.UInt32,System.Boolean)
Check for the container specific instance of a panel and if not then
create one.
containerId:
The container Id associated with the Rhino.UI.PanelInstance
definition:
The Rhino.UI.PanelDefinition containing the creation information
needed to create the panel.
documentSerailNumber:
The document runtime serial number which will be optionally passed to
the panel class constructor.
createUnmangedHost:
If true then a unmanaged window or NSView is created to host the .NET
control otherwise only the .NET control is created.
Returns:
Returns the Rhino.UI.PanelInstance associated with a container of
null if there was a problem creating one.

Rhino.UI.PanelContainers.Add(System.Guid,Rhino.UI.PanelInstance)
Called internally do add a new instance
containerId:
instance:

Rhino.UI.PanelContainers.m_instance_dictionary
Rhino.UI.PanelInstance Dictionary used to manage container specific
Rhino.UI.PanelInstance.