Rhino.FileIO.FileReadOptions.#ctor
Since: 5.0

Rhino.FileIO.FileReadOptions.ImportMode
true means we are merging whatever is being read into an existing document.
This means you need to consider things like:
If the information being read is in a different unit system, it should be
scaled if UseScaleGeometry is true.
There can be existing layers, fonts, materials, dimension styles, hatch
patterns, and so on with the same name as items being read from the file.
Since: 5.0

Rhino.FileIO.FileReadOptions.OpenMode
true means we are reading the information into an empty document.  This
means you need to consider things like:
Setting the unit system (if the file has a unit system)
Creating a default layer if one is not there.
Setting up appropriate views when you're finished reading.
Since: 5.0

Rhino.FileIO.FileReadOptions.NewMode
true means we are reading template information in something like
a OnFileNew event.
Since: 5.0

Rhino.FileIO.FileReadOptions.InsertMode
true means we are reading information that will be used to create an
instance definition or some other type of "inserting" that is supported
by Rhino's "Insert" command.
Since: 5.0

Rhino.FileIO.FileReadOptions.ImportReferenceMode
true means we are reading information for a work session reference model
or a linked instance definition.
Since: 5.0

Rhino.FileIO.FileReadOptions.BatchMode
true means you cannot ask questions during reading. (no dialogs, no "getters", etc.)
Since: 5.0

Rhino.FileIO.FileReadOptions.UseScaleGeometry
If this parameter is true, then no questions are asked when unit conversion
scaling is optional and the setting specified by ScaleGeometry is used.
Since: 5.0

Rhino.FileIO.FileReadOptions.ScaleGeometry
true: If ImportMode is true and the geometry in the file being read has
a unit system different from the model's unit system, then apply the unit
conversion scale to the file's geometry before adding it to the model.
false: Do not scale. Once case where this happens is when an instance
definition is read from a file and the model space instance references
have been scaled. In case the instance definition geometry cannot be
scaled or the net result is that the size of the instance reference
object is scaled by the square of the scale factor.
Since: 5.0

Rhino.FileIO.FileReadOptions.WorkSessionReferenceModelSerialNumber
If a worksession reference model is being read, then a value >= 1000 will be returned.
Otherwise, this value will be 0;
Since: 8.6

Rhino.FileIO.FileReadOptions.LinkedInstanceDefinitionSerialNumber
If a file is being read to create an instance definition, then this value will be the
serial number of the instance definition being created.
Otherwise, this value will be 0;
Since: 8.6

Rhino.FileIO.FileReadOptions.ReferenceModelGrandParentLayerId
Information that ultimately is part of a worksession reference model or linked instance definition model is being read,
all layers are added as sub-layers of a grand-parent layer.When the information being read is destined for the active model,
no grandparent layer is used. Value is Guid.Empty if no grandparent layer is in use.
Since: 8.6

Rhino.FileIO.FileReadOptions.OptionsDictionary
Additional read options.
Since: 8.0

Rhino.FileIO.FileReadOptions.Dispose
Since: 5.0