Rhino.UI.Controls.ThumbnailUI.Thumbnail.CppPointer
Thumbnail c++ pointer
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.Thumbnail.#ctor(System.IntPtr)
Constructor for Thumbnail
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.Thumbnail.Finalize
Destructor for Thumbnail

Rhino.UI.Controls.ThumbnailUI.Thumbnail.Dispose
Dispose for Thumbnail
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.Thumbnail.Dib(System.Drawing.Bitmap@)
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.Thumbnail.GetDib
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.Thumbnail.GetDisplayRect(System.Drawing.RectangleF@)
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.Thumbnail.Id
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.Thumbnail.IsHot
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.Thumbnail.IsSelected
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.Thumbnail.Label
Since: 6.0
6.6