Rhino.Render.DecalMapping
Since: 5.10

Rhino.Render.DecalMapping.Planar
Planar mapping. Uses projection, origin, up and across vectors (not unitized).

Rhino.Render.DecalMapping.Cylindrical
Cylindrical mapping. Uses origin, up, across, height, radius, latitude start and stop.

Rhino.Render.DecalMapping.Spherical
Spherical mapping. Uses origin, up, across, radius, latitude/longitude start and stop.

Rhino.Render.DecalMapping.UV
UV mapping.