Rhino.Render.PostEffects.PostEffectExecuteWhileRenderingOptions
Since: 7.0

Rhino.Render.PostEffects.PostEffectExecuteWhileRenderingOptions.Never
OBSOLETE; typo. Use Never.
The post effect does not support execution while rendering.

Rhino.Render.PostEffects.PostEffectExecuteWhileRenderingOptions.Always
The post effect supports execution while rendering and it should be run every time the dib
is updated.

Rhino.Render.PostEffects.PostEffectExecuteWhileRenderingOptions.UseDelay
The post effect supports execution while rendering but only after a delay the first time.

Rhino.Render.PostEffects.PostEffectExecuteWhileRenderingOptions.UseExecutionControl
Since: 8.14
The post effect supports execution while rendering but requires a PostEffectExecutionControl object
to be registered with the render window. The ReadyToExecutePostEffect() function on this object will
then be called to decide when to run the post effect.