Rhino.FileIO.File3dmMeshModifiers
Represents the mesh modifiers attached to file3dm object attributes.

Rhino.FileIO.File3dmMeshModifiers.Displacement
Returns an object that provides access to displacement information.
If no displacement information is present, the method returns null.
Since: 8.0

Rhino.FileIO.File3dmMeshModifiers.EdgeSoftening
Returns an object that provides access to edge softening information.
If no edge softening information is present, the method returns null.
Since: 8.0

Rhino.FileIO.File3dmMeshModifiers.Thickening
Returns an object that provides access to thickening information.
If no thickening information is present, the method returns null.
Since: 8.0

Rhino.FileIO.File3dmMeshModifiers.CurvePiping
Returns an object that provides access to curve piping information.
If no curve piping information is present, the method returns null.
Since: 8.0

Rhino.FileIO.File3dmMeshModifiers.ShutLining
Returns an object that provides access to shut-lining information.
If no shutlining information is present, the method returns null.
Since: 8.0