Rhino.UI.ObjectPropertiesPageCollection
Passed to Rhino.PlugIns.PlugIn.ObjectPropertiesPages to allow a plug-in
to add custom ObjectPropertiesPage pages to the Rhino properties panel.

Rhino.UI.ObjectPropertiesPageCollection.#ctor(System.UInt32)
Constructor
documentRuntimeSerialNumber:
Document associated with the Rhino properties panel.

Rhino.UI.ObjectPropertiesPageCollection.Add(Rhino.UI.ObjectPropertiesPage)
Custom page to add
page:
Since: 7.0

Rhino.UI.ObjectPropertiesPageCollection.Pages
Add plug-in pages to this list

Rhino.UI.ObjectPropertiesPageCollection.DocumentRuntimeSerialNumber
Document associated with the Rhino properties panel.
Since: 7.0

Rhino.UI.ObjectPropertiesPageCollection.Document
Document associated with the Rhino properties panel.
Since: 7.0