Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList_Modes
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList_Modes.Grid
Big thumbnails like Explorer icon mode (default).

Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList_Modes.List
Small thumbnails and info on right like Explorer report mode.

Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList_Modes.Tree
Tree view mode.