Rhino.Runtime.InteropWrappers.SimpleArrayLinetypePointer
Wrapper for a C++ ON_SimpleArray<ON_Linetype*>
If you are not writing C++ code then this class is not for you.

Rhino.Runtime.InteropWrappers.SimpleArrayLinetypePointer.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.
Since: 6.6

Rhino.Runtime.InteropWrappers.SimpleArrayLinetypePointer.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.
Since: 6.6

Rhino.Runtime.InteropWrappers.SimpleArrayLinetypePointer.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayLinetypePointer instance.
Since: 6.6

Rhino.Runtime.InteropWrappers.SimpleArrayLinetypePointer.Count
Gets the amount of linetypes in this array.
Since: 6.6

Rhino.Runtime.InteropWrappers.SimpleArrayLinetypePointer.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.SimpleArrayLinetypePointer.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 6.6

Rhino.Runtime.InteropWrappers.SimpleArrayLinetypePointer.Dispose(System.Boolean)
Dispose
disposing:

Rhino.Runtime.InteropWrappers.SimpleArrayLinetypePointer.ToNonConstArray
Copies the unmanaged array to a managed counterpart.
Returns: The managed array.
Since: 6.6