Rhino.Geometry.MeshCheckParameters
Output of a mesh checking operations.

Rhino.Geometry.MeshCheckParameters.Defaults
Gets the default mesh check parameters.
Returns: The default mesh check parameters.
Since: 7.0

Rhino.Geometry.MeshCheckParameters.CheckForDegenerateFaces
If true, then look for triangles and quads that have zero area and quads
where one sub triangle has zero area.
Since: 7.0

Rhino.Geometry.MeshCheckParameters.DegenerateFaceCount
Gets the total degenerate face count for all meshes.
Since: 7.0

Rhino.Geometry.MeshCheckParameters.CheckForInvalidNgons
If true, then look for ngons that have invalid information.
Since: 7.0

Rhino.Geometry.MeshCheckParameters.InvalidNgonCount
Gets the total number of invalid ngons for all meshes.
Since: 7.0

Rhino.Geometry.MeshCheckParameters.CheckForNakedEdges
If true, then look for topological edges in the mesh topology where the
face count is 1. Note, this check is also made if CheckForDuplicateFaces
is true but the output is not shown if CheckForNakedEdges is false.
Since: 7.0

Rhino.Geometry.MeshCheckParameters.NakedEdgeCount
Gets the total number of naked edges for all meshes.
Since: 7.0

Rhino.Geometry.MeshCheckParameters.CheckForNonManifoldEdges
If true, then look for topological edges in the mesh topology where the
face count is greater than 2. Note, this check is also made if
CheckForDuplicateFaces is true but the output is not shown if
CheckForNonManifoldEdges is false.
Since: 7.0

Rhino.Geometry.MeshCheckParameters.NonManifoldEdgeCount
Gets the total number of non-manifold edges for all meshes.
Since: 7.0

Rhino.Geometry.MeshCheckParameters.CheckForExtremelyShortEdges
If true, then look for topological edges where the distance between the
endpoints is less than ExtremelyShortEdgeDistance.
Since: 7.0

Rhino.Geometry.MeshCheckParameters.ExtremelyShortEdgeCount
Gets the total number of extremely short edges for all meshes.
Since: 7.0

Rhino.Geometry.MeshCheckParameters.CheckForBadNormals
If true, then look for vertex normals that are not unit vectors,
are zero length or vary greatly from the general direction of the
face normals.
Since: 7.0

Rhino.Geometry.MeshCheckParameters.NonUnitVectorNormalCount
Get the total count of normals that are not unit vectors for all meshes.
Since: 7.0

Rhino.Geometry.MeshCheckParameters.ZeroLengthNormalCount
Gets the total count of zero length normals for all meshes.
Since: 7.0

Rhino.Geometry.MeshCheckParameters.VertexFaceNormalsDifferCount
Gets the total count of vertex normals that differ greatly from face
normals for all meshes.
Since: 7.0

Rhino.Geometry.MeshCheckParameters.CheckForDuplicateFaces
If true, then look for faces that have vertices (not necessarily vertex indexes) that are identical.
Since: 7.0

Rhino.Geometry.MeshCheckParameters.DuplicateFaceCount
Gets the total count of duplicate faces for all meshes.
Since: 7.0

Rhino.Geometry.MeshCheckParameters.CheckForRandomFaceNormals
If true, then look for adjacent faces that have the same edge orientation.
This typically means that clockwise/counterclockwise orientation, and face normal
are not in sync.
Since: 7.0

Rhino.Geometry.MeshCheckParameters.RandomFaceNormalCount
Gets the total count of random face normals for all meshes.
Since: 7.0

Rhino.Geometry.MeshCheckParameters.CheckForDisjointMeshes
If true, then look for faces in the mesh that are totally isolated from other faces in the mesh.
(i.e. an island of faces, or many islands, that have a boundary of naked edges)
Since: 7.0

Rhino.Geometry.MeshCheckParameters.DisjointMeshCount
Gets the total count of disjoint pieces for all meshes.
Since: 7.0

Rhino.Geometry.MeshCheckParameters.CheckForUnusedVertices
If true, then look for vertices that are not referenced by any face in the mesh.
Since: 7.0

Rhino.Geometry.MeshCheckParameters.UnusedVertexCount
Gets the total count of unused vertices for all meshes.
Since: 7.0

Rhino.Geometry.MeshCheckParameters.CheckForSelfIntersection
If true, then look for self intersections.
Since: 7.0

Rhino.Geometry.MeshCheckParameters.SelfIntersectingPairsCount
Gets the total count of self intersections for all meshes.
Since: 7.0