Rhino.UI.IStackedDialogPageService
For internal use, the IStackedDialogPageService service is implemented in
RhinoWindows or RhinoMac as appropriate and handles the communication
with core Rhino

Rhino.UI.IStackedDialogPageService.GetImageHandle(System.Drawing.Image,System.Boolean)
Convert image to platform specific unmanaged pointer
image:
canBeNull:
Returns:
Since: 6.0

Rhino.UI.IStackedDialogPageService.GetImageHandle(System.Drawing.Icon,System.Boolean)
Convert image to platform specific unmanaged pointer
icon:
canBeNull:
Returns:
Since: 6.1

Rhino.UI.IStackedDialogPageService.SetNativeParent(System.IntPtr,System.Object)
Sets the parent on a host returned from GetNativePageWindow
hwndParent:
host:
Returns:
Since: 8.3

Rhino.UI.IStackedDialogPageService.NativeHandle(System.Object)
Gets the native window handle associated with the host object if there is one.
host:
Returns:
Since: 8.4

Rhino.UI.IStackedDialogPageService.GetNativePageWindow(System.Object,System.Boolean,System.Boolean,System.Object@)
Get the unmanaged pointer associated with the pages content control
nativeWindowObject:
isRhinoPanel:
applyPanelStyles:
host:
Returns:
Since: 6.0

Rhino.UI.IStackedDialogPageService.GetNativePageWindow(System.Object,System.Boolean,System.Boolean,System.Object@,System.Object@)
Get the unmanaged pointer associated with the pages content control
pageObject:
nativeWindowObject:
isRhinoPanel:
applyPanelStyles:
host:
Returns:
Since: 6.1

Rhino.UI.IStackedDialogPageService.RedrawPageControl(System.Object)
Redraw the specified control.
pageControl:
Control to redraw
Since: 6.0

Rhino.UI.IStackedDialogPageService.TryGetControlMinimumSize(System.Object,System.Drawing.SizeF@)
Get the minimum size associated with a control object
Returns:
Returns true if get control minimum size found, false otherwise.
controlObject:
The control object to check for minimum size.
size:
The minimum size of the control if provided.
Since: 6.5