Rhino.Geometry.VolumeMassProperties
Contains static initialization methods and allows access to the computed
metrics of volume, volume centroid and volume moments in
in solid meshes, in solid surfaces and in solid (closed) boundary representations.

Rhino.Geometry.VolumeMassProperties.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Geometry.VolumeMassProperties.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0

Rhino.Geometry.VolumeMassProperties.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.Geometry.VolumeMassProperties.Compute(Rhino.Geometry.Mesh)
Compute the VolumeMassProperties for a single Mesh.
mesh: Mesh to measure.
Returns: The VolumeMassProperties for the given Mesh or null on failure.
Throws System.ArgumentNullException: When mesh is null.
Since: 5.0

Rhino.Geometry.VolumeMassProperties.Compute(Rhino.Geometry.Mesh,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Compute the VolumeMassProperties for a single Mesh.
mesh: Mesh to measure.
volume: true to calculate volume.
firstMoments: true to calculate volume first moments, volume, and volume centroid.
secondMoments: true to calculate volume second moments.
productMoments: true to calculate volume product moments.
Returns: The VolumeMassProperties for the given Mesh or null on failure.
Throws System.ArgumentNullException: When Mesh is null.
Since: 6.3

Rhino.Geometry.VolumeMassProperties.Compute(Rhino.Geometry.Brep)
Compute the VolumeMassProperties for a single Brep.
brep: Brep to measure.
Returns: The VolumeMassProperties for the given Brep or null on failure.
Throws System.ArgumentNullException: When brep is null.
Since: 5.0

Rhino.Geometry.VolumeMassProperties.Compute(Rhino.Geometry.Brep,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Compute the VolumeMassProperties for a single Brep.
brep: Brep to measure.
volume: true to calculate volume.
firstMoments: true to calculate volume first moments, volume, and volume centroid.
secondMoments: true to calculate volume second moments.
productMoments: true to calculate volume product moments.
Returns: The VolumeMassProperties for the given Brep or null on failure.
Throws System.ArgumentNullException: When brep is null.
Since: 6.3

Rhino.Geometry.VolumeMassProperties.Compute(Rhino.Geometry.Brep,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Double,System.Double)
Compute the VolumeMassProperties for a single Brep.
brep: Brep to measure.
volume: true to calculate volume.
firstMoments: true to calculate volume first moments, volume, and volume centroid.
secondMoments: true to calculate volume second moments.
productMoments: true to calculate volume product moments.
relativeTolerance: The relative tolerance used for the calculation. In overloads of this function where tolerances are not specified, 1.0e-6 is used.
absoluteTolerance: The absolute tolerancwe used for the calculation. In overloads of this function where tolerances are not specified, 1.0e-6 is used.
Returns: The VolumeMassProperties for the given Brep or null on failure.
Throws System.ArgumentNullException: When brep is null.
Since: 7.10

Rhino.Geometry.VolumeMassProperties.Compute(Rhino.Geometry.Surface)
Compute the VolumeMassProperties for a single Surface.
surface: Surface to measure.
Returns: The VolumeMassProperties for the given Surface or null on failure.
Throws System.ArgumentNullException: When surface is null.
Since: 5.0

Rhino.Geometry.VolumeMassProperties.Compute(Rhino.Geometry.Surface,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Compute the VolumeMassProperties for a single Surface.
surface: Surface to measure.
volume: true to calculate volume.
firstMoments: true to calculate volume first moments, volume, and volume centroid.
secondMoments: true to calculate volume second moments.
productMoments: true to calculate volume product moments.
Returns: The VolumeMassProperties for the given Surface or null on failure.
Throws System.ArgumentNullException: When surface is null.
Since: 6.3

Rhino.Geometry.VolumeMassProperties.Compute(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})
Computes the VolumeMassProperties for a collection of geometric objects.
At present only Breps, Surfaces, and Meshes are supported.
geometry: Objects to include in the volume computation.
Returns: The VolumeMassProperties for the entire collection or null on failure.
Since: 6.3

Rhino.Geometry.VolumeMassProperties.Compute(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Computes the VolumeMassProperties for a collection of geometric objects.
At present only Breps, Surfaces, Meshes and Planar Closed Curves are supported.
geometry: Objects to include in the volume computation.
volume: true to calculate volume.
firstMoments: true to calculate volume first moments, volume, and volume centroid.
secondMoments: true to calculate volume second moments.
productMoments: true to calculate volume product moments.
Returns: The VolumeMassProperties for the entire collection or null on failure.
Since: 6.3

Rhino.Geometry.VolumeMassProperties.Volume
Gets the volume solution.
Since: 5.0

Rhino.Geometry.VolumeMassProperties.VolumeError
Gets the uncertainty in the volume calculation.
Since: 5.0

Rhino.Geometry.VolumeMassProperties.Centroid
Gets the volume centroid in the world coordinate system.
Since: 5.0

Rhino.Geometry.VolumeMassProperties.CentroidError
Gets the uncertainty in the Centroid calculation.
Since: 5.0

Rhino.Geometry.VolumeMassProperties.WorldCoordinatesFirstMoments
Returns the world coordinate first moments if they were able to be calculated.
X is integral of "x dm" over the volume
Y is integral of "y dm" over the volume
Z is integral of "z dm" over the volume.
Since: 5.0

Rhino.Geometry.VolumeMassProperties.WorldCoordinatesFirstMomentsError
Uncertainty in world coordinates first moments calculation.
Since: 5.0

Rhino.Geometry.VolumeMassProperties.WorldCoordinatesSecondMoments
Returns the world coordinate second moments if they were able to be calculated.
X is integral of "xx dm" over the volume
Y is integral of "yy dm" over the volume
Z is integral of "zz dm" over the volume.
Since: 5.0

Rhino.Geometry.VolumeMassProperties.WorldCoordinatesSecondMomentsError
Uncertainty in world coordinates second moments calculation.
Since: 5.0

Rhino.Geometry.VolumeMassProperties.WorldCoordinatesProductMoments
Returns the world coordinate product moments if they were able to be calculated.
X is integral of "xy dm" over the volume
Y is integral of "yz dm" over the volume
Z is integral of "zx dm" over the volume.
Since: 5.0

Rhino.Geometry.VolumeMassProperties.WorldCoordinatesProductMomentsError
Uncertainty in world coordinates second moments calculation.
Since: 5.0

Rhino.Geometry.VolumeMassProperties.WorldCoordinatesMomentsOfInertia
The moments of inertia about the world coordinate axes.
X = integral of (y^2 + z^2) dm
Y = integral of (z^2 + x^2) dm
Z = integral of (z^2 + y^2) dm.
Remarks:
What is meant by "moments of inertia" varies widely in textbooks and papers.
The values returned here are the integrals listed in the Summary section.
Some applications may want the values from WorldCoordinatesSecondMoments
instead of the values returned here.
Since: 5.0

Rhino.Geometry.VolumeMassProperties.WorldCoordinatesMomentsOfInertiaError
Uncertainty in world coordinates moments of inertia calculation.
Since: 5.0

Rhino.Geometry.VolumeMassProperties.WorldCoordinatesRadiiOfGyration
Radii of gyration with respect to world coordinate system.
X = sqrt(integral of (y^2 + z^2) dm/M)
Y = sqrt(integral of (z^2 + x^2) dm/M)
Z = sqrt(integral of (z^2 + y^2) dm/M)
Remarks:
What is meant by "radii of gyration" varies widely in textbooks and papers.
The values returned here are the integrals listed in the Returns section.
Since: 5.0

Rhino.Geometry.VolumeMassProperties.CentroidCoordinatesSecondMoments
Second moments with respect to centroid coordinate system.
X = integral of (x-x0)^2 dm
Y = integral of (y-y0)^2 dm
Z = integral of (z-z0)^2 dm
where (x0,y0,z0) = centroid.
Since: 5.0

Rhino.Geometry.VolumeMassProperties.CentroidCoordinatesSecondMomentsError
Uncertainty in centroid coordinates second moments calculation.
Since: 5.0

Rhino.Geometry.VolumeMassProperties.CentroidCoordinatesProductMoments
Product moments with respect to centroid coordinate system.
Since: 6.26

Rhino.Geometry.VolumeMassProperties.CentroidCoordinatesProductMomentsError
Uncertainty in product moments with respect to centroid coordinate system.
Since: 6.26

Rhino.Geometry.VolumeMassProperties.CentroidCoordinatesMomentsOfInertia
Moments of inertia with respect to centroid coordinate system.
X = integral of ((y-y0)^2 + (z-z0)^2) dm
Y = integral of ((z-z0)^2 + (x-x0)^2) dm
Z = integral of ((z-z0)^2 + (y-y0)^2) dm
where (x0,y0,z0) = centroid.
Remarks:
What is meant by "moments of inertia" varies widely in textbooks and papers.
The values returned here are the integrals listed in the Summary section.
Some applications may want the values from WorldCoordinatesSecondMoments
instead of the values returned here.
Since: 5.0

Rhino.Geometry.VolumeMassProperties.CentroidCoordinatesMomentsOfInertiaError
Uncertainty in centroid coordinates moments of inertia calculation.
Since: 5.0

Rhino.Geometry.VolumeMassProperties.CentroidCoordinatesRadiiOfGyration
Radii of gyration with respect to centroid coordinate system.
X = sqrt(integral of ((y-y0)^2 + (z-z0)^2) dm/M)
Y = sqrt(integral of ((z-z0)^2 + (x-x0)^2) dm/M)
Z = sqrt(integral of ((z-z0)^2 + (y-y0)^2) dm/M)
where (x0,y0,z0) = centroid.
Remarks:
What is meant by "radii of gyration" varies widely in textbooks and papers.
The values returned here are the integrals listed in the Returns section.
Since: 5.0

Rhino.Geometry.VolumeMassProperties.WorldCoordinatesPrincipalMoments(System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@)
Calculates the eigenvalues and eigenvectors of moments matrix in world coordinates.
x: Principal moment.
xaxis: Principal axis for x.
y: Principal moment.
yaxis: Principal axis for y.
z: Principal moment.
zaxis: Principal axis for z.
Returns: true if successful.
Since: 6.9

Rhino.Geometry.VolumeMassProperties.WorldCoordinatesPrincipalMomentsOfInertia(System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@)
Calculates the principal moments of inertia and principal axes with respect to world coordinates.
x: Principal moment.
xaxis: Principal axis for x.
y: Principal moment.
yaxis: Principal axis for y.
z: Principal moment.
zaxis: Principal axis for z.
Returns: true if successful.
Since: 7.3

Rhino.Geometry.VolumeMassProperties.CentroidCoordinatesPrincipalMoments(System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@)
Calculates the eigenvalues and eigenvectors of the moments matrix with respect to centroid coordinates.
x: Principal moment.
xaxis: Principal axis for x.
y: Principal moment.
yaxis: Principal axis for y.
z: Principal moment.
zaxis: Principal axis for z.
Returns: true if successful.
Since: 6.9

Rhino.Geometry.VolumeMassProperties.CentroidCoordinatesPrincipalMomentsOfInertia(System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@)
Calculates the principal moments of inertia and principal axes with respect to centroid coordinates.
x: Principal moment.
xaxis: Principal axis for x.
y: Principal moment.
yaxis: Principal axis for y.
z: Principal moment.
zaxis: Principal axis for z.
Returns: true if successful.
Since: 7.3

Rhino.Geometry.VolumeMassProperties.Sum(Rhino.Geometry.VolumeMassProperties)
Sum mass properties together to get an aggregate mass.
summand: mass properties to add.
Returns: true if successful.
Since: 5.0

Rhino.Geometry.VolumeMassProperties.Transform(Rhino.Geometry.Transform)
On input, this contains the mass properties for some geometry G.
On exit, this contains the mass properties for the transformed geometry xform(G).
xform:
The transformation.
When computing volumne mass properties, transform must be an affine transformation, or Rhino.Geometry.Transform.IsAffine.
When computing area mass properties, transform must be a similarity transformation, or Rhino.Geometry.Transform.IsSimilarity(System.Double).
Perspective transformations are not allowed.
Returns:
True if successful, false otherwise.
Remarks:
The Area of a transformed object can not be calculated from the area of the original object
if the transform is not a similarity, like a non-uniform scaling.
Since: 8.12