Rhino.FileIO.FileObjWriteOptions.ObjObjectNames
Since: 6.0

Rhino.FileIO.FileObjWriteOptions.ObjObjectNames.NoObjects
Object names are not exported

Rhino.FileIO.FileObjWriteOptions.ObjObjectNames.ObjectAsGroup
Rhino Object names are exported as OBJ groups

Rhino.FileIO.FileObjWriteOptions.ObjObjectNames.ObjectAsObject
Rhino Object names are exported as OBJ objects