Rhino.Runtime.InteropWrappers.SimpleArraySubDPointer
Wrapper for a C++ ON_SimpleArray<ON_SubD*> or ON_SimpleArray<constant ON_SubD*>
If you are not writing C++ code then this class is not for you.

Rhino.Runtime.InteropWrappers.SimpleArraySubDPointer.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.
Since: 7.14

Rhino.Runtime.InteropWrappers.SimpleArraySubDPointer.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.
Since: 7.14

Rhino.Runtime.InteropWrappers.SimpleArraySubDPointer.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArraySubDPointer instance.
Since: 7.14

Rhino.Runtime.InteropWrappers.SimpleArraySubDPointer.Count
Gets the amount of subds in this array.
Since: 7.14

Rhino.Runtime.InteropWrappers.SimpleArraySubDPointer.Add(Rhino.Geometry.SubD,System.Boolean)
Adds a subd to the list.
subd: A subd to add.
asConst: Whether this subd should be treated as non-modifiable.
Since: 7.14

Rhino.Runtime.InteropWrappers.SimpleArraySubDPointer.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.SimpleArraySubDPointer.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 7.14

Rhino.Runtime.InteropWrappers.SimpleArraySubDPointer.Dispose(System.Boolean)
disposing:

Rhino.Runtime.InteropWrappers.SimpleArraySubDPointer.ToNonConstArray
Copies the unmanaged array to a managed counterpart.
Returns: The managed array.
Since: 7.14