Rhino.UI.Controls.ThumbnailUI.IRhRdkContentThumbnail.TopLevelContent
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.IRhRdkContentThumbnail.ChildContent
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.IRhRdkContentThumbnail.GroupId
Since: 6.0
6.6