Rhino.PlugIns.PlugInInfo
Contains detailed information about a Rhino plug-in.

Rhino.PlugIns.PlugInInfo.#ctor(System.IntPtr)
Internal constructor

Rhino.PlugIns.PlugInInfo.Id
Returns the plug-in's Id.
Since: 6.0

Rhino.PlugIns.PlugInInfo.RegistryPath
Returns the plug-in's Windows Registry path.
Since: 6.0

Rhino.PlugIns.PlugInInfo.Name
Returns the plug-in's name.
Since: 6.0

Rhino.PlugIns.PlugInInfo.Description
Returns the plug-in's description.
Since: 6.0

Rhino.PlugIns.PlugInInfo.ConvertIconToBitmap(System.Drawing.Icon,System.Drawing.Size)
When converting an icon to a bitmap, using Icon.ToBitmap(), the transparent areas
of the icon are lost. Thus function works a bit better.
icon: The icon to convert.
size: The size of the icon in pixels.
Returns: The bitmap if successful, null otherwise.

Rhino.PlugIns.PlugInInfo.Icon(System.Drawing.Size)
Returns the plug-in's icon in bitmap form.
Since: 6.0

Rhino.PlugIns.PlugInInfo.FileName
Returns the plug-in's file name.
Since: 6.0

Rhino.PlugIns.PlugInInfo.Version
Returns the plug-in's version.
Since: 6.0

Rhino.PlugIns.PlugInInfo.Organization
Returns the organization or company that created the plug-in.
Since: 6.0

Rhino.PlugIns.PlugInInfo.Address
Returns the address of the organization or company that created the plug-in.
Since: 6.0

Rhino.PlugIns.PlugInInfo.Country
Returns the country of the organization or company that created the plug-in.
Since: 6.0

Rhino.PlugIns.PlugInInfo.Email
Returns the email address of the organization or company that created the plug-in.
Since: 6.0

Rhino.PlugIns.PlugInInfo.Phone
Returns the phone number of the organization or company that created the plug-in.
Since: 6.0

Rhino.PlugIns.PlugInInfo.Fax
Returns the fax number of the organization or company that created the plug-in.
Since: 6.0

Rhino.PlugIns.PlugInInfo.WebSite
Returns the web site, or URL, of the organization or company that created the plug-in.
Since: 6.0

Rhino.PlugIns.PlugInInfo.UpdateUrl
Returns the web site, or URL, were an updated version of the plug-in can be found.
Since: 6.0

Rhino.PlugIns.PlugInInfo.PlugInType
Returns the plug-in type.
Since: 6.0

Rhino.PlugIns.PlugInInfo.PlugInLoadTime
Returns the plug-in's load time.
Since: 6.0

Rhino.PlugIns.PlugInInfo.IsLoaded
Returns true if the plug-in is loaded, false otherwise.
Since: 6.0

Rhino.PlugIns.PlugInInfo.IsLoadProtected(System.Boolean@)
Returns the load protection state for a plug-in
loadSilently: The plug-in's load silently state.
Returns: true if the plug-in is load protected, false otherwise.
Since: 6.0

Rhino.PlugIns.PlugInInfo.ShipsWithRhino
Returns true if the plug-in ships with Rhino, false otherwise.
Since: 6.0

Rhino.PlugIns.PlugInInfo.IsDotNet
Returns true if the plug-in is based on .NET, false otherwise.
Since: 6.0

Rhino.PlugIns.PlugInInfo.CommandNames
Returns a plug-in's English command names.
Since: 6.0

Rhino.PlugIns.PlugInInfo.FileTypeDescriptions
Returns the description of supported file types for file import and file export plug-in.
Since: 6.0

Rhino.PlugIns.PlugInInfo.FileTypeExtensions
Returns the file types extensions supported for file import and file export plug-in.
Since: 7.0