Rhino.Geometry.Point3d
Represents the three coordinates of a point in three-dimensional space,
using System.Double-precision floating point values.

Rhino.Geometry.Point3d.#ctor(System.Double,System.Double,System.Double)
Initializes a new point by defining the X, Y and Z coordinates.
x: The value of the X (first) coordinate.
y: The value of the Y (second) coordinate.
z: The value of the Z (third) coordinate.
Since: 5.0

Rhino.Geometry.Point3d.#ctor(Rhino.Geometry.Vector3d)
Initializes a new point by copying coordinates from the components of a vector.
vector: A vector.
Since: 5.0

Rhino.Geometry.Point3d.#ctor(Rhino.Geometry.Point3f)
Initializes a new point by copying coordinates from a single-precision point.
point: A point.
Since: 5.0

Rhino.Geometry.Point3d.#ctor(Rhino.Geometry.Point3d)
Initializes a new point by copying coordinates from another point.
point: A point.
Since: 5.0

Rhino.Geometry.Point3d.#ctor(Rhino.Geometry.Point4d)
Initializes a new point by copying coordinates from a four-dimensional point.
The first three coordinates are divided by the last one.
If the W (fourth) dimension of the input point is zero, then it will be just discarded.
point: A point.
Since: 5.0

Rhino.Geometry.Point3d.Origin
Gets the value of a point at location 0,0,0.
Since: 5.0

Rhino.Geometry.Point3d.Unset
Gets the value of a point at location RhinoMath.UnsetValue,RhinoMath.UnsetValue,RhinoMath.UnsetValue.
Since: 5.0

Rhino.Geometry.Point3d.op_Multiply(Rhino.Geometry.Point3d,System.Double)
Multiplies a Rhino.Geometry.Point3d by a number.
point: A point.
t: A number.
Returns: A new point that is coordinate-wise multiplied by t.
Since: 5.0

Rhino.Geometry.Point3d.Multiply(Rhino.Geometry.Point3d,System.Double)
Multiplies a Rhino.Geometry.Point3d by a number.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
point: A point.
t: A number.
Returns: A new point that is coordinate-wise multiplied by t.
Since: 5.0

Rhino.Geometry.Point3d.op_Multiply(System.Double,Rhino.Geometry.Point3d)
Multiplies a Rhino.Geometry.Point3d by a number.
point: A point.
t: A number.
Returns: A new point that is coordinate-wise multiplied by t.
Since: 5.0

Rhino.Geometry.Point3d.Multiply(System.Double,Rhino.Geometry.Point3d)
Multiplies a Rhino.Geometry.Point3d by a number.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
point: A point.
t: A number.
Returns: A new point that is coordinate-wise multiplied by t.
Since: 5.0

Rhino.Geometry.Point3d.op_Division(Rhino.Geometry.Point3d,System.Double)
Divides a Rhino.Geometry.Point3d by a number.
point: A point.
t: A number.
Returns: A new point that is coordinate-wise divided by t.
Since: 5.0

Rhino.Geometry.Point3d.Divide(Rhino.Geometry.Point3d,System.Double)
Divides a Rhino.Geometry.Point3d by a number.
(Provided for languages that do not support operator overloading. You can use the / operator otherwise)
point: A point.
t: A number.
Returns: A new point that is coordinate-wise divided by t.
Since: 5.0

Rhino.Geometry.Point3d.op_Addition(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Sums two Rhino.Geometry.Point3d instances.
point1: A point.
point2: A point.
Returns: A new point that results from the addition of point1 and point2.

Rhino.Geometry.Point3d.Add(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Sums two Rhino.Geometry.Point3d instances.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
point1: A point.
point2: A point.
Returns: A new point that results from the addition of point1 and point2.
Since: 5.0

Rhino.Geometry.Point3d.op_Addition(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)
Sums up a point and a vector, and returns a new point.
point: A point.
vector: A vector.
Returns: A new point that results from the addition of point and vector.

Rhino.Geometry.Point3d.Add(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)
Sums up a point and a vector, and returns a new point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
point: A point.
vector: A vector.
Returns: A new point that results from the addition of point and vector.
Since: 5.0

Rhino.Geometry.Point3d.op_Addition(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3f)
Sums up a point and a vector, and returns a new point.
point: A point.
vector: A vector.
Returns: A new point that results from the addition of point and vector.

Rhino.Geometry.Point3d.Add(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3f)
Sums up a point and a vector, and returns a new point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
point: A point.
vector: A vector.
Returns: A new point that results from the addition of point and vector.
Since: 5.0

Rhino.Geometry.Point3d.op_Addition(Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Sums up a point and a vector, and returns a new point.
vector: A vector.
point: A point.
Returns: A new point that results from the addition of point and vector.

Rhino.Geometry.Point3d.Add(Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Sums up a point and a vector, and returns a new point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
vector: A vector.
point: A point.
Returns: A new point that results from the addition of point and vector.
Since: 5.0

Rhino.Geometry.Point3d.op_Subtraction(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)
Subtracts a vector from a point.
point: A point.
vector: A vector.
Returns: A new point that is the difference of point minus vector.
Since: 5.0

Rhino.Geometry.Point3d.Subtract(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)
Subtracts a vector from a point.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
vector: A vector.
point: A point.
Returns: A new point that is the difference of point minus vector.
Since: 5.0

Rhino.Geometry.Point3d.op_Subtraction(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Subtracts a point from another point.
point1: A point.
point2: Another point.
Returns: A new vector that is the difference of point minus vector.
Since: 5.0

Rhino.Geometry.Point3d.Subtract(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Subtracts a point from another point.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
point1: A point.
point2: Another point.
Returns: A new vector that is the difference of point minus vector.
Since: 5.0

Rhino.Geometry.Point3d.op_UnaryNegation(Rhino.Geometry.Point3d)
Computes the additive inverse of all coordinates in the point, and returns the new point.
point: A point.
Returns: A point value that, when summed with the point input, yields the Rhino.Geometry.Point3d.Origin.
Since: 5.0

Rhino.Geometry.Point3d.op_Equality(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Determines whether two Point3d have equal values.
a: The first point.
b: The second point.
Returns: true if the coordinates of the two points are exactly equal; otherwise false.
Since: 5.0

Rhino.Geometry.Point3d.op_Inequality(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Determines whether two Point3d have different values.
a: The first point.
b: The second point.
Returns: true if the two points differ in any coordinate; false otherwise.
Since: 5.0

Rhino.Geometry.Point3d.op_Implicit(Rhino.Geometry.Point3d)~Rhino.Geometry.ControlPoint
Converts a point in a control point, without needing casting.
pt: The point.
Returns: The control point.

Rhino.Geometry.Point3d.op_Explicit(Rhino.Geometry.Point3d)~Rhino.Geometry.Vector3d
Converts a point in a vector, needing casting.
point: A point.
Returns: The resulting vector.

Rhino.Geometry.Point3d.op_Explicit(Rhino.Geometry.Vector3d)~Rhino.Geometry.Point3d
Converts a vector in a point, needing casting.
vector: A vector.
Returns: The resulting point.

Rhino.Geometry.Point3d.op_Implicit(Rhino.Geometry.Point3f)~Rhino.Geometry.Point3d
Converts a single-precision point in a double-precision point, without needing casting.
point: A point.
Returns: The resulting point.

Rhino.Geometry.Point3d.FromPoint3f(Rhino.Geometry.Point3f)
Converts a single-precision point in a double-precision point.
point: A point.
Returns: The resulting point.
Since: 6.0

Rhino.Geometry.Point3d.op_LessThan(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Determines whether the first specified point comes before (has inferior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y, then Z.
a: The first point.
b: The second point.
Returns: true if a.X is smaller than b.X,
or a.X == b.X and a.Y is smaller than b.Y,
or a.X == b.X and a.Y == b.Y and a.Z is smaller than b.Z;
otherwise, false.
Since: 5.0

Rhino.Geometry.Point3d.op_LessThanOrEqual(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Determines whether the first specified point comes before
(has inferior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y, then Z.
a: The first point.
b: The second point.
Returns: true if a.X is smaller than b.X,
or a.X == b.X and a.Y is smaller than b.Y,
or a.X == b.X and a.Y == b.Y and a.Z <= b.Z;
otherwise, false.
Since: 5.0

Rhino.Geometry.Point3d.op_GreaterThan(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Determines whether the first specified point comes after (has superior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y, then Z.
a: The first point.
b: The second point.
Returns: true if a.X is larger than b.X,
or a.X == b.X and a.Y is larger than b.Y,
or a.X == b.X and a.Y == b.Y and a.Z is larger than b.Z;
otherwise, false.
Since: 5.0

Rhino.Geometry.Point3d.op_GreaterThanOrEqual(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Determines whether the first specified point comes after
(has superior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y, then Z.
a: The first point.
b: The second point.
Returns: true if a.X is larger than b.X,
or a.X == b.X and a.Y is larger than b.Y,
or a.X == b.X and a.Y == b.Y and a.Z >= b.Z;
otherwise, false.
Since: 5.0

Rhino.Geometry.Point3d.X
Gets or sets the X (first) coordinate of this point.
Since: 5.0

Rhino.Geometry.Point3d.Y
Gets or sets the Y (second) coordinate of this point.
Since: 5.0

Rhino.Geometry.Point3d.Z
Gets or sets the Z (third) coordinate of this point.
Since: 5.0

Rhino.Geometry.Point3d.Item(System.Int32)
Gets or sets an indexed coordinate of this point.
index:
The coordinate index. Valid values are:
0 = X coordinate
1 = Y coordinate
2 = Z coordinate
.

Rhino.Geometry.Point3d.IsValid
Each coordinate of the point must pass the Rhino.RhinoMath.IsValidDouble(System.Double) test.
Since: 5.0

Rhino.Geometry.Point3d.MinimumCoordinate
Gets the smallest (both positive and negative) coordinate value in this point.
Since: 5.0

Rhino.Geometry.Point3d.MaximumCoordinate
Gets the largest (both positive and negative) valid coordinate in this point,
or RhinoMath.UnsetValue if no coordinate is valid, as an absolute value.
Since: 5.0

Rhino.Geometry.Point3d.Equals(System.Object)
Determines whether the specified System.Object is a Rhino.Geometry.Point3d and has the same values as the present point.
obj: The specified object.
Returns: true if obj is a Point3d and has the same coordinates as this; otherwise false.

Rhino.Geometry.Point3d.EpsilonEquals(Rhino.Geometry.Point3d,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:
Since: 5.4

Rhino.Geometry.Point3d.CompareTo(Rhino.Geometry.Point3d)
Compares this Rhino.Geometry.Point3d with another Rhino.Geometry.Point3d.
Component evaluation priority is first X, then Y, then Z.
other: The other Rhino.Geometry.Point3d to use in comparison.
Returns:
0: if this is identical to other
-1: if this.X < other.X
-1: if this.X == other.X and this.Y < other.Y
-1: if this.X == other.X and this.Y == other.Y and this.Z < other.Z
+1: otherwise.
Since: 5.0

Rhino.Geometry.Point3d.Equals(Rhino.Geometry.Point3d)
Determines whether the specified Rhino.Geometry.Point3d has the same values as the present point.
point: The specified point.
Returns: true if point has the same coordinates as this; otherwise false.
Since: 5.0

Rhino.Geometry.Point3d.GetHashCode
Computes a hash code for the present point.
Returns: A non-unique integer that represents this point.

Rhino.Geometry.Point3d.Interpolate(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
Interpolate between two points.
pA: First point.
pB: Second point.
t: Interpolation parameter.
If t=0 then this point is set to pA.
If t=1 then this point is set to pB.
Values of t in between 0.0 and 1.0 result in points between pA and pB.
Since: 5.0

Rhino.Geometry.Point3d.ToString
Constructs the string representation for the current point.
Returns: The point representation in the form X,Y,Z.

Rhino.Geometry.Point3d.ToString(System.String,System.IFormatProvider)
Since: 7.0

Rhino.Geometry.Point3d.FormatCoordinates(System.String,System.IFormatProvider,System.Double[])
Utility method for formatting coordinate groups.

Rhino.Geometry.Point3d.IsCommaLikeText(System.String)
Test whether a string contains any char which looks like a comma.

Rhino.Geometry.Point3d.IsCommaLikeChar(System.Char)
Test whether a char looks like a comma.

Rhino.Geometry.Point3d.DistanceTo(Rhino.Geometry.Point3d)
Computes the distance between two points.
other: Other point for distance measurement.
Returns: The length of the line between this and the other point; or 0 if any of the points is not valid.
Since: 5.0

Rhino.Geometry.Point3d.DistanceToSquared(Rhino.Geometry.Point3d)
Computes the square of the distance between two points.
This method is usually largely faster than DistanceTo().
other: Other point for squared distance measurement.
Returns: The squared length of the line between this and the other point; or 0 if any of the points is not valid.
Since: 6.0

Rhino.Geometry.Point3d.Transform(Rhino.Geometry.Transform)
Transforms the present point in place. The transformation matrix acts on the left of the point. i.e.,
result = transformation*point
xform: Transformation to apply.
Since: 5.0

Rhino.Geometry.Point3d.CullDuplicates(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Double)
Removes duplicates in the supplied set of points.
points: A list, an array or any enumerable of Rhino.Geometry.Point3d.
tolerance: The minimum distance between points.
Points that fall within this tolerance will be discarded.
.
Returns: An array of points without duplicates; or null on error.
Since: 5.0

Rhino.Geometry.Point3d.ArePointsCoplanar(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Double)
Determines whether a set of points is coplanar within a given tolerance.
points: A list, an array or any enumerable of Rhino.Geometry.Point3d.
tolerance: A tolerance value. A default might be RhinoMath.ZeroTolerance.
Returns: true if points are on the same plane; false otherwise.
Since: 5.0

Rhino.Geometry.Point3d.TryParse(System.String,Rhino.Geometry.Point3d@)
Converts the string representation of a point to the equivalent Point3d structure.
input: The point to convert.
result: The structure that will contain the parsed value.
Returns: true if successful, false otherwise.
Since: 6.12

Rhino.Geometry.Point3d.SortAndCullPointList(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Double)
Orders a set of points so they will be connected in a "reasonable polyline" order.
Also, removes points from the list if their common distance exceeds a specified threshold.
points: A list, an array or any enumerable of Rhino.Geometry.Point3d.
minimumDistance: Minimum allowed distance among a pair of points. If points are closer than this, only one of them will be kept.
Returns: The new array of sorted and culled points.
Since: 5.0