Rhino.Geometry.SubDEdgeChain
An ordered run of connected SubD edges.
Consecutive edges in a chain share a vertex, and each edge carries the direction it is
traversed with, so the chain has a start and an end even when the individual edges do
not agree on orientation. Chains are what commands like Bridge, Loft and edge
sharpening operate on.
Remarks:
A chain holds a reference to its SubD and does not keep it alive across edits that
change the SubD topology; rebuild the chain after editing.
Since: 8.36

Rhino.Geometry.SubDEdgeChain.#ctor(Rhino.Geometry.SubD)
Creates an empty chain in the given SubD.
subd: The SubD the chain will run through.
Since: 8.36

Rhino.Geometry.SubDEdgeChain.#ctor(Rhino.Geometry.SubD,Rhino.Geometry.SubDEdge)
Creates a chain containing a single starting edge. Grow it with
Rhino.Geometry.SubDEdgeChain.AddAllNeighbors(Rhino.Geometry.ChainDirection,Rhino.Geometry.SubDChainType) or
Rhino.Geometry.SubDEdgeChain.AddOneNeighbor(Rhino.Geometry.ChainDirection,Rhino.Geometry.SubDChainType).
subd: The SubD the chain runs through.
startEdge: The edge to start from.
Since: 8.36

Rhino.Geometry.SubDEdgeChain.ParentSubD
The SubD this chain runs through.
Since: 8.36

Rhino.Geometry.SubDEdgeChain.Begin(Rhino.Geometry.SubDEdge)
Clears the chain and restarts it from a single edge.
startEdge: The edge to start from.
Returns: The number of edges in the chain, so 1 on success and 0 on failure.
Since: 8.36

Rhino.Geometry.SubDEdgeChain.EdgeCount
The number of edges in this chain.
Since: 8.36

Rhino.Geometry.SubDEdgeChain.IsClosedLoop
True when the chain closes back on itself.
Since: 8.36

Rhino.Geometry.SubDEdgeChain.IsConvexLoop(System.Boolean)
True when the chain is a closed loop that is convex.
strictlyConvex:
If true, a loop with three or more colinear points in a row is not convex.
Since: 8.36

Rhino.Geometry.SubDEdgeChain.EdgeAt(System.Int32)
Gets the edge at the given position in the chain. The returned edge carries the
direction the chain traverses it with, in
Rhino.Geometry.SubDComponent.ComponentDirection.
index: The position in the chain.
Returns: The edge, or null if index is out of range.
Since: 8.36

Rhino.Geometry.SubDEdgeChain.VertexAt(System.Int32)
Gets the vertex at the given position along the chain. A chain of N edges has N+1
vertices, or N when it is a closed loop.
index: The position along the chain.
Returns: The vertex, or null if index is out of range.
Since: 8.36

Rhino.Geometry.SubDEdgeChain.Edges
The edges of this chain, in order.
Since: 8.36

Rhino.Geometry.SubDEdgeChain.Reverse
Reverses the direction of the chain.
Since: 8.36

Rhino.Geometry.SubDEdgeChain.Clear
Removes every edge from the chain.
Since: 8.36

Rhino.Geometry.SubDEdgeChain.AddOneNeighbor(Rhino.Geometry.ChainDirection,Rhino.Geometry.SubDChainType)
Extends the chain by one edge at one or both ends.
direction: Which end or ends to extend.
chainType: Which edges and vertices the chain is allowed through.
Returns: The number of edges that were added.
Since: 8.36

Rhino.Geometry.SubDEdgeChain.AddAllNeighbors(Rhino.Geometry.ChainDirection,Rhino.Geometry.SubDChainType)
Extends the chain as far as it will go at one or both ends.
direction: Which end or ends to extend.
chainType: Which edges and vertices the chain is allowed through.
Returns: The number of edges that were added.
Since: 8.36

Rhino.Geometry.SubDEdgeChain.AddEdge(Rhino.Geometry.SubDEdge)
Adds an edge to whichever end of the chain it connects to.
edge: The edge to add.
Returns:
The number of edges that were added, so 1 on success and 0 if the edge does not
connect to either end, is already in the chain, or the chain is empty.
Remarks:
This cannot start a chain: adding to an empty chain does nothing and returns 0.
Use Rhino.Geometry.SubDEdgeChain.Begin(Rhino.Geometry.SubDEdge) or the
Rhino.Geometry.SubDEdgeChain.#ctor(Rhino.Geometry.SubD,Rhino.Geometry.SubDEdge) constructor for the first edge.
Since: 8.36

Rhino.Geometry.SubDEdgeChain.TrimToRange(Rhino.Geometry.SubDEdge,Rhino.Geometry.SubDEdge)
Trims the chain down to the run of edges between firstEdge and lastEdge, removing
everything before firstEdge and everything after lastEdge.
firstEdge:
The edge to keep as the new start of the chain. Pass null to keep the current start.
lastEdge:
The edge to keep as the new end of the chain. Pass null to keep the current end.
Returns: The number of edges that were removed.
Remarks:
This wraps ON_SubDEdgeChain::RemoveEdges, whose name reads as though the given
range is what gets removed. It is the other way round: the range is what survives.
Passing null for both edges therefore removes nothing and returns 0; use
Rhino.Geometry.SubDEdgeChain.Clear to empty the chain.
Since: 8.36

Rhino.Geometry.SubDEdgeChain.SortEdgesIntoEdgeChains(Rhino.Geometry.SubD,System.Collections.Generic.IEnumerable{Rhino.Geometry.SubDEdge})
Sorts a set of edges into chains.
subd: The SubD the edges belong to.
edges:
The edges to sort. Where three or more of them meet at one vertex, no chain passes
through that vertex.
Returns:
One array of edges per chain, in chain order. Each returned edge carries the
direction its chain traverses it with.
Remarks:
This uses the mark bits on the edges and vertices involved, so it must not run on
the same SubD from more than one thread at a time.
Since: 8.36

Rhino.Geometry.SubDEdgeChain.ToNurbsCurve
Gets a NURBS curve on the SubD surface following this chain.
Returns: The curve, or null if the chain is not valid.
Since: 8.36

Rhino.Geometry.SubDEdgeChain.ToLoftCurve
Gets a NURBS curve suitable for lofting SubDs, following this chain.
Returns: The curve, or null if the chain is not valid.
Since: 8.36

Rhino.Geometry.SubDEdgeChain.Dispose
Frees the unmanaged chain.
Since: 8.36

Rhino.Geometry.SubDEdgeChain.Finalize
Finalizer.