Rhino.Geometry.MeshPipeCapStyle
Enumerates methods to end a mesh pipe.

Rhino.Geometry.MeshPipeCapStyle.None
Capping is skipped. The resulting object will be simpler.

Rhino.Geometry.MeshPipeCapStyle.Flat
A flat surface will cap the pipe.

Rhino.Geometry.MeshPipeCapStyle.Box
A simple construction will cap the pipe.

Rhino.Geometry.MeshPipeCapStyle.Dome
A meridians-and-parallels hemisphere construction will cap the pipe.