Rhino.Collections.RhinoList
Provides helper methods to work with Rhino.Collections.RhinoList`1 and other collections.

Rhino.Collections.RhinoList.PointCloudKNeighbors(Rhino.Geometry.PointCloud,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32)
Finds a certain amount of points in a list of 3D points that are the k-closest to a test point.
This method searches needlePoints by computing all distances from each point cloud point and keeping a short list.
pointcloud: A point cloud to be searched.
needlePoints: Points to search for.
amount: The required amount of closest neighbors to find.
Returns: An enumerable of arrays of indices; each array contains the indices for each of the needlePts.
Rhino.Geometry.RTree.PointCloudKNeighbors(Rhino.Geometry.PointCloud,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32)
Since: 6.0

Rhino.Collections.RhinoList.Point3dKNeighbors(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32)
Finds a certain amour of points in a list of 3D points that are the k-closest to a test point.
This method searches needlePoints by computing all distances from each point cloud point and keeping a "short list".
See RTree KNeighbors for alternatives.
hayPoints: A point cloud to be searched.
needlePoints: Points to search for.
amount: The required amount of closest neighbors to find.
Returns: An enumerable of arrays of indices; each array contains the indices for each of the needlePts.
Rhino.Geometry.RTree.Point3dKNeighbors(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32)
Since: 6.0

Rhino.Collections.RhinoList.Point3fKNeighbors(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3f},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3f},System.Int32)
Finds a certain amour of points in a list of single-precision 3D points that are the k-closest to a test point.
This method searches needlePoints by computing all distances from each point cloud point and keeping a "short list".
hayPoints: A point cloud to be searched.
needlePoints: Points to search for.
amount: The required amount of closest neighbors to find.
Returns: An enumerable of arrays of indices; each array contains the indices for each of the needlePts.
Rhino.Geometry.RTree.Point3dKNeighbors(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32)
Since: 6.0

Rhino.Collections.RhinoList.Point2dKNeighbors(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d},System.Int32)
Finds a certain amour of points in a list of single-precision 2D points that are the k-closest to a test point.
This method searches needlePoints by computing all distances from each point cloud point and keeping a "short list".
hayPoints: A point cloud to be searched.
needlePoints: Points to search for.
amount: The required amount of closest neighbors to find.
Returns: An enumerable of arrays of indices; each array contains the indices for each of the needlePts.
Rhino.Geometry.RTree.Point3dKNeighbors(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32)
Since: 6.0

Rhino.Collections.RhinoList.Point2fKNeighbors(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2f},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2f},System.Int32)
Finds a certain amour of points in a list of single-precision 2D points that are the k-closest to a test point.
This method searches needlePoints by computing all distances from each point cloud point and keeping a "short list".
hayPoints: A point cloud to be searched.
needlePoints: Points to search for.
amount: The required amount of closest neighbors to find.
Returns: An enumerable of arrays of indices; each array contains the indices for each of the needlePts.
Rhino.Geometry.RTree.Point3dKNeighbors(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32)
Since: 6.0

Rhino.Collections.RhinoList.KNeighbors``1(System.Collections.Generic.IEnumerable{``0},System.Collections.Generic.IEnumerable{``0},System.Int32)
T must be of type Point3d, Vector3d, Point3f, Vector3f, Point, Point2d, Vector2d, Point2f, Vector2f or Point4d.