Rhino.FileIO.CommonComponentTable`1
Provides a base table type that encompasses all document tables, both in RhinoDoc and File3dm.
A model component.

Rhino.FileIO.CommonComponentTable`1.Count
Returns the count of all items, including deleted ones.

Rhino.FileIO.CommonComponentTable`1.GetEnumerator
Returns the enumerator that yields all items.
Returns:

Rhino.FileIO.CommonComponentTable`1.Delete(`0)
Deletes an item. Items that are deleted are still keeping their space, but the 'IsDeleted' flag is checked.
item: An item to delete.
Returns: True if an items could be deleted (e.g., it was not locked).

Rhino.FileIO.CommonComponentTable`1.ComponentType
Returns the actual component type of a table.

Rhino.FileIO.CommonComponentTable`1.FindId(System.Guid)
Uses the guid to find a model component. Deleted objects cannot be found by id.
The guid is the value that is stored in the .Id property.
In a single document, no two active objects have the same guid. If an object is
replaced with a new object, then the guid  persists. For example, if the _Move command
moves an object, then the moved object inherits its guid from the starting object.
If the Copy command copies an object, then the copy gets a new guid. This guid persists
through file saving/opening operations. This function will not find grip objects.
id: ID of model component to search for.
Returns: Reference to the rhino object with the objectId or null if no such object could be found.

Rhino.FileIO.CommonComponentTable`1.__FindIndexInternal(System.Int32)
This is internal so that we can choose when to deliver the functionality for each table.
Object, history and instance tables have no indices.

Rhino.FileIO.CommonComponentTable`1.Rhino#FileIO#ICommonComponentTable{T}#FindNameHash(Rhino.FileIO.NameHash)
Uses the hash of the name to find a model component.
Deleted objects have no name.
nameHash: NameHash of model component to search for.
Returns: Reference to the rhino object or null if no such object could be found.

Rhino.FileIO.CommonComponentTable`1.Clear
Marks all items as deleted.