Rhino.Display.DisplayPipelineAttributes
Represents display pipeline settings, such as "show transparency" and "show grips".

Rhino.Display.DisplayPipelineAttributes.#ctor(System.IntPtr,System.Boolean)
Use this constructor if attributes shouldn't be fully disposed (i.e.
not owned by this instance)

Rhino.Display.DisplayPipelineAttributes.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Since: 5.0

Rhino.Display.DisplayPipelineAttributes.Dispose
Since: 5.0

Rhino.Display.DisplayPipelineAttributes.XrayAllObjects
Since: 5.0

Rhino.Display.DisplayPipelineAttributes.IgnoreHighlights
Since: 5.0

Rhino.Display.DisplayPipelineAttributes.DisableConduits
Since: 5.0

Rhino.Display.DisplayPipelineAttributes.DisableTransparency
Since: 5.0

Rhino.Display.DisplayPipelineAttributes.ObjectColor
Since: 5.0

Rhino.Display.DisplayPipelineAttributes.ShowGrips
Since: 5.0

Rhino.Display.DisplayPipelineAttributes.FillMode
Get or set the frame buffer fill mode.
Since: 6.0

Rhino.Display.DisplayPipelineAttributes.SetFill(System.Drawing.Color)
Set fill mode to solid color and set the fill color
singleColor:
Since: 6.23

Rhino.Display.DisplayPipelineAttributes.SetFill(System.Drawing.Color,System.Drawing.Color)
Set fill mode to two color and set the colors
gradientTop:
gradientBottom:
Since: 6.23

Rhino.Display.DisplayPipelineAttributes.SetFill(System.Drawing.Color,System.Drawing.Color,System.Drawing.Color,System.Drawing.Color)
Set the fill mode to four color gradient and set the colors
gradientTopLeft:
gradientBottomLeft:
gradientTopRight:
gradientBottomRight:
Since: 6.23

Rhino.Display.DisplayPipelineAttributes.GetFill(System.Drawing.Color@,System.Drawing.Color@,System.Drawing.Color@,System.Drawing.Color@)
Get fill colors used for clearing the frame buffer
topLeft:
bottomLeft:
topRight:
bottomRight:
Since: 6.23

Rhino.Display.DisplayPipelineAttributes.BoundingBoxMode
Since: 6.1

Rhino.Display.DisplayPipelineAttributes.ShowClippingPlanes
Show clipping planes.
Since: 6.4

Rhino.Display.DisplayPipelineAttributes.ShowClipIntersectionSurfaces
Show fills where clipping planes clip solid objects
Since: 8.0

Rhino.Display.DisplayPipelineAttributes.ShowClipIntersectionEdges
Show edges and hatches where clipping planes clip objects
Since: 8.0

Rhino.Display.DisplayPipelineAttributes.ViewSpecificAttributes
Since: 5.0

Rhino.Display.DisplayPipelineAttributes.UseAssignedObjectMaterial
Gets or sets whether objects ought to be drawn using their assigned rendering material.
Since: 6.0

Rhino.Display.DisplayPipelineAttributes.UseCustomObjectColor
Gets or sets whether objects ought to be drawn using a custom color.
Since: 6.0

Rhino.Display.DisplayPipelineAttributes.UseCustomObjectMaterial
Gets or sets whether objects ought to be drawn using a custom material.
Since: 6.0

Rhino.Display.DisplayPipelineAttributes.UseCustomObjectColorBackfaces
Gets or sets whether objects ought to be drawn using a custom color for back faces.
Since: 7.1

Rhino.Display.DisplayPipelineAttributes.UseCustomObjectMaterialBackfaces
Gets or sets whether objects ought to be drawn using a custom material on backfaces.
Since: 7.1

Rhino.Display.DisplayPipelineAttributes.BackfaceDisplayStyle
Changes the display of the backfaces (the side opposite of the surface normal direction).
Since: 8.20

Rhino.Display.DisplayPipelineAttributes.UseBackfaceMaterial
Use the backface material for displaying backfaces.
Since: 8.20

Rhino.Display.DisplayPipelineAttributes.UseObjectBackfaceMaterial
Use the backface material of the object for displaying its backfaces.
Since: 8.20

Rhino.Display.DisplayPipelineAttributes.UseCustomBackface
Use a custom material for displaying backfaces.
Since: 8.20

Rhino.Display.DisplayPipelineAttributes.ShowCurves
Draw curves
Since: 5.1

Rhino.Display.DisplayPipelineAttributes.UseSingleCurveColor
Use a single color for drawing curves
Since: 6.3

Rhino.Display.DisplayPipelineAttributes.CurveThicknessUsage
Use a pixel thickness (CurveThickness) or a scale thickness (CurveThicknessScale)
Since: 8.4

Rhino.Display.DisplayPipelineAttributes.SetCurveThicknessUsage(Rhino.Display.DisplayPipelineAttributes.CurveThicknessUse)
Sets usage, pixel thickness (CurveThickness) or a scale thickness (CurveThicknessScale)
Since: 8.7

Rhino.Display.DisplayPipelineAttributes.GetCurveThicknessUsage
Gets current usage, pixel thickness (CurveThickness) or a scale thickness (CurveThicknessScale)
Since: 8.7

Rhino.Display.DisplayPipelineAttributes.CurveThickness
Pixel thickness for curves
Since: 5.1

Rhino.Display.DisplayPipelineAttributes.CurveThicknessScale
Scale thickness for curves
Since: 8.4

Rhino.Display.DisplayPipelineAttributes.CurveColor
Color used for drawing curves
Since: 5.1

Rhino.Display.DisplayPipelineAttributes.ShadingEnabled
Draw shaded meshes and surfaces
Since: 5.1

Rhino.Display.DisplayPipelineAttributes.ShadeVertexColors
Shade using vertex colors.
Since: 6.4

Rhino.Display.DisplayPipelineAttributes.ShowIsoCurves
Draw surface ISO curves.
Since: 6.4

Rhino.Display.DisplayPipelineAttributes.ShowSurfaceEdges
Show surface edges.
Since: 6.4

Rhino.Display.DisplayPipelineAttributes.ShowTangentEdges
Show tangent edges.
Since: 6.4

Rhino.Display.DisplayPipelineAttributes.ShowTangentSeams
Show tangent seams.
Since: 6.4

Rhino.Display.DisplayPipelineAttributes.SurfaceEdgeThickness
Thickness for surface edges
Since: 6.1

Rhino.Display.DisplayPipelineAttributes.GetSurfaceEdgeThicknessUsage
Helper function for setting the SurfaceEdgeThicknessFlags
Returns:
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.SetSurfaceEdgeThicknessUsage(Rhino.Display.DisplayPipelineAttributes.SurfaceThicknessUse)
Helper function for getting the SurfaceEdgeThicknessFlags
Returns:
Since: 8.10

Rhino.Display.DisplayPipelineAttributes.SetSurfaceNakedEdgeThicknessUsage(Rhino.Display.DisplayPipelineAttributes.SurfaceNakedEdgeThicknessUse)
This is a helper function that combines setting SurfaceNakeEdgeUseNormalThickness and SurfaceNakedEdgeThicknessUsageFlags settings to correspond
to the behavor of the Settings page.
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.GetSurfaceNakedEdgeThicknessUsage
This is a helper function that combines getting SurfaceNakeEdgeUseNormalThickness and SurfaceNakedEdgeThicknessUsageFlags settings to correspond
to the behavor of the Settings page.
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.SetSurfaceIsoThicknessUsage(Rhino.Display.DisplayPipelineAttributes.SurfaceIsoThicknessUse)
This is a helper function that combines setting IsoThicknessUsed and SurfaceNakedEdgeThicknessUsageFlags settings to correspond
to the behavor of the Settings page.
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.GetSurfaceIsoThicknessUsage
This is a helper function that combines getting IsoThicknessUsed and SurfaceNakedEdgeThicknessUsageFlags settings to correspond
to the behavor of the Settings page.
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.SetSurfaceIsoApplyPattern(System.Boolean,System.Boolean,System.Boolean)
u:
v:
w:
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.GetSurfaceIsoApplyPattern(System.Boolean@,System.Boolean@,System.Boolean@)
u: Gets mode in the u direction
v: Gets mode in the v direction
w: Gets mode in the w direction
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.SurfaceIsoShowForFlatFaces
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.SurfaceIsoThicknessUsed
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.SurfaceEdgeApplyPattern
Turn pattern application on or off
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.SurfaceNakedEdgeApplyPattern
Turn pattern application on or off
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.ShowSurfaceEdge
Turn Surface Edge visibility on or off
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.ShowSurfaceNakedEdge
Turn Surface Naked Edge visibility on or off
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.SurfaceEdgeColorUsage
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.SurfaceNakedEdgeColorUsage
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.SetSurfaceIsoColorUsage(Rhino.Display.DisplayPipelineAttributes.SurfaceIsoColorUse)
Helper function for setting SurfaceIsoColorsUsed and SurfaceIsoSingleColor
use:
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.GetSurfaceIsoColorUsage
Helper function for getting SurfaceIsoColorsUsed and SurfaceSingleIsoColor
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.SurfaceIsoSingleColor
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.SurfaceIsoColorsUsed
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.SurfaceEdgeColor
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.SurfaceNakedEdgeColor
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.SurfaceIsoUVColor
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.SurfaceIsoUColor
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.SurfaceIsoVColor
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.SurfaceEdgeColorReduction
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.SurfaceNakedAdgeColorReduction
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.SurfaceEdgeColorReductionPercent
Since: 8.7

Rhino.Display.DisplayPipelineAttributes.SurfaceNakedEdgeColorReductionPercent
Since: 8.7

Rhino.Display.DisplayPipelineAttributes.SurfaceNakedEdgeThickness
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.SurfaceIsoThickness
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.SurfaceIsoUThickness
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.SurfaceIsoVThickness
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.SurfaceEdgeThicknessScale
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.SurfaceNakedEdgeThicknessScale
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.SurfaceIsoThicknessUScale
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.SurfaceIsoThicknessVScale
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.SurfaceIsoThicknessWScale
Since: 8.7

Rhino.Display.DisplayPipelineAttributes.LockedObjectsDrawBehindOthers
Locked object are drawn behind other objects
Since: 5.1

Rhino.Display.DisplayPipelineAttributes.MeshSpecificAttributes
Since: 5.0

Rhino.Display.DisplayPipelineAttributes.ShowText
Show text.
Since: 6.4

Rhino.Display.DisplayPipelineAttributes.ShowAnnotations
Show annotations.
Since: 6.4

Rhino.Display.DisplayPipelineAttributes.ShowLights
Show light widgets.
Since: 6.4

Rhino.Display.DisplayPipelineAttributes.LightingScheme
Since: 8.4

Rhino.Display.DisplayPipelineAttributes.AmbientLightingColor
Since: 6.3

Rhino.Display.DisplayPipelineAttributes.ShadowColor
Since: 6.3

Rhino.Display.DisplayPipelineAttributes.ColorReductionPct
Since: 8.6

Rhino.Display.DisplayPipelineAttributes.CastShadows
Cast shadows.
Since: 6.4

Rhino.Display.DisplayPipelineAttributes.ShowPoints
Show points.
Since: 6.4

Rhino.Display.DisplayPipelineAttributes.PointStyle
Since: 6.0

Rhino.Display.DisplayPipelineAttributes.PointRadius
Since: 6.0

Rhino.Display.DisplayPipelineAttributes.ShowPointClouds
Show point clouds.
Since: 6.4

Rhino.Display.DisplayPipelineAttributes.PointCloudStyle
Since: 8.4

Rhino.Display.DisplayPipelineAttributes.PointCloudRadius
Since: 8.4

Rhino.Display.DisplayPipelineAttributes.SetColorFadeEffect(System.Drawing.Color@,System.Single@)
Set a color fade effect to make objects fade a given amount towards a given color.
fadeAmount: The color to fade towards.
fadeColor: The amount of fade towards the given color (0..1).
Since: 8.0

Rhino.Display.DisplayPipelineAttributes.GetColorFadeEffect(System.Drawing.Color@,System.Single@)
Get the current color fade effect data.
fadeAmount: The current fade color
fadeColor: The current fade amount
Since: 8.0

Rhino.Display.DisplayPipelineAttributes.HasColorFadeEffect
Returns TRUE if there is a color fade effect enabled with a color fade effect amount
larger than 0.0, FALSE otherwise.
Since: 8.0

Rhino.Display.DisplayPipelineAttributes.SetDitherTransparencyEffect(System.Single@)
Set a dither transparency effect to make objects render with a given amount of
transparency using a dither effect.
transparencyAmount: The amount of transparency (0..1).
Since: 8.0

Rhino.Display.DisplayPipelineAttributes.GetDitherTransparencyEffect
Get the current dither transparency amount.
Since: 8.0

Rhino.Display.DisplayPipelineAttributes.HasDitherTransparencyEffect
Returns TRUE if there is a dither transparency effect enabled with a transparency
amount larger than 0.0, FALSE otherwise.
Since: 8.0

Rhino.Display.DisplayPipelineAttributes.SetDiagonalHatchEffect(System.Single@,System.Single@)
Set a diagonal hatch effect to make objects render with diagonal hatch with
a given strength and width in pixels. The effect works by brightening and
darkening pixels in a diagonal pattern.
hatchStrength: The strength of the hatch effect (0..1).
hatchWidth: The width of the diagonal hatch in pixels (>= 0).
Since: 8.0

Rhino.Display.DisplayPipelineAttributes.GetDiagonalHatchEffect(System.Single@,System.Single@)
Get the current diagonal hatch strength and width in pixels.
hatchStrength: The strength of the hatch effect.
hatchWidth: The width of the diagonal hatch in pixels.
Since: 8.0

Rhino.Display.DisplayPipelineAttributes.HasDiagonalHatchEffect
Returns TRUE if there is a diagonal hatch effect enabled with a hatch strength
larger than 0.0, FALSE otherwise.
Since: 8.0

Rhino.Display.DisplayPipelineAttributes.Id
Since: 5.0

Rhino.Display.DisplayPipelineAttributes.EnglishName
Since: 5.0

Rhino.Display.DisplayPipelineAttributes.LocalName
Since: 5.0

Rhino.Display.DisplayPipelineAttributes.ContextForDraw
Since: 6.5

Rhino.Display.DisplayPipelineAttributes.RealtimeDisplayId
Get the ID of the real-time display engine attached to the view. This will be
Guid.Empty if no real-time display engine is in use. This can be the case for instance
when starting a _Render session for a real-time viewport integration. That still would
cause this ID to be Guid.Empty.
Since: 6.0

Rhino.Display.DisplayPipelineAttributes.RealtimeRenderPasses
Get or set the real-time passes amount
Since: 6.0

Rhino.Display.DisplayPipelineAttributes.ShowRealtimeRenderProgressBar
Get or set whether the display is used for preview rendering or not.
Since: 6.0

Rhino.Display.DisplayPipelineAttributes.StereoContext
Get or set the stereo render context.
Since: 7.0

Rhino.Display.DisplayPipelineAttributes.FrontMaterialShine
Get or set the front material shine (0 to Rhino.DocObjects.MaxShine). You must call DisplayModeDescription.UpdateDisplayMode() to commit this change.
Since: 8.4

Rhino.Display.DisplayPipelineAttributes.BackMaterialShine
Get or set the back material shine (0 to Rhino.DocObjects.MaxShine). You must call DisplayModeDescription.UpdateDisplayMode() to commit this change.
Since: 8.4

Rhino.Display.DisplayPipelineAttributes.FrontMaterialTransparency
Get or set the front material transparency (0 to 100). You must call DisplayModeDescription.UpdateDisplayMode() to commit this change.
Since: 8.4

Rhino.Display.DisplayPipelineAttributes.BackMaterialTransparency
Get or set the back material transparency (0 to 100). You must call DisplayModeDescription.UpdateDisplayMode() to commit this change.
Since: 8.4

Rhino.Display.DisplayPipelineAttributes.BackMaterialDiffuseColor
Since: 8.8

Rhino.Display.DisplayPipelineAttributes.CullBackfaces
Since: 8.8

Rhino.Display.DisplayPipelineAttributes.SubDSmoothInteriorColorReduction
Color reduction percentage
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDCreaseInteriorColorReduction
Color reduction percentage
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDNonManifoldColorReduction
Color reduction percentage
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDBoundaryColorReduction
Color reduction percentage
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDSmoothInteriorEdgeColorUsage
Edge color usage
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDCreaseInteriorEdgeColorUsage
Edge color usage
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDNonManifoldEdgeColorUsage
Edge color usage
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDBoundaryEdgeColorUsage
Edge color usage
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDReflectionPlaneColorUsage
SubD replection plane color use
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDReflectionPlaneColorReduction
SubD replection plane color reduction percentage
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.MeshEdgeThickness
Mesh edge width in pixels
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.MeshNakedEdgeThickness
Naked mesh edge width in pixels.}
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.MeshNonmanifoldEdgeThickness
Non-manifold mesh edge width in pixels
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.MeshVertexSize
Mesh vertex size in pixels
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.MeshEdgeColorReduction
The darken percentage of the color
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.MeshNakedEdgeColorReduction
The darken percentage of the color
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.MeshNonmanifoldEdgeColorReduction
The darken percentage of the color
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.SubDSmoothInteriorThicknessScale
Edge thickness scale
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDCreaseInteriorThicknessScale
Edge thickness scale
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDNonManifoldThicknessScale
Edge thickness scale
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDBoundaryThicknessScale
Edge thickness scale
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDSmoothInteriorEdgeThickness
Edge thickness (pixels).
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDCreaseInteriorEdgeThickness
Edge thickness (pixels).
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDNonManifoldEdgeThickness
Edge thickness (pixels).
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDBoundaryEdgeThickness
Edge thickness (pixels).
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDThicknessUsage
Thickness usage, pixel thickness or a scale thickness
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDSmoothInteriorThicknessUsage
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDCreaseInteriorThicknessUsage
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDNonManifoldThicknessUsage
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDBoundaryThicknessUsage
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDSmoothInteriorApplyPattern
Apply pattern to the edge
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDCreaseInteriorApplyPattern
Apply pattern to the edge
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDNonManifoldApplyPattern
Apply pattern to the edge
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDBoundaryApplyPattern
Apply pattern to the edge
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDReflectionPlaneAxisLineOn
Apply Turnh on or off the reflection plane axis line
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDSmoothInteriorEdgeColor
Edge color
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDCreaseInteriorEdgeColor
Edge color
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDNonManifoldEdgeColor
Edge color
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDBoundaryEdgeColor
Edge color
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDReflectionAxisLineColor
Reflection axis line color
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.SubDReflectionPlaneColor
Reflection plane color
Since: 8.9

Rhino.Display.DisplayPipelineAttributes.MeshEdgeColor
Sets the mesh edge color
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.MeshNakedEdgeColor
Sets the naked edge color
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.MeshNonmanifoldEdgeColor
Sets the nonmanifold edge color
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.CustomGroundPlaneAltitude
Height above the world XY plane in model units
Since: 8.10

Rhino.Display.DisplayPipelineAttributes.CustomGroundPlaneOn
Turn the custom ground plane on or off
Since: 8.10

Rhino.Display.DisplayPipelineAttributes.CustomGroundPlaneShadowOnly
Makes the ground plane transparent, but allows shadows to still be cast on it.
Since: 8.10

Rhino.Display.DisplayPipelineAttributes.CustomGroundPlaneAutomaticAltitude
Turns on auto-elevation that moves Ground Plane to the lowest point of the objects in the model.
Since: 8.10

Rhino.Display.DisplayPipelineAttributes.ShowSubDEdges
Set visibility of SubD smooth edges.
Since: 8.10

Rhino.Display.DisplayPipelineAttributes.ShowSubDCreases
Set visibility of SubD creased edges.
Since: 8.10

Rhino.Display.DisplayPipelineAttributes.ShowSubDBoundary
Set visibility of SubD naked edges.
Since: 8.10

Rhino.Display.DisplayPipelineAttributes.ShowSubDNonmanifoldEdges
Turn on/off color differentiation of SubD symmetry children.
Since: 8.10

Rhino.Display.DisplayPipelineAttributes.ShowSubDReflectionPlanePreview
Since: 8.10

Rhino.Display.DisplayPipelineAttributes.ShowMeshEdges
Display mesh edges on/off
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ShowMeshNakedEdges
Display mesh naked edges on/off
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ShowMeshNonmanifoldEdges
Display mesh manifold edges on/off
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.UseLightColor
Draw lights using light color
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ShowClippingFills
When a clipping plane intersects a 3-D object and the section is closed, the section is filled.
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ShowClippingEdges
Shows the edges between the clipping plane and clipped objects.
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ClippingShadeSelectedPlane
Shades the selected clipping plane.
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ClipSelectionHighlight
Clips the highlight wires. Shaded selections always clip.
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ClippingPlaneFillColorUsage
Specifies how the color for the clipping plane object fill is determined.
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ClippingFillColor
Clipping plane fill color
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ClippingEdgeColorUsage
Specifies how the color for the Edges is determined
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ClippingEdgeColor
Clipping edge color
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ClippingShadeColorUsage
Specifies how to shade the clipping plane
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ClippingShadeColor
Clipping plane solid color
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ClippingEdgeThickness
Edge thickness in pixels.
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ClippingShadeTransparency
Specifies the clipping plane transparency percentage.
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.UseSectionStyles
When enabled, the appearances of clipping fills and edges are based on objects' section style properties.
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ControlPolygonWireThickness
The width of the control polygon lines in pixels.
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ControlPolygonStyle
PointStyle for the control polygon. Supported values are ControlPoint, RoundControlPoint, VariableDot, and RoundDot
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ControlPolygonGripSize
The control point size in pixels.
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.LockedObjectTransparency
LockedObjectTransparency.
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.LockedObjectUsage
Set asource of display attributes for locked objects
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.DynamicDisplayUsage
Sets the appearance of objects in the display
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.HighlightSurfaces
Shades entire object with highlight color.
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ControlPolygonUseSolidLines
Use dotted / solid lines
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ControlPolygonUseFixedSingleColor
Specifies a color for the control polygon.
true = Use a specified color for all control polygons.
false = Use the color specified in the object's Properties.
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ControlPolygonShowPoints
Shows the control points while the control polygon is displayed.
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ControlPolygonShowSurface
Shows the object while the control polygon is displayed.
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ControlPolygonShow
Shows the control polygon and only shows the control points.
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ControlPolygonHighlight
Highlights the segments of the control polygon on either side of the control points.
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.GhostLockedObjects
Set locked appearance
true = Locked objects appear transparent
false = Locked objects appear solid
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.LayersFollowLockUsage
Applies the settings for locked objects to locked layers.
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ControlPolygonColor
Control polygon color
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.LockedColor
Locked Object Color
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ShadowsOn
Enable shadows
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ShadowIntensity
Shadow intensity (percentage 0-100)
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ShadowMemoryUsage
Value from 1 to 16384 indicating how much memory is to be allocated. Actual memory use
is ShadowMemoryUsage*ShadowMemoryUsage*4.
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.SkylightShadowQuality
Skylight shadow quality, from 0 (lowest) to 8 (highest)
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ShadowSoftEdgeQuality
Soft edge quality, from 0 (none/faster) to 12 (softer/slower)
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ShadowEdgeBlur
Set blurring from 0 (no blurring) to 16 (maximum blurring)
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ShadowBiasX
ShadowBiasX (Self shadowing artifacts) from 0 (dirty) to 50 (cleaner).
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ShadowTransparencyTolerance
Transparency tolerance from 0 (never cast shadows) to 100 (always case shadows)
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ShadowClippingRadius
Camera-based shadow clipping radius
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ShadowsIgnoreUserDefinedClippingPlanes
If true, shadows ignore user-defined clipping planes
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.AxesSizePercentage
Size of axes as a percentage of the grid extents.
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.GridTransparency
Transparency of the grid, percentage (0-100)
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.GridPlaneTransparency
Transparency of the grid plane, percentage (0-100)
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.GridPlaneVisibility
Set when to show the grid plane
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.WorldAxesIconColorUsage
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.PlaneUsesGridColor
If true, use the grid thin line color in App settings
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.GridPlaneColor
The color of the grid plane
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.GroundPlaneUsage
Turn on or off custom Ground plane settungs
Since: 8.14

Rhino.Display.DisplayPipelineAttributes.LinearWorkflowUsage
Turn on or off custom linear workflow settings
Since: 8.14

Rhino.Display.DisplayPipelineAttributes.PreProcessColors
Linear workflow input colors
Since: 8.14

Rhino.Display.DisplayPipelineAttributes.PreProcessTextures
Linear workflow input textures
Since: 8.14

Rhino.Display.DisplayPipelineAttributes.PreProcessGamma
Linear workflow input gamma
Since: 8.14

Rhino.Display.DisplayPipelineAttributes.PostProcessFrameBuffer
Linear workflow Adjust output image
Since: 8.14

Rhino.Display.DisplayPipelineAttributes.PostProcessGamma
Linear workflow Output image gamma
Since: 8.14

Rhino.Display.DisplayPipelineAttributes.FrontFlatShaded
Shades the current viewport with no smoothing so the individual render mesh faces are visible.
Since: 8.14

Rhino.Display.DisplayPipelineAttributes.FrontOverrideObjectColor
Since: 8.14

Rhino.Display.DisplayPipelineAttributes.FrontOverrideObjectTransparency
Objects acquire transparency from render materials.
Since: 8.21

Rhino.Display.DisplayPipelineAttributes.FrontOverrideObjectReflectivity
Objects acquire reflectivity from render materials.
Since: 8.21

Rhino.Display.DisplayPipelineAttributes.BackOverrideObjectTransparency
Objects acquire transparency from render materials.
Since: 8.21

Rhino.Display.DisplayPipelineAttributes.BackOverrideObjectReflectivity
Objects acquire reflectivity from render materials.
Since: 8.21

Rhino.Display.DisplayPipelineAttributes.FrontDiffuse
Shades the current viewport with no smoothing so the individual render mesh faces are visible.
Since: 8.14

Rhino.Display.DisplayPipelineAttributes.BakeTextures
Adds the ability to display procedural textures in viewports. When it is turned off, procedural textures in viewports look different from the rendering.
Since: 8.14