Rhino.RhinoDoc.TextureMappingEventArgs
Event arguments passed to the RhinoDoc.TextureMappingEvent.

Rhino.RhinoDoc.TextureMappingEventArgs.Document
Since: 5.8

Rhino.RhinoDoc.TextureMappingEventArgs.EventType
Since: 5.8

Rhino.RhinoDoc.TextureMappingEventArgs.OldMapping
Since: 5.8

Rhino.RhinoDoc.TextureMappingEventArgs.NewMapping
Since: 5.8