Rhino.Geometry.Line
Represents the value of start and end points in a single line segment.

Rhino.Geometry.Line.From
Start point of line segment.
Since: 5.0

Rhino.Geometry.Line.FromX
Gets or sets the X coordinate of the line From point.
Since: 5.0

Rhino.Geometry.Line.FromY
Gets or sets the Y coordinate of the line From point.
Since: 5.0

Rhino.Geometry.Line.FromZ
Gets or sets the Z coordinate of the line From point.
Since: 5.0

Rhino.Geometry.Line.To
End point of line segment.
Since: 5.0

Rhino.Geometry.Line.ToX
Gets or sets the X coordinate of the line To point.
Since: 5.0

Rhino.Geometry.Line.ToY
Gets or sets the Y coordinate of the line To point.
Since: 5.0

Rhino.Geometry.Line.ToZ
Gets or sets the Z coordinate of the line To point.
Since: 5.0

Rhino.Geometry.Line.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Constructs a new line segment between two points.
from: Start point of line.
to: End point of line.
Since: 5.0

Rhino.Geometry.Line.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)
Constructs a new line segment from start point and span vector.
start: Start point of line segment.
span: Direction and length of line segment.
Since: 5.0

Rhino.Geometry.Line.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Double)
Constructs a new line segment from start point, direction and length.
start: Start point of line segment.
direction: Direction of line segment.
length: Length of line segment.
Since: 5.0

Rhino.Geometry.Line.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Constructs a new line segment between two points.
x0: The X coordinate of the first point.
y0: The Y coordinate of the first point.
z0: The Z coordinate of the first point.
x1: The X coordinate of the second point.
y1: The Y coordinate of the second point.
z1: The Z coordinate of the second point.
Since: 5.0

Rhino.Geometry.Line.Unset
Gets a line segment which has Rhino.Geometry.Point3d.Unset end points.
Since: 5.0

Rhino.Geometry.Line.IsValid
Gets a value indicating whether or not this line is valid.
Valid lines must have valid start and end points, and the points must not be equal.
Since: 5.0

Rhino.Geometry.Line.Length
Gets or sets the length of this line segment.
Note that a negative length will invert the line segment without
making the actual length negative. The line From point will remain fixed
when a new Length is set.
Since: 5.0

Rhino.Geometry.Line.Direction
Gets the direction of this line segment.
The length of the direction vector equals the length of
the line segment.
Since: 5.0

Rhino.Geometry.Line.UnitTangent
Gets the tangent of the line segment.
Note that tangent vectors are always unit vectors.
Sets only the direction of the line, the length is maintained.
Since: 5.0

Rhino.Geometry.Line.BoundingBox
Gets the line's 3d axis aligned bounding box.
Returns: 3d bounding box.
Since: 5.0

Rhino.Geometry.Line.TryFitLineToPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.Geometry.Line@)
Attempt to fit a line through a set of points.
points: The points through which to fit.
fitLine: The resulting line on success.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Line.TryCreateBetweenCurves(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double@,System.Double@,System.Boolean,System.Boolean,Rhino.Geometry.Line@)
Creates a line segment between a pair of curves such that the line segment is either tangent or perpendicular to each of the curves.
curve0: The first curve.
curve1: The second curve.
t0: Parameter value of point on curve0. Seed value at input and solution at output.
t1: Parameter value of point on curve 0.  Seed value at input and solution at output.
perpendicular0: Find line perpendicular to (true) or tangent to (false) curve0.
perpendicular1: Find line Perpendicular to (true) or tangent to (false) curve1.
line: The line segment if successful.
Returns: true on success, false on failure.
Since: 5.2

Rhino.Geometry.Line.op_Equality(Rhino.Geometry.Line,Rhino.Geometry.Line)
Determines whether two lines have the same value.
a: A line.
b: Another line.
Returns: true if a has the same coordinates as b; otherwise false.
Since: 5.0

Rhino.Geometry.Line.op_Inequality(Rhino.Geometry.Line,Rhino.Geometry.Line)
Determines whether two lines have different values.
a: A line.
b: Another line.
Returns: true if a has any coordinate that distinguishes it from b; otherwise false.
Since: 5.0

Rhino.Geometry.Line.Equals(System.Object)
Determines whether an object is a line that has the same value as this line.
obj: An object.
Returns: true if obj is a Line and has the same coordinates as this; otherwise false.

Rhino.Geometry.Line.Equals(Rhino.Geometry.Line)
Determines whether a line has the same value as this line.
other: A line.
Returns: true if other has the same coordinates as this; otherwise false.
Since: 5.0

Rhino.Geometry.Line.EpsilonEquals(Rhino.Geometry.Line,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:
Since: 5.4

Rhino.Geometry.Line.GetHashCode
Computes a hash number that represents this line.
Returns: A number that is not unique to the value of this line.

Rhino.Geometry.Line.ToString
Constructs the string representation of this line, in the form "From,To".
Returns: A text string.

Rhino.Geometry.Line.ToString(System.String,System.IFormatProvider)
Since: 7.0

Rhino.Geometry.Line.Flip
Flip the endpoints of the line segment.
Since: 5.0

Rhino.Geometry.Line.PointAt(System.Double)
Evaluates the line at the specified parameter.
t: Parameter to evaluate line segment at. Line parameters are normalized parameters.
Returns: The point at the specified parameter.
Since: 5.0

Rhino.Geometry.Line.ClosestParameter(Rhino.Geometry.Point3d)
Finds the parameter on the infinite line segment that is closest to a test point.
testPoint: Point to project onto the line.
Returns: The parameter on the line that is closest to testPoint.
Since: 5.0

Rhino.Geometry.Line.ClosestPoint(Rhino.Geometry.Point3d,System.Boolean)
Finds the point on the (in)finite line segment that is closest to a test point.
testPoint: Point to project onto the line.
limitToFiniteSegment: If true, the projection is limited to the finite line segment.
Returns: The point on the (in)finite line that is closest to testPoint.
Since: 5.0

Rhino.Geometry.Line.DistanceTo(Rhino.Geometry.Point3d,System.Boolean)
Compute the shortest distance between this line segment and a test point.
testPoint: Point for distance computation.
limitToFiniteSegment: If true, the distance is limited to the finite line segment.
Returns: The shortest distance between this line segment and testPoint.
Since: 5.0

Rhino.Geometry.Line.MinimumDistanceTo(Rhino.Geometry.Point3d)
Finds the shortest distance between this line as a finite segment
and a test point.
testPoint: A point to test.
Returns: The minimum distance.
Since: 5.0

Rhino.Geometry.Line.MinimumDistanceTo(Rhino.Geometry.Line)
Finds the shortest distance between this line as a finite segment
and another finite segment.
testLine: A line to test.
Returns: The minimum distance.
Since: 5.0

Rhino.Geometry.Line.MaximumDistanceTo(Rhino.Geometry.Point3d)
Finds the largest distance between this line as a finite segment
and a test point.
testPoint: A point to test.
Returns: The maximum distance.
Since: 5.0

Rhino.Geometry.Line.MaximumDistanceTo(Rhino.Geometry.Line)
Finds the largest distance between this line as a finite segment
and another finite segment.
testLine: A line to test.
Returns: The maximum distance.
Since: 5.0

Rhino.Geometry.Line.Transform(Rhino.Geometry.Transform)
Transform the line using a Transformation matrix.
xform: Transform to apply to this line.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Line.ToNurbsCurve
Constructs a nurbs curve representation of this line.
This amounts to the same as calling NurbsCurve.CreateFromLine().
Returns: A nurbs curve representation of this line or null if no such representation could be made.
Since: 5.0

Rhino.Geometry.Line.PointAtLength(System.Double)
Computes a point located at a specific metric distance from the line origin (Rhino.Geometry.Line.From).
If line start and end coincide, then the start point is always returned.
distance: A positive, 0, or a negative value that will be the distance from Rhino.Geometry.Line.From.
Returns: The newly found point.
Since: 6.0

Rhino.Geometry.Line.Extend(System.Double,System.Double)
Extend the line by custom distances on both sides.
startLength:
Distance to extend the line at the start point.
Positive distance result in longer lines.
endLength:
Distance to extend the line at the end point.
Positive distance result in longer lines.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Line.ExtendThroughBox(Rhino.Geometry.BoundingBox)
Ensure the line extends all the way through a box.
Note, this does not result in the shortest possible line
that overlaps the box.
box: Box to extend through.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Line.ExtendThroughBox(Rhino.Geometry.BoundingBox,System.Double)
Ensure the line extends all the way through a box.
Note, this does not result in the shortest possible line that overlaps the box.
box: Box to extend through.
additionalLength: Additional length to append at both sides of the line.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Line.ExtendThroughBox(Rhino.Geometry.Box)
Ensure the line extends all the way through a box.
Note, this does not result in the shortest possible line that overlaps the box.
box: Box to extend through.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Line.ExtendThroughBox(Rhino.Geometry.Box,System.Double)
Ensure the line extends all the way through a box.
Note, this does not result in the shortest possible line that overlaps the box.
box: Box to extend through.
additionalLength: Additional length to append at both sides of the line.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Line.TryGetPlane(Rhino.Geometry.Plane@)
Gets a plane that contains the line. The origin of the plane is at the start of the line.
If possible, a plane parallel to the world XY, YZ, or ZX plane is returned.
plane: If the return value is true, the plane out parameter is assigned during this call.
Returns: true on success.
Since: 5.0