Rhino.Geometry.SubDEndCapStyle
ON_SubDEndCapStyle enumerates the type of end caps functions like ON_SubD::CreateCylinder will create.
Use ON_SubDEndCapStyleFromUnsigned(integer value) to convert integer values to an ON_SubDEndCapStyle.
Use ON_SubDEndCapStyleToString(end_cap_style) to convert ON_SubDEndCapStyle values to string descriptions.

Rhino.Geometry.SubDEndCapStyle.Unset
Used to indicate the end cap style is not set.

Rhino.Geometry.SubDEndCapStyle.None
Ends are not capped.

Rhino.Geometry.SubDEndCapStyle.Triangles
Ends are capped with triangles.

Rhino.Geometry.SubDEndCapStyle.Quads
When the end has an even number of edges, is will be capped with quads. Otherwise it will be capped with triangles.

Rhino.Geometry.SubDEndCapStyle.Ngon
Ends are capped with a n-gon. This is a poor choice when there are a large number of edges in the end boundary.