Rhino.Render.PreviewRenderedEventArgs
PreviewRenderedEventArgs is raised when a content preview has been rendered

Rhino.Render.PreviewRenderedEventArgs.PreviewJobSignature
The Preview Job Signature associated with the rendered preview
Since: 8.8

Rhino.Render.PreviewRenderedEventArgs.Bitmap
The Bitmap of the rendered preview
Since: 8.8

Rhino.Render.PreviewRenderedEventArgs.Quality
The Bitmap of the rendered preview
Since: 8.8