Rhino.IndexPair
Represents two indices: I and J.

Rhino.IndexPair.#ctor(System.Int32,System.Int32)
Initializes a new instance of Rhino.IndexPair with two indices.
i: A first index.
j: A second index.
Since: 5.0

Rhino.IndexPair.I
Gets or sets the first, I index.
Since: 5.0

Rhino.IndexPair.J
Gets or sets the second, J index.
Since: 5.0

Rhino.IndexPair.Item(System.Int32)
Gets or sets a particular index of this structure.
Remarks: Only 0 and 1 are valid indices.
index: Either 0 for I, or 1 for J.
Returns: The value at the index.

Rhino.IndexPair.IndexOf(System.Int32)
Determines the index of a specific item in Rhino.IndexPair.
Returns:
The index, 0 for I or 1 for J of item if found in the list; otherwise, -1.
item: The object to locate in the System.Collections.Generic.IList`1.
Since: 6.0

Rhino.IndexPair.Contains(System.Int32)
Determines whether the Rhino.IndexPair contains a specific value.
Returns:
true if item is found in the Rhino.IndexPair; otherwise, false.
item: The number to locate in the Rhino.IndexPair.
Since: 6.0

Rhino.IndexPair.CopyTo(System.Int32[],System.Int32)
Copies the elements of the Rhino.IndexPair to an System.Array, starting at a particular System.Array index.
array: The one-dimensional System.Array that is the destination of the elements copied
from Rhino.IndexPair.
The System.Array must have zero-based indexing.
arrayIndex: The zero-based index in array at which copying begins.
Throws System.ArgumentNullException: array is null.
Throws System.ArgumentOutOfRangeException: arrayIndex is less than 0 or arrayIndex is greater than or equals the length of array minus 2.
Throws System.ArgumentException: The length of the array is less than 2.
Since: 6.0

Rhino.IndexPair.Count
Returns the amount of elements in this pair of indices, which is always 2.
Since: 6.0

Rhino.IndexPair.GetEnumerator
Gets an enumerator that goes over Rhino.IndexPair.I and Rhino.IndexPair.J, in this order.
Returns: The needed enumerator.
Since: 6.0

Rhino.IndexPair.System#Collections#IEnumerable#GetEnumerator
Since: 6.0