Rhino.FileIO.File3dmRenderMaterials


Rhino.FileIO.File3dmRenderMaterials.#ctor(Rhino.FileIO.File3dm)
Since: 8.0

Rhino.FileIO.File3dmRenderMaterials.GetEnumerator
Since: 8.0

Rhino.FileIO.File3dmRenderMaterials.Find(System.Guid)
Finds a material by its id, if possible. Returns null on failure.
Since: 8.0

Rhino.FileIO.File3dmRenderMaterials.System#Collections#IEnumerable#GetEnumerator
Since: 8.0