Rhino.Geometry.MeshRefinements.CreaseEdges
Defines the way naked edges are handled.
Since: 6.8

Rhino.Geometry.MeshRefinements.CreaseEdges.NakedFixed
Naked edges will not move or be modified.

Rhino.Geometry.MeshRefinements.CreaseEdges.NakedSmooth
The naked edge will tend toward a spline.

Rhino.Geometry.MeshRefinements.CreaseEdges.CornerFixedOtherCreased
Corners (2-sided vertices) will be fixed, while other naked vertices will tend toward a spline.

Rhino.Geometry.MeshRefinements.CreaseEdges.Auto
Unwelded vertices become creases, and welded are smooth.