Rhino.FileIO.FileTxt
Support for writing Txt (points) file format

Rhino.FileIO.FileTxt.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileTxtWriteOptions)
Write a Txt file based on the contents of a RhinoDoc
path: path to write a file to
doc: document to get geometry from
options: options used for generating the Txt file
Returns: true on success
Since: 8.0

Rhino.FileIO.FileTxt.Read(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileTxtReadOptions)
Read a Txt file into a RhinoDoc
path: path to read a file from
doc: document to import geometry into
options: options used for importing the Txt file
Returns: true on success
Since: 8.0