Rhino.Geometry.PreserveIsoCurveMethod
The way the surface iso-lines align with the target
Since: 8.21

Rhino.Geometry.PreserveIsoCurveMethod.Automatic
If the trim is on an iso direction use Rhino.Geometry.PreserveIsoCurveMethod.MatchTarget, else use Rhino.Geometry.PreserveIsoCurveMethod.Perpendicular

Rhino.Geometry.PreserveIsoCurveMethod.MatchTarget
The surface tangent will be parallel to the surface derivative in U- or V-direction

Rhino.Geometry.PreserveIsoCurveMethod.Perpendicular
The surface tangent will be perpendicular to the target edge

Rhino.Geometry.PreserveIsoCurveMethod.Preserve
The surface tangent will not change