Rhino.UI.Controls.ICollapsibleSectionHolder2.SetFullHeightSection(Rhino.UI.Controls.ICollapsibleSection)
Since: 7.4

Rhino.UI.Controls.ICollapsibleSectionHolder2.EnableHeaderButton(Rhino.UI.Controls.ICollapsibleSection,System.Int32,System.Boolean)
Since: 7.4

Rhino.UI.Controls.ICollapsibleSectionHolder2.ShowHeaderButton(Rhino.UI.Controls.ICollapsibleSection,System.Int32,System.Boolean)
Since: 7.4