Rhino.Geometry.ExtrudeCornerType
Corner types used for creating a tapered extrusion
Since: 5.1

Rhino.Geometry.ExtrudeCornerType.None
No Corner

Rhino.Geometry.ExtrudeCornerType.Sharp


Rhino.Geometry.ExtrudeCornerType.Round


Rhino.Geometry.ExtrudeCornerType.Smooth


Rhino.Geometry.ExtrudeCornerType.Chamfer
