Rhino.FileIO.File3dmNamedConstructionPlanes
Provides access to named construction planes in the 3dm file.

Rhino.FileIO.File3dmNamedConstructionPlanes.FindName(System.String)
Finds a named construction plane given its name.
name: The name of the construction plane to be searched.
Returns: A ConstructionPlane, or null if not found.
Since: 6.0

Rhino.FileIO.File3dmNamedConstructionPlanes.IndexOf(Rhino.DocObjects.ConstructionPlane)
Returns the index of a named construction plane.
cplane: The construction plane to be searched.
Returns: The index of the named construction plane, -1 if not found.
Since: 6.0

Rhino.FileIO.File3dmNamedConstructionPlanes.Delete(System.Int32)
Remove a named construction plane from the table.
index: Zero based array index.
Returns: true if successful.
Since: 6.0

Rhino.FileIO.File3dmNamedConstructionPlanes.Delete(Rhino.DocObjects.ConstructionPlane)
Deletes a named construction plane from the table.
cplane: The construction plane to delete.
Returns:
Since: 6.0

Rhino.FileIO.File3dmNamedConstructionPlanes.Item(System.Int32)
Gets the named construction plane at an index.
index: Zero based array index.
Returns:
A construction plane at the index, or null on error.

Rhino.FileIO.File3dmNamedConstructionPlanes.Add(System.String,Rhino.Geometry.Plane)
Adds a named construction plane to the table.
name:
The name of the named construction plane.
plane: The plane value.
Returns:
0 based index of the named construction plane.
-1 on failure.
Since: 6.0

Rhino.FileIO.File3dmNamedConstructionPlanes.Add(Rhino.DocObjects.ConstructionPlane)
Adds a named construction plane to the table.
cplane: The construction plane to add.
Since: 6.0

Rhino.FileIO.File3dmNamedConstructionPlanes.Clear
Removes all named construction planes from the table.
Since: 6.0

Rhino.FileIO.File3dmNamedConstructionPlanes.Contains(Rhino.DocObjects.ConstructionPlane)
Returns an indication of the presence of a named construction plane in the table.
cplane: The construction plane to check.
Returns: true if the named construction plane is in the table; false otherwise.
Since: 6.0

Rhino.FileIO.File3dmNamedConstructionPlanes.CopyTo(Rhino.DocObjects.ConstructionPlane[],System.Int32)
Copies the content of the table to an array.
array:
arrayIndex:
Since: 6.0

Rhino.FileIO.File3dmNamedConstructionPlanes.Count
Number of named construction planes in the table.
Since: 6.0

Rhino.FileIO.File3dmNamedConstructionPlanes.GetEnumerator
Gets an enumerator that yields all construction planes in this collection.
Returns: The enumerator.
Since: 6.0

Rhino.FileIO.File3dmNamedConstructionPlanes.System#Collections#IEnumerable#GetEnumerator
Since: 6.0