Rhino.DocObjects.TextHorizontalAlignment
Horizontal location of text attach point relative to text

Rhino.DocObjects.TextHorizontalAlignment.Left
Attach at left of text lines (Independent of glyphs being displayed.)

Rhino.DocObjects.TextHorizontalAlignment.Center
Attach point at center of text horizontal advance (not glyph bounding box)

Rhino.DocObjects.TextHorizontalAlignment.Right
Attach point at right text horizontal advance (not glyph bounding box)

Rhino.DocObjects.TextHorizontalAlignment.Auto
Used for Leaders only
Attach point adjusts to Right or Left depending on leader tail direction in view
If tail direction is to the Left, alignment is Right
If tail direction is to the Right, alignment is Left