Rhino.Runtime.HostUtils.SendLogMessageToCloudDelegate
Represents a reference to a method that will be called when an exception occurs.
sClass: The top level message type
sDesc: Finer grained description of the message.
sMessage: The message.
msg_type: The messag type