Rhino.Geometry.Morphs.SplopSpaceMorph
Rotates, scales, and wraps objects on a surface.

Rhino.Geometry.Morphs.SplopSpaceMorph.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.Surface,Rhino.Geometry.Point2d)
Constructs a flow space morph.
plane: Source plane of deformation.
surface: Surface to wrap objects onto.
surfaceParam: U,V parameter on surface used for orienting.
Since: 5.9

Rhino.Geometry.Morphs.SplopSpaceMorph.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.Surface,Rhino.Geometry.Point2d,System.Double)
Constructs a flow space morph.
plane: Source plane of deformation.
surface: Surface to wrap objects onto.
surfaceParam: U,V parameter on surface used for orienting.
scale: Scale factor.
Since: 5.9

Rhino.Geometry.Morphs.SplopSpaceMorph.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.Surface,Rhino.Geometry.Point2d,System.Double,System.Double)
Constructs a flow space morph.
plane: Source plane of deformation.
surface: Surface to wrap objects onto.
surfaceParam: U,V parameter on surface used for orienting.
scale: Scale factor. To ignore, use Rhino.RhinoMath.UnsetValue.
angle: Rotation angle in radians. To ignore, use Rhino.RhinoMath.UnsetValue.
Since: 5.9

Rhino.Geometry.Morphs.SplopSpaceMorph.IsValid
Returns true if the space morph definition is valid, false otherwise.
Since: 5.9

Rhino.Geometry.Morphs.SplopSpaceMorph.MorphPoint(Rhino.Geometry.Point3d)
Morphs an Euclidean point.
point: A point that will be morphed by this object.
Returns: Resulting morphed point.
Since: 5.9

Rhino.Geometry.Morphs.SplopSpaceMorph.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Geometry.Morphs.SplopSpaceMorph.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.9

Rhino.Geometry.Morphs.SplopSpaceMorph.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.