Rhino.Render.PhysicallyBasedMaterial.ParametersNames
Helper class with fields containing the names of fields available in our PBR implementation.

Rhino.Render.PhysicallyBasedMaterial.ParametersNames.BaseColor
Since: 6.12
7.0

Rhino.Render.PhysicallyBasedMaterial.ParametersNames.BRDF
Since: 6.12
7.0

Rhino.Render.PhysicallyBasedMaterial.ParametersNames.Subsurface
Since: 6.12
7.0

Rhino.Render.PhysicallyBasedMaterial.ParametersNames.SubsurfaceScatteringColor
Since: 6.12
7.0

Rhino.Render.PhysicallyBasedMaterial.ParametersNames.SubsurfaceScatteringRadius
Since: 6.12
7.0

Rhino.Render.PhysicallyBasedMaterial.ParametersNames.Specular
Since: 6.12
7.0

Rhino.Render.PhysicallyBasedMaterial.ParametersNames.SpecularTint
Since: 6.12
7.0

Rhino.Render.PhysicallyBasedMaterial.ParametersNames.Metallic
Since: 6.12
7.0

Rhino.Render.PhysicallyBasedMaterial.ParametersNames.Roughness
Since: 6.12
7.0

Rhino.Render.PhysicallyBasedMaterial.ParametersNames.Anisotropic
Since: 6.12
7.0

Rhino.Render.PhysicallyBasedMaterial.ParametersNames.AnisotropicRotation
Since: 6.12
7.0

Rhino.Render.PhysicallyBasedMaterial.ParametersNames.Sheen
Since: 6.12
7.0

Rhino.Render.PhysicallyBasedMaterial.ParametersNames.SheenTint
Since: 6.12
7.0

Rhino.Render.PhysicallyBasedMaterial.ParametersNames.Clearcoat
Since: 6.12
7.0

Rhino.Render.PhysicallyBasedMaterial.ParametersNames.ClearcoatRoughness
Since: 6.12
7.0

Rhino.Render.PhysicallyBasedMaterial.ParametersNames.ClearcoatBump
Since: 6.16
7.0

Rhino.Render.PhysicallyBasedMaterial.ParametersNames.OpacityIor
Since: 6.12
7.0

Rhino.Render.PhysicallyBasedMaterial.ParametersNames.Opacity
Since: 6.12
7.0

Rhino.Render.PhysicallyBasedMaterial.ParametersNames.OpacityRoughness
Since: 6.12
7.0

Rhino.Render.PhysicallyBasedMaterial.ParametersNames.Emission
Since: 6.12
7.0

Rhino.Render.PhysicallyBasedMaterial.ParametersNames.Smudge
Since: 6.12
7.0

Rhino.Render.PhysicallyBasedMaterial.ParametersNames.Normal
Since: 6.12
7.0

Rhino.Render.PhysicallyBasedMaterial.ParametersNames.Displacement
Since: 6.12
7.0

Rhino.Render.PhysicallyBasedMaterial.ParametersNames.Bump
Since: 6.12
7.0

Rhino.Render.PhysicallyBasedMaterial.ParametersNames.AmbientOcclusion
Since: 6.12
7.0