Rhino.Render.ChangeQueue.Environment.FrameBufferFillMode
Fillmode for background
Since: 6.0

Rhino.Render.ChangeQueue.Environment.FrameBufferFillMode.None
None set

Rhino.Render.ChangeQueue.Environment.FrameBufferFillMode.DefaultColor
Use default color

Rhino.Render.ChangeQueue.Environment.FrameBufferFillMode.SolidColor
Use specified solid color

Rhino.Render.ChangeQueue.Environment.FrameBufferFillMode.Gradient2Color
Use 2-color gradient

Rhino.Render.ChangeQueue.Environment.FrameBufferFillMode.Gradient4Color
Use 4-color gradient (colors are specified by corners)

Rhino.Render.ChangeQueue.Environment.FrameBufferFillMode.Bitmap
Use bitmap

Rhino.Render.ChangeQueue.Environment.FrameBufferFillMode.Renderer
Use whatever renderer chooses

Rhino.Render.ChangeQueue.Environment.FrameBufferFillMode.Transparent
Transparent background

Rhino.Render.ChangeQueue.Environment.FrameBufferFillMode.Force32Bit
Use 32bit color @todo verify what this means