Rhino.ApplicationSettings.NeverRepeatList
Contains static methods and properties relating to the list of commands that are never repeated.

Rhino.ApplicationSettings.NeverRepeatList.UseNeverRepeatList
Only use the list if somebody modifies it via CRhinoAppSettings::SetDontRepeatCommands().
Return value of true means CRhinoCommand don't repeat flags will be ignored and the m_dont_repeat_list
will be used instead.  false means the individual CRhinoCommands will determine if they are repeatable.
Since: 5.0

Rhino.ApplicationSettings.NeverRepeatList.SetList(System.String[])
Puts the command name tokens in m_dont_repeat_list.
Returns: Number of items added to m_dont_repeat_list.
Since: 5.0

Rhino.ApplicationSettings.NeverRepeatList.CommandNames
The list of commands to not repeat.
Since: 5.0