Rhino.Geometry.SubDPatchStyle
SubD::PatchStyle identifies the style of patch used to fill holes.

Rhino.Geometry.SubDPatchStyle.Unset
Not a valid style.
This encourages developers to thoughtfully select a patch style and can
be used to indicate a UI control is not initialized.

Rhino.Geometry.SubDPatchStyle.Automatic
Automatically choose a patch style that will generally create a good looking result.
If a hole boundary is not convex, it is triangulated. Otherwise:
If a hole has 3 edges, a single triangle face is used.
If a hole has 4 edges, a single quad face is used.
If a hole has 5 or more edges and an odd number of edges, a triangle fan is used.
If a hole has 6 or more edges and an even number of edges, a quad fan is used.

Rhino.Geometry.SubDPatchStyle.SingleFace
A single face is used under all conditions.

Rhino.Geometry.SubDPatchStyle.TriangleFan
A triangle fan used under all conditions. The center of the fan
is the average of the hole boundary vertex control net points.

Rhino.Geometry.SubDPatchStyle.QuadOrTriangleFan
If the hole boundary has an even number of edges, a quad fan is used.
Otherwise a triangle fan is used. The center of the fan
is the average of the hole boundary vertex control net points.

Rhino.Geometry.SubDPatchStyle.Triangulated
The hole boundary is triangluated.
Typically this style is selected when a boundary not convex
and the other styles produce faces with overlapping regions.