Rhino.Render.UI.WorldMapDayNight.#ctor
Since: 6.0

Rhino.Render.UI.WorldMapDayNight.Dispose
Since: 6.0

Rhino.Render.UI.WorldMapDayNight.Map
Since: 6.0

Rhino.Render.UI.WorldMapDayNight.MakeMapBitmap
Since: 6.0

Rhino.Render.UI.WorldMapDayNight.HasMapForCurrentSettings
Since: 6.0

Rhino.Render.UI.WorldMapDayNight.SetDayNightDisplay(System.Boolean)
Since: 6.0

Rhino.Render.UI.WorldMapDayNight.SetEnabled(System.Boolean)
Since: 6.0

Rhino.Render.UI.WorldMapDayNight.SetTimeInfo(System.DateTime,System.Double,System.Int32,System.Boolean)
Since: 6.0

Rhino.Render.UI.WorldMapDayNight.LocationToMap(Rhino.Geometry.Point2d)
Since: 6.0

Rhino.Render.UI.WorldMapDayNight.MapToLocation(System.Drawing.Point)
Since: 6.0