Rhino.DocObjects.CoordinateSystem
Defines enumerated values for coordinate systems to use as references.
Since: 5.0

Rhino.DocObjects.CoordinateSystem.World
The world coordinate system. This has origin (0,0,0),
X unit axis is (1, 0, 0) and Y unit axis is (0, 1, 0).

Rhino.DocObjects.CoordinateSystem.Camera
The camera coordinate system.

Rhino.DocObjects.CoordinateSystem.Clip
The clip coordinate system.

Rhino.DocObjects.CoordinateSystem.Screen
The screen coordinate system.