Rhino.Render.RenderWindow.ChannelGPU.#ctor(System.IntPtr)
Since: 7.0

Rhino.Render.RenderWindow.ChannelGPU.Dispose
Dispose of the channel.
Since: 7.0

Rhino.Render.RenderWindow.ChannelGPU.DisplayTechnology
Return the type of API used for this channel's texture handle.
Since: 7.0

Rhino.Render.RenderWindow.ChannelGPU.Id
Return the channel id.
Since: 7.0

Rhino.Render.RenderWindow.ChannelGPU.Width
Return the channel width.
Since: 7.0

Rhino.Render.RenderWindow.ChannelGPU.Height
Return the channel height.
Since: 7.0

Rhino.Render.RenderWindow.ChannelGPU.PixelSize
Return the size of one pixel's data in the channel.
Since: 7.0

Rhino.Render.RenderWindow.ChannelGPU.TextureHandle
Return the channel's texture handle.
Since: 7.0
8.0

Rhino.Render.RenderWindow.ChannelGPU.TextureHandleOpenGL
Return the channel's OpenGL texture handle.
If there isn't one, a value of 0 will be returned.
The ChannelGPU.DisplayTechnology property will indicate which type
of texture is stored in the channel.
Since: 8.0

Rhino.Render.RenderWindow.ChannelGPU.TextureHandleMetal
Return the channel's Metal texture handle (id<MTLTexture>) as an IntPtr.
If there isn't one, IntPtr.Zero will be returned.
The ChannelGPU.DisplayTechnology property will indicate which type
of texture is stored in the channel.
The IntPtr can be turned back into an Objective-C id<MTLTexture> using
id<MTLTexture> texture = CFBridgingRelease(ptr);
Since: 8.0

Rhino.Render.RenderWindow.ChannelGPU.Close
Close the channel.
Since: 7.0

Rhino.Render.RenderWindow.ChannelGPU.Clone
Return a clone of the channel.
Since: 7.0

Rhino.Render.RenderWindow.ChannelGPU.CopyTo(Rhino.Render.RenderWindow.Channel)
Copy the channel to a 'CPU' channel.
channel: The channel to copy to.
Since: 7.0