Rhino.DocObjects.SectionBackgroundFillMode
Defines how a background fill is applied to a section

Rhino.DocObjects.SectionBackgroundFillMode.None
Do not fill in the background of a section

Rhino.DocObjects.SectionBackgroundFillMode.Viewport
Use the current display mode settings to determine how to apply a fill.
Wireframe will not fill while shaded and rendered will fill using colors
and materials matching how the object is drawn.

Rhino.DocObjects.SectionBackgroundFillMode.SolidColor
Use a solid color for a background fill. If BackgroundFillColor is set
on this section style, then that color will be used. Otherwise, the item's
color that this section style is associated will be used