Rhino.DocObjects.ActiveSpace
Defines the current working space.
Since: 5.0

Rhino.DocObjects.ActiveSpace.None
There is no working space.

Rhino.DocObjects.ActiveSpace.ModelSpace
3d modeling or "world" space.

Rhino.DocObjects.ActiveSpace.PageSpace
page/layout/paper/printing space.

Rhino.DocObjects.ActiveSpace.UVEditorSpace
UV Editor space.

Rhino.DocObjects.ActiveSpace.BlockEditorSpace
Block Editor space.