Rhino.DocObjects.DimensionStyle.AngleDisplayFormat
Display format for angles

Rhino.DocObjects.DimensionStyle.AngleDisplayFormat.DecimalDegrees
Decimal Degrees

Rhino.DocObjects.DimensionStyle.AngleDisplayFormat.DegMinSec
Degrees Minutes Seconds

Rhino.DocObjects.DimensionStyle.AngleDisplayFormat.Radians
Decimal Radians

Rhino.DocObjects.DimensionStyle.AngleDisplayFormat.Grads
Decimal Gradians