Rhino.FileIO.File3dm
Represents a 3dm file, which is stored using the OpenNURBS file standard.
The 3dm format is the main Rhinoceros storage format.
Visit http://www.opennurbs.com/ for more details.

Rhino.FileIO.File3dm.Read(System.String)
Reads a 3dm file from a specified location.
path: The file to read.
Returns: new File3dm on success, null on error.
Throws System.IO.FileNotFoundException: If path does not exist.
Since: 5.0

Rhino.FileIO.File3dm.Read(System.String,Rhino.FileIO.File3dm.TableTypeFilter,Rhino.FileIO.File3dm.ObjectTypeFilter)
Reads a 3dm file from a specified location.
path: The file to read.
tableTypeFilterFilter:
If tableTypeFilterFilter is None, then everything in the archive is read.
Otherwise tableTypeFilterFilter identifies what tables should be read.
objectTypeFilter:
If objectTypeFilter is not None, then is a filter made by bitwise or-ing
values to select which types of objects will be read from the model object
table.
Returns: new File3dm on success, null on error.
Throws System.IO.FileNotFoundException: If path does not exist.
Since: 5.9

Rhino.FileIO.File3dm.ReadWithLog(System.String,Rhino.FileIO.File3dm.TableTypeFilter,Rhino.FileIO.File3dm.ObjectTypeFilter,System.String@)
Reads a 3dm file from a specified location.
path: The file to read.
tableTypeFilterFilter:
If tableTypeFilterFilter is None, then everything in the archive is read.
Otherwise tableTypeFilterFilter identifies what tables should be read.
objectTypeFilter:
If objectTypeFilter is not None, then is a filter made by bitwise or-ing
values to select which types of objects will be read from the model object
table.
errorLog: Any archive reading errors are logged here.
Returns: new File3dm on success, null on error.
Throws System.IO.FileNotFoundException: If path does not exist.
Since: 5.9

Rhino.FileIO.File3dm.ReadWithLog(System.String,System.String@)
Read a 3dm file from a specified location and log any archive
reading errors.
path: The file to read.
errorLog: Any archive reading errors are logged here.
Returns: New File3dm on success, null on error.
Throws System.IO.FileNotFoundException: If path does not exist.
Since: 5.0

Rhino.FileIO.File3dm.FromByteArray(System.Byte[])
Read a 3dm file from a byte array
bytes:
Returns: New File3dm on success, null on error.
Since: 7.0

Rhino.FileIO.File3dm.ReadNotes(System.String)
Reads only the notes from an existing 3dm file.
path: The file from which to read the notes.
Returns: The 3dm file notes.
Throws System.IO.FileNotFoundException: If path does not exist, is null or cannot be accessed because of permissions.
Since: 5.0

Rhino.FileIO.File3dm.ReadArchiveVersion(System.String)
Reads only the archive 3dm version from an existing 3dm file.
path: The file from which to read the archive version.
Returns: The 3dm file archive version.
Throws System.IO.FileNotFoundException: If path does not exist, is null or cannot be accessed because of permissions.
Since: 5.10

Rhino.FileIO.File3dm.ReadRevisionHistory(System.String,System.String@,System.String@,System.Int32@,System.DateTime@,System.DateTime@)
Quickly check a file for it's revision information.  This function does
not read the entire file, just what it needs to get revision information out
path: path to the 3dm file
createdBy: original author of the file
lastEditedBy: last person to edit the file
revision: which revision this file is at
createdOn: date file was created (DateTime.MinValue if not set in file)
lastEditedOn: date file was last edited (DateTime.MinValue if not set in file)
Returns: true on success
Since: 5.6

Rhino.FileIO.File3dm.ReadEarthAnchorPoint(System.String)
Reads only the earth anchor point from an existing 3dm file
path: A location on disk or network.
Returns: The earth anchor point.
Since: 8.3

Rhino.FileIO.File3dm.ReadApplicationData(System.String,System.String@,System.String@,System.String@)
Reads only the application information from an existing 3dm file.
path: A location on disk or network.
applicationName: The application name. This out parameter is assigned during this call.
applicationUrl: The application URL. This out parameter is assigned during this call.
applicationDetails: The application details. This out parameter is assigned during this call.
Since: 5.0

Rhino.FileIO.File3dm.WriteOneObject(System.String,Rhino.Geometry.GeometryBase)
Creates a simple 3dm file that contains a single geometric object.
path: Path to the 3dm file to create.
geometry:
The geometry to be saved in the archive's object table.
This is typically a Curve, Surface, Brep, Mesh, or SubD.
Returns: True if successful, false otherwise.
Since: 7.0

Rhino.FileIO.File3dm.WriteMultipleObjects(System.String,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})
Creates a simple 3dm file that contains a multiple geometric objects.
path: Path to the 3dm file to create.
geometry:
The geometry to be saved in the archive's object table.
This is typically some Curves, Surfaces, Breps, Meshs, or SubDs.
Returns: True if successful, false otherwise.
Since: 7.0

Rhino.FileIO.File3dm.ReadPreviewImage(System.String)
Attempts to read the preview image out of a 3dm file.
path: The location of the file.
Returns: A bitmap, or null on failure.
Throws System.IO.FileNotFoundException: If the provided path is null, does not exist or cannot be accessed.
Since: 5.0

Rhino.FileIO.File3dm.ReadDimensionStyles(System.String)
Read the dimension styles table out of a 3dm file.
path: The location of the file.
Throws System.IO.FileNotFoundException: If the provided path is null, does not exist or cannot be accessed.
Returns:
Array of dimension styles on success (empty array if file does not contain dimension styles)
null on error
Since: 6.0

Rhino.FileIO.File3dm.Write(System.String,System.Int32)
Writes contents of this model to an openNURBS archive.
If the model is not valid, then Write will refuse to write it.
path: The file name to use for writing.
version:
Version of the openNURBS archive to write.  Must be [2; current version].
Rhino can read its current version, plus earlier file versions except 1.
Use latest version when possible.
Alternatively, 0 is a placeholder for the last valid version.
Returns:
true if archive is written with no error.
false if errors occur.
Since: 5.0

Rhino.FileIO.File3dm.Write(System.String,Rhino.FileIO.File3dmWriteOptions)
Writes contents of this model to an openNURBS archive.
If the model is not valid, then Write will refuse to write it.
path: The file name to use for writing.
options: An options instance, or null for default.
Returns:
true if archive is written with no error.
false if errors occur.
Since: 5.9

Rhino.FileIO.File3dm.WriteWithLog(System.String,System.Int32,System.String@)
Writes contents of this model to an openNURBS archive.
If the model is not valid, then Write will refuse to write it.
path: The file name to use for writing.
version:
Version of the openNURBS archive to write.  Must be [2; current version].
Rhino can read its current version, plus earlier file versions except 1.
Use latest version when possible.
Alternatively, 0 is a placeholder for the last valid version.
errorLog: This argument will be filled by out reference.
Returns:
true if archive is written with no error.
false if errors occur.
Since: 5.0

Rhino.FileIO.File3dm.WriteWithLog(System.String,Rhino.FileIO.File3dmWriteOptions,System.String@)
Writes contents of this model to an openNURBS archive.
If the model is not valid, then Write will refuse to write it.
path: The file name to use for writing.
options: An options instance, or null for default.
errorLog: This argument will be filled by out reference.
Returns:
true if archive is written with no error.
false if errors occur.
Since: 6.0

Rhino.FileIO.File3dm.ToByteArray
Write to an in-memory byte[]
Returns:
Since: 7.1

Rhino.FileIO.File3dm.ToByteArray(Rhino.FileIO.File3dmWriteOptions)
Write to an in-memory byte[]
options:
Returns:
Since: 7.1

Rhino.FileIO.File3dm.IsValid(System.String@)
The File3dm object is kept consistent during its creation.
Therefore, this function now returns only true.
errors:
No errors are found.
Returns: true in any case.
Since: 5.0
6.0

Rhino.FileIO.File3dm.IsValid(Rhino.FileIO.TextLog)
The File3dm object is kept consistent during its creation.
Therefore, this function now returns only true.
errors:
No errors are found.
Returns: >true in any case.
Since: 5.1
6.0

Rhino.FileIO.File3dm.Polish
This function is only kept for forward assembly compatibility.
Since: 5.0
6.0

Rhino.FileIO.File3dm.Audit(System.Boolean,System.Int32@,System.String@,System.Int32[]@)
This function is only kept for forward assembly compatibility.
attemptRepair:
Ignored.
repairCount: Is set to 0.
errors:
Contains no meaningful error.
warnings: Is set to null.
Returns:
Returns 0.
Since: 5.0
6.0

Rhino.FileIO.File3dm.StartSectionComments
Gets or sets the start section comments, which are the comments with which the 3dm file begins.
Since: 5.0

Rhino.FileIO.File3dm.ArchiveVersion
Gets the 3dm file archive version.
Since: 7.9

Rhino.FileIO.File3dm.Notes
Gets or sets the model notes.
Since: 5.0

Rhino.FileIO.File3dm.ApplicationName
Gets or sets the name of the application that wrote this file.
Since: 5.0

Rhino.FileIO.File3dm.ApplicationUrl
Gets or sets a URL for the application that wrote this file.
Since: 5.0

Rhino.FileIO.File3dm.ApplicationDetails
Gets or sets details for the application that wrote this file.
Since: 5.0

Rhino.FileIO.File3dm.CreatedBy
Gets a string that names the user who created the file.
Since: 5.0

Rhino.FileIO.File3dm.LastEditedBy
Gets a string that names the user who last edited the file.
Since: 5.0

Rhino.FileIO.File3dm.Created
Get the DateTime that this file was originally created. If the
value is not set in the 3dm file, then DateTime.MinValue is returned
Since: 5.6

Rhino.FileIO.File3dm.LastEdited
Get the DateTime that this file was last edited. If the
value is not set in the 3dm file, then DateTime.MinValue is returned
Since: 5.6

Rhino.FileIO.File3dm.Revision
Gets or sets the revision number.
Since: 5.0

Rhino.FileIO.File3dm.EarthAnchorPoint
If set, this is the model's location on the earth.  This information is
used when the model is used with GIS information.
Since: 8.3

Rhino.FileIO.File3dm.GetPreviewImage
Preview image used for file explorer
Since: 6.0

Rhino.FileIO.File3dm.SetPreviewImage(System.Drawing.Bitmap)
Preview image used for file explorer
Since: 6.0

Rhino.FileIO.File3dm.Settings
Settings include tolerance, and unit system, and defaults used
for creating views and objects.
Since: 5.0

Rhino.FileIO.File3dm.Manifest
Retrieves the manifest with all object descriptions in this file.
Since: 6.0

Rhino.FileIO.File3dm.Objects
Gets access to the Rhino.FileIO.File3dmObjectTable class associated with this file,
which contains all objects.
Since: 5.0

Rhino.FileIO.File3dm.Materials
Materials in this file.
Since: 5.0

Rhino.FileIO.File3dm.AllMaterials
Materials in this file.
Since: 6.0

Rhino.FileIO.File3dm.Linetypes
Linetypes in this file.
Since: 5.0

Rhino.FileIO.File3dm.AllLinetypes
Linetypes in this file.
Since: 6.0

Rhino.FileIO.File3dm.Layers
Layers in this file.
Since: 5.0

Rhino.FileIO.File3dm.AllLayers
Layers in this file.
Since: 6.0

Rhino.FileIO.File3dm.AllGroups
Groups in this file.
Since: 6.5

Rhino.FileIO.File3dm.DimStyles
Dimension Styles in this file.
Since: 5.0

Rhino.FileIO.File3dm.AllDimStyles
Dimension Styles in this file.
Since: 6.0

Rhino.FileIO.File3dm.HatchPatterns
Hatch patterns in this file
Since: 5.0

Rhino.FileIO.File3dm.AllHatchPatterns
Hatch patterns in this file.
Since: 6.0

Rhino.FileIO.File3dm.InstanceDefinitions
Instance definitions in this file.
Since: 5.6

Rhino.FileIO.File3dm.AllInstanceDefinitions
Instance definitions in this file
Since: 6.0

Rhino.FileIO.File3dm.Views
Views that represent the RhinoViews which are displayed when Rhino loads this file.
Since: 5.0

Rhino.FileIO.File3dm.AllViews
Views that represent the RhinoViews which are displayed when Rhino loads this file.
Since: 6.0

Rhino.FileIO.File3dm.NamedViews
Named views in this file.
Since: 5.0

Rhino.FileIO.File3dm.AllNamedViews
Named views in this file.
Since: 6.0

Rhino.FileIO.File3dm.NamedConstructionPlanes
Named construction planes in this file.
Since: 6.0

Rhino.FileIO.File3dm.AllNamedConstructionPlanes
Named construction planes in this file.
Since: 6.0

Rhino.FileIO.File3dm.PlugInData
Custom plug-in data in this file.  This data is not attached to any geometry or attributes
Since: 5.0

Rhino.FileIO.File3dm.Strings
Document user strings in this file
Since: 6.0

Rhino.FileIO.File3dm.EmbeddedFiles
The embedded files in this file.
Since: 8.0

Rhino.FileIO.File3dm.RenderMaterials
The render materials in this file.
Since: 8.0

Rhino.FileIO.File3dm.RenderEnvironments
The render environments in this file.
Since: 8.0

Rhino.FileIO.File3dm.RenderTextures
The render textures in this file.
Since: 8.0

Rhino.FileIO.File3dm.Dump
Prepares a text dump of the entire model.
Returns: The text dump.
Since: 5.0

Rhino.FileIO.File3dm.DumpSummary
Prepares a text dump of model properties and settings.
Returns: The text dump.
Since: 5.0

Rhino.FileIO.File3dm.DumpToTextLog(Rhino.FileIO.TextLog)
Prepares a text dump of the entire model.
log:
Since: 5.1

Rhino.FileIO.File3dm.#ctor
Initializes a new instance of a 3dm file.
Since: 5.0

Rhino.FileIO.File3dm.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.FileIO.File3dm.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0

Rhino.FileIO.File3dm.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.