Rhino.Geometry.ComponentState
Provides a set of values describing component state.
This is not a bit field.
Some of these values are mutually exclusive and should not be combined.

Rhino.Geometry.ComponentState.Unset
Not a valid status.

Rhino.Geometry.ComponentState.Clear
This is a default component state.

Rhino.Geometry.ComponentState.NotSelected
This is a default component state, but not selected.

Rhino.Geometry.ComponentState.Selected
This component is selected.

Rhino.Geometry.ComponentState.SelectedPersistent
This component is selected persistently.

Rhino.Geometry.ComponentState.NotHighlighted
This is a default component state, but not highlighted.

Rhino.Geometry.ComponentState.Highlighted
This component is highlighted.

Rhino.Geometry.ComponentState.NotHidden
This is a default component state, but not hidden.

Rhino.Geometry.ComponentState.Hidden
This component is hidden.

Rhino.Geometry.ComponentState.NotLocked
This is a default component state, but not locked.

Rhino.Geometry.ComponentState.Locked
This component is locked.

Rhino.Geometry.ComponentState.NotDamaged
This is a default component state, but not damaged.

Rhino.Geometry.ComponentState.Damaged
This component is damaged.

Rhino.Geometry.ComponentState.NotDeleted
This component is not deleted.

Rhino.Geometry.ComponentState.Deleted
This component is deleted.

Rhino.Geometry.ComponentState.RuntimeMarkClear
This runtime mark is clear.

Rhino.Geometry.ComponentState.RuntimeMarkSet
This runtime mark is set.