Rhino.Runtime.InteropWrappers.StdVectorFloat
Wrapper for ON_SimpleArray<float>. If you are not writing C++ code
then this class is not for you.

Rhino.Runtime.InteropWrappers.StdVectorFloat.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.
Since: 7.26

Rhino.Runtime.InteropWrappers.StdVectorFloat.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.
Since: 7.26

Rhino.Runtime.InteropWrappers.StdVectorFloat.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.StdVectorFloat class.
Since: 7.26

Rhino.Runtime.InteropWrappers.StdVectorFloat.#ctor(System.UInt64)
Initializes a new Rhino.Runtime.InteropWrappers.StdVectorFloat class.
initialSize: Initial size of the array - all values are set to zero.

Rhino.Runtime.InteropWrappers.StdVectorFloat.#ctor(Rhino.Runtime.InteropWrappers.StdVectorFloat)
Initializes a new Rhino.Runtime.InteropWrappers.StdVectorFloat with the contents of another SimpleArrayFloat.
Since: 7.26

Rhino.Runtime.InteropWrappers.StdVectorFloat.CopyTo(Rhino.Runtime.InteropWrappers.StdVectorFloat)
Copies the contents of a Rhino.Runtime.InteropWrappers.StdVectorFloat into another SimpleArrayFloat.
Since: 7.26

Rhino.Runtime.InteropWrappers.StdVectorFloat.#ctor(System.Collections.Generic.IEnumerable{System.Single})
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayFloat class
values: initial set of integers to add to the array
Since: 7.26

Rhino.Runtime.InteropWrappers.StdVectorFloat.Count
Gets the amount of elements in this array.
Since: 7.26

Rhino.Runtime.InteropWrappers.StdVectorFloat.Memory
Return the raw data.
Since: 7.26

Rhino.Runtime.InteropWrappers.StdVectorFloat.ToArray
Returns the managed counterpart of the unmanaged array.
Returns: The managed array.
Since: 7.26

Rhino.Runtime.InteropWrappers.StdVectorFloat.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.StdVectorFloat.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 7.26