Rhino.Geometry.TextEntity.#ctor
Initializes a new instance of the Rhino.Geometry.TextEntity class.
Since: 5.0

Rhino.Geometry.TextEntity.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor used in serialization
info: Serialization data
context: Serialization stream

Rhino.Geometry.TextEntity.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,System.Boolean,System.Double,System.Double)
Create Text geometry or null if input is invalid
text:
plane:
style:
wrapped:
rectWidth:
rotationRadians:
Returns:
Since: 6.0

Rhino.Geometry.TextEntity.CreateWithRichText(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,System.Boolean,System.Double,System.Double)
Create RichText geometry or null if input is invalid
richTextString:
plane:
style:
wrapped:
rectWidth:
rotationRadians:
Returns:
Since: 6.0

Rhino.Geometry.TextEntity.Justification
Gets or sets the justification of text in relation to its base point.
Since: 5.0

Rhino.Geometry.TextEntity.TextHorizontalAlignment
Since: 6.0

Rhino.Geometry.TextEntity.TextVerticalAlignment
Since: 6.0

Rhino.Geometry.TextEntity.TextOrientation
Since: 6.0

Rhino.Geometry.TextEntity.Transform(Rhino.Geometry.Transform,Rhino.DocObjects.DimensionStyle)
Transform the object by a 4x4 transform matrix and change text height
override to accommodate scaling in the transform if necessary
transform:
An Transform with the transformation information
style:
Returns:
Returns true on success otherwise returns false.
Since: 6.0

Rhino.Geometry.TextEntity.GetTextTransform(System.Double,Rhino.DocObjects.DimensionStyle)
Get the transform for this text object's text geometry
textscale:
dimstyle:
Since: 6.0

Rhino.Geometry.TextEntity.Explode
Explodes this text entity into an array of curves.
Returns: An array of curves that forms the outline or content of this text entity.
Since: 5.0

Rhino.Geometry.TextEntity.CreateSurfaces(Rhino.DocObjects.DimensionStyle,System.Double,System.Double)
Creates planar breps from the outline curves.
dimstyle:
smallCapsScale:  Set to create small caps out of lower case letters.
spacing:  Set to add additional spacing between glyph output.
Returns: An array of planar breps.
Since: 6.0

Rhino.Geometry.TextEntity.CreateSurfacesGrouped(Rhino.DocObjects.DimensionStyle,System.Double,System.Double)
Creates planar Breps from text outline curves. Breps are grouped such that each element
in the list being returned represents a single character.
dimstyle:
smallCapsScale:
spacing:
Returns:
Since: 8.0

Rhino.Geometry.TextEntity.CreatePolysurfacesGrouped(Rhino.DocObjects.DimensionStyle,System.Double,System.Double,System.Double)
Creates 3d Breps from text outline curves. Breps are grouped such that each element
in the list being returned represents a single character.
dimstyle:
smallCapsScale:
height:
spacing:
Returns:
Since: 8.0

Rhino.Geometry.TextEntity.CreatePolySurfaces(Rhino.DocObjects.DimensionStyle,System.Double,System.Double,System.Double)
Creates breps from the outline curves with specified height.
dimstyle:
height:  Height in direction perpendicular to plane of text.
smallCapsScale:  Set to create small caps out of lower case letters.
spacing:  Set to add additional spacing between glyph output.
Returns: An array of planar breps.
Since: 6.0

Rhino.Geometry.TextEntity.CreateExtrusionsGrouped(Rhino.DocObjects.DimensionStyle,System.Double,System.Double,System.Double)
Creates 3d Breps from text outline curves. Breps are grouped such that each element
in the list being returned represents a single character.
dimstyle:
smallCapsScale:
height:
spacing:
Returns:
Since: 8.0

Rhino.Geometry.TextEntity.CreateExtrusions(Rhino.DocObjects.DimensionStyle,System.Double,System.Double,System.Double)
Creates extrusions from the outline curves with specified height.
dimstyle:
height:  Height in direction perpendicular to plane of text.
smallCapsScale:  Set to create small caps out of lower case letters.
spacing:  Set to add additional spacing between glyph output.
Returns: An array of planar breps.
Since: 6.0

Rhino.Geometry.TextEntity.CreateCurves(Rhino.DocObjects.DimensionStyle,System.Boolean,System.Double,System.Double)
Returns the outline curves.
dimstyle:
allowOpen:  Set to true to prevent forced closing of open curves retrieved from glyphs.
smallCapsScale:  Set to create small caps out of lower case letters.
spacing:  Set to add additional spacing between glyph output.
Returns: An array of curves that forms the outline or content of this text entity.
Since: 6.0

Rhino.Geometry.TextEntity.CreateCurvesGrouped(Rhino.DocObjects.DimensionStyle,System.Boolean,System.Double,System.Double)
Creates planar curve from text outline curves. Curves are grouped such that each element
in the list being returned represents a single character.
dimstyle:
allowOpen:  Set to true to prevent forced closing of open curves retrieved from glyphs.
smallCapsScale:
spacing:
Returns:
Since: 8.0