Rhino.Geometry.SubDAutomaticMeshToSubDContext
ON_SubD::AutomaticMeshToSubDContext identifies a context where meshes can automatically
be converted to subds.

Rhino.Geometry.SubDAutomaticMeshToSubDContext.Unset
Indicates the context has not been initialized.

Rhino.Geometry.SubDAutomaticMeshToSubDContext.Rhino5BoxModeTSpline
A mesh in a Rhino 5 3dm file that is a representation of a box mode T-spline.
By default, these meshes are automatically converted to subds.

Rhino.Geometry.SubDAutomaticMeshToSubDContext.FBXMeshWithDivisionLevels
A mesh in an FBX file that has nonzero values for either preview division levels or render division levels.
Some FBX files created by Maya save subdivision objects as meshes with nonzero division level values.
By default, FBX division levels are ignored.