Rhino.FileIO.FileDwgWriteOptions
Options for writing a DWG file

Rhino.FileIO.FileDwgWriteOptions.Version
Version of DWG file to write
Since: 8.0

Rhino.FileIO.FileDwgWriteOptions.SimplifyTolerance
Since: 8.0

Rhino.FileIO.FileDwgWriteOptions.MinPointDistance
Since: 8.0

Rhino.FileIO.FileDwgWriteOptions.CurveUseMaxAngle
Since: 8.0

Rhino.FileIO.FileDwgWriteOptions.CurveUseChordHeight
Since: 8.0

Rhino.FileIO.FileDwgWriteOptions.CurveUseSegmentLength
Since: 8.0

Rhino.FileIO.FileDwgWriteOptions.CurveMaxAngleRadians
Angle between pline segments in writing curve
Since: 8.0

Rhino.FileIO.FileDwgWriteOptions.CurveMaxAngleDegrees
Angle between pline segments in writing curve
Since: 8.0

Rhino.FileIO.FileDwgWriteOptions.CurveChordHeight
Absolute distance from pline to nurb
Since: 8.0

Rhino.FileIO.FileDwgWriteOptions.CurveSegmentLength
Max length for any polyline segment
Since: 8.0

Rhino.FileIO.FileDwgWriteOptions.ExportMeshesAs
Rhino meshes as polyface meshes or 3dfaces
Since: 8.0

Rhino.FileIO.FileDwgWriteOptions.ExportSurfacesAs
Rhino surcaces as meshes(0) or curves(1) or acis(2)
Since: 8.0

Rhino.FileIO.FileDwgWriteOptions.ExportLinesAs
Since: 8.0

Rhino.FileIO.FileDwgWriteOptions.ExportArcsAs
Since: 8.0

Rhino.FileIO.FileDwgWriteOptions.ExportSplinesAs
Since: 8.0

Rhino.FileIO.FileDwgWriteOptions.ExportPolylinesAs
Since: 8.0

Rhino.FileIO.FileDwgWriteOptions.ExportPolycurvesAs
Since: 8.0

Rhino.FileIO.FileDwgWriteOptions.Flatten
Project to cplane or view
Since: 8.0

Rhino.FileIO.FileDwgWriteOptions.SplitPolycurves
Explode polycurves before exporting
Since: 8.0

Rhino.FileIO.FileDwgWriteOptions.SplitSplines
Split splines at FMKs before exporting
Since: 8.0

Rhino.FileIO.FileDwgWriteOptions.Simplify
use lines and arcs where possible
Since: 8.0

Rhino.FileIO.FileDwgWriteOptions.NoDxfHeader
write an entities only dxf file ( R12 only)
Since: 8.0

Rhino.FileIO.FileDwgWriteOptions.IsDefault
Since: 8.0

Rhino.FileIO.FileDwgWriteOptions.FullLayerPath
write layernames as Parent$Child or Child
Since: 8.0

Rhino.FileIO.FileDwgWriteOptions.ColorMethod
pallette index: clrACI, RGB: clrRGB
Since: 8.0

Rhino.FileIO.FileDwgWriteOptions.PreserveArcNormals
Users wanted to use Pedit
in AutoCAD to join them into plines and that didn't work if the normals of
arcs being joined are different.
Default will be true and will change the behavior
Since: 8.0

Rhino.FileIO.FileDwgWriteOptions.UseLWPolylines
Since: 8.0

Rhino.FileIO.FileDwgWriteOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0