Rhino.UI.IRhinoUiDialogService
Used by Rhino.UI.Dialogs to access generic Eto dialogs from Rhino Common

Rhino.UI.IRhinoUiDialogService.ShowComboListBox(System.String,System.String,System.Collections.IList)
Since: 6.0

Rhino.UI.IRhinoUiDialogService.ShowListBox(System.String,System.String,System.Collections.IList,System.Object)
Since: 6.0

Rhino.UI.IRhinoUiDialogService.ShowCheckListBox(System.String,System.String,System.Collections.IList,System.Collections.Generic.IList{System.Boolean})
Since: 6.0

Rhino.UI.IRhinoUiDialogService.ShowEditBox(System.String,System.String,System.String,System.Boolean,System.String@)
Since: 6.0

Rhino.UI.IRhinoUiDialogService.ShowNumberBox(System.String,System.String,System.Double@,System.Double,System.Double)
Since: 6.0

Rhino.UI.IRhinoUiDialogService.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc)
Since: 6.7

Rhino.UI.IRhinoUiDialogService.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc,System.Guid)
Since: 8.0

Rhino.UI.IRhinoUiDialogService.ShowPrintWidths(System.String,System.String)
Since: 8.0

Rhino.UI.IRhinoUiDialogService.ShowPrintWidths(System.String,System.String,System.Double)
Since: 8.0

Rhino.UI.IRhinoUiDialogService.ShowPropertyListBox(System.String,System.String,System.Collections.IList,System.Collections.Generic.IList{System.String})
Since: 8.0

Rhino.UI.IRhinoUiDialogService.ShowMultiListBox(System.Collections.Generic.IList{System.String},System.String,System.String,System.Collections.Generic.IList{System.String})
Since: 6.10

Rhino.UI.IRhinoUiDialogService.IconFromResourceId(System.Reflection.Assembly,System.String)
Since: 8.0

Rhino.UI.IRhinoUiDialogService.SetToDefaultColorScheme(System.Boolean)
Since: 8.2

Rhino.UI.IRhinoUiDialogService.DetectColorScheme(System.Boolean@,System.Boolean@)
Since: 8.2