Rhino.Render.Utilities.SetDefaultRenderPlugIn(System.Guid)
Set default render application
pluginId: ID of render plug-in
Returns:
True if plug-in found and loaded successfully.  False if pluginId is
invalid or was unable to load plug-in
Since: 5.3

Rhino.Render.Utilities.DefaultRenderPlugInId
Get the plug-in Id for the default render plug-in
Since: 5.3

Rhino.Render.Utilities.UiFramework
Since: 7.0

Rhino.Render.Utilities.ShowIncompatibleMaterials
Specifies whether incompatible content should be shown in the corresponding editor.
Since: 5.3

Rhino.Render.Utilities.ShowIncompatibleEnvironments
Specifies whether incompatible content should be shown in the corresponding editor.
Since: 5.3

Rhino.Render.Utilities.ShowIncompatibleTextures
Specifies whether incompatible content should be shown in the corresponding editor.
Since: 5.3

Rhino.Render.Utilities.SafeFrameEnabled(Rhino.RhinoDoc)
Queries whether or not the Safe Frame is visible.
Since: 6.0

Rhino.Render.Utilities.ChangeContentType(Rhino.Render.RenderContent,System.Guid,System.Boolean)
Changes the type of a content. This deletes the content and creates a replacement
of the specified type allowing the caller to decide about harvesting.
oldContent: oldContent is the old content which is deleted.
newType: The type of content to replace pOldContent with.
harvestParameters: Determines whether or not parameter harvesting will be performed.
Returns: A new persistent render content.
Since: 6.0

Rhino.Render.Utilities.PromptForSaveImageFileParameters(System.String,System.Int32@,System.Int32@,System.Int32@)
Prompts the user for a save file name and the width, height and depth of an image to be saved.
filename: The original file path.
width: A width.
height: An height.
colorDepth: A color depth.
Returns: The new file name.
Since: 6.0

Rhino.Render.Utilities.LoadPersistentRenderContentFromFile(System.UInt32,System.String)
Loads a content from a library file and adds it to the persistent content list of a particular document.
docSerialNumber: identifies the document into which the content should be loaded.
filename: is the full path to the file to be loaded.
Returns: The loaded content or null if an error occurred.
Since: 6.0

Rhino.Render.Utilities.ShowContentChooser(System.Guid,System.Guid,Rhino.Render.RenderContentKind,System.Guid@,Rhino.Render.RenderContent.ShowContentChooserFlags,Rhino.RhinoDoc)
Shows the content chooser to allow the user to select a new or existing content.
defaultType: The content type that will be initially selected in the 'New' tab.
defaultInstanceId: The content instance that will be initially selected in the 'Existing' tab.
kinds: Semicolon-delimited string specifying which content kinds will be displayed.
instanceIdOut: The UUID of the chosen item. Depending on eRhRdkSccResult, this can be the type id of a content type or the instance id of an existing content.
flags: Flags controlling the chooser. Multiple selection is not valid for this call.
doc: A Rhino document.
Returns: The result of displaying the chooser.
Since: 6.25
7.9

Rhino.Render.Utilities.ShowContentChooser(Rhino.RhinoDoc,System.Guid,System.Guid,Rhino.Render.RenderContentKind,Rhino.Render.RenderContent.ShowContentChooserFlags,System.String,System.Collections.Generic.IEnumerable{System.String},System.Collections.Generic.IEnumerable{System.Guid},System.Guid[]@)
Shows the content chooser to allow the user to select a new or existing content, or multiple contents.
doc: A Rhino document.
defaultType: The content type that will be initially selected in the 'New' tab.
defaultInstanceId: The content instance that will be initially selected in the 'Existing' tab.
kinds: Semicolon-delimited string specifying which content kinds will be displayed.
flags: Flags controlling the chooser (tabs to hide, type of selection).
presetCategory: Specifies the category to preset in the drop-down list on the 'New' tab. If this string is empty, the preset category will be 'All'.
categories: Specifies the categories to display. Render contents that do not belong to one of these categories will not be listed. If this array is empty, all render contents from all categories will be listed.
types: Specifies content types to display. Contents that are not one of these types will not be listed. If this array is empty, all content types will be listed.
instanceIdsOut: Array of UUID(s) of the chosen item(s). Depending on eRhRdkSccResult, this can accept type id(s) of content type(s) or instance id(s) of existing content(s).
Returns: The result of displaying the chooser.
Since: 7.6
7.9

Rhino.Render.Utilities.ShowContentChooser(Rhino.RhinoDoc,System.Guid,System.Guid,Rhino.Render.RenderContentKind,Rhino.Render.Utilities.ContentChooserFlags,System.String,System.Collections.Generic.IEnumerable{System.String},System.Collections.Generic.IEnumerable{System.Guid},System.Guid[]@)
Shows the content chooser to allow the user to select a new or existing content, or multiple contents.
doc: A Rhino document.
defaultType: The content type that will be initially selected in the 'New' tab.
defaultInstanceId: The content instance that will be initially selected in the 'Existing' tab.
kinds: Semicolon-delimited string specifying which content kinds will be displayed.
flags: Flags controlling the chooser (tabs to hide, type of selection).
presetCategory: Specifies the category to preset in the drop-down list on the 'New' tab. If this string is empty, the preset category will be 'All'.
categories: Specifies the categories to display. Render contents that do not belong to one of these categories will not be listed. If this array is empty, all render contents from all categories will be listed.
types: Specifies content types to display. Contents that are not one of these types will not be listed. If this array is empty, all content types will be listed.
instanceIdsOut: Array of UUID(s) of the chosen item(s). Depending on eRhRdkSccResult, this can accept type id(s) of content type(s) or instance id(s) of existing content(s).
Returns: The result of displaying the chooser.
Since: 7.9

Rhino.Render.Utilities.FindFile(Rhino.RhinoDoc,System.String)
Finds a file and also handles network shares.
Remarks: This is a replacement for CRhinoFileUtilities::FindFile().
doc: Document to use for locating .3dm file's folder.
fullPathToFile: The file to be found.
Returns: The found file.
Since: 6.0

Rhino.Render.Utilities.FindFile(Rhino.RhinoDoc,System.String,System.Boolean)
Finds a file and also handles network shares.
Remarks: This is a replacement for CRhinoFileUtilities::FindFile().
doc: Document to use for locating .3dm file's folder.
fullPathToFile: The file to be found.
unpackFromBitmapTableIfNecessary: True to seasch for the file in the bitmap table and unpack it into the temp folder if not found in the initial search.
Returns: The found file.
Since: 6.0

Rhino.Render.Utilities.IsCachedTextureFileInUse(System.String)
Determines if any texture in any persistent content list is using the specified file name for caching.
textureFileName: The file name to check for. The extension is ignored.
Returns: true if the texture is present.
Since: 6.0

Rhino.Render.Utilities.MoveWindow(System.IntPtr,System.Drawing.Rectangle,System.Boolean,System.Boolean)
Since: 6.0

Rhino.Render.Utilities.ShowIORMenu(System.IntPtr,System.Drawing.Point,System.Double@,System.String@)
Display and track the context menu.
hwnd: The window that displays the menu, for example an edit box.
pt: The position to display the menu at inside the window
outIOR: Accepts the IOR value of the user's chosen substance
outString: Accepts the name of the user's chosen substance. Can be null if not required.
Returns: true if the function showed the IOR menu and something was picked.
Since: 6.0

Rhino.Render.Utilities.GetUnpackedFilesCacheFolder(Rhino.RhinoDoc,System.Boolean)
Gets a folder associated with the document for unpacking textures to
doc: The document the folder is associated with
create: If true, this will create a directory if it does not exist
Returns: The path to the unpacked files folder
Throws System.ArgumentNullException: When doc is null
Since: 8.0