Rhino.Render.AsyncRenderContext
\ingroup rhino_render
Inherit from AsyncRenderContext to be able to create asynchronous
render engine implementations through RhinoCommon.

Rhino.Render.AsyncRenderContext.RenderWindow
Handle to the RenderWindow for the instance of this class. This
is a convenience property for implementors to use.
Since: 6.0

Rhino.Render.AsyncRenderContext.RenderThread
Holder for render thread, that gets set through
StartRenderThread()
Since: 6.0

Rhino.Render.AsyncRenderContext.Cancel
If set to true rendering should be stopped. Is set
to true only by StopRendering().

Rhino.Render.AsyncRenderContext.StartRenderThread(System.Threading.ThreadStart,System.String)
Start a new render thread with given function.
threadStart: Function to start in render thread
threadName: Name for the thread
Returns:
Since: 6.0

Rhino.Render.AsyncRenderContext.JoinRenderThread
Join the render thread, then set to null;
Since: 6.0

Rhino.Render.AsyncRenderContext.StopRendering
Override StopRendering if you need to do additional tasks besides
having Cancel set to true.
Note: you should always base.StopRendering() in your overriding
implementation.
Since: 6.0

Rhino.Render.AsyncRenderContext.Dispose
Since: 6.0