Rhino.RuntimeEnvironment
ON::RuntimeEnvironment identifies a runtime environment (operating system).
This value is saved in binary archives so appropriate adjustments
to resources provided by runtime environments, like fonts, can be made
when an archive created in one runtime environment is used in another.

Rhino.RuntimeEnvironment.Unset
ON::RuntimeEnvironment::Unset indicates no runtime is set.

Rhino.RuntimeEnvironment.None
ON::RuntimeEnvironment::None indicates no runtime.
This is a different condition from ON::Runtime::Unset.

Rhino.RuntimeEnvironment.Windows
ON::RuntimeEnvironment::Windows indicates some version of Microsoft Windows.

Rhino.RuntimeEnvironment.Apple
ON::RuntimeEnvironment::Apple indicates some version of Apple OS X or iOS.

Rhino.RuntimeEnvironment.Android
ON::RuntimeEnvironment::Android indicates some version of Google Android.

Rhino.RuntimeEnvironment.Linux
ON::RuntimeEnvironment::Linux indicates some version of Linux.

Rhino.RuntimeEnvironment.WebAssembly
ON::RuntimeEnvironment::WebAssembly indicates some version of WASM / WebAssembly.