Rhino.Display.DisplayPipelineAttributes.BackfaceStyle
Values for changing the display of the backface (the side opposite of the surface normal direction).
Since: 8.20

Rhino.Display.DisplayPipelineAttributes.BackfaceStyle.UseFrontFaceSettings
No color change.
Since: 8.20

Rhino.Display.DisplayPipelineAttributes.BackfaceStyle.CullBackfaces
Surfaces viewed from the back will be transparent.
Since: 8.20

Rhino.Display.DisplayPipelineAttributes.BackfaceStyle.UseObjectColor
Surfaces viewed from the back use the color specified in the object's display properties.
Since: 8.20

Rhino.Display.DisplayPipelineAttributes.BackfaceStyle.SingleColorAllBackfaces
All backfaces display a specified color regardless of the object color.
Since: 8.20

Rhino.Display.DisplayPipelineAttributes.BackfaceStyle.UseRenderMaterial
Shades using rendering material.
Since: 8.20

Rhino.Display.DisplayPipelineAttributes.BackfaceStyle.CustomMaterialAllBackfaces
Use a custom material for all backfaces.
Since: 8.20