Rhino.DocObjects.Tables.NamedPositionTable
All named positions in a rhino document.

Rhino.DocObjects.Tables.NamedPositionTable.Document
Document that owns this table.
Since: 6.0

Rhino.DocObjects.Tables.NamedPositionTable.Count
Number of Named Positions in the table.
Since: 6.0

Rhino.DocObjects.Tables.NamedPositionTable.Ids
Array of Named Position Guids.
Returns:
Guid array of each Named Position in the document.
Since: 6.0

Rhino.DocObjects.Tables.NamedPositionTable.Names
Array of Named Position names.
Returns:
A string array with the names all Named Positions in the document.
Since: 6.0

Rhino.DocObjects.Tables.NamedPositionTable.Objects(System.Guid)
Array of Rhino Objects related to a Named Position.
id:
The Guid of the named position from which you want to retrieve the objects.
Returns:
Array of Rhino Objects which are tracked by the Named Position.
Since: 6.0

Rhino.DocObjects.Tables.NamedPositionTable.Objects(System.String)
Array of Rhino Objects related to a Named Position.
name:
The name of the Named Position from which you want to retrieve the objects.
Returns:
Array of Rhino Objects which are tracked by the Named Position if successful, null if no such Named Position exists.
Since: 6.0

Rhino.DocObjects.Tables.NamedPositionTable.ObjectIds(System.Guid)
Array of Rhino Object Guids related to a Named Position.
id:
The Guid of the named position from which you want to retrieve the objects.
Returns:
Array of Guid which pertain to the objects tracked by the Named Position.
Since: 6.0

Rhino.DocObjects.Tables.NamedPositionTable.ObjectIds(System.String)
Array of Rhino Object Guids related to a Named Position.
name:
The name of the Named Position from which you want to retrieve the objects.
Returns:
Array of Guid which pertain to the objects tracked by the Named Position, or null in case no such Named Position is found.
Since: 6.0

Rhino.DocObjects.Tables.NamedPositionTable.ObjectXform(System.Guid,Rhino.DocObjects.RhinoObject,Rhino.Geometry.Transform@)
Retrieve the Transform of a Rhino Object relate to a Named Position.
id:
The Guid of the Named Position
obj:
The Rhino Object from which to retrieve the Transform.
xform:
The Transform to retrieve.
Returns:
Transform of the RhinoObject related to the Named Position.
Since: 6.0

Rhino.DocObjects.Tables.NamedPositionTable.ObjectXform(System.Guid,System.Guid,Rhino.Geometry.Transform@)
Retrieve the Transform of a Rhino Object relate to a Named Position.
id:
The Guid of the Named Position
objId:
The Guid of the Rhino Object from which to retrieve the Transform.
xform:
The Transform to retrieve.
Returns:
Transform of the RhinoObject related to the Named Position.
Since: 6.0

Rhino.DocObjects.Tables.NamedPositionTable.Name(System.Guid)
Name of a Named Position.
id:
Guid of the Named Position for which you want to retrieve the name.
Returns:
The name of the Named Position as a string.
Since: 6.0

Rhino.DocObjects.Tables.NamedPositionTable.Id(System.String)
Guid of a Named Position.
name:
Name of the Named Position for which you want to retrieve the Guid.
Returns:
The Guid of the Named Position.  If not found, an empty Guid is returned.
Since: 6.0

Rhino.DocObjects.Tables.NamedPositionTable.Restore(System.Guid)
Restore a Named Position.
id:
Guid of the Named Position to restore.
Returns:
True or False based on whether the Named Position was able to be restored.
Since: 6.0

Rhino.DocObjects.Tables.NamedPositionTable.Restore(System.String)
Restore a Named Position.
name:
Name of the Named Position to restore.
Returns:
True or False based on whether the Named Position was able to be restored.
Since: 6.0

Rhino.DocObjects.Tables.NamedPositionTable.Save(System.String,System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject})
Save a new Named Position.
name:
Name for this Named Position.
objects:
Array of Rhino Objects which should be included in this Named Position.
Returns:
Guid of the newly saved Named Position.
Since: 6.0

Rhino.DocObjects.Tables.NamedPositionTable.Save(System.String,System.Collections.Generic.IEnumerable{System.Guid})
Save a new Named Position.
name:
Name for this Named Position.
objectIds:
Array of Rhino Object Ids which should be included in this Named Position.
Returns:
Guid of the newly saved Named Position.
Since: 6.0

Rhino.DocObjects.Tables.NamedPositionTable.Delete(System.Guid)
Delete a Named Position.
id:
Guid of the Named Position which you want to delete.
Returns:
True or False depending on whether the Delete was successful, Null in case the id does not exist as a Named Position.
Since: 6.0

Rhino.DocObjects.Tables.NamedPositionTable.Delete(System.String)
Delete a Named Position.
name:
Name of the Named Position which you want to delete.
Returns:
True or False depending on whether the Delete was successful, Null in case the id does not exist as a Named Position.
Since: 6.0

Rhino.DocObjects.Tables.NamedPositionTable.Update(System.Guid)
Updates a Named Position, effectively storing the current positions of the objects which the Named Position is tracking.
id:
Guid of the Named Position which you want to update.
Returns:
True or False depending on whether the Update was successful.
Since: 6.0

Rhino.DocObjects.Tables.NamedPositionTable.Update(System.String)
Updates a Named Position, effectively storing the current positions of the objects which the Named Position is tracking.
name:
Name of the Named Position which you want to update.
Returns:
True or False depending on whether the Update was successful.
Since: 6.0

Rhino.DocObjects.Tables.NamedPositionTable.Rename(System.Guid,System.String)
Rename a Named Position.
id:
Guid of the Named Position which you want to rename.
name:
New name for the Named Position.
Returns:
True or False depending on whether the Rename was successful.  For example, this method might return False if you attempt to rename the Named Position with the currently assigned name.
Since: 6.0

Rhino.DocObjects.Tables.NamedPositionTable.Rename(System.String,System.String)
Rename a Named Position.
oldName:
Current name of the Named Position which you want to rename.
name:
New name for the Named Position.
Returns:
True or False depending on whether the Rename was successful.  For example, this method might return False if you attempt to rename the Named Position with the currently assigned name.
Since: 6.0

Rhino.DocObjects.Tables.NamedPositionTable.Append(System.Guid,System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject})
Append objects to a Named Position.
id:
Guid of the Named Position which you want to append to.
objects:
Collection of Rhino Objects to be included in this Named Position.
Returns:
True or False depending on whether the Append was successful.
Since: 6.0

Rhino.DocObjects.Tables.NamedPositionTable.Append(System.Guid,System.Collections.Generic.IEnumerable{System.Guid})
Append objects to a Named Position.
id:
Guid of the Named Position which you want to append to.
objectIds:
New object ids to be included in this Named Position.
Returns:
True or False depending on whether the Append was successful.
Since: 6.0

Rhino.DocObjects.Tables.NamedPositionTable.Append(System.String,System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject})
Append objects to a Named Position.
name:
Name of the Named Position which you want to append to.
objects:
Collection of Rhino Objects to be included in this Named Position.
Returns:
True or False depending on whether the Append was successful.
Since: 6.0

Rhino.DocObjects.Tables.NamedPositionTable.Append(System.String,System.Collections.Generic.IEnumerable{System.Guid})
Append objects to a Named Position.
name:
Name of the Named Position which you want to append to.
objectIds:
New object Guids to be included in this Named Position.
Returns:
True or False depending on whether the Append was successful.
Since: 6.0