Rhino.Geometry.Collections.SubDEdgeList
All edges in a SubD

Rhino.Geometry.Collections.SubDEdgeList.Count
Gets the number of SubD edges.
Since: 7.0

Rhino.Geometry.Collections.SubDEdgeList.Find(System.UInt32)
Find an edge in this SubD with a given id
id:
Returns:
Since: 7.0

Rhino.Geometry.Collections.SubDEdgeList.Find(System.Int32)
Find an edge in this SubD with a given id
id:
Returns:
Since: 7.0

Rhino.Geometry.Collections.SubDEdgeList.GetEnumerator
Implementation of IEnumerable
Returns:
Since: 7.0

Rhino.Geometry.Collections.SubDEdgeList.System#Collections#IEnumerable#GetEnumerator
Since: 7.0

Rhino.Geometry.Collections.SubDEdgeList.EdgeEnumerator
All edges associated with this vertex

Rhino.Geometry.Collections.SubDEdgeList.Add(Rhino.Geometry.SubDEdgeTag,Rhino.Geometry.SubDVertex,Rhino.Geometry.SubDVertex)
Add a new edge to the list.
tag: The type of edge tag, such as smooth or corner.
v0: First vertex.
v1: Second vertex.
Throws System.ArgumentOutOfRangeException: If tag is unset or non-defined.
Since: 7.0

Rhino.Geometry.Collections.SubDEdgeList.SetEdgeTags(System.Collections.Generic.IEnumerable{System.Int32},Rhino.Geometry.SubDEdgeTag)
Set edge tags for a list of edges. Useful for adding creases to SubDs
edgeIndices: list of indices for the edges to set tags on
tag: The type of edge tag
Since: 7.7

Rhino.Geometry.Collections.SubDEdgeList.SetEdgeTags(System.Collections.Generic.IEnumerable{Rhino.Geometry.SubDEdge},Rhino.Geometry.SubDEdgeTag)
Set edge tags for a list of edges. Useful for adding creases to SubDs
edges: list of edges to set a specific tag on
tag: The type of edge tag
Since: 7.7

Rhino.Geometry.Collections.SubDEdgeList.FindOrAdd(Rhino.Geometry.SubDVertex,Rhino.Geometry.SubDVertex)
Gets the edge between two vertices, adding a smooth edge if there is not one yet.
v0: First vertex.
v1: Second vertex.
Returns: The existing or newly added edge, or null on failure.
Since: 8.36