Rhino.Render.RenderSettings.EnvironmentUsage
The usage of a render environment.
Since: 8.0

Rhino.Render.RenderSettings.EnvironmentUsage.Background
Specifies the 360 background environment.

Rhino.Render.RenderSettings.EnvironmentUsage.Reflection
Specifies the custom reflective environment. Also used for refraction.

Rhino.Render.RenderSettings.EnvironmentUsage.Skylighting
Specifies the custom skylighting environment.