Rhino.Geometry.CurveProxy
Represent curve geometry. Usually this is part of another piece of geometry
that can be represented as a "proxy".

Rhino.Geometry.CurveProxy.#ctor
Protected constructor for internal use.

Rhino.Geometry.CurveProxy.ProxyCurveIsReversed
True if "this" is a curve is reversed from the "real" curve geometry
Since: 5.10