Rhino.Render.PreviewJobSignature
Preview Job Signature is a specific identifier for a specific rendered preview

Rhino.Render.PreviewJobSignature.CppPointer
UnManaged pointer of the PreviewJobsingature
Since: 8.8

Rhino.Render.PreviewJobSignature.#ctor
Preview Job Signature constructor
Since: 8.8

Rhino.Render.PreviewJobSignature.#ctor(System.IntPtr)
Preview Job Signature constructor
Since: 8.8

Rhino.Render.PreviewJobSignature.#ctor(System.Int32,System.Int32,System.UInt32)
Preview Job Signature constructor
Since: 8.8

Rhino.Render.PreviewJobSignature.Finalize
Preview Job Signature destructor

Rhino.Render.PreviewJobSignature.Dispose
Dispose
Since: 8.8

Rhino.Render.PreviewJobSignature.Dispose(System.Boolean)
Dispose

Rhino.Render.PreviewJobSignature.Compare(Rhino.Render.PreviewJobSignature)
Compare two Preview Job Signatures. True if they are the same, otherwise false.
Since: 8.8

Rhino.Render.PreviewJobSignature.ImageWidth
The Width of the rendered preview image
Since: 8.8

Rhino.Render.PreviewJobSignature.ImageHeight
The Height of the rendered preview image
Since: 8.8