Rhino.FileIO.FilePdf
Support for PDF file format

Rhino.FileIO.FilePdf.PreWrite
Fired immediately before a PDF is written
Since: 6.0

Rhino.FileIO.FilePdf.FirePreWriteEvent
Called by the framework to fire a PreWrite event

Rhino.FileIO.FilePdf.Create
Create a new instance of a FilePdf class
Returns:
Since: 6.0

Rhino.FileIO.FilePdf.LayersAsOptionalContentGroups
Add layers as "optional content groups" to the PDF. This is the
visible layer tree available in PDF viewers
Since: 7.0

Rhino.FileIO.FilePdf.AddPage(Rhino.Display.ViewCaptureSettings)
Add a new page to this document and draw a viewport into it based on
provided ViewCaptureSettings
settings:
Returns: page number on success
Since: 6.0

Rhino.FileIO.FilePdf.AddPage(System.Int32,System.Int32,System.Int32)
Add a blank page to this document
widthInDots:
heightInDots:
dotsPerInch:
Returns: page number on success
Since: 6.5

Rhino.FileIO.FilePdf.DrawText(System.Int32,System.String,System.Double,System.Double,System.Single,Rhino.DocObjects.Font,System.Drawing.Color,System.Drawing.Color,System.Single,System.Single,Rhino.DocObjects.TextHorizontalAlignment,Rhino.DocObjects.TextVerticalAlignment)
Draw text on a page
pageNumber:
text:
x:
y:
heightPoints:
onfont:
fillColor:
strokeColor:
strokeWidth:
angleDegrees:
horizontalAlignment:
verticalAlignment:
Since: 6.5

Rhino.FileIO.FilePdf.DrawPolyline(System.Int32,System.Drawing.PointF[],System.Drawing.Color,System.Drawing.Color,System.Single)
Draw a polyline path
pageNumber:
polyline:
fillColor:
strokeColor:
strokeWidth:
Since: 6.5

Rhino.FileIO.FilePdf.DrawLine(System.Int32,System.Drawing.PointF,System.Drawing.PointF,System.Drawing.Color,System.Single)
Draw a line
pageNumber:
from:
to:
strokeColor:
strokeWidth:
Since: 6.5

Rhino.FileIO.FilePdf.DrawBitmap(System.Int32,System.Drawing.Bitmap,System.Single,System.Single,System.Single,System.Single,System.Single)
Draw a bitmap
pageNumber:
bitmap:
left:
top:
width:
height:
rotationInDegrees:
Since: 6.5

Rhino.FileIO.FilePdf.Write(System.String)
Write PDF to a file
filename:
Since: 6.0

Rhino.FileIO.FilePdf.Write(System.IO.Stream)
Write PDF to a stream
stream:
Since: 6.0

Rhino.FileIO.FilePdf.PdfDocumentImplementation
Get actual implementation of PdfDocument class
Returns:
Since: 6.0

Rhino.FileIO.FilePdf.Read(System.String,Rhino.RhinoDoc,Rhino.FileIO.FilePdfReadOptions)
Read a PDF file into a RhinoDoc
path: path to read a file from
doc: document to import geometry into
options: options used for importing the PDF file
Returns: true on success
Since: 8.0