Rhino.UI.OptionsDialogPage.RunScript(Rhino.RhinoDoc,Rhino.Commands.RunMode)
Since: 5.0

Rhino.UI.OptionsDialogPage.OptionsPageType
17 March 2021 John Morse
For internal use in determining the page type.  RhinoMac uses this
to ensure pages are sized properly when hosting them.
Since: 8.0