Rhino.ScaleValue.ScaleStringFormat
Specifies preferred formats for automatically
created string descriptions of a scale value.

Rhino.ScaleValue.ScaleStringFormat.None
No preference for automatically created string descriptions of a scale value.

Rhino.ScaleValue.ScaleStringFormat.RatioFormat
Prefer the ratio format using a colon, like "1:4" or "4:1".

Rhino.ScaleValue.ScaleStringFormat.EquationFormat
Prefer the equation format using an equal sign, like "1 = 4" or "4 = 1".

Rhino.ScaleValue.ScaleStringFormat.FractionFormat
Prefer the fraction format using a slash, like "1/4" or "4/1".

Rhino.ScaleValue.ScaleStringFormat.Unset
ON_ScaleValue::ScaleStringFormat::Unset is used to indicate no preference is set.
This condition is different from ON_ScaleValue::ScaleStringFormat::None.