Rhino.DocObjects.Tables.FontTable
Font tables store the list of fonts in a Rhino document.
Remarks: The FontTable is now just a wrapper around the DimStyles table.

Rhino.DocObjects.Tables.FontTable.Document
Document that owns this table.
Since: 5.0

Rhino.DocObjects.Tables.FontTable.Count
Number of fonts in the table.
Since: 5.0

Rhino.DocObjects.Tables.FontTable.CurrentIndex
At all times, there is a "current" font.  Unless otherwise specified,
new dimension objects are assigned to the current font. The current
font is never deleted.
Returns: Zero based font index of the current font.
Since: 5.0

Rhino.DocObjects.Tables.FontTable.Item(System.Int32)
Gets the font at a position.
index: The index of the font.
Returns: A font, or null if no font was not found at that position.

Rhino.DocObjects.Tables.FontTable.FindOrCreate(System.String,System.Boolean,System.Boolean)
Get a DimensionStyle with the specified characteristics
the settings other than face, bold and italic are copied from the current style
face:
bold:
italic:
Returns:
Since: 5.0

Rhino.DocObjects.Tables.FontTable.FindOrCreate(System.String,System.Boolean,System.Boolean,Rhino.DocObjects.DimensionStyle)
Get a DimensionStyle with the specified characteristics
face:
bold:
italic:
template_style:
the settings other than face, bold and italic are copied from the template_style
Returns:
Since: 6.0

Rhino.DocObjects.Tables.FontTable.GetEnumerator
Since: 5.0

Rhino.DocObjects.Tables.FontTable.System#Collections#IEnumerable#GetEnumerator
Since: 5.0