Rhino.Runtime.AssemblyResolver
Assembly Resolver for the Rhino App Domain.

Rhino.Runtime.AssemblyResolver.CurrentDomainAssemblyResolve
Standard resolver function used by Rhino in execution context.
This is added to the Current System.AppDomain.AssemblyResolve.
Since: 7.9

Rhino.Runtime.AssemblyResolver.CurrentDomainReflectionOnlyAssemblyResolve
Standard resolver function used by Rhino in reflection-only context.
This is added to the Current System.AppDomain.ReflectionOnlyAssemblyResolve.
Since: 7.9

Rhino.Runtime.AssemblyResolver.AddSearchFolder(System.String)
Register a custom folder with the Assembly Resolver. Folders will be
searched recursively, so this could potentially be a very expensive operation.
If at all possible, you should consider only registering individual files.
folder: Path of folder to include during Assembly Resolver events.
Since: 5.0

Rhino.Runtime.AssemblyResolver.AddSearchFile(System.String)
Register another file with the Assembly Resolver. File must be a .NET assembly,
so it should probably be a dll, rhp or exe.
file: Path of file to include during Assembly Resolver events.
Since: 5.0