Rhino.Render.PostEffects.PostEffectChannel.#ctor(System.IntPtr)
Since: 7.0

Rhino.Render.PostEffects.PostEffectChannel.CppPointer
Since: 7.0

Rhino.Render.PostEffects.PostEffectChannel.Dispose
Since: 7.0

Rhino.Render.PostEffects.PostEffectChannel.Id
Return the channel id which indicates what type of data is used in this channel.
Since: 7.0

Rhino.Render.PostEffects.PostEffectChannel.PixelSize
Return the pixel size in bytes for this channel.
Since: 7.0

Rhino.Render.PostEffects.PostEffectChannel.CPU
Return an interface to this channel for doing channel operations on the CPU.
Since: 7.0

Rhino.Render.PostEffects.PostEffectChannel.GPU
Return an interface to this channel for doing channel operations on the GPU.
Since: 7.0

Rhino.Render.PostEffects.PostEffectChannel.Clone
Return a clone of this channel.
Since: 7.0

Rhino.Render.PostEffects.PostEffectChannel.Commit
Commit changes to the channel so that those changes can be used by subsequent post effects in the chain.
Only valid for channels that were obtained by calling GetChannelForWrite().
If the channel has the same id as an existing channel, the existing channel will be replaced by
the new one. If the existing channel was created by a previous post effect in the chain, it will be deleted.
Changes to channels that are not commited simply get ignored.
Note: This call merely sets a flag. The process is deferred until after the post effect has finished executing.
Since: 7.0