Rhino.FileIO.FileAi
Support for writing ai file format

Rhino.FileIO.FileAi.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileAiWriteOptions)
Write a Ai file based on the contents of a RhinoDoc
path: path to write a file to
doc: document to get geometry from
options: options used for generating the ai file
Returns: true on success
Since: 8.0

Rhino.FileIO.FileAi.Read(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileAiReadOptions)
Read a Ai file into a RhinoDoc
path: path to read a file from
doc: document to import geometry into
options: options used for importing the Ai file
Returns: true on success
Since: 8.0