Rhino.Runtime.NotLicensedException
Exception thrown when calling functions in RhinoCommon and the
application is executing without a license

Rhino.Runtime.NotLicensedException.#ctor
Default constructor
Since: 7.0

Rhino.Runtime.NotLicensedException.#ctor(System.String)
Create a new instance with a custom message
message:
Since: 7.0

Rhino.Runtime.NotLicensedException.#ctor(System.String,System.Exception)
Create a new instance with a custom message and an inner exception
message:
inner:
Since: 7.0