Rhino.ApplicationSettings.ZebraAnalysisSettingsState
Represents a snapshot of Rhino.ApplicationSettings.ZebraAnalysisSettings.
Since: 7.8

Rhino.ApplicationSettings.ZebraAnalysisSettingsState.VerticalStripes
Set to true for vertical stripes, or false for horizontal stripes.
Since: 7.8

Rhino.ApplicationSettings.ZebraAnalysisSettingsState.ShowIsoCurves
Get or sets the display of surface isocurves.
Since: 7.8

Rhino.ApplicationSettings.ZebraAnalysisSettingsState.StripeColor
Gets or sets the stripe color.
Since: 7.8

Rhino.ApplicationSettings.ZebraAnalysisSettingsState.StripeThickness
Gets or sets the stripe thickness, where 0 = thinnest and 6 = thickest.
Since: 7.8