Rhino.Render.TwoColorRenderTexture.#ctor
Since: 5.1

Rhino.Render.TwoColorRenderTexture.Color1
Since: 5.1

Rhino.Render.TwoColorRenderTexture.Color2
Since: 5.1

Rhino.Render.TwoColorRenderTexture.Texture1On
Since: 5.1

Rhino.Render.TwoColorRenderTexture.Texture2On
Since: 5.1

Rhino.Render.TwoColorRenderTexture.Texture1Amount
Since: 5.1

Rhino.Render.TwoColorRenderTexture.Texture2Amount
Since: 5.1

Rhino.Render.TwoColorRenderTexture.SwapColors
Since: 5.1

Rhino.Render.TwoColorRenderTexture.SuperSample
Since: 5.1