Rhino.Geometry.Morphs.BendSpaceMorph
Deforms objects by bending along a spine arc.

Rhino.Geometry.Morphs.BendSpaceMorph.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Boolean)
Constructs a bend space morph.
start: Start of spine that represents the original orientation of the object.
end: End of spine.
point: Point to bend through.
straight: If false, then point determines the region to bend. If true, only the spine region is bent.
symmetric: If false, then only one end of the object bends. If true, then the object will bend symmetrically around the center if you start the spine in the middle of the object.
Since: 5.9

Rhino.Geometry.Morphs.BendSpaceMorph.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Boolean,System.Boolean)
Constructs a bend space morph.
start: Start of spine that represents the original orientation of the object.
end: End of spine.
point: Used for bend direction.
angle: Bend angle in radians.
straight: If false, then point determines the region to bend. If true, only the spine region is bent.
symmetric: If false, then only one end of the object bends. If true, then the object will bend symmetrically around the center if you start the spine in the middle of the object.
Since: 5.9

Rhino.Geometry.Morphs.BendSpaceMorph.IsValid
Returns true if the space morph definition is valid, false otherwise.
Since: 5.9

Rhino.Geometry.Morphs.BendSpaceMorph.MorphPoint(Rhino.Geometry.Point3d)
Morphs an Euclidean point.
point: A point that will be morphed by this object.
Returns: Resulting morphed point.
Since: 5.9

Rhino.Geometry.Morphs.BendSpaceMorph.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Geometry.Morphs.BendSpaceMorph.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.9

Rhino.Geometry.Morphs.BendSpaceMorph.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.