Rhino.UI.RhinoPageInterop
For internal use only, provides access to unmanaged core
Rhino.

Rhino.UI.RhinoPageInterop.NewPropertiesPanelPagePointer(Rhino.UI.ObjectPropertiesPage,System.UInt32)
For internal use only, provides access to unmanaged core
page:
rhinoDocRuntimeSn:
Returns:
Since: 6.0

Rhino.UI.RhinoPageInterop.StackedDialogPageFromUnmanagedPointer(System.IntPtr)
For internal use only, provides access to unmanaged core
pointer:
Returns:
Since: 6.4