Rhino.Display.ViewEnableDrawingEventArgs
View enable drawing event argument.
Since: 8.15

Rhino.Display.ViewEnableDrawingEventArgs.DocumentSerialNumber
The serial number of the Rhino document.
Since: 8.15

Rhino.Display.ViewEnableDrawingEventArgs.DrawingEnabled
True if drawing is enabled, false otherwise.
Since: 8.15

Rhino.Display.ViewEnableDrawingEventArgs.Document
Gets the Rhino document.
Since: 8.15