Rhino.Runtime.PythonCompiledCode
Represents scripting compiled code.

Rhino.Runtime.PythonCompiledCode.Execute(Rhino.Runtime.PythonScript)
Executes the script in a specific scope.
scope: The scope where the script should be executed.
Since: 5.0