Rhino.Runtime.LicenseManager._setCallbacksWasRun
Gets set to true after initial call to
UnsafeNativeMethods.RHC_SetLicenseManagerCallbacks and is checked to
make sure it only gets called one time.

Rhino.Runtime.LicenseManager.SetCallbacks
Only needs to be called once, will call into rhcommon_c and set call
back function pointers

Rhino.Runtime.LicenseManager.ActivateLicenseFromUrlCallbackName
RH-92774: name of the named callback that activates a Rhino license from a
rhinoN://license link. Registered by Rhino.Runtime.LicenseManager.SetCallbacks and invoked both by
core Rhino during startup licensing and by the protocol handler in the Commands
plug-in for a link that arrives while Rhino is already running.

Rhino.Runtime.LicenseManager.ActivateLicenseFromUrlHelper(System.Object,Rhino.Runtime.NamedParametersEventArgs)
RH-92774: handles a rhinoN://license/add?key=...&email=... link.
Reads "url" from args, and sets "handled" to true when the link was a license link
that this call consumed - whether or not activation succeeded - so the caller knows
not to route the same URL anywhere else.

Rhino.Runtime.LicenseManager.GetQueryValue(System.String,System.String)
Reads one value out of a URL query string, decoded. Hand-rolled rather than using
System.Web.HttpUtility, which RhinoCommon does not reference; the semantics match
ParseQueryString, including treating "+" as a space, so a link behaves identically
whether it arrives at startup or through the protocol handler.

Rhino.Runtime.LicenseManager.ActivateLicenseFromUrl(System.String,System.String)
RH-92774: confirms, then validates a license key from a rhinoN://license link.

Rhino.Runtime.LicenseManager.ReportValidationFailure(System.String)
RH-92777: reports why validating a rhinoN://license link's key failed. The link is a
one-click action started from a web page, and on the startup path it runs before the
command line exists, so RhinoApp.WriteLine on its own leaves the user looking at a link
that silently did nothing. The reason is also logged, so support can see it after the
fact; the zoo client logs the specific internal reason alongside it.

Rhino.Runtime.LicenseManager.InitializeHelper
Returns:

Rhino.Runtime.LicenseManager.EchoHelper(System.String,System.IntPtr)
message:
resultString:

Rhino.Runtime.LicenseManager.ShowValidationUiHelper(System.String)
cdKey:
Returns:

Rhino.Runtime.LicenseManager.GetLicenseHelper(System.String,System.Guid,System.Guid,System.Int32,System.String,System.IntPtr)
title:
pluginId:
licenseId:
productBuildType:
path:
validator:
Returns:

Rhino.Runtime.LicenseManager.CustomGetLicenseHelper(System.Guid,System.Guid,System.String,System.UInt32,System.String,System.String,System.IntPtr)
pluginId:
licenseId:
title:
capabilities:
textMask:
path:
validator:
Returns:

Rhino.Runtime.LicenseManager.GetRegisteredOwnerInfoHelper(System.Guid,System.IntPtr,System.IntPtr)
productId:
ownerWStringPointer:
companyWStringPointer:
Returns:

Rhino.Runtime.LicenseManager.AskUserForLicenseHelper(System.String,System.Boolean,System.IntPtr,System.Guid,System.Guid,System.Int32,System.String,System.String,System.IntPtr,System.UInt32)
productTitle:
standAlone:
parent:
productId:
licenseId:
productBuildType:
textMask:
path:
validator:
capabilities:
Returns:

Rhino.Runtime.LicenseManager.g_validation_failure_detail
RH-92777: why the most recent rhinoN://license validation failed, when the license
validator gave a specific reason. Set by ValidateLicenseNoPromptHelper and consumed by
ActivateLicenseFromUrl, which are both on this class, so this needs no new SDK surface.

Rhino.Runtime.LicenseManager.UuidHelper(System.Int32,System.Guid)
The CRhCmn_ZooClient; ReturnLicense(), CheckOutLicense(),
CheckInLicense(), ConvertLicense(), and GetLicenseType() methods call
this method with the appropriate mode.
mode: Calling function Id
id: License type Id
Returns: