Rhino.FileIO.File3dmStringTable
Provides access to document strings in the 3dm file.

Rhino.FileIO.File3dmStringTable.Count
Returns the number of document strings in the 3dm file.
Since: 6.0

Rhino.FileIO.File3dmStringTable.DocumentUserTextCount
Returns the number of Section/Entry-style key values.
Since: 6.0

Rhino.FileIO.File3dmStringTable.GetKey(System.Int32)
Returns a key value at a given index.
i: The index.
Returns: The key if successful.
Since: 6.0

Rhino.FileIO.File3dmStringTable.GetValue(System.Int32)
Returns a string value at a given index.
i: The index at which to get the value.
Returns: The string value if successful.
Since: 6.0

Rhino.FileIO.File3dmStringTable.GetValue(System.String)
Returns a string value at a key.
key: The key at which to get the value.
Returns: The string value if successful.
Since: 6.0

Rhino.FileIO.File3dmStringTable.GetValue(System.String,System.String)
Returns a string value given a section and entry.
section: The section at which to get the value.
entry: The entry to search for.
Returns: The string value if successful.
Since: 6.0

Rhino.FileIO.File3dmStringTable.GetSectionNames
Returns a list of all the section names for document strings in the 3dm file.
By default a section name is a key that is prefixed with a string separated by a backslash.
Returns: An array of section names. This can be empty, but not null.
Since: 6.0

Rhino.FileIO.File3dmStringTable.GetEntryNames(System.String)
Return list of all entry names for a given section of document strings in the 3dm file.
section: The section from which to retrieve section names.
Returns: An array of section names. This can be empty, but not null.
Since: 6.0

Rhino.FileIO.File3dmStringTable.SetString(System.String,System.String,System.String)
Adds or sets a document string in the 3dm file.
section: The section.
entry: The entry name.
value: The entry value.
Returns:
The previous value if successful.
Since: 6.0

Rhino.FileIO.File3dmStringTable.SetString(System.String,System.String)
Adds or sets a document string in the 3dm file.
key: The key.
value: The entry value.
Returns:
The previous value if successful.
Since: 6.0

Rhino.FileIO.File3dmStringTable.Delete(System.String,System.String)
Removes document strings from the 3dm file.
section: name of section to delete. If null, all sections will be deleted.
entry: name of entry to delete. If null, all entries will be deleted for a given section.
Since: 6.0

Rhino.FileIO.File3dmStringTable.Delete(System.String)
Removes a document string from the 3dm file.
key: The key to remove.
Since: 6.0