Rhino.UI.OptionPageButtons
Standard IRhinoOptionsPageButton

Rhino.UI.OptionPageButtons.None
Don't display any of the standard buttons.

Rhino.UI.OptionPageButtons.DefaultButton
The "Restore Defaults" button located at the bottom of the host.

Rhino.UI.OptionPageButtons.ApplyButton
The "Apply" button located at the bottom of the host.