Rhino.DocObjects.TextDisplayAlignment
Defines enumerated values for the line alignment of text.
Since: 5.0

Rhino.DocObjects.TextDisplayAlignment.Normal
Normal alignment.

Rhino.DocObjects.TextDisplayAlignment.Horizontal
Horizontal alignment.

Rhino.DocObjects.TextDisplayAlignment.AboveLine
Above line alignment.

Rhino.DocObjects.TextDisplayAlignment.InLine
In line alignment.