Rhino.Geometry.QuadRemeshSymmetryAxis
Symmetrical meshing axis
Since: 7.0

Rhino.Geometry.QuadRemeshSymmetryAxis.None
No symmetric re-meshing

Rhino.Geometry.QuadRemeshSymmetryAxis.X
Symmetry across X axis

Rhino.Geometry.QuadRemeshSymmetryAxis.Y
Symmetry across Y axis

Rhino.Geometry.QuadRemeshSymmetryAxis.Z
Symmetry across Z axis