Rhino.Geometry.TextDot
Represents a text dot, or an annotation entity with text that always faces the camera and always has the same size.
This class refers to the geometric element that is independent from the document.

Rhino.Geometry.TextDot.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor used in serialization.

Rhino.Geometry.TextDot.#ctor(System.String,Rhino.Geometry.Point3d)
Initializes a new text dot based on the text and the location.
text: Text.
location: A position.
Since: 5.0

Rhino.Geometry.TextDot.Point
Gets or sets the position of the text dot.
Since: 5.0

Rhino.Geometry.TextDot.Text
Gets or sets the primary text of the text dot.
Since: 5.0

Rhino.Geometry.TextDot.SecondaryText
Gets or sets the secondary text of the text dot.
Since: 6.0

Rhino.Geometry.TextDot.FontHeight
Height of font used for displaying the dot
Since: 5.2

Rhino.Geometry.TextDot.FontFace
Font face used for displaying the dot
Since: 5.2