Rhino.Geometry.HiddenLineDrawingPoint.Visibility
The different types of HiddenLineObjectPoint visibility
Since: 6.8

Rhino.Geometry.HiddenLineDrawingPoint.Visibility.Unset
Unset value

Rhino.Geometry.HiddenLineDrawingPoint.Visibility.Visible
Visible

Rhino.Geometry.HiddenLineDrawingPoint.Visibility.Hidden
Hidden

Rhino.Geometry.HiddenLineDrawingPoint.Visibility.Duplicate
Duplicate