Rhino.Geometry.SurfaceFilletBase
New interactive FilletSrf

Rhino.Geometry.SurfaceFilletBase.#ctor(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,System.Double)
FaceA:
uvA:
FaceB:
uvB:
radius:
tolerance:

Rhino.Geometry.SurfaceFilletBase.#ctor(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,System.Boolean,System.Double)
FaceA:
uvA:
FaceB:
uvB:
radius:
allowExtend:
tolerance:

Rhino.Geometry.SurfaceFilletBase.#ctor(Rhino.Geometry.BrepFace,Rhino.Geometry.Curve,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double)
RailFace:
Rail3d:
Face:
uv:
tolerance:
Throws System.NullReferenceException:

Rhino.Geometry.SurfaceFilletBase.#ctor(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.Curve,System.Double,System.Double,System.Double)
face:
uv:
rail3d:
u:
tolerance:
radius:
Throws System.NullReferenceException:

Rhino.Geometry.SurfaceFilletBase.Finalize


Rhino.Geometry.SurfaceFilletBase.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 7.9

Rhino.Geometry.SurfaceFilletBase.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.Geometry.SurfaceFilletBase.ChangeFilletRadius(System.Double)
This will clear out the existing rails and fillet surfaces,
and redo the offset intersections, etc.
radius: The new radius
Returns: true if successful

Rhino.Geometry.SurfaceFilletBase.TrimBreps(System.Boolean,System.Collections.Generic.List{Rhino.Geometry.Brep},System.Collections.Generic.List{Rhino.Geometry.Brep})
If the two input breps are the same, TrimmedBreps[1] will be empty.
The constructor idoes everything necessary for this to be called.
Calles to the various fillet creation members will not change the result.
bExtend:
TrimmedBreps0:
TrimmedBreps1:
Returns:
Since: 8.0

Rhino.Geometry.SurfaceFilletBase.RationalArcs(System.Int32,System.Boolean,System.Collections.Generic.List{Rhino.Geometry.Brep})
make fillet surfaces and hack them up to active pieces. Adjusts cross sections
railDegree: The degree of the rail
bExtend: If true, when one input surface is longer than the other, the fillet surface is extended to the input surface edges.
Fillets: the fillet8s that were created
Returns: true if successful
Since: 8.0

Rhino.Geometry.SurfaceFilletBase.NonRationalQuinticArcs(System.Int32,System.Boolean,System.Collections.Generic.List{Rhino.Geometry.Brep})
make fillet surfaces and hack them up to active pieces. Adjusts cross sections
railDegree: The degree of the rail
bExtend: If true, when one input surface is longer than the other, the fillet surface is extended to the input surface edges.
Fillets: the fillet8s that were created
Returns: true if successful
Since: 8.0

Rhino.Geometry.SurfaceFilletBase.NonRationalQuintic(System.Int32,System.Double,System.Double,System.Boolean,System.Collections.Generic.List{Rhino.Geometry.Brep})
make fillet surfaces and hack them up to active pieces. Adjusts cross sections
railDegree: The degree of the rail
TanSlider: A number from -1 to 1 indicating how far towards the theoretical rational midpoint to adjust the tangent control points.
InnerSlider: A number from -1 to 1 indicating how far towards the theoretical rational midpoint to adjust the inner control points.
bExtend: If true, when one input surface is longer than the other, the fillet surface is extended to the input surface edges.
Fillets: the fillet8s that were created
Returns: true if successful
Since: 8.0

Rhino.Geometry.SurfaceFilletBase.NonRationalQuarticArcs(System.Int32,System.Boolean,System.Collections.Generic.List{Rhino.Geometry.Brep})
make fillet surfaces and hack them up to active pieces. Adjusts cross sections
railDegree: The degree of the rail
bExtend: If true, when one input surface is longer than the other, the fillet surface is extended to the input surface edges.
Fillets: the fillet8s that were created
Returns: true if successful
Since: 8.0

Rhino.Geometry.SurfaceFilletBase.NonRationalQuartic(System.Int32,System.Double,System.Double,System.Boolean,System.Collections.Generic.List{Rhino.Geometry.Brep})
make fillet surfaces and hack them up to active pieces. Adjusts cross sections
railDegree: The degree of the rail
TanSlider: A number from -1 to 1 indicating how far towards the theoretical rational midpoint to adjust the tangent control points.
InnerSlider: A number from -1 to 1 indicating how far towards the theoretical rational midpoint to adjust the inner control points.
bExtend: If true, when one input surface is longer than the other, the fillet surface is extended to the input surface edges.
Fillets: the fillet8s that were created
Returns: true if successful
Since: 8.0

Rhino.Geometry.SurfaceFilletBase.NonRationalCubicArcs(System.Int32,System.Boolean,System.Collections.Generic.List{Rhino.Geometry.Brep})
make fillet surfaces and hack them up to active pieces. Adjusts cross sections
railDegree: The degree of the rail
bExtend: If true, when one input surface is longer than the other, the fillet surface is extended to the input surface edges.
Fillets: the fillet8s that were created
Returns: true if successful
Since: 8.0

Rhino.Geometry.SurfaceFilletBase.NonRationalCubic(System.Int32,System.Double,System.Boolean,System.Collections.Generic.List{Rhino.Geometry.Brep})
make fillet surfaces and hack them up to active pieces. Adjusts cross sections
railDegree: The degree of the rail
TanSlider: A number from -1 to 1 indicating how far towards the theoretical rational midpoint to adjust the tangent control points.
bExtend: If true, when one input surface is longer than the other, the fillet surface is extended to the input surface edges.
Fillets: the fillet8s that were created
Returns: true if successful
Since: 8.0

Rhino.Geometry.SurfaceFilletBase.G2ChordalQuintic(System.Int32,System.Boolean,System.Collections.Generic.List{Rhino.Geometry.Brep})
make fillet surfaces and hack them up to active pieces. Adjusts cross sections
railDegree: The degree of the rail
bExtend: If true, when one input surface is longer than the other, the fillet surface is extended to the input surface edges.
Fillets: the fillet8s that were created
Returns: true if successful
Since: 8.0

Rhino.Geometry.SurfaceFilletBase.CreateRationalArcsFilletSrf(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,System.Double,System.Collections.Generic.List{Rhino.Geometry.Brep},System.Collections.Generic.List{Rhino.Geometry.Brep},System.Int32,System.Boolean,System.Boolean,System.Collections.Generic.List{Rhino.Geometry.Brep})
Creates a standard surface fillet using rational arc sections
faceA: the first face to use constructing the fillet
uvA: The parametric u,v selection point on FaceA close to the edge to fillet
faceB: the second face to use constructing the fillet
uvB: The parametric u,v selection point on FaceB close to the edge to fillet
radius: The radius of the fillet
tolerance: Tolerance to use in fitting a solution
trimmedBrepsA: if bTrim = true, returns the remains of FaceA trimmed to the fillet
trimmedBrepsB: if bTrim = true, the remains of FaceB trimmed to the fillet
rail_degree: the degree of the rail curve
bTrim: if True, trim the faces and retuen those results in resultsA and resultsB
bExtend: if True and if one input surface is longer than the other, the fillet surface is extended to the input surface edges
Fillets: the resulting fillet surfaces
Returns: True if successful.
Since: 8.0

Rhino.Geometry.SurfaceFilletBase.CreateNonRationalQuinticArcsFilletSrf(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,System.Double,System.Collections.Generic.List{Rhino.Geometry.Brep},System.Collections.Generic.List{Rhino.Geometry.Brep},System.Int32,System.Boolean,System.Boolean,System.Collections.Generic.List{Rhino.Geometry.Brep})
Creates a surface fillet using Non-rational Quintic arc approximations as sections
faceA: the first face to use constructing the fillet
uvA: The parametric u,v selection point on FaceA close to the edge to fillet
faceB: the second face to use constructing the fillet
uvB: The parametric u,v selection point on FaceB close to the edge to fillet
radius: The radius of the fillet
tolerance: Tolerance to use in fitting a solution
trimmedBrepsA: if bTrim = true, returns the remains of FaceA trimmed to the fillet
trimmedBrepsB: if bTrim = true, the remains of FaceB trimmed to the fillet
rail_degree: the degree of the rail curve
bTrim: if True, trim the faces and retuen those results in resultsA and resultsB
bExtend: if True and if one input surface is longer than the other, the fillet surface is extended to the input surface edges
Fillets: the resulting fillet surfaces
Returns: True if successful.
Since: 8.0

Rhino.Geometry.SurfaceFilletBase.CreateNonRationalQuinticFilletSrf(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,System.Double,System.Collections.Generic.List{Rhino.Geometry.Brep},System.Collections.Generic.List{Rhino.Geometry.Brep},System.Int32,System.Double,System.Double,System.Boolean,System.Boolean,System.Collections.Generic.List{Rhino.Geometry.Brep})
Creates a fillet using non-rational Quintic sections with a tangent and inner slider
faceA: the first face to use constructing the fillet
uvA: The parametric u,v selection point on FaceA close to the edge to fillet
faceB: the second face to use constructing the fillet
uvB: The parametric u,v selection point on FaceB close to the edge to fillet
radius: The radius of the fillet
tolerance: Tolerance to use in fitting a solution
trimmedBrepsA: if bTrim = true, returns the remains of FaceA trimmed to the fillet
trimmedBrepsB: if bTrim = true, the remains of FaceB trimmed to the fillet
rail_degree: the degree of the rail curve
TanSlider: A number between -0.95 and 0.95 indicating how far to push the tangent control points toward or away from the theoretical quadratic middle control point
InnerSlider: A number between -0.95 and 0.95 indicating how far to push the inner control points toward or away from the theoretical quadratic middle control point
bTrim: if True, trim the faces and retuen those results in resultsA and resultsB
bExtend: if True and if one input surface is longer than the other, the fillet surface is extended to the input surface edges
Fillets: the resulting fillet surfaces
Returns: True if successful.
Since: 8.0

Rhino.Geometry.SurfaceFilletBase.CreateNonRationalQuarticArcsFilletSrf(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,System.Double,System.Collections.Generic.List{Rhino.Geometry.Brep},System.Collections.Generic.List{Rhino.Geometry.Brep},System.Int32,System.Boolean,System.Boolean,System.Collections.Generic.List{Rhino.Geometry.Brep})
Creates a surface fillet using Non-rational Quartic arc approximations as sections
faceA: the first face to use constructing the fillet
uvA: The parametric u,v selection point on FaceA close to the edge to fillet
faceB: the second face to use constructing the fillet
uvB: The parametric u,v selection point on FaceB close to the edge to fillet
radius: The radius of the fillet
tolerance: Tolerance to use in fitting a solution
trimmedBrepsA: if bTrim = true, returns the remains of FaceA trimmed to the fillet
trimmedBrepsB: if bTrim = true, the remains of FaceB trimmed to the fillet
rail_degree: the degree of the rail curve
bTrim: if True, trim the faces and retuen those results in resultsA and resultsB
bExtend: if True and if one input surface is longer than the other, the fillet surface is extended to the input surface edges
Fillets: the resulting fillet surfaces
Returns: True if successful.
Since: 8.0

Rhino.Geometry.SurfaceFilletBase.CreateNonRationalQuarticFilletSrf(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,System.Double,System.Collections.Generic.List{Rhino.Geometry.Brep},System.Collections.Generic.List{Rhino.Geometry.Brep},System.Int32,System.Double,System.Double,System.Boolean,System.Boolean,System.Collections.Generic.List{Rhino.Geometry.Brep})
Creates a fillet using non-rational Quartic sections with a tangent and inner slider
faceA: the first face to use constructing the fillet
uvA: The parametric u,v selection point on FaceA close to the edge to fillet
faceB: the second face to use constructing the fillet
uvB: The parametric u,v selection point on FaceB close to the edge to fillet
radius: The radius of the fillet
tolerance: Tolerance to use in fitting a solution
trimmedBrepsA: if bTrim = true, returns the remains of FaceA trimmed to the fillet
trimmedBrepsB: if bTrim = true, the remains of FaceB trimmed to the fillet
rail_degree: the degree of the rail curve
TanSlider: A number between -0.95 and 0.95 indicating how far to push the tangent control points toward or away from the theoretical quadratic middle control point
InnerSlider: A number between -0.95 and 0.95 indicating how far to push the inner control point toward or away from the theoretical quadratic middle control point
bTrim: if True, trim the faces and retuen those results in resultsA and resultsB
bExtend: if True and if one input surface is longer than the other, the fillet surface is extended to the input surface edges
Fillets: the resulting fillet surfaces
Returns:
Since: 8.0

Rhino.Geometry.SurfaceFilletBase.CreateNonRationalCubicArcsFilletSrf(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,System.Double,System.Collections.Generic.List{Rhino.Geometry.Brep},System.Collections.Generic.List{Rhino.Geometry.Brep},System.Int32,System.Boolean,System.Boolean,System.Collections.Generic.List{Rhino.Geometry.Brep})
Creates a surface fillet using Non-rational Cubic arc approximations as sections
faceA: the first face to use constructing the fillet
uvA: The parametric u,v selection point on FaceA close to the edge to fillet
faceB: the second face to use constructing the fillet
uvB: The parametric u,v selection point on FaceB close to the edge to fillet
radius: The radius of the fillet
tolerance: Tolerance to use in fitting a solution
trimmedBrepsA: if bTrim = true, returns the remains of FaceA trimmed to the fillet
trimmedBrepsB: if bTrim = true, the remains of FaceB trimmed to the fillet
rail_degree: the degree of the rail curve
bTrim: if True, trim the faces and retuen those results in resultsA and resultsB
bExtend: if True and if one input surface is longer than the other, the fillet surface is extended to the input surface edges
Fillets: the resulting fillet surfaces
Returns: True if successful.
Since: 8.0

Rhino.Geometry.SurfaceFilletBase.CreateNonRationalCubicFilletSrf(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,System.Double,System.Collections.Generic.List{Rhino.Geometry.Brep},System.Collections.Generic.List{Rhino.Geometry.Brep},System.Int32,System.Double,System.Boolean,System.Boolean,System.Collections.Generic.List{Rhino.Geometry.Brep})
Creates a fillet using non-rational Cubic sections with a tangent slider
faceA: the first face to use constructing the fillet
uvA: The parametric u,v selection point on FaceA close to the edge to fillet
faceB: the second face to use constructing the fillet
uvB: The parametric u,v selection point on FaceB close to the edge to fillet
radius: The radius of the fillet
tolerance: Tolerance to use in fitting a solution
trimmedBrepsA: if bTrim = true, returns the remains of FaceA trimmed to the fillet
trimmedBrepsB: if bTrim = true, the remains of FaceB trimmed to the fillet
rail_degree: the degree of the rail curve
TanSlider: A number between -0.95 and 0.95 indicating how far to push the tangent control points toward or away from the theoretical quadratic middle control point
bTrim: if True, trim the faces and retuen those results in resultsA and resultsB
bExtend: if True and if one input surface is longer than the other, the fillet surface is extended to the input surface edges
Fillets: the resulting fillet surfaces
Returns:
Since: 8.0

Rhino.Geometry.SurfaceFilletBase.CreateG2ChordalQuinticFilletSrf(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,System.Double,System.Collections.Generic.List{Rhino.Geometry.Brep},System.Collections.Generic.List{Rhino.Geometry.Brep},System.Int32,System.Boolean,System.Boolean,System.Collections.Generic.List{Rhino.Geometry.Brep})
Creates a surface fillet using G2 chordal Quintic arc approximations as sections
faceA: the first face to use constructing the fillet
uvA: The parametric u,v selection point on FaceA close to the edge to fillet
faceB: the second face to use constructing the fillet
uvB: The parametric u,v selection point on FaceB close to the edge to fillet
radius: The radius of the fillet
tolerance: Tolerance to use in fitting a solution
trimmedBrepsA: if bTrim = true, returns the remains of FaceA trimmed to the fillet
trimmedBrepsB: if bTrim = true, the remains of FaceB trimmed to the fillet
rail_degree: the degree of the rail curve
bTrim: if True, trim the faces and retuen those results in resultsA and resultsB
bExtend: if True and if one input surface is longer than the other, the fillet surface is extended to the input surface edges
Fillets: the resulting fillet surfaces
Returns: True if successful.
Since: 8.0

Rhino.Geometry.SurfaceFilletBase.IsInitialized
Check to see if the fillet is properly initialized. If it is not, then the selected curves, surfaces, and/or radius must
be adjusted in some way before creating the fillet
Returns:
Since: 8.0