Rhino.PrivateMeshCommands.Operations.Tasks.LoopWeaver.GetTasks(Rhino.PrivateMeshCommands.Operations.Tasks.WeaverSettings)
Calculates a new mesh, with new points and a new topology.
Points are set in this order:
new VPoints (points deriving from vertices)
new EPoints (points deriving from edges)
Returns: