Rhino.DocObjects.ProxyObject
A proxy object (not saved in files)

Rhino.DocObjects.ProxyObject.CreateMeshes(Rhino.Geometry.MeshType,Rhino.Geometry.MeshingParameters,System.Boolean)
Since: 7.0

Rhino.DocObjects.ProxyObject.GetMeshes(Rhino.Geometry.MeshType)
Since: 7.0