Rhino.DocObjects.TextureUvwWrapping
Defines Texture UVW wrapping modes
Since: 5.6

Rhino.DocObjects.TextureUvwWrapping.Repeat
Repeat the texture

Rhino.DocObjects.TextureUvwWrapping.Clamp
Clamp the texture