Rhino.Render.TextureEvaluator
This is the interface to a lightweight object capable of evaluating texture color throughout uvw space.  Derive from this class to create your own texture evaluator to return from a custom RenderTexture.

Rhino.Render.TextureEvaluator.#ctor
Base class constructor

Rhino.Render.TextureEvaluator.#ctor(Rhino.Render.RenderTexture.TextureEvaluatorFlags)
Base class constructor
evaluatorFlags:

Rhino.Render.TextureEvaluator.Initialize
Call this function before calling GetColor for the first time. Ideally, this should
be on the main thread, but you can also call it on a worker thread as long as you
are sure that Initialize() or GetColor() cannot be called at the same time on another thread.
Returns:
Since: 6.0

Rhino.Render.TextureEvaluator.GetColor(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Get the color of the texture at a particular point in uvw space.
May be called from within a rendering shade pipeline.
note For ray differentials see Pharr Humphreys, "Physically Based Rendering", chapter 11.
uvw: is the point for which to evaluate the texture.
duvwdx: duvwdx is a ray differential.
duvwdy: duvwdy is a ray differential.
Returns: The texture color at this point in UV space.
Since: 5.1

Rhino.Render.TextureEvaluator.GetColor(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Display.Color4f@)
Optimized version of GetColor for callers.  Much faster in the case of a native (C++) evaluator.
uvw: is the point for which to evaluate the texture.
duvwdx: duvwdx is a ray differential.
duvwdy: duvwdy is a ray differential.
color: The texture color at this point in UV space.
Returns: True if the evaluator returned a valid color.  Otherwise false.
Since: 7.0

Rhino.Render.TextureEvaluator.WriteToByteArray(System.Int32,System.Int32)
Fast access to bitmap evaluator - supply size (which you will probably have received from CRhRdkTexture::PixelSize) to see
if the data can be extracted direct to a width*height*4 array of unsigned chars.
width: is the point for which to evaluate the texture.
height: duvwdx is a ray differential.
Returns: A ByteArray full of the byte values in RGBA order, or null if the function did not succeed
Since: 7.0
7.26

Rhino.Render.TextureEvaluator.WriteToFloatArray(System.Int32,System.Int32)
Fast access to bitmap evaluator - supply size (which you will probably have received from CRhRdkTexture::PixelSize) to see
if the data can be extracted direct to a width*height*4 array of unsigned chars.
width: is the point for which to evaluate the texture.
height: duvwdx is a ray differential.
Returns: A FloatArray full of the float values in RGBA order, or null if the function did not succeed.
Since: 7.0
7.26

Rhino.Render.TextureEvaluator.WriteToByteArray2(System.Int32,System.Int32)
Fast access to bitmap evaluator - supply size (which you will probably have received from CRhRdkTexture::PixelSize) to see
if the data can be extracted direct to a width*height*4 array of unsigned chars.
width: is the point for which to evaluate the texture.
height: duvwdx is a ray differential.
Returns: A ByteArray full of the byte values in RGBA order, or null if the function did not succeed
Since: 7.0

Rhino.Render.TextureEvaluator.WriteToFloatArray2(System.Int32,System.Int32)
Fast access to bitmap evaluator - supply size (which you will probably have received from CRhRdkTexture::PixelSize) to see
if the data can be extracted direct to a width*height*4 array of unsigned chars.
width: is the point for which to evaluate the texture.
height: duvwdx is a ray differential.
Returns: A FloatArray full of the float values in RGBA order, or null if the function did not succeed.
Since: 7.0

Rhino.Render.TextureEvaluator.Finalize
For Dispose pattern

Rhino.Render.TextureEvaluator.Dispose
For Dispose pattern
Since: 5.1

Rhino.Render.TextureEvaluator.Dispose(System.Boolean)
For Dispose pattern
disposing: