Rhino.Runtime.Mode
Contains enumerated constant values to represent Rhino's Runtime Mode.

Rhino.Runtime.Mode.NormalMode
Running with a commercial, educational, or evaluation license ke

Rhino.Runtime.Mode.ViewerMode
Running as a viewer

Rhino.Runtime.Mode.BetaMode
Running as a Beta product

Rhino.Runtime.Mode.InvalidMode
Invalid mode; this is an error condition