Rhino.Runtime.RdkNotLoadedException
Is thrown when the RDK is not loaded.

Rhino.Runtime.RdkNotLoadedException.#ctor
Initializes a new instance of the RDK not loaded exception with a standard message.
Since: 5.0