Rhino.Render.CreateTexture2dPreviewEventArgs.PreviewImageSize
Pixel size of the image that is being requested for the preview scene
Since: 5.1

Rhino.Render.CreateTexture2dPreviewEventArgs.PreviewImage
Initially null.  If this image is set, then this image will be used for
the preview.  If never set, the default internal simulation preview will
be used.
Since: 5.1