Rhino.ApplicationSettings.CurvatureGraphSettings
Contains static methods and properties to modify curvature graph commands.

Rhino.ApplicationSettings.CurvatureGraphSettings.GetDefaultState
Gets the factory settings of the application.
Since: 8.0

Rhino.ApplicationSettings.CurvatureGraphSettings.GetCurrentState
Gets the current settings of the application.
Since: 8.0

Rhino.ApplicationSettings.CurvatureGraphSettings.RestoreDefaults
Commits the default settings as the current settings.
Since: 8.0

Rhino.ApplicationSettings.CurvatureGraphSettings.UpdateFromState(Rhino.ApplicationSettings.CurvatureGraphSettingsState)
Sets all settings to a particular defined joined state.
state: The particular state.
Since: 8.0

Rhino.ApplicationSettings.CurvatureGraphSettings.CurveHairColor
Gets or sets the curve hair color;
Since: 8.0

Rhino.ApplicationSettings.CurvatureGraphSettings.SurfaceUHairColor
Gets or sets the surface U hair color;
Since: 8.0

Rhino.ApplicationSettings.CurvatureGraphSettings.SurfaceVHairColor
Gets or sets the surface V hair color;
Since: 8.0

Rhino.ApplicationSettings.CurvatureGraphSettings.SrfUHair
Gets or sets the surface U hairs are on;
Since: 8.0

Rhino.ApplicationSettings.CurvatureGraphSettings.SrfVHair
Gets or sets the surface V hairs are on;
Since: 8.0

Rhino.ApplicationSettings.CurvatureGraphSettings.HairScale
Gets or sets the hair scale;
Since: 8.0

Rhino.ApplicationSettings.CurvatureGraphSettings.HairDensity
Gets or sets the hair density;
Since: 8.0

Rhino.ApplicationSettings.CurvatureGraphSettings.SampleDensity
Gets or sets the sampling density;
Since: 8.0