Rhino.FileIO.FileVrmlWriteOptions
Options for writing a wrl file

Rhino.FileIO.FileVrmlWriteOptions.Version
Since: 8.0

Rhino.FileIO.FileVrmlWriteOptions.ExportTextureCoordinates
Since: 8.0

Rhino.FileIO.FileVrmlWriteOptions.ExportVertexNormals
Since: 8.0

Rhino.FileIO.FileVrmlWriteOptions.ExportVertexColors
Since: 8.0

Rhino.FileIO.FileVrmlWriteOptions.MeshingParameters
Since: 8.0

Rhino.FileIO.FileVrmlWriteOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0