Rhino.Render.DataSources.MetaData.CppPointer
Since: 6.0

Rhino.Render.DataSources.MetaData.#ctor(System.IntPtr)
Since: 6.0

Rhino.Render.DataSources.MetaData.Dispose
Since: 6.0

Rhino.Render.DataSources.MetaData.Geometry
Since: 6.0

Rhino.Render.DataSources.MetaData.ContentInstanceId
Since: 6.7