Rhino.FileIO.FileAmfWriteOptions
Options for writing a amf file

Rhino.FileIO.FileAmfWriteOptions.MeshingParameters
Since: 8.0

Rhino.FileIO.FileAmfWriteOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0