Rhino.Render.Fields.Vector3dField
Vector3d field value class

Rhino.Render.Fields.Vector3dField.#ctor(Rhino.Render.RenderContent,System.IntPtr)
Constructor
renderContent: RenderContent whose Fields owns this filed.
attachToPointer: Existing C++ pointer to attach to.

Rhino.Render.Fields.Vector3dField.Value
Gets or sets the field value
Since: 5.1

Rhino.Render.Fields.Vector3dField.ValueAsObject
Since: 5.7