Rhino.DocObjects.ObjectDecoration
Defines bit mask values to represent object decorations.
Since: 5.0

Rhino.DocObjects.ObjectDecoration.None
There are no object decorations.

Rhino.DocObjects.ObjectDecoration.StartArrowhead
Arrow head at start.

Rhino.DocObjects.ObjectDecoration.EndArrowhead
Arrow head at end.

Rhino.DocObjects.ObjectDecoration.BothArrowhead
Arrow head at start and end.