Rhino.Runtime.Notifications.NotificationCenter
The NotificationCenter holds all Rhino.Runtime.Notifications.Notification objects that are displayed in the Notifications panel by Rhino.
The NotificationCenter is not thread-safe and should only be used in the UI thread.

Rhino.Runtime.Notifications.NotificationCenter.Notifications
A set containing all the Rhino.Runtime.Notifications.Notification instances. Any Notification added will be displayed in the
Notifications panel. Any Notification removed will be removed from the Notifications panel, and, if shown modally
or queued to be shown modally, will be closed or dequeued from the modal queue.