Rhino.Render.RenderChannels
Render Channels. This corresponds to the user's settings in the Rendering panel.

Rhino.Render.RenderChannels.Changed
This event is raised when a Render Channels property value is changed.
Since: 7.0

Rhino.Render.RenderChannels.#ctor
Create a utility object not associated with any document.
Since: 8.0

Rhino.Render.RenderChannels.CopyFrom(Rhino.Render.FreeFloatingBase)
Since: 7.0

Rhino.Render.RenderChannels.Dispose
Since: 8.0

Rhino.Render.RenderChannels.Mode
Since: 7.0

Rhino.Render.RenderChannels.CustomList
Since: 7.0