Rhino.Render.Fields.NullField
Null field value class

Rhino.Render.Fields.NullField.#ctor(Rhino.Render.RenderContent,System.IntPtr)
Constructor
renderContent: RenderContent whose Fields owns this filed.
attachToPointer: Existing C++ pointer to attach to.

Rhino.Render.Fields.NullField.Value
Gets or sets the field value
Since: 7.14

Rhino.Render.Fields.NullField.ValueAsObject
Since: 7.14