Rhino.FileIO.FileSkpReadOptions
Options used when reading a Skp file

Rhino.FileIO.FileSkpReadOptions.ImportFacesAsMeshes
Set to false for trimmed planes.
Since: 8.0

Rhino.FileIO.FileSkpReadOptions.ImportCurves
Since: 8.0

Rhino.FileIO.FileSkpReadOptions.JoinEdges
Since: 8.0

Rhino.FileIO.FileSkpReadOptions.JoinFaces
Since: 8.0

Rhino.FileIO.FileSkpReadOptions.Weld
Since: 8.0

Rhino.FileIO.FileSkpReadOptions.WeldAngle
Since: 8.0

Rhino.FileIO.FileSkpReadOptions.UseGroupLayers
Since: 8.0

Rhino.FileIO.FileSkpReadOptions.AddObjectsToGroups
Since: 8.0

Rhino.FileIO.FileSkpReadOptions.EmbedTexturesInModel
Since: 8.0

Rhino.FileIO.FileSkpReadOptions.UseSketchUpTextureWriter
Since: 8.0

Rhino.FileIO.FileSkpReadOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Import function
Returns:
Since: 8.0