Rhino.DocObjects.InstanceObject.InstanceXform
transformation applied to an instance definition for this object.
Since: 5.0

Rhino.DocObjects.InstanceObject.InsertionPoint
Base point coordinates of a block.
Since: 5.0

Rhino.DocObjects.InstanceObject.InstanceDefinition
instance definition that this object uses.
Since: 5.0

Rhino.DocObjects.InstanceObject.UsesDefinition(System.Int32,System.Int32@)
Determine if this reference uses an instance definition
definitionIndex:
nestingLevel:
If the instance definition is used, this is the definition's nesting depth
Returns: true or false depending on if the definition is used
Since: 5.2

Rhino.DocObjects.InstanceObject.Explode(System.Boolean,Rhino.DocObjects.RhinoObject[]@,Rhino.DocObjects.ObjectAttributes[]@,Rhino.Geometry.Transform[]@)
Explodes the instance reference into pieces.
explodeNestedInstances:
If true, then nested instance references are recursively exploded into pieces until actual geometry is found.
If false, an InstanceObject is added to the pieces out parameter when this InstanceObject has nested references.
pieces: An array of Rhino objects will be assigned to this out parameter during this call.
pieceAttributes: An array of object attributes will be assigned to this out parameter during this call.
pieceTransforms: An array of the previously applied transform matrices will be assigned to this out parameter during this call.
Since: 5.0

Rhino.DocObjects.InstanceObject.Explode(System.Boolean,System.Guid,System.Boolean,Rhino.DocObjects.RhinoObject[]@,Rhino.DocObjects.ObjectAttributes[]@,Rhino.Geometry.Transform[]@)
Explodes the instance reference into pieces.
skipHiddenPieces:
If true, pieces that are not visible will not be appended to the pieces out parameter.
viewportId:
If skipHiddenPieces is false, then viewportId is ignored.
If bSkipHiddenPieces is true and viewportId is not Guid.Empty, then layer and object per viewport visibility settings are used.
If bSkipHiddenPieces is true and viewport_id is Guid.Empty, then layer and object global visibility settings are used.
explodeNestedInstances:
If true, then nested instance references are recursively exploded into pieces until actual geometry is found.
If false, an InstanceObject is added to the pieces out parameter when this InstanceObject has nested references.
pieces: An array of Rhino objects will be assigned to this out parameter during this call.
pieceAttributes: An array of object attributes will be assigned to this out parameter during this call.
pieceTransforms: An array of the previously applied transform matrices will be assigned to this out parameter during this call.
Since: 8.9

Rhino.DocObjects.InstanceObject.SubObjectFromComponentIndex(Rhino.Geometry.ComponentIndex)
Get a RhinoObject in this block
ci:
Returns:
Since: 8.0