Rhino.ApplicationSettings.AppearanceSettings
Provides static methods and properties to deal with the appearance of the application.

Rhino.ApplicationSettings.AppearanceSettings.SetToDarkMode
Set UI to the default dark mode color scheme
Returns: true on sucess
Since: 8.2

Rhino.ApplicationSettings.AppearanceSettings.SetToLightMode
Set UI to the default light mode color scheme
Returns: true on sucess
Since: 8.2

Rhino.ApplicationSettings.AppearanceSettings.UsingDefaultDarkModeColors
Determine if Rhino is running with default dark mode color settings
Returns:
Since: 8.2

Rhino.ApplicationSettings.AppearanceSettings.UsingDefaultLightModeColors
Determine if Rhino is running with default light mode color settings
Returns:
Since: 8.2

Rhino.ApplicationSettings.AppearanceSettings.GetDefaultState(System.Boolean)
Gets the factory settings of the application.
Returns: An instance of a class that represents all the default settings joined together.
Since: 8.0

Rhino.ApplicationSettings.AppearanceSettings.GetDefaultState
Gets the factory settings of the application.
Returns: An instance of a class that represents all the default settings joined together.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.GetCurrentState
Gets the current settings of the application.
Returns: An instance of a class that represents all the settings as they appear in the Rhino _Options dialog,
joined in a single class.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.RestoreDefaults
Commits the default settings as the current settings.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.UpdateFromState(Rhino.ApplicationSettings.AppearanceSettingsState)
Sets all settings to a particular defined joined state.
state: A joined settings object.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.DefaultFontFaceName
Gets or sets the default font face name used in Rhino.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.GetPaintColorHook
FOR INTERNAL USE ONLY
Rhino.UI.ThemeSettings sets this to map colors to new theme colors

Rhino.ApplicationSettings.AppearanceSettings.GetPaintColor(Rhino.ApplicationSettings.PaintColor)
Gets the color that is currently associated with a paint color.
whichColor: A color association.
Returns: A .Net library color.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.GetPaintColor(Rhino.ApplicationSettings.PaintColor,System.Boolean)
Gat a paint color. This overload provides a compute option for cases where colors
are computed when they are "unset" colors.
whichColor:
compute: if true, a color is computed in some cases
Returns:
Since: 7.1

Rhino.ApplicationSettings.AppearanceSettings.DefaultPaintColor(Rhino.ApplicationSettings.PaintColor)
Get a default paint color for Rhino. The current paint color may
be different than the default
whichColor: The color to retrieve
Returns:
Since: 7.0

Rhino.ApplicationSettings.AppearanceSettings.DefaultPaintColor(Rhino.ApplicationSettings.PaintColor,System.Boolean)
Get a default paint color for Rhino. The current paint color may
be different than the default
whichColor: The color to retrieve
darkMode:
If true gets the default dark mode color otherwise return the default
light mode color
Returns:
Since: 8.0

Rhino.ApplicationSettings.AppearanceSettings.SetPaintColor(Rhino.ApplicationSettings.PaintColor,System.Drawing.Color)
Sets the logical paint color association to a specific .Net library color, without forced UI update.
whichColor: A logical color association.
c: A .Net library color.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.SetPaintColor(Rhino.ApplicationSettings.PaintColor,System.Drawing.Color,System.Boolean)
Sets the logical paint color association to a specific .Net library color.
whichColor: A logical color association.
c: A .Net library color.
forceUiUpdate: true if the UI should be forced to update.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.UsePaintColors
Gets or sets a value indicating if logical paint colors should be used.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.DefaultWidgetColor(Rhino.ApplicationSettings.WidgetColor)
Get a default widget color for Rhino. The current widget color may
be different than the default
whichColor: The color to retrieve
Returns: A .Net library color.
Since: 8.0

Rhino.ApplicationSettings.AppearanceSettings.GetWidgetColor(Rhino.ApplicationSettings.WidgetColor)
Gets the .Net library color that is currently associated with a widget color.
whichColor: A color association.
Returns: A .Net library color.
Since: 6.0

Rhino.ApplicationSettings.AppearanceSettings.SetWidgetColor(Rhino.ApplicationSettings.WidgetColor,System.Drawing.Color)
Sets the logical widget color association to a specific .Net library color, without forced UI update.
whichColor: A logical color association.
c: A .Net library color.
Since: 6.0

Rhino.ApplicationSettings.AppearanceSettings.SetWidgetColor(Rhino.ApplicationSettings.WidgetColor,System.Drawing.Color,System.Boolean)
Sets the logical widget color association to a specific .Net library color.
whichColor: A logical color association.
c: A .Net library color.
forceUiUpdate: true if the UI should be forced to update.
Since: 6.0

Rhino.ApplicationSettings.AppearanceSettings.DefaultLayerColor
Gets or sets the default layer color.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.SelectedObjectColor
The color used to draw selected objects.
The default is yellow, but this can be customized by the user.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.LockedObjectColor
color used to draw locked objects.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.SelectionWindowStrokeColor
Color used to draw stroke for selection window
Since: 7.0

Rhino.ApplicationSettings.AppearanceSettings.SelectionWindowFillColor
Color used to fill selection window
Since: 7.0

Rhino.ApplicationSettings.AppearanceSettings.SelectionWindowCrossingStrokeColor
Color used to draw stroke for selection crossing window
Since: 7.0

Rhino.ApplicationSettings.AppearanceSettings.SelectionWindowCrossingFillColor
Color used to fill selection crossing window
Since: 7.0

Rhino.ApplicationSettings.AppearanceSettings.WorldCoordIconXAxisColor
Gets or sets the color of the world coordinate X axis.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.WorldCoordIconYAxisColor
Gets or sets the color of the world coordinate Y axis.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.WorldCoordIconZAxisColor
Gets or sets the color of the world coordinate Z axis.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.TrackingColor
Gets or sets the tracking color.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.FeedbackColor
Gets or sets the feedback color.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.DefaultObjectColor
Gets or sets the default color for new objects.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.ViewportBackgroundColor
Gets or sets the viewport background color.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.FrameBackgroundColor
Gets or sets the background color of the frame.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.CommandPromptTextColor
Gets or sets the color of the command prompt text.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.CommandPromptHypertextColor
Gets or sets the color of the command prompt hypertext.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.CommandPromptBackgroundColor
Gets or sets the color of the command prompt background.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.CrosshairColor
Gets or sets the color of the crosshair icon.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.PageviewPaperColor
Gets or sets the paper background. A rectangle is drawn into the background
of page views to represent the printed area. The alpha portion of the color
is used to draw the paper blended into the background
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.CurrentLayerBackgroundColor
Gets or sets the color used by the layer manager dialog as the background color for the current layer.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.EditCandidateColor
Gets or sets the color of objects that are eligible to be edited.
Since: 6.0

Rhino.ApplicationSettings.AppearanceSettings.GridThinLineColor
Gets or sets the color of the thin line of the grid.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.GridThickLineColor
Gets or sets the color of the thick line of the grid.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.GridXAxisLineColor
Gets or sets the color of the X axis of the grid.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.GridYAxisLineColor
Gets or sets the color of the Y axis of the grid.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.GridZAxisLineColor
Gets or sets the color of the Z axis of the grid.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.DirectionArrowIconShaftSize
length of direction arrow shaft icon in pixels.
Since: 8.0

Rhino.ApplicationSettings.AppearanceSettings.DirectionArrowIconHeadSize
length of direction arrowhead icon in pixels.
Since: 8.0

Rhino.ApplicationSettings.AppearanceSettings.CommandPromptPosition
Gets or sets the command prompt position.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.CommandPromptFontSize
Size of font used in command prompt (in points)
Since: 7.0

Rhino.ApplicationSettings.AppearanceSettings.EchoPromptsToHistoryWindow
Gets or sets a value that determines if prompt messages are written to the history window.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.EchoCommandsToHistoryWindow
Gets or sets a value that determines if command names are written to the history window.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.ShowFullPathInTitleBar
Gets or sets a value that determines if the full path of the document is shown in the Rhino title bar.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.ShowCrosshairs
Gets or sets a value that determines if cross hairs are visible.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.ShowSideBar
Shows or hides the side bar user interface.
Since: 6.0

Rhino.ApplicationSettings.AppearanceSettings.ShowOsnapBar
Shows or hides the object snap user interface.
Since: 7.0

Rhino.ApplicationSettings.AppearanceSettings.ShowSelectionFilterBar
Shows or hides the selection filter user interface.
Since: 8.2

Rhino.ApplicationSettings.AppearanceSettings.ShowStatusBar
Shows or hides the status bar user interface.
Since: 7.0

Rhino.ApplicationSettings.AppearanceSettings.ShowViewportTitles
Shows or hides viewport titles.
Since: 8.0

Rhino.ApplicationSettings.AppearanceSettings.ShowTitleBar
Shows or hides title bar.
Since: 8.0

Rhino.ApplicationSettings.AppearanceSettings.MenuVisible
Gets or sets a value that determines if the File menu is visible.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.ShowLayoutDropShadow
Display the drop shadow of layouts
Since: 8.0

Rhino.ApplicationSettings.AppearanceSettings.ViewportTabsVisibleAtStart
Display viewport tabs at start
Since: 8.0

Rhino.ApplicationSettings.AppearanceSettings.LanguageIdentifier
Gets or sets the language identifier.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.PreviousLanguageIdentifier
Gets or sets the previous language identifier.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettings.InitialMainWindowPosition(System.Drawing.Rectangle@)
Location where the Main Rhino window attempts to show when the application is first
started.
bounds: The rectangle in which the main window attempts to shows is assigned to this out parameter during the call.
Returns: false if the information could not be retrieved.
Since: 6.0