Rhino.RhinoDoc.TextureMappingEventType
Since: 5.8

Rhino.RhinoDoc.TextureMappingEventType.Added
Adding texture mapping to a document

Rhino.RhinoDoc.TextureMappingEventType.Deleted
A texture mapping was deleted from a document

Rhino.RhinoDoc.TextureMappingEventType.Undeleted
A texture mapping was undeleted in a document

Rhino.RhinoDoc.TextureMappingEventType.Modified
A texture mapping was modified in a document