Rhino.Geometry.PlaneFitResult
Enumerates all possible outcomes of a Least-Squares plane fitting operation.
Since: 5.0

Rhino.Geometry.PlaneFitResult.Failure
No plane could be found.

Rhino.Geometry.PlaneFitResult.Success
A plane was successfully fitted.

Rhino.Geometry.PlaneFitResult.Inconclusive
A valid plane was found, but it is an inconclusive result.
This might happen with co-linear points for example.