Rhino.DocObjects.LightObject.ComponentType
Since: 6.0

Rhino.DocObjects.LightObject.LightGeometry
Since: 5.0

Rhino.DocObjects.LightObject.DuplicateLightGeometry
Since: 5.0

Rhino.DocObjects.LightObject.Index
Since: 8.0