Rhino.FileIO.FileObj
Support for obj file format

Rhino.FileIO.FileObj.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileObjWriteOptions)
Write an obj file based on the contents of a RhinoDoc
filename:
doc:
options:
Returns:
Since: 6.0

Rhino.FileIO.FileObj.Write(System.IO.StreamWriter,Rhino.RhinoDoc,Rhino.FileIO.FileObjWriteOptions)
Write an obj stream based on the contents of a RhinoDoc
stream:
doc:
options:
Returns:
Remarks:  No .mtl file is written, hence no materials, when the WriteFile that takes a StreamWriter
is called directly.  If you need materials call the WriteFile that takes a string for the
obj file path.
Since: 7.0

Rhino.FileIO.FileObj.Write(System.String,Rhino.Geometry.Mesh[],Rhino.FileIO.FileObjWriteOptions)
Write an obj file with an array of meshes
filename: path to write to
meshes: meshes to write as obj format
options:
Returns:
Since: 7.0

Rhino.FileIO.FileObj.Read(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileObjReadOptions)
Since: 6.0