Rhino.DocObjects.InstanceDefinitionArchiveFileStatus
The archive file of a linked instance definition can have the following possible states.
Use InstanceObject.ArchiveFileStatus to query a instance definition's archive file status.
Since: 5.2

Rhino.DocObjects.InstanceDefinitionArchiveFileStatus.NotALinkedInstanceDefinition
The instance definition is not a linked instance definition.

Rhino.DocObjects.InstanceDefinitionArchiveFileStatus.LinkedFileNotReadable
The instance definition's archive file is not readable.

Rhino.DocObjects.InstanceDefinitionArchiveFileStatus.LinkedFileNotFound
The instance definition's archive file cannot be found.

Rhino.DocObjects.InstanceDefinitionArchiveFileStatus.LinkedFileIsUpToDate
The instance definition's archive file is up-to-date.

Rhino.DocObjects.InstanceDefinitionArchiveFileStatus.LinkedFileIsNewer
The instance definition's archive file is newer.

Rhino.DocObjects.InstanceDefinitionArchiveFileStatus.LinkedFileIsOlder
The instance definition's archive file is older.

Rhino.DocObjects.InstanceDefinitionArchiveFileStatus.LinkedFileIsDifferent
The instance definition's archive file is different.