Rhino.Render.UI.UserInterfaceSection
Custom user interface section manager

Rhino.Render.UI.UserInterfaceSection.#ctor(System.Int32,System.Object)
Internal constructor
serialNumber: C++ pointer serial number returned by the C interface wrapper.
window: The control created and embedded in the expandable tab control in the content browser.

Rhino.Render.UI.UserInterfaceSection.SerialNumber
C++ pointer serial number returned by the C interface wrapper.

Rhino.Render.UI.UserInterfaceSection.m_window
The control created and embedded in the expandable tab control in the content browser.

Rhino.Render.UI.UserInterfaceSection.m_serial_number
C++ pointer serial number returned by the C interface wrapper.

Rhino.Render.UI.UserInterfaceSection.m_search_hint
Search hint helper

Rhino.Render.UI.UserInterfaceSection.g_user_interface_section_dictionary
UserInterfaceSection instance dictionary, the constructor adds objects to the dictionary
and the C++ destructor callback removes them when they get destroyed.

Rhino.Render.UI.UserInterfaceSection.SetHooks
Set C++ callback function pointers

Rhino.Render.UI.UserInterfaceSection.g_delete_this_proc
Called by the C++ destructor when a user interface section object is destroyed.

Rhino.Render.UI.UserInterfaceSection.g_display_data_proc
Called by the C++ SDK when it is time to initialize a user interface section.

Rhino.Render.UI.UserInterfaceSection.g_on_expand_callback
Called by the C++ SDK when a user interface section is being createExpanded
or collapsed.

Rhino.Render.UI.UserInterfaceSection.g_is_hidden_callback
Called by the C++ SDK to determine if a user interface section should be hidden

Rhino.Render.UI.UserInterfaceSection.DeleteThisProc(System.Int32)
C++ user interface destructor callback, remove the object from the runtime
dictionary and dispose if it if possible.
serialNumber:

Rhino.Render.UI.UserInterfaceSection.DisplayDataProc(System.Int32)
Called when it is safe to initialize the control window.
serialNumber:

Rhino.Render.UI.UserInterfaceSection.OnExpandProc(System.Int32,System.Boolean)
Called when a user interface section is being createExpanded or collapsed.
serialNumber:
expanding:

Rhino.Render.UI.UserInterfaceSection.IsHiddenProc(System.Int32)
Called when it is safe to initialize the control window.
serialNumber:

Rhino.Render.UI.UserInterfaceSection.RenderContent
The RenderContent object that created this user interface object.
Since: 5.1
6.0

Rhino.Render.UI.UserInterfaceSection.Window
The user control associated with this user interface object.
Since: 5.1
6.0

Rhino.Render.UI.UserInterfaceSection.FromWindow(System.Object)
Find the UserInterfaceSection that created the specified instance of a
window.
window:
If window is not null then look for the UserInterfaceSection that
created the window.
Returns:
If a UserInterfaceSection object is found containing a reference to
the requested window then return the object otherwise return null.
Since: 6.0
6.0

Rhino.Render.UI.UserInterfaceSection.GetContentList
Returns a list of currently selected content items to be edited.
Returns: Returns a list of currently selected content items to be edited.
Since: 5.1
6.0

Rhino.Render.UI.UserInterfaceSection.Show(System.Boolean)
Show or hide this content section.
visible: If true then show the content section otherwise hide it.
Since: 5.1
6.0

Rhino.Render.UI.UserInterfaceSection.Expand(System.Boolean)
Expand or collapse this content section.
expand: If true then expand the content section otherwise collapse it.
Since: 5.1
6.0

Rhino.Render.UI.UserInterfaceSection.GetContentIdList
Returns a list of currently selected content item Id's to be edited.
Returns: Returns a list of currently selected content item Id's to be edited.

Rhino.Render.UI.UserInterfaceSection.FromSerialNumber(System.Int32)
Look up a runtime instance of an user interface object by serial number.
serialNumber:
Returns:

Rhino.Render.UI.UserInterfaceSection.UiFromSerialNumber(System.Int32,Rhino.Render.UI.UserInterfaceSection@,Rhino.Render.UI.IUserInterfaceSection@)
Look up a runtime instance of an user interface object by serial number
and check the user interface Window object for a IUserInterfaceSection
instance.
serialNumber:
uiSection:
iUiSection:
Returns:
Returns true if both uiSection and iUiSection are non null otherwise;
return false.