Rhino.FileIO.FileAmf
Support for writing amf file format

Rhino.FileIO.FileAmf.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileAmfWriteOptions)
Write a amf file based on the contents of a RhinoDoc
path: path to write a file to
doc: document to get geometry from
options: options used for generating the amf file
Returns: true on success
Since: 8.0