Rhino.Render.Dithering
This is the interface to dithering settings.

Rhino.Render.Dithering.#ctor
Create a utility object not associated with any document
Since: 6.0

Rhino.Render.Dithering.#ctor(Rhino.Render.Dithering)
Create a utility object not associated with any document from another object
d:
Since: 6.0

Rhino.Render.Dithering.Finalize


Rhino.Render.Dithering.Dispose
Since: 8.0

Rhino.Render.Dithering.CopyFrom(Rhino.Render.FreeFloatingBase)
Since: 6.0

Rhino.Render.Dithering.Method
Since: 6.0

Rhino.Render.Dithering.On
Since: 7.0
8.0

Rhino.Render.Dithering.Enabled
Since: 8.0