Rhino.DocObjects.DistanceDisplayMode
Defines enumerated values for the display of distances in US customary and Imperial units.
Since: 5.0

Rhino.DocObjects.DistanceDisplayMode.Decimal
Shows distance decimals.

Rhino.DocObjects.DistanceDisplayMode.Feet
Show feet.

Rhino.DocObjects.DistanceDisplayMode.FeetAndInches
Show feet and inches.