Rhino.Display.InitFrameBufferEventArgs.SetFill(System.Drawing.Color)
Since: 6.18

Rhino.Display.InitFrameBufferEventArgs.SetFill(System.Drawing.Color,System.Drawing.Color)
Since: 6.18

Rhino.Display.InitFrameBufferEventArgs.SetFill(System.Drawing.Color,System.Drawing.Color,System.Drawing.Color,System.Drawing.Color)
Since: 6.18