Rhino.Runtime.InteropWrappers.SimpleArrayDouble
Wrapper for ON_SimpleArray<double>. If you are not writing C++ code,
then this class is not for you.

Rhino.Runtime.InteropWrappers.SimpleArrayDouble.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayDouble.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayDouble.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayDouble instance.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayDouble.#ctor(System.Collections.Generic.IEnumerable{System.Double})
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayDouble instance, with items.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayDouble.Count
Gets the amount of elements in this array.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayDouble.ToArray
Returns the managed counterpart of the unmanaged array.
Returns: The managed array.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayDouble.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.SimpleArrayDouble.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0