Rhino.Collections.Point3dList.XAccess
Utility class for easy-access of x-components of points inside an ON_3dPointList.

Rhino.Collections.Point3dList.XAccess.#ctor(Rhino.Collections.Point3dList)
XAccess constructor.

Rhino.Collections.Point3dList.XAccess.Item(System.Int32)
Gets or sets the x-coordinate of the specified point.
index: Index of point.