Rhino.DocObjects.HistoryRecord
Provides a single bundling of information to be passed to Rhino when setting up history for an object.
Remarks: To use this object, just pass it to a RhinoDoc.Add() method along with the needed geometry.
Do not reuse this class for more than one history addition.

Rhino.DocObjects.HistoryRecord.Handle
Wrapped native C++ pointer to CRhinoHistory instance
Since: 5.0

Rhino.DocObjects.HistoryRecord.#ctor(Rhino.Commands.Command,System.Int32)
Since: 5.0

Rhino.DocObjects.HistoryRecord.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.DocObjects.HistoryRecord.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0

Rhino.DocObjects.HistoryRecord.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.DocObjects.HistoryRecord.SetBool(System.Int32,System.Boolean)
Since: 5.0

Rhino.DocObjects.HistoryRecord.SetInt(System.Int32,System.Int32)
Since: 5.0

Rhino.DocObjects.HistoryRecord.SetDouble(System.Int32,System.Double)
Since: 5.0

Rhino.DocObjects.HistoryRecord.SetPoint3d(System.Int32,Rhino.Geometry.Point3d)
Since: 5.0

Rhino.DocObjects.HistoryRecord.SetVector3d(System.Int32,Rhino.Geometry.Vector3d)
Since: 5.0

Rhino.DocObjects.HistoryRecord.SetTransorm(System.Int32,Rhino.Geometry.Transform)
Since: 5.0

Rhino.DocObjects.HistoryRecord.SetColor(System.Int32,System.Drawing.Color)
Since: 5.0

Rhino.DocObjects.HistoryRecord.SetObjRef(System.Int32,Rhino.DocObjects.ObjRef)
Since: 5.0

Rhino.DocObjects.HistoryRecord.SetPoint3dOnObject(System.Int32,Rhino.DocObjects.ObjRef,Rhino.Geometry.Point3d)
Since: 5.0

Rhino.DocObjects.HistoryRecord.SetGuid(System.Int32,System.Guid)
Since: 5.0

Rhino.DocObjects.HistoryRecord.SetString(System.Int32,System.String)
Since: 5.0

Rhino.DocObjects.HistoryRecord.SetCurve(System.Int32,Rhino.Geometry.Curve)
Since: 5.0

Rhino.DocObjects.HistoryRecord.SetSurface(System.Int32,Rhino.Geometry.Surface)
Since: 5.0

Rhino.DocObjects.HistoryRecord.SetBrep(System.Int32,Rhino.Geometry.Brep)
Since: 5.0

Rhino.DocObjects.HistoryRecord.SetMesh(System.Int32,Rhino.Geometry.Mesh)
Since: 5.0

Rhino.DocObjects.HistoryRecord.SetBools(System.Int32,System.Collections.Generic.IEnumerable{System.Boolean})
Since: 5.0

Rhino.DocObjects.HistoryRecord.SetInts(System.Int32,System.Collections.Generic.IEnumerable{System.Int32})
Since: 5.0

Rhino.DocObjects.HistoryRecord.SetDoubles(System.Int32,System.Collections.Generic.IEnumerable{System.Double})
Since: 5.0

Rhino.DocObjects.HistoryRecord.SetPoint3ds(System.Int32,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Since: 5.0

Rhino.DocObjects.HistoryRecord.SetVector3ds(System.Int32,System.Collections.Generic.IEnumerable{Rhino.Geometry.Vector3d})
Since: 5.0

Rhino.DocObjects.HistoryRecord.SetColors(System.Int32,System.Collections.Generic.IEnumerable{System.Drawing.Color})
Since: 5.0

Rhino.DocObjects.HistoryRecord.SetGuids(System.Int32,System.Collections.Generic.IEnumerable{System.Guid})
Since: 5.0

Rhino.DocObjects.HistoryRecord.SetStrings(System.Int32,System.Collections.Generic.IEnumerable{System.String})
Since: 5.0

Rhino.DocObjects.HistoryRecord.SetHistoryVersion(System.Int32)
Specifies a non-zero integer that identifies the version of
this history record. The virtual ReplayHistory() functions
can check this version to avoid replaying history using
information created by earlier versions of the command.
historyVersion: Any non-zero integer.
It is strongly suggested that something like YYYYMMDD be used.
Returns: True if successful.
Since: 6.0

Rhino.DocObjects.HistoryRecord.CopyOnReplaceObject
When an object is replaced and the old object has a history record with
this field set, the history record is copied and attached to the new object.
That allows a descendant object to continue the history linkage after
it is edited.
Since: 6.0