Rhino.Render.PixelBuffer
Pixel buffer to hold a pointer to (unmanaged) pixel data.
This class will be in the (near) future improved to help with
management of buffers between unmanaged and managed code. For
C++ this could be the use of std::shared_ptr<>. See
http://phab.mcneel.com/D12 for discussion on this topic.

Rhino.Render.PixelBuffer.Buffer
Since: 6.0

Rhino.Render.PixelBuffer.#ctor(System.IntPtr)
Create a new PixelBuffer pointing to the
(unmanaged) pixel data buffer behind IntPtr
bufferPointer: IntPtr to the unmanaged pixel data buffer
Since: 6.0