Rhino.FileIO.File3dmSettings
General settings in a 3dm file.

Rhino.FileIO.File3dmSettings.ModelUrl
Gets or sets a Uniform Resource Locator (URL) direction for the model.
Since: 5.0

Rhino.FileIO.File3dmSettings.ModelBasepoint
Gets or sets the model base point that is used when the file is read as an instance definition.
This point is mapped to the origin in the instance definition.
Since: 5.0

Rhino.FileIO.File3dmSettings.ModelAbsoluteTolerance
Gets or sets the model space absolute tolerance.
Since: 5.0

Rhino.FileIO.File3dmSettings.ModelAngleToleranceRadians
Gets or sets the model space angle tolerance.
Since: 5.0

Rhino.FileIO.File3dmSettings.ModelAngleToleranceDegrees
Gets or sets the model space angle tolerance.
Since: 5.0

Rhino.FileIO.File3dmSettings.ModelRelativeTolerance
Gets or sets the model space relative tolerance.
Since: 5.0

Rhino.FileIO.File3dmSettings.PageAbsoluteTolerance
Gets or sets the page space absolute tolerance.
Since: 5.0

Rhino.FileIO.File3dmSettings.PageAngleToleranceRadians
Gets or sets the page space angle tolerance.
Since: 5.0

Rhino.FileIO.File3dmSettings.PageAngleToleranceDegrees
Gets or sets the page space angle tolerance.
Since: 5.0

Rhino.FileIO.File3dmSettings.PageRelativeTolerance
Gets or sets the page space relative tolerance.
Since: 5.0

Rhino.FileIO.File3dmSettings.ModelUnitSystem
Gets or sets the model unit system, using Rhino.UnitSystem enumeration.
Since: 5.0

Rhino.FileIO.File3dmSettings.PageUnitSystem
Gets or sets the page unit system, using Rhino.UnitSystem enumeration.
Since: 5.0

Rhino.FileIO.File3dmSettings.ModelDistanceDisplayMode
Gets or sets the model space distance display mode (decimal, feet, or feet and inches).
Since: 9.0

Rhino.FileIO.File3dmSettings.PageDistanceDisplayMode
Gets or sets the page space distance display mode (decimal, feet, or feet and inches).
Since: 9.0

Rhino.FileIO.File3dmSettings.ModelDistanceDisplayPrecision
Gets or sets the model space distance display precision. In decimal mode this is the
number of decimal places; in fractional modes the denominator is (1/2)^precision.
Valid values are >= 0 and <= 7.
Since: 9.0

Rhino.FileIO.File3dmSettings.PageDistanceDisplayPrecision
Gets or sets the page space distance display precision. In decimal mode this is the
number of decimal places; in fractional modes the denominator is (1/2)^precision.
Valid values are >= 0 and <= 7.
Since: 9.0

Rhino.FileIO.File3dmSettings.RenderSettings
Gets or sets the render settings.
Since: 8.0

Rhino.FileIO.File3dmSettings.ActiveViewId
The viewport id of the view that is active when the model is opened. When this is nil
Rhino activates the first view in the view table.
Since: 8.36

Rhino.FileIO.File3dmSettings.CurrentLayerId
The id of the layer new objects are created on.
Since: 8.36

Rhino.FileIO.File3dmSettings.CurrentRenderMaterialId
The id of the current render material.
Since: 8.36

Rhino.FileIO.File3dmSettings.CurrentLinePatternId
The id of the current line pattern (linetype).
Since: 8.36

Rhino.FileIO.File3dmSettings.CurrentTextStyleId
The id of the current text style.
Since: 8.36

Rhino.FileIO.File3dmSettings.CurrentDimensionStyleId
The id of the dimension style new annotation uses. When this is nil Rhino falls back
to the obsolete V5 index, which selects the first style in the table - so a template
that leaves it nil can open with the wrong annotation style current.
Since: 8.36

Rhino.FileIO.File3dmSettings.CurrentHatchPatternId
The id of the current hatch pattern.
Since: 8.36

Rhino.FileIO.File3dmSettings.CurrentColor
The colour new objects are created with.
Since: 8.36

Rhino.FileIO.File3dmSettings.CurrentPlotColor
The plot colour new objects are created with.
Since: 8.36

Rhino.FileIO.File3dmSettings.CurrentWireDensity
The surface isocurve density new objects are created with. -1 draws no isocurves,
0 draws the surface edges only, and n > 0 draws n isocurves per span.
Since: 8.36

Rhino.FileIO.File3dmSettings.InstanceDefinitionLinkUpdate
How instance definition links are updated when the model is opened.
Since: 8.36

Rhino.FileIO.File3dmSettings.SaveTextureBitmapsInFile
Whether texture bitmaps are embedded in the model when it is saved.
Since: 8.36

Rhino.FileIO.File3dmSettings.LinetypeDisplayScale
The document-wide linetype pattern display scale.
Since: 8.36

Rhino.FileIO.File3dmSettings.MeshingParameters
The meshing parameters Rhino uses to build render meshes for this model. Rhino derives
the "Jagged & faster" / "Smooth & slower" choice from these when the model is
opened, so a model that leaves them at the openNURBS default gets jagged render meshes.
Since: 8.36

Rhino.FileIO.File3dmSettings.AnalysisMeshingParameters
The meshing parameters used for analysis meshes (curvature, draft angle, ...).
Since: 8.36

Rhino.FileIO.File3dmSettings.CustomRenderMeshingParameters
The meshing parameters stored as the model's custom render mesh settings.
Since: 8.36

Rhino.FileIO.File3dmSettings.GridDefaults
The construction plane grid defaults new views inherit: grid and snap spacing, line
counts, and whether the grid, its axes and the world axes icon are drawn.
Since: 8.36