Rhino.FileIO.FilePdfReadOptions.PDF_UNITS
Since: 8.0

Rhino.FileIO.FilePdfReadOptions.PDF_UNITS.inches
inches

Rhino.FileIO.FilePdfReadOptions.PDF_UNITS.centimeters
centimeters

Rhino.FileIO.FilePdfReadOptions.PDF_UNITS.millimeters
millimeters

Rhino.FileIO.FilePdfReadOptions.PDF_UNITS.points
points