Rhino.FileIO.FileWriteOptions.#ctor
Since: 5.0

Rhino.FileIO.FileWriteOptions.UpdateDocumentPath
If a complete, current version, 3dm file is successfully saved, then
the name of the file will be used to update the document's default file
path and title and document will be marked as not modified.
Since: 6.7

Rhino.FileIO.FileWriteOptions.WriteSelectedObjectsOnly
If true, this command should export only the objects currently selected in the Rhino model.
Since: 5.0

Rhino.FileIO.FileWriteOptions.IncludeRenderMeshes
The file written should include the render meshes if your File Writing Plug-in supports it.
Since: 5.0

Rhino.FileIO.FileWriteOptions.IncludePreviewImage
The file written should include a preview image if your File Writing Plug-in supports it.
Since: 5.0

Rhino.FileIO.FileWriteOptions.IncludeBitmapTable
The file written should include the bitmap table if your File Writing Plug-in supports it.
Since: 5.0

Rhino.FileIO.FileWriteOptions.IncludeHistory
The file written should include history information if your File Writing Plug-In supports it.
Since: 5.0

Rhino.FileIO.FileWriteOptions.WriteAsTemplate
Write as template
Since: 5.0

Rhino.FileIO.FileWriteOptions.SuppressDialogBoxes
If true, it means the command has been run with a '-', meaning you should not ask questions during writing. (no dialogs, no "getters", etc.)
Since: 5.0

Rhino.FileIO.FileWriteOptions.SuppressAllInput
Since: 7.0

Rhino.FileIO.FileWriteOptions.WriteGeometryOnly
If true, the file written should include only geometry File Writing Plug-in supports it.
Since: 5.0

Rhino.FileIO.FileWriteOptions.WriteUserData
If true, the file written should include User Data if your File Writing Plug-in supports it.
Since: 5.0

Rhino.FileIO.FileWriteOptions.FileVersion
Since: 5.0

Rhino.FileIO.FileWriteOptions.Xform
Since: 5.0

Rhino.FileIO.FileWriteOptions.DestinationFileName
For use on Apple frameworks only.
Returns the final destination file name.
Since: 6.3

Rhino.FileIO.FileWriteOptions.RhinoDoc
Source RhinoDoc that is being written
Since: 7.7

Rhino.FileIO.FileWriteOptions.OptionsDictionary
Additional read options.
Since: 8.0

Rhino.FileIO.FileWriteOptions.Dispose
Since: 5.0