Rhino.DocObjects.Custom.UserDataList
Represents a collection of user data.

Rhino.DocObjects.Custom.UserDataList.Count
Number of UserData objects in this list.
Since: 5.0

Rhino.DocObjects.Custom.UserDataList.Add(Rhino.DocObjects.Custom.UserData)
If the user-data is already in a different UserDataList, it
will be removed from that list and added to this list.
userdata: Data element.
Returns: Whether this operation succeeded.
Since: 5.0

Rhino.DocObjects.Custom.UserDataList.Remove(Rhino.DocObjects.Custom.UserData)
Remove the user-data from this list
userdata:
Returns: true if the user data was successfully removed
Since: 5.6

Rhino.DocObjects.Custom.UserDataList.Find(System.Type)
Finds a specific data type in this regulated collection.
userdataType: A data type.
Returns: The found data, or null of nothing was found.
Since: 5.0

Rhino.DocObjects.Custom.UserDataList.Item(System.Int32)
Retrieve through indexer. Read-only access.
index:
Returns:

Rhino.DocObjects.Custom.UserDataList.Contains(System.Guid)
Checks for the existence of a specific type of user-data in this list
Both .NET and native user-data is checked
userdataId:
Returns:
Since: 6.1

Rhino.DocObjects.Custom.UserDataList.GetEnumerator
Get enumerator for UserDataList
Returns:
Since: 6.0

Rhino.DocObjects.Custom.UserDataList.System#Collections#IEnumerable#GetEnumerator
Since: 6.0

Rhino.DocObjects.Custom.UserDataList.Purge
Removes all user data from this geometry.
Remarks: User Rhino.DocObjects.Custom.UserDataList.Remove(Rhino.DocObjects.Custom.UserData) to delete a single, known, item.
Since: 6.0