Rhino.Render.it_strategy
Defines the collection type to iterate.
Since: 6.0

Rhino.Render.it_strategy.ContentDataBase
This type represents all the render contents in the database.

Rhino.Render.it_strategy.ContentSelection
This type represents the selected render content collection.