Rhino.ApplicationSettings.GeneralSettingsState
Represents a snapshot of Rhino.ApplicationSettings.GeneralSettings.

Rhino.ApplicationSettings.GeneralSettingsState.MouseSelectMode
Gets or sets the current selection mode.
Since: 5.0

Rhino.ApplicationSettings.GeneralSettingsState.MaximumPopupMenuLines
Gets or sets the maximum number of popup menu lines.
Since: 5.0

Rhino.ApplicationSettings.GeneralSettingsState.MinimumUndoSteps
Gets or sets the minimum undo steps.
Undo records will be purged if there are more than MinimumUndoSteps and
they use more than MaximumUndoMemoryMb.
Since: 5.0

Rhino.ApplicationSettings.GeneralSettingsState.MaximumUndoMemoryMb
Gets or sets the minimum undo memory Mb.
Undo records will be purged if there are more than MinimumUndoSteps and
they use more than MaximumUndoMemoryMb.
Since: 5.0

Rhino.ApplicationSettings.GeneralSettingsState.NewObjectIsoparmCount
Gets or sets the number of isoparm curves to show on new objects.
Since: 5.0

Rhino.ApplicationSettings.GeneralSettingsState.MiddleMouseMode
Gets or sets what happens when the user clicks the middle mouse.
Since: 5.0

Rhino.ApplicationSettings.GeneralSettingsState.MiddleMousePopupToolbar
Gets or sets the toolbar to popup when the middle mouse is clicked on
a view, this value is only used when MiddleMouseMode is set to
PopupToolbar.
Since: 5.0

Rhino.ApplicationSettings.GeneralSettingsState.MiddleMouseMacro
Gets or sets the toolbar to popup when the middle mouse is clicked on
a view, this value is only used when MiddleMouseMode is set to
PopupToolbar.
Since: 5.0

Rhino.ApplicationSettings.GeneralSettingsState.EnableContextMenu
true if right mouse down + delay will pop up context menu on a mouse up if no move happens.
Since: 5.0

Rhino.ApplicationSettings.GeneralSettingsState.ContextMenuDelay
Gets or sets the time to wait before permitting context menu display.
Since: 5.0

Rhino.ApplicationSettings.GeneralSettingsState.AutoUpdateCommandHelp
Gets or sets the command help dialog auto-update feature.
Since: 5.0