Rhino.Geometry.Light
Represents a light that shines in the modeling space.

Rhino.Geometry.Light.CreateSunLight(System.Double,System.Double,System.Double)
Constructs a light that represents the Sun.
northAngleDegrees: The angle of North in degrees. North is the angle between positive World X axis and model North, as measured on World XY plane.
azimuthDegrees: The Azimuth angle value in degrees. Azimuth is the compass angle from North.
altitudeDegrees: The Altitude angle in degrees. Altitude is the angle above the ground plane.
Returns: A new sun light.
Throws Rhino.Runtime.RdkNotLoadedException: If the RDK is not loaded.
Since: 5.0

Rhino.Geometry.Light.CreateSunLight(System.Double,System.DateTime,System.Double,System.Double)
Constructs a light which simulates the Sun based on a given time and location on Earth.
northAngleDegrees: The angle of North in degrees. North is the angle between positive World X axis and model North, as measured on World XY plane.
when: The time of the measurement. The Kind property of DateTime specifies whether this is in local or universal time.
Local and Undefined date-time kinds in this argument are considered local.
latitudeDegrees: The latitude, in degrees, of the location on Earth.
longitudeDegrees: The longitude, in degrees, of the location on Earth.
Returns: A newly constructed light object.
Throws Rhino.Runtime.RdkNotLoadedException: If the RDK is not loaded.
Since: 5.0

Rhino.Geometry.Light.CreateSunLight(Rhino.Render.Sun)
Constructs a light which simulates a Rhino.Render.Sun.
sun: A Sun object from the Rhino.Render namespace.
Returns: A light.
Since: 5.0

Rhino.Geometry.Light.#ctor
Initializes a new light.
Since: 5.0

Rhino.Geometry.Light.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor used in serialization.
info: Serialization data.
context: Serialization stream.

Rhino.Geometry.Light.IsEnabled
Gets or sets a value that defines if the light is turned on (true) or off (false).
Since: 5.0

Rhino.Geometry.Light.LightStyle
Gets or sets a light style on this camera.
Since: 5.0

Rhino.Geometry.Light.LightIndex
Calls ON_Light::LightIndex etc

Rhino.Geometry.Light.IsPointLight
Gets a value indicating whether the light style
is Rhino.Geometry.Light.LightStyle CameraPoint or WorldPoint.
Since: 5.0

Rhino.Geometry.Light.IsDirectionalLight
Gets a value indicating whether the light style
is Rhino.Geometry.Light.LightStyle CameraDirectional or WorldDirectional.
Since: 5.0

Rhino.Geometry.Light.IsSpotLight
Gets a value indicating whether the light style
is Rhino.Geometry.Light.LightStyle CameraSpot or WorldSpot.
Since: 5.0

Rhino.Geometry.Light.IsLinearLight
Gets a value indicating whether the light style
is Rhino.Geometry.Light.LightStyle WorldLinear.
Since: 5.0

Rhino.Geometry.Light.IsRectangularLight
Gets a value indicating whether the light style
is Rhino.Geometry.Light.LightStyle WorldRectangular.
Since: 5.0

Rhino.Geometry.Light.IsSunLight
Gets a value indicating whether this object is a Sun light.
Since: 5.0

Rhino.Geometry.Light.CoordinateSystem
Gets a value, determined by LightStyle, that explains whether
the camera directions are relative to World or Camera spaces.
Since: 5.0

Rhino.Geometry.Light.Location
Gets or sets the light or 3D position or location.
Since: 5.0

Rhino.Geometry.Light.Direction
Gets or sets the vector direction of the camera.
Since: 5.0

Rhino.Geometry.Light.PerpendicularDirection
Gets a perpendicular vector to the camera direction.
Since: 5.0

Rhino.Geometry.Light.Intensity
Gets or sets the light intensity.
Since: 5.0

Rhino.Geometry.Light.PowerWatts
Gets or sets the light power in watts (W).
Since: 5.0

Rhino.Geometry.Light.PowerLumens
Gets or sets the light power in lumens (lm).
Since: 5.0

Rhino.Geometry.Light.PowerCandela
Gets or sets the light power in candelas (cd).
Since: 5.0

Rhino.Geometry.Light.Ambient
Gets or sets the ambient color.
Since: 5.0

Rhino.Geometry.Light.Diffuse
Gets or sets the diffuse color.
Since: 5.0

Rhino.Geometry.Light.Specular
Gets or sets the specular color.
Since: 5.0

Rhino.Geometry.Light.SetAttenuation(System.Double,System.Double,System.Double)
Sets the attenuation settings (ignored for "directional" and "ambient" lights).
attenuation = 1/(a0 + d*a1 + d^2*a2) where d = distance to light.
a0: The new constant attenuation divisor term.
a1: The new reverse linear attenuation divisor term.
a2: The new reverse quadratic attenuation divisor term.
Since: 5.0

Rhino.Geometry.Light.AttenuationVector
Gets or Sets the attenuation vector.
Since: 5.7

Rhino.Geometry.Light.GetAttenuation(System.Double)
Gets the attenuation settings (ignored for "directional" and "ambient" lights).
attenuation = 1/(a0 + d*a1 + d^2*a2) where d = distance to light.
d: The distance to evaluate.
Returns: 0 if a0 + d*a1 + d^2*a2 <= 0.
Since: 5.0

Rhino.Geometry.Light.SpotAngleRadians
Gets or sets the spot angle in radians.
Ignored for non-spot lights.
angle = 0 to pi/2  (0 to 90 degrees).
Since: 5.0

Rhino.Geometry.Light.SpotExponent
The spot exponent varies from 0.0 to 128.0 and provides
an exponential interface for controlling the focus or
concentration of a spotlight (like the
OpenGL GL_SPOT_EXPONENT parameter).  The spot exponent
and hot spot parameters are linked; changing one will
change the other.
A hot spot setting of 0.0 corresponds to a spot exponent of 128.
A hot spot setting of 1.0 corresponds to a spot exponent of 0.0.
Since: 5.0

Rhino.Geometry.Light.HotSpot
The hot spot setting runs from 0.0 to 1.0 and is used to
provides a linear interface for controlling the focus or
concentration of a spotlight.
A hot spot setting of 0.0 corresponds to a spot exponent of 128.
A hot spot setting of 1.0 corresponds to a spot exponent of 0.0.
Since: 5.0

Rhino.Geometry.Light.GetSpotLightRadii(System.Double@,System.Double@)
Gets the spot light radii.
innerRadius: The inner radius. This out parameter is assigned during this call.
outerRadius: The outer radius. This out parameter is assigned during this call.
Returns: true if operation succeeded; otherwise, false.
Since: 5.0

Rhino.Geometry.Light.Length
Gets or sets the height in linear and rectangular lights.
(ignored for non-linear/rectangular lights.)
Since: 5.0

Rhino.Geometry.Light.Width
Gets or sets the width in linear and rectangular lights.
(ignored for non-linear/rectangular lights.)
Since: 5.0

Rhino.Geometry.Light.SpotLightShadowIntensity
Gets or sets the spot light shadow intensity.
(ignored for non-spot lights.)
Since: 5.0

Rhino.Geometry.Light.ShadowIntensity
Gets or sets the shadow intensity for the light.
Since: 6.0

Rhino.Geometry.Light.Name
Gets or sets the light name.
Since: 5.0

Rhino.Geometry.Light.Id
Gets the ID of this light.
Since: 6.0

Rhino.Geometry.Light.ConstantAttenuationVector
Vector denoting a constant light attenuation.

Rhino.Geometry.Light.LinearAttenuationVector
Vector denoting a linear light attenuation.

Rhino.Geometry.Light.InverseSquaredAttenuationVector
Vector denoting an inverse squared light attenuation.

Rhino.Geometry.Light.AttenuationType
Get the type of attenuation for this light.
Since: 7.0