Rhino.DocObjects.Texture
Represents a texture that is mapped on objects.

Rhino.DocObjects.Texture.#ctor
Initializes a new texture.
Since: 5.0

Rhino.DocObjects.Texture.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor for internal use.
info: Serialization data.
context: Serialization stream.

Rhino.DocObjects.Texture.FileName
Gets or sets a file name that is used by this texture.
NOTE: We are moving away from string-based FileName, and suggest
the usage of the new FileReference class.
Also, this filename may well not be a path that makes sense
on a user's computer because it was a path initially set on
a different user's computer. If you want to get a workable path
for this user, use the BitmapTable.Find function using this
property.
Since: 5.0

Rhino.DocObjects.Texture.FileReference
Gets or sets a copy of the file reference that is used by this texture.
Remarks: After the get or the set method complete,
you own the copy you received or passed in, and can Dispose() of it.
Since: 6.0

Rhino.DocObjects.Texture.Id
Gets the globally unique identifier of this texture.
Since: 5.0

Rhino.DocObjects.Texture.Enabled
If the texture is enabled then it will be visible in the rendered
display otherwise it will not.
Since: 5.0

Rhino.DocObjects.Texture.TextureType
Controls how the pixels in the bitmap are interpreted
Since: 5.6

Rhino.DocObjects.Texture.MinFilter
The MinFilter setting controls how the color
of the image pixel is calculated when the image pixel
corresponds to multiple texture bitmap pixels.
Since: 8.3

Rhino.DocObjects.Texture.MagFilter
The MagFilter setting controls how the color
of the image pixel is calculated when the image pixel
corresponds to a fraction of a texture bitmap pixel.
Since: 8.3

Rhino.DocObjects.Texture.MappingChannelId
Since: 5.10

Rhino.DocObjects.Texture.ProjectionMode
How texture is projected onto geometry
Since: 8.3

Rhino.DocObjects.Texture.WcsProjected
Is true if this texture uses world coordinate system (WCS) projection for texture mapping.
Notice: If this texture is used by an object that has an object coordinate system (OCS) frame
defined on a mapping channel then that OCS frame is used instead of the WCS.
Since: 8.3

Rhino.DocObjects.Texture.TreatAsLinear
If false, the texture color values should be correctly by the linear workflow pre-process gamma value (in the document)
if linear workflow is on.  Otherwise, if the values is true, the values should be used raw from the texture.
Since: 8.7

Rhino.DocObjects.Texture.WcsBoxProjected
Is true if this texture uses world coordinate system (WCS) box projection for texture mapping.
Notice: If this texture is used by an object that has an object coordinate system (OCS) frame
defined on a mapping channel then that OCS frame is used instead of the WCS.
Since: 8.3

Rhino.DocObjects.Texture.TextureCombineMode
Determines how this texture is combined with others in a material's
texture list.
Since: 5.6

Rhino.DocObjects.Texture.WrapUvwHelper(System.Int32)
Helper function for getting the ON_Texture::WRAP mode and converting
it to a TextureUvwWrapping value.
mode:
Returns:

Rhino.DocObjects.Texture.WrapU
Texture wrapping mode in the U direction
Since: 5.6

Rhino.DocObjects.Texture.WrapV
Texture wrapping mode in the V direction
Since: 5.6

Rhino.DocObjects.Texture.WrapW
Texture wrapping mode in the W direction
Since: 5.6

Rhino.DocObjects.Texture.ApplyUvwTransform
If true then the UVW transform is applied to the texture
otherwise the UVW transform is ignored.
Since: 5.6

Rhino.DocObjects.Texture.UvwTransform
Transform to be applied to each instance of this texture
if ApplyUvw is true
Since: 5.6

Rhino.DocObjects.Texture.Repeat
Helper for access to the repeat value encoded in UvwTransform
Since: 8.0

Rhino.DocObjects.Texture.Offset
Helper for access to the offset value encoded in UvwTransform
Since: 8.0

Rhino.DocObjects.Texture.Rotation
Helper for access to the rotation value encoded in UvwTransform
Since: 8.0

Rhino.DocObjects.Texture.GetAlphaBlendValues(System.Double@,System.Double@,System.Double@,System.Double@,System.Double@)
If the TextureCombineMode is Blend, then the blending function
for alpha is determined by
new alpha = constant
+ a0*(current alpha)
+ a1*(texture alpha)
+ a2*min(current alpha,texture alpha)
+ a3*max(current alpha,texture alpha)
constant:
a0:
a1:
a2:
a3:
Since: 5.6

Rhino.DocObjects.Texture.SetAlphaBlendValues(System.Double,System.Double,System.Double,System.Double,System.Double)
If the TextureCombineMode is Blend, then the blending function
for alpha is determined by
new alpha = constant
+ a0*(current alpha)
+ a1*(texture alpha)
+ a2*min(current alpha,texture alpha)
+ a3*max(current alpha,texture alpha)
constant:
a0:
a1:
a2:
a3:
Since: 5.6

Rhino.DocObjects.Texture.SetRGBBlendValues(System.Drawing.Color,System.Double,System.Double,System.Double,System.Double)
If the TextureCombineMode is Blend, then the blending function
for RGB is determined by
new rgb = colorcolor
+ a0[0]*(current RGB)
+ a1[1]*(texture RGB)
+ a2[2]*min(current RGB,texture RGB)
+ a3[3]*max(current RGB,texture RGB)
color:
a0:
a1:
a2:
a3:
Since: 6.0