Rhino.Render.UICommands.UICommand.CppPointer
CppPointer

Rhino.Render.UICommands.UICommand.SerialNumber
SerialNumber

Rhino.Render.UICommands.UICommand.#ctor
Constructor

Rhino.Render.UICommands.UICommand.Dispose
Dispose

Rhino.Render.UICommands.UICommand.Dispose(System.Boolean)
Dispose

Rhino.Render.UICommands.UICommand.IsEnabled(Rhino.Render.UICommands.UICommandOrigin)
This is used by content-dependent UICommands to disable the UICommand's UI
if the wrong number of contents are selected.
Returns:  True if the UICommand is enabled, else false.

Rhino.Render.UICommands.UICommand.MenuOrder(Rhino.Render.UICommands.UICommandOrigin)
The sort order of the UICommand on any menus it appears on.
Returns:  int sort order

Rhino.Render.UICommands.UICommand.MenuString(Rhino.Render.UICommands.UICommandOrigin,Rhino.Render.RenderContentKind)
The menu string for this UICommand.
to: UICommandOrigin is the UI that is showing the UICommand
kind:  Kind is the kind of top-level content being displayed in the UI that is showing the menu.
Returns:  int sort order

Rhino.Render.UICommands.UICommand.Update(Rhino.Render.UICommands.UICommandUpdate)
Implement this method to update the UI element associated with the UICommand (e.g., a menu).
If you do not implement this, the UICommand's UI elements will always appear in an active
and unchecked state.
tu: UICommandUodate

Rhino.Render.UICommands.UICommand.Execute(Rhino.Render.UICommands.UICommandOrigin)
Implement this method to execute the UICommand.
to: UICommandOrigin

Rhino.Render.UICommands.UICommand.PlugInId
Plugin-in ID
Returns: The Guid for the plugin that contains the UICommand

Rhino.Render.UICommands.UICommand.Id
The UICommand's unique id.
Returns: The Guid for the UICommand

Rhino.Render.UICommands.UICommand.InterfaceId
-The unique interface id of this extension
Returns: The Interface ID

Rhino.Render.UICommands.UICommand.RenderEngineId
Get the render engine id associated with the UICommand. Only UICommands associated with
the current renderer will be shown on menus.If this method returns uuidUniversalRenderEngine
then the UICommand will always be shown. This is the default.
Returns: The Render engine ID

Rhino.Render.UICommands.UICommand.RequiredDatasources(Rhino.Runtime.InteropWrappers.SimpleArrayGuid)
The ids of the data sources needed to make UICommands work..
array: The array with datasource ids.

Rhino.Render.UICommands.UICommand.SupportsSandbox
Support for sandbox documents
Returns:  True if the UICommand can be used when editing a sandbox document, else false.

Rhino.Render.UICommands.UICommand.Query(Rhino.Render.UICommands.UICommandOrigin,System.Boolean)
Query if the UICommand should be displayed to the user in a menu etc.
The default implementation returns the result of calling origin.SupportsUICommand().
to: Origin represents the UI that the menu was invoked in.
bOnItem:  True if the user right-clicked on one or more items (thumbnail, tree node etc).
It will be false if the menu was not a context menu, nothing was selected or the user right-clicked
on a blank area of the UI.For content/sub-node controls, this is always true.
Returns:  True if a UI element (e.g., a menu item) should be created for the UICommand, else false.

Rhino.Render.UICommands.UICommand.UserUpdate(Rhino.Render.UICommands.UICommandUpdate)
Update the UI element (e.g., a menu) associated with a UICommand. This method should
rarely if ever, be overridden.It first checks if the UICommand is enabled generally
by calling IsEnabled(). If the UICommand is enabled, it updates the UICommand's UI by
calling Update(). The actual update is performed by an override of Update().
tu: UICommand Update.

Rhino.Render.UICommands.UICommand.UserExecute(Rhino.Render.UICommands.UICommandOrigin)
Execute the UICommand.This method should rarely, if ever, be overridden.As well as
executing the UICommand by calling Execute(), it does common operations such as asking
if the user is sure, and displaying an error message on failure.The actual UICommand
operation is performed by an override of Execute().
to: UICommand Origin.
Returns: Return Result

Rhino.Render.UICommands.UICommand.MenuSeparators
Menu separators that surround the menu item of this UICommand.
Returns: The menu separators that surround the menu item of this UICommand.

Rhino.Render.UICommands.UICommand.IconOut(Rhino.Render.RenderContentKind,System.Int32,System.Int32)
An icon for the 'out' or 'unchecked' state of the menu item or button that initiates this UICommand.
kind: Render content kind
width: Icon width
height: Icon height
Returns: The bitmap that is used for the UICommand in the menu

Rhino.Render.UICommands.UICommand.IconIn(Rhino.Render.RenderContentKind,System.Int32,System.Int32)
An icon for the 'in' or 'checked' state of the menu item or button that initiates this UICommand.
Since many operations do not have a 'checked' state, the default implementation returns IconOut().
kind: Render content kind
width: Icon width
height: Icon height
Returns: The bitmap that is used for the UICommand in the menu

Rhino.Render.UICommands.UICommand.SetError(System.String,Rhino.UI.ShowMessageIcon)
Set an error message and severity. This is typically called when a UICommand
is about to return failure.
message: Error message
severity: Severity

Rhino.Render.UICommands.UICommand.SubMenu
UICommands Sub Menus
Returns: Return a value from the SubMenus enum which determines if the task can appear
on a sub-menu, and which sub-menu it will appear on.The default is 'None'.

Rhino.Render.UICommands.UICommand.IsForTopLevelContent
IsForTopLevelContent
Returns: True if the UICommand can only operate on top-level content, else false..

Rhino.Render.UICommands.UICommand.GetSureMessage(Rhino.Render.UICommands.UICommandOrigin,System.String@,System.String@,System.String@,System.String@)
Implement this method to provide an 'Are you sure?' message.
Only override and implement this if you want such a message.
to: UICommand Origin
message: Accepts the message that will be displayed to the user. The message
box will have 'Yes' and 'No' buttons and a 'Don't show me this again' check box.
yesVerbOut: Provides alternative text for the 'Yes' button (only used on the Mac).
noVerbOut: Provides alternative text for the 'No' button (only used on the Mac).
dontShowAgainIdOut: Accepts an identifier which is used to remember if the user
chose to not be asked this question again.
Returns: True if such a message is required by this UICommand, else false.

Rhino.Render.UICommands.UICommand.GetUndoString(Rhino.Render.UICommands.UICommandOrigin)
Implement this method to provide a custom undo string.
The default is automatically created from the menu string.
to: UICommand Origin
Returns: Return the Undo string.

Rhino.Render.UICommands.UICommand.SetSelection(Rhino.Render.UICommands.UICommandOrigin,Rhino.Render.RenderContentCollection)
Set the selection so that the user can view and edit a collection of one or more contents.
to: UICommand Origin
collection: Collection of contents to set as the current selection.

Rhino.Render.UICommands.UICommand.Error(System.String)
Helper function to set error message with severity 'error' and return failure.
message: The error message
Returns: Return Result