Rhino.Render.RenderContent
Base class for all RenderContent - RenderMaterial, RenderTexture and RenderEnvironment
Contents have a unique type id which is the same for all instances of the same class and an instance id
which is unique for each instance.They know how to provide a shader for rendering, how to read and write
their state as XML and how to create their own user interfaces.
There are two flavors of content in the RDK -- temporary and persistent.It is very important to understand
the distinction between a temporary content instance and a persistent content instance, and the fact that a
temporary instance (and all its children) can become persistent.Persistent content is registered with a
document and is usually(but not always) owned by it.
Temporary contents get created and deleted very often during the normal operation of the RDK.In fact, just
about anything the user clicks on might result in a temporary content being created and deleted again.They
are created by the content browser, the thumbnail rendering, and so on.They are 'free floating' and are
owned by whomever created them.They do not appear in the modeless UI, they do not get saved in the 3dm
file, and they can freely be deleted again after use.
Contrast this with persistent contents which are attached to a document.They are always owned by RDK,
appear in the modeless UI and get saved in the 3dm file. Pointers to persistent contents should never
be stored by clients; you should only store their instance ids and look them up again using
RenderContent.FromId. They can be deleted only after detaching them from the document.
RenderContent::Create is the highest-level function for creating a content.It creates it,
initializes it, adds it to the document and sends many events.It even records undo.You cannot call this
method from just anywhere. It must only be called by 'UI code'; scripts or buttons on a dialog.It results
in a persistent (usually top-level) content being attached to the document and appearing in all the RDK UI
elements that display contents, like the thumbnail and tree views.If you call this method and specify a
parent and child-slot name, your new content will be attached to the document-resident parent as a child
and the UI will be updated accordingly.
The important point is that everything is temporary while the content structure is being built. Only
after the whole structure is complete will the top-level parent be attached to the document making the
whole structure persistent.

Rhino.Render.RenderContent.ConvertContentKind(UnsafeNativeMethods.CRhRdkContentKindConst)
Convert unmanaged UnsafeNativeMethods.CRhRdkContentKindConst to managed
RenderContentKind.
kind:
Returns:

Rhino.Render.RenderContent.IsInUseBySelectedObject
If this is a material, checks if it's in use and the rhino object is selected.
Otherwise returns false.
Returns:

Rhino.Render.RenderContent.HasId(System.Guid)
Checks if this render content has the specified id. This is different to checking the id
directly because it also checks the members of texture proxies.

Rhino.Render.RenderContent.Create(System.Guid,Rhino.Render.RenderContent.ShowContentChooserFlags,Rhino.RhinoDoc)
Constructs a new content of the specified type and attaches it to a document.
This function cannot be used to create temporary content that you delete after use.
Content created by this function is owned by RDK and appears in the content editor.
To create a temporary content which is owned by you, call RenderContentType.NewContentFromTypeId().
type: The type of the content to create.
flags: Flags for future use (please always pass ShowContentChooserFlags::None).
doc: The Rhino document to attach the new render content to.
Returns: A new document-resident render content.
Since: 5.1
7.9

Rhino.Render.RenderContent.Create(System.Type,Rhino.Render.RenderContent.ShowContentChooserFlags,Rhino.RhinoDoc)
Constructs a new content of the specified type and attaches it to a document.
This function cannot be used to create temporary content that you delete after use.
Content created by this function is owned by RDK and appears in the content editor.
To create a temporary content which is owned by you, call RenderContentType.NewContentFromTypeId().
type: The type of the content to create.
flags: Flags for future use (please always pass ShowContentChooserFlags::None).
doc: The Rhino document to attach the new render content to.
Returns: A new document-resident render content.
Since: 5.1
7.9

Rhino.Render.RenderContent.Create(System.Guid,Rhino.Render.RenderContent,System.String,Rhino.Render.RenderContent.ShowContentChooserFlags,Rhino.RhinoDoc)
Constructs a new content of the specified type and attaches it to a document.
This function cannot be used to create temporary content that you delete after use.
Content created by this function is owned by RDK and appears in the content editor.
To create a temporary content which is owned by you, call RenderContentType.NewContentFromTypeId().
type: The type of the content to create.
parent: Parent is the parent content. If not null, this must be an RDK-owned content that is
attached to the document (either top-level or child). The new content then becomes its child.
If null, the new content is added to the top-level document content list instead.
childSlotName: ChildSlotName is the unique child identifier to use for the new content when creating it as a child of parent (i.e., when parent is not null)
flags: Flags for future use (please always pass ShowContentChooserFlags::None).
doc: The Rhino document to attach the new render content to.
Returns: A new document-resident render content.
Since: 5.1
7.9

Rhino.Render.RenderContent.Create(System.Type,Rhino.Render.RenderContent,System.String,Rhino.Render.RenderContent.ShowContentChooserFlags,Rhino.RhinoDoc)
Constructs a new content of the specified type and attaches it to a document.
This function cannot be used to create temporary content that you delete after use.
Content created by this function is owned by RDK and appears in the content editor.
To create a temporary content which is owned by you, call RenderContentType.NewContentFromTypeId().
type: The type of the content to create.
parent: The parent content. If not null, this must be an RDK-owned content that is
attached to the document (either top-level or child). The new content then becomes its child.
If null, the new content is added to the top-level document content list instead.
childSlotName: ChildSlotName is the unique child identifier to use for the new content when creating it as a child of parent (i.e., when parent is not null)
flags: Flags for future use (please always pass ShowContentChooserFlags::None).
doc: The Rhino document to attach the new render content to.
Returns: A new document-resident render content.
Since: 5.1
7.9

Rhino.Render.RenderContent.Create(Rhino.RhinoDoc,System.Guid)
Constructs a new content of the specified type and attaches it to a document.
This function cannot be used to create temporary content that you delete after use.
Content created by this function is owned by RDK and appears in the content editor.
To create a temporary content which is owned by you, call RenderContentType.NewContentFromTypeId().
doc: The Rhino document to attach the new render content to.
type: The type of the content to create.
Returns: A new document-resident render content.
Since: 7.9

Rhino.Render.RenderContent.Create(Rhino.RhinoDoc,System.Type)
Constructs a new content of the specified type and attaches it to a document.
This function cannot be used to create temporary content that you delete after use.
Content created by this function is owned by RDK and appears in the content editor.
To create a temporary content which is owned by you, call RenderContentType.NewContentFromTypeId().
doc: The Rhino document to attach the new render content to.
type: The type of the content to create.
Returns: A new document-resident render content.
Since: 7.9

Rhino.Render.RenderContent.Create(Rhino.RhinoDoc,System.Guid,Rhino.Render.RenderContent,System.String)
Constructs a new content of the specified type and attaches it to a document.
This function cannot be used to create temporary content that you delete after use.
Content created by this function is owned by RDK and appears in the content editor.
To create a temporary content which is owned by you, call RenderContentType.NewContentFromTypeId().
doc: The Rhino document to attach the new render content to.
type: The type of the content to create.
parent: Parent is the parent content. If not null, this must be an RDK-owned content that is
attached to the document (either top-level or child). The new content then becomes its child.
If null, the new content is added to the top-level document content list instead.
childSlotName: ChildSlotName is the unique child identifier to use for the new content when creating it as a child of parent (i.e., when parent is not null)
Returns: A new document-resident render content.
Since: 7.9

Rhino.Render.RenderContent.Create(Rhino.RhinoDoc,System.Type,Rhino.Render.RenderContent,System.String)
Constructs a new content of the specified type and attaches it to a document.
This function cannot be used to create temporary content that you delete after use.
Content created by this function is owned by RDK and appears in the content editor.
To create a temporary content which is owned by you, call RenderContentType.NewContentFromTypeId().
doc: The Rhino document to attach the new render content to.
type: The type of the content to create.
parent: The parent content. If not null, this must be an RDK-owned content that is
attached to the document (either top-level or child). The new content then becomes its child.
If null, the new content is added to the top-level document content list instead.
childSlotName: ChildSlotName is the unique child identifier to use for the new content when creating it as a child of parent (i.e., when parent is not null)
Returns: A new document-resident render content.
Since: 7.9

Rhino.Render.RenderContent.RegisterContent(Rhino.PlugIns.PlugIn)
Call RegisterContent in your plug-in's OnLoad function in order to register all of the
custom RenderContent classes in your assembly.
plugin:
Returns: array of render content types registered on success. null on error.
Since: 5.1

Rhino.Render.RenderContent.RegisterContent(System.Reflection.Assembly,System.Guid)
Call RegisterContent in your plug-in's OnLoad function in order to register all of the
custom RenderContent classes in your assembly.
assembly:
Assembly where custom content is defined, this may be a plug-in assembly
or another assembly referenced by the plug-in.
pluginId: Parent plug-in for this assembly.
Returns: array of render content types registered on success. null on error.
Since: 5.1

Rhino.Render.RenderContent.LoadFromFile(System.String)
Loads content from a library file.  Does not add the content to the document.  Use RhinoDoc.RenderMaterials.Add or similar.
filename: full path to the file to be loaded.
Returns: The loaded content or null if an error occurred.
Since: 5.1

Rhino.Render.RenderContent.SaveToFile(System.String,Rhino.Render.RenderContent.EmbedFilesChoice)
Saves content to a file - RMTL, RENV or RTEX.
filename: Full path to the file to be saved.
embedFilesChoice:
Returns: The loaded content or null if an error occurred.
Since: 8.6

Rhino.Render.RenderContent.AddPersistentRenderContent(Rhino.Render.RenderContent)
Add a material, environment or texture to the internal RDK document lists as
top level content.  The content must have been returned from
RenderContent::MakeCopy, NewContentFromType or a similar function that returns
a non-document content.
Obsolete - use RhinoDoc.RenderMaterials.Add or similar.
renderContent: The render content.
Returns: true on success.
Since: 5.1
6.0

Rhino.Render.RenderContent.AddPersistentRenderContent(Rhino.RhinoDoc,Rhino.Render.RenderContent)
Add a material, environment or texture to the internal RDK document lists as
top level content.  The content must have been returned from
RenderContent::MakeCopy, NewContentFromType or a similar function that returns
a non-document content.
Obsolete - use RhinoDoc.RenderMaterials.Add or similar.
document: The document to attach the render content to.
renderContent: The render content.
Returns: true on success.
Since: 6.0
6.0

Rhino.Render.RenderContent.FromId(Rhino.RhinoDoc,System.Guid)
Search for a content object based on its Id
document:
The Rhino document containing the content.
id:
Id of the content instance to search for.
Returns:
Returns the content object with the specified Id if it is found
otherwise it returns null.
Since: 5.7

Rhino.Render.RenderContent.MakeCopy
Create a copy of the render content. All content is the same, except for the
instance Id.
Returns: The new RenderContent
Since: 6.0

Rhino.Render.RenderContent.OnMakeCopy(Rhino.Render.RenderContent@)
Override this function to supplement the standard copying behavour for your RenderContent.
newContent: Is the content that will be returned from MakeCopy.

Rhino.Render.RenderContent.FromPointer(System.IntPtr,Rhino.Render.RenderContent)
Create a .NET object of the appropriate type and attach it to the
requested C++ pointer
renderContent:
relatedContent:
Returns:

Rhino.Render.RenderContent.FromXml(System.String)
Since: 6.0
6.4

Rhino.Render.RenderContent.FromXml(System.String,Rhino.RhinoDoc)
Creates a new content from the XML data.  The resulting content will not be attached to the document.
xml: The input XML data.
doc: The document that the content will be associated with for units, linear workflow purposes.
Returns:
Since: 6.4

Rhino.Render.RenderContent.GenerateRenderContentPreview(Rhino.Render.LinearWorkflow,Rhino.Render.RenderContent,System.Int32,System.Int32,System.Boolean,Rhino.Render.PreviewJobSignature,Rhino.Render.PreviewAppearance,Rhino.Render.Utilities.PreviewRenderResult@)
Generate a render content preview
lwf: Linear Workflow
c: Render Content
width: Image width
height: Image height
bSuppressLocalMapping: Suppress Local Mapping
pjs: Preivew Job Signature
pa: Preivew Appearance
result: Reference to PreviewRenderResult value
Returns: The Bitmap of the render content preview
Since: 8.9

Rhino.Render.RenderContent.GenerateQuickContentPreview(Rhino.Render.RenderContent,System.Int32,System.Int32,Rhino.Render.PreviewSceneServer,System.Boolean,System.Int32,Rhino.Commands.Result@)
Generate a quick render content preview
c: Render Content
width: Image width
height: Image height
psc: PreviewSceneServer
bSuppressLocalMapping: SuppressLocalMapping
reason:  ContentChanged = 0, ViewChanged = 1, RefreshDisplay = 2, Other = 99
result: Rhino.Command.Result value for successfull quick image creation
Returns: The Bitmap of the quick render content preview
Since: 8.9

Rhino.Render.RenderContent.GenerateQuickContentPreview(Rhino.Render.LinearWorkflow,Rhino.Render.RenderContent,System.Int32,System.Int32,Rhino.Render.PreviewSceneServer,System.Boolean,System.Int32,Rhino.Commands.Result@)
Generate a quick render content preview
lw: Linear workflow
c: Render Content
width: Image width
height: Image height
psc: PreviewSceneServer
bSuppressLocalMapping: SuppressLocalMapping
reason:  ContentChanged = 0, ViewChanged = 1, RefreshDisplay = 2, Other = 99
result: Rhino.Command.Result value for successfull quick image creation
Returns: The Bitmap of the quick render content preview
Since: 8.16

Rhino.Render.RenderContent.ShowContentInstanceBrowser(Rhino.RhinoDoc,System.Guid@,Rhino.Render.RenderContentKind,Rhino.Render.RenderContent.ContentInstanceBrowserButtons)
Allows the user to choose a content by displaying the Content Instance Browser dialog.
The dialog will have OK, Cancel and Help buttons, and optional New and Edit buttons.
doc: Specifies the document to use.
instance_id: Sets the initially selected content and receives the instance id of the chosen content.
kinds: Specifies the kind(s) of content that should be displayed in the browser.
buttons: Specifies which optional buttons to display.
Returns true if the user chooses a content or false if the dialog is cancelled.
Since: 8.15

Rhino.Render.RenderContent.RuntimeSerialNumber
Serial number of the created object, valid values:
-1  == OnDeleteRhCmnRenderContent() was called with this serial number
>0  == Value set by the constructor

Rhino.Render.RenderContent.g_current_serial_number
The next allocation serial number

Rhino.Render.RenderContent.m_search_hint
I think this is the index to start the search from if we have an
idea as to where to start looking.

Rhino.Render.RenderContent.g_custom_content_dictionary
Contains a list of objects with a m_runtime_serial_number > 0,
OnDeleteRhCmnRenderContent() will remove objects from the dictionary
by m_runtime_serial_number.

Rhino.Render.RenderContent.m_field_dictionary
Rhino.Render.Fields FieldDictionary which provides access to setting
and retrieving field values.

Rhino.Render.RenderContent.Fields
Rhino.Render.Fields FieldDictionary which provides access to setting
and retrieving field values.
Since: 5.1

Rhino.Render.RenderContent.CppPointer
Since: 6.0

Rhino.Render.RenderContent.BindParameterToField(System.String,System.String,Rhino.Render.Fields.Field,Rhino.Render.RenderContent.ChangeContexts)
Use bindings to automatically wire parameters to fields
parameterName:
childSlotName:
field:
setEvent:
Since: 5.7

Rhino.Render.RenderContent.BindParameterToField(System.String,Rhino.Render.Fields.Field,Rhino.Render.RenderContent.ChangeContexts)
Use bindings to automatically wire parameters to fields
parameterName:
field:
setEvent:
Since: 5.7

Rhino.Render.RenderContent.ClassDefinedInRhinoCommon
Check to see if the class is defined by RhinoCommon or some other
assembly.
Returns:
If the class assembly type is equal to the RhinoCommon assembly then
return true  indicating native content otherwise return false
indicating custom content.

Rhino.Render.RenderContent.IsCustomClassDefintion
Check to see if the class type assembly is something other than
RhinoCommon.
Returns:
Return true if the class definition resides in an assembly other than
RhinoCommon otherwise return false because it is native content.

Rhino.Render.RenderContent.#ctor
internal because we don't want people to ever directly subclass RenderContent.
They should always derive from the subclasses of this class.

Rhino.Render.RenderContent.GetString(UnsafeNativeMethods.RenderContent_StringIds)
Internal method used to get string values from the C++ SDK
which: Id of string value to get
Returns: Returns the requested string value.

Rhino.Render.RenderContent.TypeName
Name for your content type. i.e., "My .net Texture"
Since: 5.1

Rhino.Render.RenderContent.TypeDescription
Description for your content type. i.e., "Procedural checker pattern"
Since: 5.1

Rhino.Render.RenderContent.DisplayName
Display name for this content.
Since: 7.8

Rhino.Render.RenderContent.Name
Instance 'raw' name for this content.
Since: 5.1

Rhino.Render.RenderContent.SetName(System.String,System.Boolean,System.Boolean)
Set instance name for this content
name:
renameEvents:
ensureNameUnique:
Since: 7.0

Rhino.Render.RenderContent.Notes
Notes for this content.
Since: 5.1

Rhino.Render.RenderContent.Tags
Tags for this content.
Since: 6.4

Rhino.Render.RenderContent.ChildSlotDisplayName
Returns the localized display name of the child slot name
Since: 7.0

Rhino.Render.RenderContent.Category
Category for this content.
Since: 6.7

Rhino.Render.RenderContent.Id
Instance identifier for this content.
Since: 5.1

Rhino.Render.RenderContent.TypeId
Type identifier for this content
Since: 6.0

Rhino.Render.RenderContent.ForDisplay
**** This method is for proxies and will be marked obsolete in the future ****
The only place a single proxy can be displayed is in the
New Content Control main thumbnail. All other attempts to
use a single proxy in a UI require it to be replaced with
the corresponding multi proxy. Single proxies override this
to find the corresponding multi proxy.
Returns: The render content.
Since: 6.9

Rhino.Render.RenderContent.IsReference
Query whether or not the content or any of its ancestors is a reference content.
Returns: true if the content is a reference, else false
Since: 6.9

Rhino.Render.RenderContent.GroupId
Group ID of the content
Since: 6.26

Rhino.Render.RenderContent.MakeGroupInstance
Create an 'instance' of the content hierarchy and group the new hierarchy with this hierarchy.
If the instance is subsequently attached to the same document, the state of all members
of the group will be kept synchronized. With the exception of the instance ids, all
state is exactly preserved in the new instance hierarchy.
\note The grouping will have no effect until the new instance is attached to the same document.
Returns: A grouped instance of the content hierarchy.
Since: 6.26

Rhino.Render.RenderContent.Ungroup
Remove this content from any instance group it may be a member of.
Does not record undo but does send the OnContentGroupIdChanged event.
Returns: true if content was ungrouped, \e false if it was not part of a group.
Since: 6.26

Rhino.Render.RenderContent.UngroupRecursive
Remove this content and all its children from any instance groups they may be a member of.
Does not record undo but does send the OnContentGroupIdChanged event.
Returns: true if a content was ungrouped, \e false if no content or child was part of a group.
Since: 6.26

Rhino.Render.RenderContent.SmartUngroupRecursive
Remove this content and all its children from any instance groups they may be a member of.
If any content in the same document is left alone in the group, that content is also ungrouped.
Records undo and sends events OnContentChanged and OnContentGroupIdChanged.
\note This method is designed to be called from a content UI and is intended for RDK internal
use but may be used as an expert user override.
Returns: true if a content was ungrouped, \e false if no content or child was part of a group.
Since: 6.26

Rhino.Render.RenderContent.UseCount
UseCount returns how many times the content is used
Since: 6.9

Rhino.Render.RenderContent.SetRenderHash(System.UInt32)
This method is deprecated and no longer called. For more information see Rhino.Render.RenderContent.CalculateRenderHash(System.UInt64)
hash:
Since: 6.0
6.0

Rhino.Render.RenderContent.IsRenderHashCached
This method is deprecated and no longer called. For more information see Rhino.Render.RenderContent.CalculateRenderHash(System.UInt64)
Returns: bool
Since: 6.0
6.0

Rhino.Render.RenderContent.CalculateRenderHash(System.UInt64)
Override this method to calculate the render hash of the state that
affects how the content is rendered.  Does not include children or
perform any caching. Render hash values are now automatically cached by
the content framework and you do not have to worry about caching. You
also do not have to worry about iterating into children.  This method
is now only called internally by the framework, use the RenderHash
property to get the current hash value.
Returns:

Rhino.Render.RenderContent.CalculateRenderHash2(Rhino.Render.CrcRenderHashFlags,System.String[])
flags:
excludeParameterNames:
Returns:

Rhino.Render.RenderContent.RenderHash
Render hash for the content hierarchy. It iterates over children and includes a caching
mechanism which means the hash value can be retrieved quickly if it hasn't changed.
The cache is invalidated when Changed() is called.
You can override the Rhino.Render.RenderContent.CalculateRenderHash(System.UInt64) method to provide a custom hash value.
Since: 6.0

Rhino.Render.RenderContent.SetIsRenderHashRecursive(System.Boolean)
By default, RenderHash recurses into children when computing the render hash.
However, some applications may require children to be excluded from the render hash calculation.
Call this method to enable or disable recursing into children.
see Rhino.Render.RenderContent.RenderHash
recursive:
Since: 7.0

Rhino.Render.RenderContent.RenderHashExclude(Rhino.Render.TextureRenderHashFlags,System.String)
This method is deprecated in favor of the one that takes CrcRenderHashFlags.
Since: 6.0
8.0

Rhino.Render.RenderContent.RenderHashExclude(Rhino.Render.CrcRenderHashFlags,System.String)
As RenderHash, but allows you to specify flags and exclude specific parameters.
flags: Flags to finely control the render hash.
excludeParameterNames: Semicolon-delimited string of parameter names to exclude.
Returns: The render hash.
Since: 6.2

Rhino.Render.RenderContent.RenderHashExclude(Rhino.Render.CrcRenderHashFlags,System.String,Rhino.Render.LinearWorkflow)
As RenderHash, but allows you to specify flags and exclude specific parameters.
Use this version of the function to calculate a render hash when you have the linear workflow
information and you are not running on the main thread. Access to LinearWorkflow data requires
document access. CrcRenderHashFlags.ExcludeLinearWorkflow must be specified.
flags: Flags to finely control the render hash.
excludeParameterNames: Semicolon-delimited string of parameter names to exclude.
lw: Linear Workflow to use.
Returns: The render hash.
Since: 6.2

Rhino.Render.RenderContent.TopLevel
Returns true if this content has no parent, false if it is the child of another content.
Since: 5.1

Rhino.Render.RenderContent.InDocument
Returns true if this content is a resident of one of the persistent lists.

Rhino.Render.RenderContent.Hidden
Gets or sets the render content's 'hidden' state. This feature only works for top-level render contents
because it hides the entire hierarchy. It is normally used for 'implementation detail' render contents.
For expert use only. Hidden render contents are never shown in the UI, with the exception of the Object
(or Layer) Material Properties UI which always shows whatever is assigned to the object (or layer).
In the Object (or Layer) Material Properties UI, if the user drops down the list, hidden render contents
are not listed. Hidden render contents, being part of the document content list, will be listed by any
scripts or other code that iterates over the document render content list. It is recommended that you set
IsHidden once when you create your render content and leave it on to prevent flicker or slow performance.
Since: 5.1

Rhino.Render.RenderContent.IsHiddenByAutoDelete
Contents can be created as 'auto-delete' by certain commands such as 'Picture'.
These contents are automatically hidden from the user when the associated Rhino object
is deleted. They are later deleted when the document is saved.
Since: 6.15

Rhino.Render.RenderContent.CanBeEdited
Determines if the content can be edited.
Since: 6.0

Rhino.Render.RenderContent.IsDefaultInstance
Checks if render content is default instance.
Since: 6.0

Rhino.Render.RenderContent.ProxyType
Gets the proxy type of the render content
Since: 6.0

Rhino.Render.RenderContent.Parent
Returns the top content in this parent/child chain.
Since: 5.11

Rhino.Render.RenderContent.FirstChild
Return First child of this content or null if none.
Since: 6.0

Rhino.Render.RenderContent.NextSibling
Return First sibling of this content or null if none.
Since: 6.0

Rhino.Render.RenderContent.TopLevelParent
Returns the top content in this parent/child chain.
Since: 5.1

Rhino.Render.RenderContent.Document
Obsolete. Do not use. You should use DocumentOwner instead.
Since: 5.10

Rhino.Render.RenderContent.DocumentOwner
If this render content is owned by a document, the document will be returned.
This is the same as getting the document the render content is attached to.
Otherwise returns null.
Since: 7.13

Rhino.Render.RenderContent.DocumentRegistered
Obsolete. Do not use. You should use DocumentOwner instead.
Since: 6.0

Rhino.Render.RenderContent.DocumentAssoc
If this render content is associated with a document in any way, the document will be returned. This includes copies of
render contents that were attached to a document when the copy was made. Otherwise returns null.
Since: 6.0

Rhino.Render.RenderContent.OpenInEditor
Call this method to open the content in the relevant thumbnail editor
and select it for editing by the user. The content must be in the
document or the call will fail.
Returns:
Returns true on success or false on error.
Since: 5.7

Rhino.Render.RenderContent.OpenInModalEditor
Call this method to open the content in the a modal version of the editor.
The content must be in the document or the call will fail.
Returns:
Returns true on success or false on error.
Since: 5.7
6.13

Rhino.Render.RenderContent.Edit
This method allows a render content hierarchy to be edited using a modal (AKA 'pop-up') editor.
If the original render content is in a document, it will remain there, and the edited one will be
'free-floating'. Therefore it is the caller's responsibility to do any replacement in the document
if required. The returned new content will be owned by the caller.
Returns:
Returns an edited version of the content hierarchy if successful, else null.
The method always edits the entire hierarchy. It places a copy of the hierarchy in the editor
and selects the copied item that corresponds to this one. Therefore, editing a child will return
a top-level render content, not a child.
Since: 6.13

Rhino.Render.RenderContent.Xml
Since: 6.0

Rhino.Render.RenderContent.OnAddUserInterfaceSections
Override to provide UI sections to display in the editor.

Rhino.Render.RenderContent.BeginChange(Rhino.Render.RenderContent.ChangeContexts)
Begins a change or batch of changes. It may also make a
copy of the content state allowing Rhino.Render.RenderContent.EndChange to send an
event with the old and new contents. Calls to this method are counted;
you must call EndChange() once for every call to BeginChange().
Note:
If Changed() was called between the calls to BeginChange() and
EndChange(), the last call to EndChange() may cause the ContentChanged
event to be sent.
changeContext:
the change context. If this is ChangeContexts.UI, ChangeContexts.Program,ChangeContexts.Drop or ChangeContexts.Tree,
the content will be copied. EndChange() will then send the copy as 'old' in the OnContentChanged event.
Rhino.Render.RenderContent.EndChange Rhino.Render.RenderContent.ContentChanged
Since: 6.0

Rhino.Render.RenderContent.EndChange
Ends a change or batch of changes. Calls to this method are counted;
you must call this method once for every call to Rhino.Render.RenderContent.BeginChange(Rhino.Render.RenderContent.ChangeContexts).
Note:
If Rhino.Render.RenderContent.BeginChange(Rhino.Render.RenderContent.ChangeContexts) was called with ChangeContexts.UI,
ChangeContexts.Program, ChangeContexts.Drop or ChangeContexts.UI.Tree
and Changed() was called between the calls to Rhino.Render.RenderContent.BeginChange(Rhino.Render.RenderContent.ChangeContexts) and
EndChange(), the last call to EndChange() will raise the Rhino.Render.RenderContent.ContentChanged event.
Since: 6.0

Rhino.Render.RenderContent.OnGetDefaultsInteractive
Override this method to prompt user for information necessary to
create a new content object.  For example, if you are created a
textured material you may prompt the user for a bitmap file name
prior to creating the textured material.
Returns:
If true is returned the content is created otherwise the creation
is aborted.

Rhino.Render.RenderContent.NewUiPointer(System.Guid,System.Guid,System.String,System.Boolean,System.Boolean,System.Object)
Create a new custom content user interface instance for this
RenderContext.
classId: The class Type Guid which was created.
UIId: The UI to add the new UI to.
caption: The expandable tab caption
createExpanded:
If this is true the tab will initially be expanded otherwise it will be
collapsed.
createVisible:
If this is true the tab will initially be visible otherwise it will be
hidden.
window: The user control to embed in the expandable tab.
Returns:
Returns the UserInterfaceSection object used to manage the new custom
UI.

Rhino.Render.RenderContent.AddUserInterfaceSection(System.Type,System.String,System.Boolean,System.Boolean)
Add a new .NET control to an content expandable tab section, the height
of the createExpanded tabs client area will be the initial height of the
specified control.
classType:
The control class to create and embed as a child window in the
expandable tab client area.  This class type must be derived from
IWin32Window or this method will throw an ArgumentException.  Implement
the IUserInterfaceSection interface in your classType to get
UserInterfaceSection notification.
caption: Expandable tab caption.
createExpanded:
If this value is true then the new expandable tab section will
initially be expanded, if it is false it will be collapsed.
createVisible:
If this value is true then the new expandable tab section will
initially be visible, if it is false it will be hidden.
Returns:
Returns the UserInterfaceSection object used to manage the new
user control object.
Since: 5.1
6.0

Rhino.Render.RenderContent.AddAutomaticUserInterfaceSection(System.String,System.Int32)
Add a new automatic user interface section, Field values which include
prompts will be automatically added to this section.
caption: Expandable tab caption.
id: Tab id which may be used later on to reference this tab.
Returns:
Returns true if the automatic tab section was added otherwise; returns
false on error.
Since: 5.1

Rhino.Render.RenderContent.AddUserInterfaceSection(Rhino.UI.Controls.ICollapsibleSection)
Since: 6.0

Rhino.Render.RenderContent.GetUiHash
This allows a content to have more than one UI for the same content type.
Returns:
Default is zero and is ignored.
Since: 7.1

Rhino.Render.RenderContent.Factory
Since: 6.10

Rhino.Render.RenderContent.GetUnderlyingInstances(Rhino.Render.RenderContentCollection@)
Since: 7.0
DO NOT CALL THIS FUNCTION IN NEW CODE. IT WILL BE DEPRECATED ASAP.

Rhino.Render.RenderContent.IsContentTypeAcceptableAsChild(System.Guid,System.String)
Since: 6.0

Rhino.Render.RenderContent.IsFactoryProductAcceptableAsChild(Rhino.Render.DataSources.ContentFactory,System.String)
Since: 6.1

Rhino.Render.RenderContent.ConvertUnits(Rhino.UnitSystem,Rhino.UnitSystem)
Modify your content so that it is converted from meters into the units of the unit system.
No need to call the base class when you override this, and no need to recurse into children.
Since: 7.0

Rhino.Render.RenderContent.GetParameter(System.String)
Query the content instance for the value of a given named parameter.
If you do not support this parameter, call the base class.
parameterName: Name of the parameter
Returns: IConvertible. Note that you can't directly cast from object, instead you have to use the Convert mechanism.
Since: 5.7

Rhino.Render.RenderContent.SetParameter(System.String,System.Object,Rhino.Render.RenderContent.ChangeContexts)
Set the named parameter value for this content instance.
If you do not support this parameter, call the base class.
parameterName:
value:
changeContext:
Returns:
Since: 5.7
6.0

Rhino.Render.RenderContent.SetParameter(System.String,System.Object)
Set the named parameter value for this content instance.
If you do not support this parameter, call the base class.
parameterName:
value:
Returns:
Since: 6.0

Rhino.Render.RenderContent.IsLocked
Set this property to true prior to adding content to the document to
lock the content browser editing UI methods.  Setting this to true will
keep the browser from allowing things like deleting, renaming or
changing content.  This is useful for custom child content that you
want to be editable but persistent.  Setting this after adding content
to the document will cause an exception to be thrown.
Throws System.Exception:
IsLocked must be called prior to adding content to the document
Since: 5.12

Rhino.Render.RenderContent.GetChildSlotParameter(System.String,System.String)
Extra requirements are a way of specifying extra functionality on parameters in the automatic UI.
Override this function to specify additional functionality for automatic UI sections or the texture summary.
See IAutoUIExtraRequirements.h in the C++ RDK SDK for string definitions for the parameter names.
Call the base class from your override if you do not support the extra requirement parameter.
Please do not call this function. It is only retained for backward compatibility. You should instead
call GetExtraRequirementParameter().
contentParameterName: The parameter or field internal name to which this query applies.
extraRequirementParameter: The extra requirement parameter, as listed in IAutoUIExtraRequirements.h in the C++ RDK SDK.
Returns:
The value of the requested extra requirement parameter or null if the parameter does not exist.
Current supported return values are (int, bool, float, double, string, Guid, Color, Vector3d, Point3d, DateTime).
Since: 5.7

Rhino.Render.RenderContent.GetExtraRequirementParameter(System.String,System.String)
Extra requirements are a way of specifying extra functionality on parameters in the automatic UI.
See IAutoUIExtraRequirements.h in the C++ RDK SDK for string definitions for the parameter names.
contentParameterName: The parameter or field internal name to which this query applies.
extraRequirementParameter: The extra requirement parameter, as listed in IAutoUIExtraRequirements.h in the C++ RDK SDK.
Returns:
The value of the requested extra requirement parameter or null if the parameter does not exist.
Current supported return values are (int, bool, float, double, string, Guid, Color, Vector3d, Point3d, DateTime).
Since: 7.9

Rhino.Render.RenderContent.SetChildSlotParameter(System.String,System.String,System.Object,Rhino.Render.RenderContent.ExtraRequirementsSetContexts)
Extra requirements are a way of specifying extra functionality on parameters in the automatic UI.
Override this function to support values being set from automatic UI sections or the texture summary.
See IAutoUIExtraRequirements.h in the C++ RDK SDK for string definitions for the parameter names.
Call the base class from your override if you do not support the extra requirement parameter.
Please do not call this function. It is only retained for backward compatibility. You should instead
call SetExtraRequirementParameter().
contentParameterName: The parameter or field internal name to which this query applies.
extraRequirementParameter: The extra requirement parameter, as listed in IAutoUIExtraRequirements.h in the C++ RDK SDK.
value: The value to set this extra requirement parameter. You will typically use System.Convert to convert the value to the type you need.
sc: The context of this operation.
Returns: true if successful, else false.
Since: 5.7

Rhino.Render.RenderContent.SetExtraRequirementParameter(System.String,System.String,System.Object,Rhino.Render.RenderContent.ExtraRequirementsSetContexts)
Extra requirements are a way of specifying extra functionality on parameters in the automatic UI.
See IAutoUIExtraRequirements.h in the C++ RDK SDK for string definitions for the parameter names.
contentParameterName: The parameter or field internal name to which this query applies.
extraRequirementParameter: The extra requirement parameter, as listed in IAutoUIExtraRequirements.h in the C++ RDK SDK.
value: The value to set this extra requirement parameter. You will typically use System.Convert to convert the value to the type you need.
sc: The context of this operation.
Returns: true if successful, else false.
Since: 7.9

Rhino.Render.RenderContent.ChildSlotOn(System.String)
Gets the on-ness property for the texture in the specified child slot.
childSlotName: The child slot name of the texture.
Returns: true if successful, else false.
Since: 5.7

Rhino.Render.RenderContent.SetChildSlotOn(System.String,System.Boolean,Rhino.Render.RenderContent.ChangeContexts)
Sets the on-ness property for the texture in the specified child slot.
childSlotName: The child slot name of the texture.
bOn: Value for the on-ness property.
cc: Context of the change
Since: 5.7

Rhino.Render.RenderContent.ChildSlotAmount(System.String)
Gets the amount property for the texture in the specified child slot.
childSlotName: The child slot name of the texture.
Returns: The requested amount value. Values are typically from 0.0 to 100.0
Since: 5.7

Rhino.Render.RenderContent.SetChildSlotAmount(System.String,System.Double,Rhino.Render.RenderContent.ChangeContexts)
Sets the amount property for the texture in the specified child slot.
childSlotName: The child slot name of the texture.
amount: The texture amount. Values are typically from 0.0 to 100.0
cc: The context of the change.
Since: 5.7

Rhino.Render.RenderContent.NewPreviewSceneServer(Rhino.Render.SceneServerData)
Gets the PreviewSceneServer of the content
ssd: SceneServerData
Returns the contents PreviewSceneServer
Since: 6.0

Rhino.Render.RenderContent.MatchData(Rhino.Render.RenderContent)
Implement to transfer data from another content to this content during creation.
oldContent: An old content object from which the implementation may harvest data.
Returns: Information about how much data was matched.
Since: 6.0

Rhino.Render.RenderContent.GetShader(System.Guid,System.IntPtr)
See C++ RDK documentation - this is a pass through function that gives access to your own
native shader.  .NET clients will more likely simply check the type of their content and call their own
shader access functions
If you overide this function, you must ensure that you call "IsCompatible" and return IntPtr.Zero is that returns false.
renderEngineId: The render engine requesting the shader.
privateData: A pointer to the render engine's own context object.
Returns: A pointer to the unmanaged shader.

Rhino.Render.RenderContent.IsCompatible(System.Guid)
Since: 6.0

Rhino.Render.RenderContent.ChildSlotNameFromParamName(System.String)
A "child slot" is the specific "slot" that a child (usually a texture) occupies.
This is generally the "use" of the child - in other words, the thing the child
operates on.  Some examples are "color", "transparency".
paramName: The name of a parameter field. Since child textures will usually correspond with some
parameter (they generally either replace or modify a parameter over UV space) these functions are used to
specify which parameter corresponded with child slot.  If there is no correspondence, return the empty
string.
Returns:
The default behavior for these functions is to return the input string.
Sub-classes may (in the future) override these functions to provide different mappings.
Since: 5.1

Rhino.Render.RenderContent.ParamNameFromChildSlotName(System.String)
A "child slot" is the specific "slot" that a child (usually a texture) occupies.
This is generally the "use" of the child - in other words, the thing the child
operates on.  Some examples are "color", "transparency".
childSlotName: The named of the child slot to receive the parameter name for.
Returns: The default behavior for these functions is to return the input string.  Sub-classes may (in the future) override these functions to provide different mappings.
Since: 5.1

Rhino.Render.RenderContent.BeginCreateDynamicFields(System.Boolean)
Automatic Dynamic Field support.
Dynamic fields are typically created in the constructor of RenderContent and they are therefore created
automatically whenever the content is created. However, some advanced users require the fields to be created in response
to some user action which occurs much later. This creates the problem that the fields do not exist
by default and therefore cannot be loaded when the document is loaded. These methods are provided to solve that
problem by making it possible to automatically create the dynamic fields on loading if they don't already exist.
Dynamic fields that have this auto-create-on-load behavior are referred to as automatic dynamic fields.
Dynamic fields that do not require the advanced automatic feature can still be created by using
these methods (recommended), or they can be created manually (legacy usage).
You must call this before creating any dynamic fields. Calls to this method are counted; you must call
EndCreateDynamicFields() once for every call to BeginCreateDynamicFields().
automatic:  automatic specifies if the dynamic fields are automatic. If so, they will be created automatically
during loading of the document.
Since: 7.1

Rhino.Render.RenderContent.CreateDynamicField(System.String,System.String,System.String,System.Object,System.Object,System.Object,System.Int32)
Create a dynamic field with an initial value and min and max limits.
internalName:  is the internal name of the field. Not localized.
localName:  is the localized user-friendly name of the field.
englishName:  is the English user-friendly name of the field.
value:  is the initial value of the field.
minValue:  is the minimum value of the field. Must be the same type as vValue.
maxValue:  is the maximum value of the field. Must be the same type as vValue.
sectionId:  is used for filtering fields between sections. Zero if not needed.
Since: 7.1

Rhino.Render.RenderContent.EndCreateDynamicFields
You must call this after creating dynamic fields. Calls to this method are counted; you must call
BeginCreateDynamicFields() once for every call to EndCreateDynamicFields().
Since: 7.1

Rhino.Render.RenderContent.FindChild(System.String)
Since: 5.1

Rhino.Render.RenderContent.SetChild(Rhino.Render.RenderContent,System.String)
Set another content as a child of this content. This content may or may
not be attached to a document.  If this content already has a child
with the specified child slot name, that child will be deleted.  If
this content is not attached to a document, the child will be added
without sending any events.  If this content is attached to a document,
the necessary events will be sent to update the UI.
Note:
Do not call this method to add children in your constructor. If you want to
add default children, you should override Initialize() and add them there.
renderContent:
Child content to add to this content.
If renderContent is null, the function will fail.
If renderContent is already attached to a document, the function will fail.
If renderContent is already a child of this or another content, the function will fail.
childSlotName:
The name that will be assigned to this child slot. The child slot name
cannot be an empty string. If it is, the function will fail.
Returns:
Returns true if the content was added or the child slot with this name was modified,
otherwise returns false.
Since: 6.0

Rhino.Render.RenderContent.SetChild(Rhino.Render.RenderContent,System.String,Rhino.Render.RenderContent.ChangeContexts)
Set another content as a child of this content. This content may or may
not be attached to a document.  If this content already has a child
with the specified child slot name, that child will be deleted.  If
this content is not attached to a document, the child will be added
without sending any events.  If this content is attached to a document,
the necessary events will be sent to update the UI.
Note:
Do not call this method to add children in your constructor. If you
want to add default children, you should override Initialize() and add
them there.
renderContent:
Child content to add to this content. If pChild is NULL, the function
will fail.  If pChild is already attached to a document, the function
will fail.  If pChild is already a child of this or another content,
the function will fail.
childSlotName:
The name that will be assigned to this child slot. The child slot name
cannot be an empty string. If it is, the function will fail.
changeContexts:
Returns:
Returns true if the content was added or the child slot with this name
was modified otherwise; returns false.
Since: 5.10
6.0

Rhino.Render.RenderContent.AddChild(Rhino.Render.RenderContent)
Since: 5.6
6.0

Rhino.Render.RenderContent.AddChild(Rhino.Render.RenderContent,System.String)
Since: 6.0
6.0

Rhino.Render.RenderContent.DeleteChild(System.String,Rhino.Render.RenderContent.ChangeContexts)
Since: 5.10

Rhino.Render.RenderContent.DeleteAllChildren(Rhino.Render.RenderContent.ChangeContexts)
Since: 5.10

Rhino.Render.RenderContent.ChangeChild(Rhino.Render.RenderContent,Rhino.Render.RenderContent)
Since: 5.6
6.0

Rhino.Render.RenderContent.ChildSlotName
Since: 5.1

Rhino.Render.RenderContent.GetEmbeddedFilesList
Since: 6.0

Rhino.Render.RenderContent.Initialize
Since: 6.1
7.2

Rhino.Render.RenderContent.Uninitialize
Since: 6.1
7.2

Rhino.Render.RenderContent.Replace(Rhino.Render.RenderContent)
Since: 6.13

Rhino.Render.RenderContent.NewRenderContent(System.Guid,System.Type)
Create content from type Id, called by the NewRenderContentCallbackEvent
methods to create a .NET object pointer of a specific type from a class
type Guid.
typeId: The class GUID property to look up
isSubclassOf: The created content must be this type
Returns: Valid content object if the typeId is found otherwise null.

Rhino.Render.RenderContent.IsFactoryProductAcceptableAsChild(System.Guid,System.String,System.String)
Override this method to restrict the type of acceptable child content.
The default implementation of this method returns true if the factory kind is 'texture'.
kindId:
factoryKind:
childSlotName:
Returns:
Return true only if content with the specified kindId can be accepted as a child in the specified child slot.
Since: 5.11

Rhino.Render.RenderContent.FilesToEmbed
A string array of full paths to files used by the content that may be
embedded in .3dm files and library files (.rmtl, .renv, .rtex). The
default implementation returns an empty string list. Override this to
return the file name or file names used by your content. This is
typically used by textures that reference files containing the texture
imagery.
Since: 5.12

Rhino.Render.RenderContent.Filename
If the content is file based, this function can be overridden to deal with setting/getting the
filename.  Corresponds to IRhRdkFileBasedContent in the C++ SDK
Since: 7.4

Rhino.Render.RenderContent.VirtualIcon(System.Drawing.Size,System.Drawing.Bitmap@)
Icon to display in the content browser, this bitmap needs to be valid for
the life of this content object, the content object that returns the bitmap
is responsible for disposing of the bitmap.
size:
Requested icon size
bitmap:
Returns:
Return Icon to display in the content browser.
Since: 6.0

Rhino.Render.RenderContent.Icon(System.Drawing.Size,System.Drawing.Bitmap@)
Since: 6.0

Rhino.Render.RenderContent.DynamicIcon(System.Drawing.Size,System.Drawing.Bitmap@,Rhino.Render.DynamicIconUsage)
Since: 6.0

Rhino.Render.RenderContent.Styles
Since: 7.5

Rhino.Render.RenderContent.ModifyRenderContentStyles(Rhino.Render.RenderContentStyles,Rhino.Render.RenderContentStyles)
ModifyRenderContentStyles
stylesToAdd:
stylesToRemove:

Rhino.Render.RenderContent.ContentAdded
Used to monitor render content addition to the document.
Since: 5.7

Rhino.Render.RenderContent.ContentRenamed
Used to monitor render content renaming in the document.
Since: 5.7

Rhino.Render.RenderContent.ContentDeleting
Used to monitor render content deletion from the document.
Since: 5.7

Rhino.Render.RenderContent.ContentDeleted
Used to monitor render content deletion from the document.
Since: 6.0

Rhino.Render.RenderContent.ContentReplacing
Used to monitor render content replacing in the document.
Since: 5.7

Rhino.Render.RenderContent.ContentReplaced
Used to monitor render content replacing in the document.
Since: 5.7

Rhino.Render.RenderContent.ContentChanged
Used to monitor render content modifications.
Since: 5.7

Rhino.Render.RenderContent.PreviewRendered
This event is raised when a preview has been rendered

Rhino.Render.RenderContent.ContentFieldChanged
This event is raised when a field value is modified.
Since: 5.11

Rhino.Render.RenderContent.ContentUpdatePreview
Used to monitor render content preview updates.
Since: 5.7

Rhino.Render.RenderContent.CurrentEnvironmentChanged
Event fired when changes to current environments have been made.
This will be one of Background, Reflection or Skylighting
Since 6.11
Since: 6.11

Rhino.Render.RenderContent.Finalize
Finalizer

Rhino.Render.RenderContent.Dispose
Since: 5.1

Rhino.Render.RenderContent.Dispose(System.Boolean)
Dispose
disposing: