Rhino.DocumentEventArgs
Provides document information for RhinoDoc events.

Rhino.DocumentEventArgs.DocumentId
Gets the document Id of the document for this event.
Since: 5.0

Rhino.DocumentEventArgs.DocumentSerialNumber
Gets the uniques document serial number for this event
Since: 6.0

Rhino.DocumentEventArgs.Document
Gets the document for this event. This field might be null.
Since: 5.0