Rhino.Runtime.ViewCaptureWriter
Callback system used by SVG and PDF exporter to generate documents. Not intended
for general SDK usage

Rhino.Runtime.ViewCaptureWriter.#ctor(System.Double,System.Drawing.Size)
Since: 6.0

Rhino.Runtime.ViewCaptureWriter.Draw(System.IntPtr,Rhino.RhinoDoc)
Since: 6.15