Rhino.DocObjects.DimensionStyle.LeaderContentAngleStyle
Angle for text or other leader or dimension content

Rhino.DocObjects.DimensionStyle.LeaderContentAngleStyle.Horizontal
Annotation text is horizontal in annotation object's plane

Rhino.DocObjects.DimensionStyle.LeaderContentAngleStyle.Aligned
Aligned with last leader direction or dimension line

Rhino.DocObjects.DimensionStyle.LeaderContentAngleStyle.Rotated
Explicit angle