Rhino.UI.Controls.ICollapsibleSectionHolder.Add(Rhino.UI.Controls.ICollapsibleSection)
Since: 6.0

Rhino.UI.Controls.ICollapsibleSectionHolder.Remove(Rhino.UI.Controls.ICollapsibleSection)
Since: 6.0

Rhino.UI.Controls.ICollapsibleSectionHolder.Sections
Since: 6.0

Rhino.UI.Controls.ICollapsibleSectionHolder.SectionCount
Since: 6.0

Rhino.UI.Controls.ICollapsibleSectionHolder.SectionAt(System.Int32)
Since: 6.0

Rhino.UI.Controls.ICollapsibleSectionHolder.IsSectionExpanded(Rhino.UI.Controls.ICollapsibleSection)
Since: 6.0

Rhino.UI.Controls.ICollapsibleSectionHolder.ExpandSection(Rhino.UI.Controls.ICollapsibleSection,System.Boolean,System.Boolean)
Since: 6.0

Rhino.UI.Controls.ICollapsibleSectionHolder.BackgroundColor
Since: 6.0

Rhino.UI.Controls.ICollapsibleSectionHolder.EmptyText
Since: 6.0

Rhino.UI.Controls.ICollapsibleSectionHolder.UpdateAllViews(System.Int32)
Since: 6.0

Rhino.UI.Controls.ICollapsibleSectionHolder.TopMargin
Since: 6.0

Rhino.UI.Controls.ICollapsibleSectionHolder.BottomMargin
Since: 6.0

Rhino.UI.Controls.ICollapsibleSectionHolder.LeftMargin
Since: 6.0

Rhino.UI.Controls.ICollapsibleSectionHolder.RightMargin
Since: 6.0

Rhino.UI.Controls.ICollapsibleSectionHolder.ScrollPosition
Since: 6.0

Rhino.UI.Controls.ICollapsibleSectionHolder.SettingsPathSubKey
Since: 6.0