Rhino.ApplicationSettings.HistorySettings
Provides static (Shared in Vb.Net) properties to modify Rhino History settings.

Rhino.ApplicationSettings.HistorySettings.RecordingEnabled
When history recording is enabled, new objects keep a record of how they
were constructed so that they can be updated if an input object changes.
Since: 5.0

Rhino.ApplicationSettings.HistorySettings.RecordNextCommand
Enable history recording until the end of the next command
Since: 5.0

Rhino.ApplicationSettings.HistorySettings.UpdateEnabled
When history update is enabled, dependent objects are automatically updated
when an antecedent is modified.
Since: 5.0

Rhino.ApplicationSettings.HistorySettings.ObjectLockingEnabled
When history object locking is enabled, objects with history on them act as if
they were locked and the only way to modify these objects is to edit their inputs.
Since: 5.0

Rhino.ApplicationSettings.HistorySettings.BrokenRecordWarningEnabled
Displays a warning dialog when an action is taken that breaks the link between the output and input objects.
Since: 6.10