Rhino.LinkedInstanceDefinitionUpdateStyle
Linked and linked and embedded instance definition update style.
Since: 8.29

Rhino.LinkedInstanceDefinitionUpdateStyle.Prompt
Ask the user if the linked and linked and embedded instance definitions should be updated.
Since: 8.29

Rhino.LinkedInstanceDefinitionUpdateStyle.AlwaysUpdate
Always update linked and linked and embedded instance definitions.
Since: 8.29

Rhino.LinkedInstanceDefinitionUpdateStyle.NeverUpdate
Never update linked and linked and embedded instance definitions.
Since: 8.29