Rhino.Geometry.RefitTrimKnotMode
The mode for adding kinots to the surface for fitting

Rhino.Geometry.RefitTrimKnotMode.None
No knots are added

Rhino.Geometry.RefitTrimKnotMode.UniformEntireSurface
The entire surface is fit using uniform spacing with the specified number of knots

Rhino.Geometry.RefitTrimKnotMode.UniformPerSpan
Each existing span is uniformly spaced with the specified number of knots

Rhino.Geometry.RefitTrimKnotMode.Custom
The provided knot vector will be used