Rhino.Runtime.RhinoAccounts.RhinoAccountsServerException
Exception thrown when the Rhino Accounts server returned an unsuccessful HTTP response with a code of 400 or greater.

Rhino.Runtime.RhinoAccounts.RhinoAccountsServerException.#ctor(System.String,System.Exception)
Generates a new instance of the exception.
message: The message of the exception.
innerException: The inner exception.
Since: 7.0

Rhino.Runtime.RhinoAccounts.RhinoAccountsServerException.#ctor(System.Exception)
Generates a new instance of the exception.
innerException: The inner exception.
Since: 7.0