Rhino.DocObjects.SectionStyle
SectionStyle helps define the attributes to use when drawing a section

Rhino.DocObjects.SectionStyle.#ctor
Create a new instance of a SectionStyle
Since: 8.0

Rhino.DocObjects.SectionStyle.#ctor(Rhino.DocObjects.SectionStyle)
Create a new SetionStyle that is a copy of another SectionStyle
Since: 8.0

Rhino.DocObjects.SectionStyle.ComponentType
Returns Rhino.DocObjects.ModelComponentType.SectionStyle.
Since: 8.0

Rhino.DocObjects.SectionStyle.BackgroundFillMode
How the background should be filled
Since: 8.0

Rhino.DocObjects.SectionStyle.BackgroundFillColor
Fill color to apply to the background. Default is Color.Empty which means
get the color from the source where this section style came from (object
attributes or layer)
Since: 8.0

Rhino.DocObjects.SectionStyle.BackgroundFillPrintColor
Fill print color to apply to the background. Default is Color.Empty which
means get the color from the source where this section style came from
(object attributes or layer)
Since: 8.0

Rhino.DocObjects.SectionStyle.BoundaryVisible
Should the boundary for this section be displayed
Since: 8.0

Rhino.DocObjects.SectionStyle.BoundaryWidthScale
Scale applied to the boundary wire thickness
Since: 8.0

Rhino.DocObjects.SectionStyle.BoundaryColor
Color to apply for the boundary curves. Default is Color.Empty which means
get the color from the source where this section style came from (object
attributes or layer)
Since: 8.0

Rhino.DocObjects.SectionStyle.BoundaryPrintColor
Print color to apply for the boundary curves. Default is Color.Empty which
means get the color from the source where this section style came from
(object attributes or layer)
Since: 8.0

Rhino.DocObjects.SectionStyle.SectionFillRule
Rule to determine when to generate a hatch pattern and fill
Since: 8.0

Rhino.DocObjects.SectionStyle.HatchIndex
Hatch pattern to use when drawing a fill pattern
Since: 8.0

Rhino.DocObjects.SectionStyle.HatchScale
Scale to apply to the hatch pattern
Since: 8.0

Rhino.DocObjects.SectionStyle.HatchRotationRadians
Rotation to apply to the hatch patterh
Since: 8.0

Rhino.DocObjects.SectionStyle.HatchPatternColor
Color to apply for the hatch pattern. Default is Color.Empty which means
get the color from the source where this section style came from (object
attributes or layer)
Since: 8.0

Rhino.DocObjects.SectionStyle.HatchPatternPrintColor
Print color to apply for the hatch pattern. Default is Color.Empty which
means get the color from the source where this section style came from
(object attributes or layer)
Since: 8.0

Rhino.DocObjects.SectionStyle.GetBoundaryLinetype
Get an optional custom linetype associated with this section style. If null,
then the linetype will come from the parent attributes or layer
Since: 8.0

Rhino.DocObjects.SectionStyle.SetBoundaryLinetype(Rhino.DocObjects.Linetype)
Since: 8.0

Rhino.DocObjects.SectionStyle.RemoveBoundaryLinetype
Since: 8.0