Rhino.DocObjects.EarthCoordinateSystem
ON::EarthCoordinateSystem identifies the standard used to define Earth latitude, longitude, and elevation coordinates.

Rhino.DocObjects.EarthCoordinateSystem.Unset
ON::EarthCoordinateSystem::Unset

Rhino.DocObjects.EarthCoordinateSystem.GroundLevel
ON::EarthCoordinateSystem::GroundLevel Not well defined, but latitude and longitude will be good enough for architecture sun studies.

Rhino.DocObjects.EarthCoordinateSystem.MeanSeaLevel
Ground level - coordinates vary with time and location
ON::EarthCoordinateSystem::MeanSeaLevel Not well defined, but latitude and longitude will be good enough for architecture sun studies.

Rhino.DocObjects.EarthCoordinateSystem.CenterOfEarth
ON::EarthCoordinateSystem::CenterOfEarth Not well defined. The Earth's center of mass and center of volume are at different locations.

Rhino.DocObjects.EarthCoordinateSystem.WGS1984
ON::EarthCoordinateSystem::WGS1984 World Geodetic System 1984 standard. (Current GPS standard.)

Rhino.DocObjects.EarthCoordinateSystem.EGM2008
ON::EarthCoordinateSystem::EGM2008 Earth Gravitational Model 2008 standard.