Rhino.Input.Custom.GetEllipse
Class provides user interface to define an ellipse.

Rhino.Input.Custom.GetEllipse.ConstPointer
Gets the constant (immutable) pointer.
Returns: The constant pointer.

Rhino.Input.Custom.GetEllipse.NonConstPointer
Gets the non-constant pointer (for modification).
Returns: The non-constant pointer.

Rhino.Input.Custom.GetEllipse.Finalize
Passively releases the unmanaged object.

Rhino.Input.Custom.GetEllipse.Dispose
Actively releases the unmanaged object.
Since: 8.0

Rhino.Input.Custom.GetEllipse.Dispose(System.Boolean)
Releases the unmanaged object.

Rhino.Input.Custom.GetEllipse.#ctor
Constructs a GetEllispe object.
Since: 8.0

Rhino.Input.Custom.GetEllipse.MarkFoci
Indicates the user wants the ellipse foci marked with point objects.
Since: 8.0

Rhino.Input.Custom.GetEllipse.IsModeFromFoci
Indicates the ellipse was created from foci.
Since: 8.0

Rhino.Input.Custom.GetEllipse.FirstPoint
Returns the first point. If in "from foci" mode, then this is the first foci point.
Since: 8.0

Rhino.Input.Custom.GetEllipse.SecondPoint
Returns the second point. If in "from foci" mode, then this is the second foci point.
Since: 8.0

Rhino.Input.Custom.GetEllipse.Get(Rhino.Geometry.NurbsCurve@)
Prompt for the getting of an ellipse.
ellipse: The ellipse in NURB form.
Returns: The result of the get operation.
Since: 8.0