Rhino.Render.RenderChannels.Modes
Mode.

Rhino.Render.RenderChannels.Modes.Automatic
Render-channels are managed automatically

Rhino.Render.RenderChannels.Modes.Custom
Render-channels are specified by the user