Rhino.ApplicationSettings.CurvatureAnalysisSettings
Contains static methods and properties to modify curvature analysis-related commands.

Rhino.ApplicationSettings.CurvatureAnalysisSettings.GetDefaultState
Gets the factory settings of the application.
Since: 6.0

Rhino.ApplicationSettings.CurvatureAnalysisSettings.GetCurrentState
Gets the current settings of the application.
Since: 6.0

Rhino.ApplicationSettings.CurvatureAnalysisSettings.RestoreDefaults
Commits the default settings as the current settings.
Since: 6.0

Rhino.ApplicationSettings.CurvatureAnalysisSettings.UpdateFromState(Rhino.ApplicationSettings.CurvatureAnalysisSettingsState)
Sets all settings to a particular defined joined state.
state: The particular state.
Since: 6.0

Rhino.ApplicationSettings.CurvatureAnalysisSettings.GaussRange
Gets or sets the Gaussian curvature range.
Since: 6.0

Rhino.ApplicationSettings.CurvatureAnalysisSettings.MeanRange
Gets or sets the Mean curvature range.
Since: 6.0

Rhino.ApplicationSettings.CurvatureAnalysisSettings.MinRadiusRange
Gets or sets the Minimum Radius curvature range.
Since: 6.0

Rhino.ApplicationSettings.CurvatureAnalysisSettings.MaxRadiusRange
Gets or sets the Maximum Radius curvature range.
Since: 6.0

Rhino.ApplicationSettings.CurvatureAnalysisSettings.Style
Gets or sets the curvature analysis style.
Since: 6.0

Rhino.ApplicationSettings.CurvatureAnalysisSettings.CalculateCurvatureAutoRange(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.ApplicationSettings.CurvatureAnalysisSettingsState@)
meshes:
settings:
Returns:
Since: 6.0