Rhino.Runtime.RhinoAccounts.RhinoAccountsInvalidTokenException
Exception thrown when the token returned by Rhino Accounts is not valid.

Rhino.Runtime.RhinoAccounts.RhinoAccountsInvalidTokenException.#ctor(System.String,System.Exception)
Generates a new instance of the exception.
message: The message of the exception.
innerException: The inner exception.
Since: 7.0

Rhino.Runtime.RhinoAccounts.RhinoAccountsInvalidTokenException.#ctor(System.Exception)
Generates a new instance of the exception.
innerException: The inner exception.
Since: 7.0