Rhino.Collections.CurveList
Represents a list of curves.

Rhino.Collections.CurveList.#ctor
Initializes a new empty list of curves.
Since: 5.0

Rhino.Collections.CurveList.#ctor(System.Int32)
Initializes a new empty list of curves with a predefined capacity.
This is the amount of items the list will accept before resizing.
Since: 5.0

Rhino.Collections.CurveList.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})
Initializes a new list that is filled with all items of the input enumerable.
Input items are not explicitly duplicated (this is a shallow copy).
collection: A list, an array or any enumerable set of Rhino.Geometry.Curve.
Since: 5.0

Rhino.Collections.CurveList.Add(Rhino.Geometry.Line)
Adds a line to this list.
line: A line value that will be the model of the new internal curve.
Since: 5.0

Rhino.Collections.CurveList.Add(Rhino.Geometry.Circle)
Adds a circle to this list.
circle: A circle value that will be the model of the new internal curve.
Since: 5.0

Rhino.Collections.CurveList.Add(Rhino.Geometry.Arc)
Adds an arc to this list.
arc: An arc value that will be the model of the new internal curve.
Since: 5.0

Rhino.Collections.CurveList.Add(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Adds a polyline to this list.
polyline: A polyline value that will be copied in a new polyline.
This argument can be null, an array, a list or any enumerable set of Rhino.Geometry.Point3d.
Since: 5.0

Rhino.Collections.CurveList.Add(Rhino.Geometry.Ellipse)
Adds an ellipse to this list.
ellipse: An ellipse that will be the model of the new internal curve.
Since: 5.0

Rhino.Collections.CurveList.Insert(System.Int32,Rhino.Geometry.Line)
Inserts a line at a given index of this list.
index: A 0-based position in the list.
line: The line value from which to construct the new curve.
Since: 5.0

Rhino.Collections.CurveList.Insert(System.Int32,Rhino.Geometry.Circle)
Inserts a line at a given index of this list.
index: A 0-based position in the list.
circle: The circle value from which to construct the new curve.
Since: 5.0

Rhino.Collections.CurveList.Insert(System.Int32,Rhino.Geometry.Arc)
Inserts an arc at a given index of this list.
index: A 0-based position in the list.
arc: The arc value from which to construct the new curve.
Since: 5.0

Rhino.Collections.CurveList.Insert(System.Int32,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Inserts a polyline at a given index of this list.
index: A 0-based position in the list.
polyline: The polyline enumerable from which to construct a copy curve.
This argument can be null, an array, a list or any enumerable set of
Rhino.Geometry.Point3d.
Since: 5.0

Rhino.Collections.CurveList.Insert(System.Int32,Rhino.Geometry.Ellipse)
Inserts an ellipse at a given index of this list.
index: A 0-based position in the list.
ellipse: The ellipse value from which to construct the new curve.
Since: 5.0

Rhino.Collections.CurveList.Transform(Rhino.Geometry.Transform)
Transform all the curves in this list. If at least a single transform failed
this function returns false.
xform: Transformation to apply to all curves.
Since: 5.0