Rhino.Display.VisualAnalysisMode
Represents a base class for visual analysis modes.
This class is abstract.

Rhino.Display.VisualAnalysisMode.RhinoEdgeAnalysisModeId
Id for Rhino's built-in edge analysis mode. Brep and mesh edges are
shown in a selected color.
Since: 5.0

Rhino.Display.VisualAnalysisMode.RhinoCurvatureGraphAnalysisModeId
Id for Rhino's built-in curvature graphs analysis mode. Curvature hair
is shown on curves and surfaces.
Since: 5.0

Rhino.Display.VisualAnalysisMode.RhinoZebraStripeAnalysisModeId
Id for Rhino's built-in zebra stripe analysis mode. Zebra stripes are
shown on surfaces and meshes.
Since: 5.0

Rhino.Display.VisualAnalysisMode.RhinoEmapAnalysisModeId
Id for Rhino's built-in emap analysis mode.  An environment map is
shown on surfaces and meshes.
Since: 5.0

Rhino.Display.VisualAnalysisMode.RhinoCurvatureColorAnalyisModeId
Id for Rhino's built-in curvature color analysis mode.  Surface curvature
is shown using false color mapping.
Since: 5.0

Rhino.Display.VisualAnalysisMode.RhinoDraftAngleAnalysisModeId
Id for Rhino's built-in draft angle analysis mode.  Draft angle is
displayed using false colors.
Since: 5.0

Rhino.Display.VisualAnalysisMode.RhinoThicknessAnalysisModeId
Id for Rhino's built-in thickness analysis mode.
Since: 5.0

Rhino.Display.VisualAnalysisMode.RhinoEdgeContinuityAlalysisModeId
Id for Rhino's built-in edge continuity analysis mode.
Since: 7.0

Rhino.Display.VisualAnalysisMode.AdjustAnalysisMeshes(Rhino.RhinoDoc,System.Guid)
Interactively adjusts surface analysis meshes of objects using a Rhino built-in analysis mode.
doc: The Rhino document.
analysisModeId: The id of the analysis mode.
Returns: true if successful, false otherwise.
Since: 7.0

Rhino.Display.VisualAnalysisMode.Register(System.Type)
Registers a custom visual analysis mode for use in Rhino.  It is OK to call
register multiple times for a single custom analysis mode type, since subsequent
register calls will notice that the type has already been registered.
customAnalysisModeType:
Must be a type that is a subclass of VisualAnalysisMode.
Returns:
An instance of registered analysis mode on success.
Since: 5.0

Rhino.Display.VisualAnalysisMode.Find(System.Guid)
Finds a visual analysis mode by guid.
id: The globally unique identifier to search for.
Returns: The found visual analysis mode, or null if it was not found, or on error.
Since: 5.0

Rhino.Display.VisualAnalysisMode.Find(System.Type)
Finds a visual analysis mode by type.
t: A visual analysis mode type.
Returns: A visual analysis mode on success, or null on error.
Since: 5.0

Rhino.Display.VisualAnalysisMode.Name
Gets the name of the analysis mode. It is used by the _What command and the object
properties details window to describe the object.
Since: 5.0

Rhino.Display.VisualAnalysisMode.Style
Gets the visual analysis mode style.
Since: 5.0

Rhino.Display.VisualAnalysisMode.Id
Gets the visual analysis mode GUID.
The Guid is specified with the GuidAttribute
applied to the class.
Since: 5.0

Rhino.Display.VisualAnalysisMode.EnableUserInterface(System.Boolean)
Turns the analysis mode's user interface on and off. For Rhino's built
in modes this opens or closes the modeless dialog that controls the
analysis mode's display settings.
on: true if the interface should be shown; false if it should be concealed.
Since: 5.0

Rhino.Display.VisualAnalysisMode.ObjectSupportsAnalysisMode(Rhino.DocObjects.RhinoObject)
Gets a value indicating if this visual analysis mode can be used on a given Rhino object.
obj: The object to be tested.
Returns: true if this mode can indeed be used on the object; otherwise false.
Since: 5.0

Rhino.Display.VisualAnalysisMode.ShowIsoCurves
Gets true if this visual analysis mode will show isocuves on shaded surface
objects.  Often a mode's user interface will provide a way to change this
setting.
The default is false.
Since: 5.0

Rhino.Display.VisualAnalysisMode.SetUpDisplayAttributes(Rhino.DocObjects.RhinoObject,Rhino.Display.DisplayPipelineAttributes)
If an analysis mode needs to modify display attributes, this is the place
to do it.  In particular, Style==Texture, then this function must be
overridden.
Remarks:
Shaded analysis modes that use texture mapping, like zebra and emap,
override this function set the texture, diffuse_color, and EnableLighting
parameter.
obj: The object for which to set up attributes.
attributes: The linked attributes.

Rhino.Display.VisualAnalysisMode.UpdateVertexColors(Rhino.DocObjects.RhinoObject,Rhino.Geometry.Mesh[])
If Style==falseColor, then this virtual function must be overridden.
Rhino calls this function when it is time for to set the false colors
on the analysis mesh vertices.  For breps, there is one mesh per face.
For mesh objects there is a single mesh.
obj: The object for which to update vertex colors.
meshes: An array of meshes that should be updated.

Rhino.Display.VisualAnalysisMode.DrawCurveObject(Rhino.DocObjects.CurveObject,Rhino.Display.DisplayPipeline)
If Style==Wireframe, then the default decomposes the curve object into
nurbs curve segments and calls the virtual DrawNurbsCurve for each segment.
curve: A document curve object.
pipeline: The drawing pipeline.

Rhino.Display.VisualAnalysisMode.DrawMeshObject(Rhino.DocObjects.MeshObject,Rhino.Display.DisplayPipeline)
Draws one mesh. Override this method to add your custom behavior.
The default implementation does nothing.
mesh: A mesh object.
pipeline: The current display pipeline.

Rhino.Display.VisualAnalysisMode.DrawBrepObject(Rhino.DocObjects.BrepObject,Rhino.Display.DisplayPipeline)
Draws one brep. Override this method to add your custom behavior.
The default implementation does nothing.
brep: A brep object.
pipeline: The current display pipeline.

Rhino.Display.VisualAnalysisMode.DrawPointObject(Rhino.DocObjects.PointObject,Rhino.Display.DisplayPipeline)
Draws one point. Override this method to add your custom behavior.
The default implementation does nothing.
point: A point object.
pipeline: The current display pipeline.

Rhino.Display.VisualAnalysisMode.DrawPointCloudObject(Rhino.DocObjects.PointCloudObject,Rhino.Display.DisplayPipeline)
Draws one point cloud. Override this method to add your custom behavior.
The default implementation does nothing.
pointCloud: A point cloud object.
pipeline: The current display pipeline.

Rhino.Display.VisualAnalysisMode.DrawNurbsCurve(Rhino.DocObjects.RhinoObject,Rhino.Geometry.NurbsCurve,Rhino.Display.DisplayPipeline)
Draws a NURBS curve. This is a good function to override for
analysis modes like curvature hair display.
The default implementation does nothing.
obj: A Rhino object corresponding to the curve.
curve: The curve geometry.
pipeline: The current display pipeline.

Rhino.Display.VisualAnalysisMode.DrawNurbsSurface(Rhino.DocObjects.RhinoObject,Rhino.Geometry.NurbsSurface,Rhino.Display.DisplayPipeline)
Draws a NURBS surface. This is a good function to override
to display object-related meshes.
The default implementation does nothing.
obj: A Rhino object corresponding to the surface.
surface: The surface geometry.
pipeline: The current display pipeline.

Rhino.Display.VisualAnalysisMode.DrawMesh(Rhino.DocObjects.RhinoObject,Rhino.Geometry.Mesh,Rhino.Display.DisplayPipeline)
Draws a mesh.
The default implementation does nothing.
obj: A Rhino object corresponding to the surface.
mesh: The mesh geometry.
pipeline: The current display pipeline.