Rhino.Geometry.Vector2f
Represents the two components of a vector in two-dimensional space,
using System.Single-precision floating point numbers.

Rhino.Geometry.Vector2f.#ctor(System.Single,System.Single)
Creates an instance.
x: X component.
y: Y component.
Since: 6.0

Rhino.Geometry.Vector2f.Zero
Gets the value of the vector with components 0,0.
Since: 5.0

Rhino.Geometry.Vector2f.XAxis
Gets the value of the vector with components 1,0.
Since: 5.0

Rhino.Geometry.Vector2f.YAxis
Gets the value of the vector with components 0,1.
Since: 8.4

Rhino.Geometry.Vector2f.Unset
Gets the value of the vector with each component set to RhinoMath.UnsetValue.
Since: 5.0

Rhino.Geometry.Vector2f.X
Gets or sets the X (first) component of this vector.
Since: 5.0

Rhino.Geometry.Vector2f.Y
Gets or sets the Y (second) component of this vector.
Since: 5.0

Rhino.Geometry.Vector2f.IsZero
Gets a value indicating whether the X, Y, and Z values are all equal to 0.0.
Since: 6.0

Rhino.Geometry.Vector2f.IsUnitVector
Gets a value indicating whether or not this is a unit vector.
A unit vector has length 1.
Since: 6.0

Rhino.Geometry.Vector2f.IsValid
Returns an indication regarding the validity of this vector.
Since: 6.0

Rhino.Geometry.Vector2f.Equals(System.Object)
Determines whether the specified System.Object is a Vector2f and has the same values as the present vector.
obj: The specified object.
Returns: true if obj is Vector2f and has the same coordinates as this; otherwise false.

Rhino.Geometry.Vector2f.Equals(Rhino.Geometry.Vector2f)
Determines whether the specified vector has the same values as the present vector.
vector: The specified vector.
Returns: true if obj is Vector2f and has the same coordinates as this; otherwise false.
Since: 5.0

Rhino.Geometry.Vector2f.EpsilonEquals(Rhino.Geometry.Vector2f,System.Single)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:
Since: 5.4

Rhino.Geometry.Vector2f.CompareTo(Rhino.Geometry.Vector2f)
Compares this Rhino.Geometry.Vector2f with another Rhino.Geometry.Vector2f.
Components evaluation priority is first X, then Y.
other: The other Rhino.Geometry.Vector2f to use in comparison.
Returns:
0: if this is identical to other
-1: if this.X < other.X
-1: if this.X == other.X and this.Y < other.Y
+1: otherwise.
Since: 5.0

Rhino.Geometry.Vector2f.GetHashCode
Computes a hash number that represents the current vector.
Returns: A hash code that is not unique for each vector.

Rhino.Geometry.Vector2f.ToString
Constructs the string representation of the current vector.
Returns: The vector representation in the form X,Y,Z.

Rhino.Geometry.Vector2f.ToString(System.String,System.IFormatProvider)
Since: 7.0

Rhino.Geometry.Vector2f.Unitize
Unitizes the vector in place. A unit vector has length 1 unit.
An invalid or zero length vector cannot be unitized.
Returns: true on success or false on failure.
Since: 8.4

Rhino.Geometry.Vector2f.Reverse
Reverses this vector in place (reverses the direction).
If this vector contains RhinoMath.UnsetValue, the
reverse will also be invalid and false will be returned.
Remarks: Similar to Negate, that is only provided for CLR language compliance.
Returns: true on success or false if the vector is invalid.
Since: 8.4

Rhino.Geometry.Vector2f.PerpendicularTo(Rhino.Geometry.Vector2f)
Sets this vector to be perpendicular to another vector.
Result is not unitized.
other: Vector to use as guide.
Returns: true on success, false if input vector is zero or invalid.
Since: 8.4

Rhino.Geometry.Vector2f.op_Equality(Rhino.Geometry.Vector2f,Rhino.Geometry.Vector2f)
Determines whether two vectors have equal values.
a: The first vector.
b: The second vector.
Returns: true if the components of the two vectors are exactly equal; otherwise false.
Since: 5.0

Rhino.Geometry.Vector2f.op_Inequality(Rhino.Geometry.Vector2f,Rhino.Geometry.Vector2f)
Determines whether two vectors have different values.
a: The first vector.
b: The second vector.
Returns: true if the two vectors differ in any component; false otherwise.
Since: 5.0

Rhino.Geometry.Vector2f.op_LessThan(Rhino.Geometry.Vector2f,Rhino.Geometry.Vector2f)
Determines whether the first specified vector comes before
(has inferior sorting value than) the second vector.
Components have decreasing evaluation priority: first X, then Y.
a: First vector.
b: Second vector.
Returns: true if a.X is smaller than b.X, or a.X == b.X and a.Y is smaller than b.Y; otherwise, false.
Since: 5.0

Rhino.Geometry.Vector2f.op_LessThanOrEqual(Rhino.Geometry.Vector2f,Rhino.Geometry.Vector2f)
Determines whether the first specified vector comes before
(has inferior sorting value than) the second vector, or it is equal to it.
Components have decreasing evaluation priority: first X, then Y.
a: First vector.
b: Second vector.
Returns: true if a.X is smaller than b.X, or a.X == b.X and a.Y <= b.Y; otherwise, false.
Since: 5.0

Rhino.Geometry.Vector2f.op_GreaterThan(Rhino.Geometry.Vector2f,Rhino.Geometry.Vector2f)
Determines whether the first specified vector comes after (has superior sorting value than) the second vector.
Components have decreasing evaluation priority: first X, then Y.
a: First vector.
b: Second vector.
Returns: true if a.X is larger than b.X, or a.X == b.X and a.Y is larger than b.Y; otherwise, false.
Since: 5.0

Rhino.Geometry.Vector2f.op_GreaterThanOrEqual(Rhino.Geometry.Vector2f,Rhino.Geometry.Vector2f)
Determines whether the first specified vector comes after
(has superior sorting value than) the second vector, or it is equal to it.
Components have decreasing evaluation priority: first X, then Y.
a: First vector.
b: Second vector.
Returns: true if a.X is larger than b.X, or a.X == b.X and a.Y >= b.Y; otherwise, false.
Since: 5.0

Rhino.Geometry.Vector2f.Add(Rhino.Geometry.Vector2f,Rhino.Geometry.Vector2f)
Sums up two vectors.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
vector1: A vector.
vector2: A second vector.
Returns: A new vector that results from the component-wise addition of the two vectors.
Since: 8.4

Rhino.Geometry.Vector2f.op_Addition(Rhino.Geometry.Point2f,Rhino.Geometry.Vector2f)
Sums up a point and a vector, and returns a new point.
point: A point.
vector: A vector.
Returns: A new point that results from the addition of point and vector.

Rhino.Geometry.Vector2f.op_UnaryNegation(Rhino.Geometry.Vector2f)
Computes the opposite vector.
vector: A vector to negate.
Returns: A new vector where all components were multiplied by -1.

Rhino.Geometry.Vector2f.Subtract(Rhino.Geometry.Vector2f,Rhino.Geometry.Vector2f)
Subtracts the second vector from the first one.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
vector1: A vector.
vector2: A second vector.
Returns: A new vector that results from the component-wise difference of vector1 - vector2.
Since: 8.4

Rhino.Geometry.Vector2f.Negate(Rhino.Geometry.Vector2f)
Computes the reversed vector.
(Provided for languages that do not support operator overloading. You can use the - unary operator otherwise)
Remarks: This is similar to Reverse(), but is static for CLR compliance, and with default name.
vector: A vector to negate.
Returns: A new vector where all components were multiplied by -1.
Since: 8.4

Rhino.Geometry.Vector2f.Add(Rhino.Geometry.Point2f,Rhino.Geometry.Vector2f)
Sums up a point and a vector, and returns a new point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
point: A point.
vector: A vector.
Returns: A new point that results from the addition of point and vector.
Since: 8.4

Rhino.Geometry.Vector2f.op_Multiply(Rhino.Geometry.Vector2f,Rhino.Geometry.Vector2f)
Multiplies two Rhino.Geometry.Vector2f together, returning the dot (internal) product of the two.
point1: The first point.
point2: The second point.
Returns: A value that results from the coordinate-wise multiplication of point1 and point2.
Since: 6.0

Rhino.Geometry.Vector2f.Multiply(Rhino.Geometry.Vector2f,Rhino.Geometry.Vector2f)
Multiplies two Rhino.Geometry.Vector2f together, returning the dot (internal) product of the two.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
point1: The first point.
point2: The second point.
Returns: A value that results from the coordinate-wise multiplication of point1 and point2.
Since: 6.0

Rhino.Geometry.Vector2f.op_Subtraction(Rhino.Geometry.Vector2f,Rhino.Geometry.Vector2f)
Computes the difference between two vectors.
a: First vector.
b: Second vector.
Returns: The difference.
Since: 6.0

Rhino.Geometry.Vector2f.op_Addition(Rhino.Geometry.Vector2f,Rhino.Geometry.Vector2f)
Computes the sum between two vectors.
a: First vector.
b: Second vector.
Returns: The difference.

Rhino.Geometry.Vector2f.SquareLength
Returns the square of the length of this vector.
This method does not check for the validity of its inputs.
Since: 6.0

Rhino.Geometry.Vector2f.Length
Computes the length (or magnitude, or size) of this vector.
This is an application of Pythagoras' theorem.
If this vector is invalid, its length is considered 0.
Since: 8.4