Rhino.FileIO.DracoColorFormat
Color format for vertex colors
Since: 7.7

Rhino.FileIO.DracoColorFormat.ARGB
Alpha, Red, Green, Blue order

Rhino.FileIO.DracoColorFormat.RGBA
Red, Green, Blue, Alpha order