Rhino.Geometry.Intersect.MeshClash
Represents a particular instance of a clash or intersection between two meshes.

Rhino.Geometry.Intersect.MeshClash.MeshA
Gets the first mesh.
Since: 5.0

Rhino.Geometry.Intersect.MeshClash.MeshB
Gets the second mesh.
Since: 5.0

Rhino.Geometry.Intersect.MeshClash.ClashPoint
If valid, then the sphere centered at ClashPoint of ClashRadius
distance intersects the clashing meshes.
Since: 5.0

Rhino.Geometry.Intersect.MeshClash.ClashRadius
Gets the clash, or intersection, radius.
Since: 5.0

Rhino.Geometry.Intersect.MeshClash.Search(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Double,System.Int32)
Searches for locations where the distance from a mesh in one set of meshes
is less than distance to another mesh in a second set of meshes.
setA: The first set of meshes.
setB: The second set of meshes.
distance: The largest distance at which there is a clash.
All values smaller than this cause a clash as well.
maxEventCount: The maximum number of clash objects.
Returns: An array of clash objects.
Since: 5.0

Rhino.Geometry.Intersect.MeshClash.Search(Rhino.Geometry.Mesh,System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Double,System.Int32)
Searches the locations where the distance from the first mesh to a mesh in the second set of meshes
is less than the provided value.
meshA: The first mesh.
setB: The second set of meshes.
distance: The largest distance at which there is a clash.
All values smaller than this cause a clash as well.
maxEventCount: The maximum number of clash objects.
Returns: An array of clash objects.
Since: 5.0

Rhino.Geometry.Intersect.MeshClash.Search(Rhino.Geometry.Mesh,Rhino.Geometry.Mesh,System.Double,System.Int32)
Searches the locations where the distance from the first mesh to the second mesh
is less than the provided value.
meshA: The first mesh.
meshB: The second mesh.
distance: The largest distance at which there is a clash.
All values smaller than this cause a clash as well.
maxEventCount: The maximum number of clash objects.
Returns: An array of clash objects.
Since: 5.0

Rhino.Geometry.Intersect.MeshClash.Search(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},System.Double)
Searches for locations where the distance from a RhinoObject, in one set of objects,
is less than the specified distance to another RhinoObject in a second set of objects.
This function uses the object's mesh to calculate the interferences.
Acceptable object types include: BrepObject, ExtrusionObject, MeshObject, and SubDObject.
setA: The first set of Rhino objects.
setB: The second set of Rhino objects.
distance: The largest distance at which a clash can occur.
Returns: An array of mesh interference object if successful, or an empty array on failure.
Since: 7.0

Rhino.Geometry.Intersect.MeshClash.Search(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},System.Double,Rhino.Geometry.MeshType,Rhino.Geometry.MeshingParameters)
Searches for locations where the distance from a RhinoObject, in one set of objects,
is less than the specified distance to another RhinoObject in a second set of objects.
This function uses the object's mesh to calculate the interferences.
Acceptable object types include: BrepObject, ExtrusionObject, MeshObject, and SubDObject.
setA: The first set of Rhino objects.
setB: The second set of Rhino objects.
distance: The largest distance at which a clash can occur.
meshType: The type of mesh to be used for the calculation.
meshingParameters: The meshing parameters used to generate meshes for the calculation.
Returns: An array of mesh interference object if successful, or an empty array on failure.
Since: 7.0

Rhino.Geometry.Intersect.MeshClash.FindDetail(Rhino.DocObjects.RhinoObject,Rhino.DocObjects.RhinoObject,System.Double)
Finds all of the mesh faces on each of two Rhino objects that interfere within a clash distance.
This function uses the object's mesh to calculate the interferences.
Acceptable object types include: BrepObject, ExtrusionObject, MeshObject, and SubDObject.
objA: The first Rhino object.
objB: The second Rhino object.
distance: The largest distance at which a clash can occur.
Returns: The resulting meshes are sub-meshes of the input meshes if successful, or an empty array on error.
Since: 7.0

Rhino.Geometry.Intersect.MeshClash.FindDetail(Rhino.DocObjects.RhinoObject,Rhino.DocObjects.RhinoObject,System.Double,Rhino.Geometry.MeshType,Rhino.Geometry.MeshingParameters)
Finds all of the mesh faces on each of two Rhino objects that interfere within a clash distance.
This function uses the object's mesh to calculate the interferences.
Acceptable object types include: BrepObject, ExtrusionObject, MeshObject, and SubDObject.
objA: The first Rhino object.
objB: The second Rhino object.
distance: The largest distance at which a clash can occur.
meshType: The type of mesh to be used for the calculation.
meshingParameters: The meshing parameters used to generate meshes for the calculation.
Returns: The resulting meshes are sub-meshes of the input meshes if successful, or an empty array on error.
Since: 7.0