Rhino.PlugIns.LicenseType
LicenseType enumeration.
Since: 5.0

Rhino.PlugIns.LicenseType.Standalone
A standalone license

Rhino.PlugIns.LicenseType.Network
A network license that has not been fulfilled by a Zoo

Rhino.PlugIns.LicenseType.NetworkLoanedOut
A license on temporary loan from a Zoo

Rhino.PlugIns.LicenseType.NetworkCheckedOut
A license on permanent check out from a Zoo

Rhino.PlugIns.LicenseType.CloudZoo
A lease granted by the Cloud Zoo