Rhino.Geometry.Collections.HiddenLineDrawingObjectList
Provides access to all the HiddenLineDrawingObject objects in a HiddenLineDrawing object.

Rhino.Geometry.Collections.HiddenLineDrawingObjectList.Count
Gets the number of HiddenLineDrawingObject objects.

Rhino.Geometry.Collections.HiddenLineDrawingObjectList.Item(System.Int32)
Get the HiddenLineDrawingObject at a given index.
index: Index of HiddenLineDrawingObject to access.
Throws System.IndexOutOfRangeException: Thrown when the index is invalid.
Returns: The HiddenLineDrawingObject at [index].

Rhino.Geometry.Collections.HiddenLineDrawingObjectList.GetEnumerator
Gets an enumerator that visits all objects.
Returns: The enumerator.

Rhino.Geometry.Collections.HiddenLineDrawingObjectList.System#Collections#IEnumerable#GetEnumerator
Gets the same enumerator as Rhino.Geometry.Collections.HiddenLineDrawingObjectList.GetEnumerator.
Returns: The enumerator.