Rhino.Geometry.CurveExtensionStyle
Defines enumerated values for styles to use during curve extension, such as "Line", "Arc" or "Smooth".
Since: 5.0

Rhino.Geometry.CurveExtensionStyle.Line
Curve ends will be propagated linearly according to tangents.

Rhino.Geometry.CurveExtensionStyle.Arc
Curve ends will be propagated arc-wise according to curvature.

Rhino.Geometry.CurveExtensionStyle.Smooth
Curve ends will be propagated smoothly according to curvature.