Rhino.DocObjects.Font.FontStretch
Horizontal expansion or contraction of font

Rhino.DocObjects.Font.FontStretch.Unset
Not set.

Rhino.DocObjects.Font.FontStretch.Ultracondensed


Rhino.DocObjects.Font.FontStretch.Extracondensed


Rhino.DocObjects.Font.FontStretch.Condensed


Rhino.DocObjects.Font.FontStretch.Semicondensed


Rhino.DocObjects.Font.FontStretch.Medium
Default font stretch.

Rhino.DocObjects.Font.FontStretch.Semiexpanded


Rhino.DocObjects.Font.FontStretch.Expanded


Rhino.DocObjects.Font.FontStretch.Extraexpanded


Rhino.DocObjects.Font.FontStretch.Ultraexpanded
