Rhino.UI.RhinoPlotWidthType
Supported plot width special types

Rhino.UI.RhinoPlotWidthType.ByLayer
Plot width from layer

Rhino.UI.RhinoPlotWidthType.ByParent
Plot width from parent object

Rhino.UI.RhinoPlotWidthType.Hairline
System hairline plot width

Rhino.UI.RhinoPlotWidthType.Default
Use default plot width

Rhino.UI.RhinoPlotWidthType.None
Don't print

Rhino.UI.RhinoPlotWidthType.Varies
Multiple objects selected with different types/widths

Rhino.UI.RhinoPlotWidthType.Width
Standard or custom width