Rhino.Display.DisplayEngine.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 6.0

Rhino.Display.DisplayEngine.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().