Rhino.FileIO.BinaryArchiveReader
Represents an entity that is capable of reading a binary archive and
instantiating strongly-typed objects.

Rhino.FileIO.BinaryArchiveReader.ReadErrorOccured
Gets or sets whether en error occurred during reading.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.Archive3dmVersion
If a 3dm archive is being read or written, then this is the
version of the 3dm archive format (1, 2, 3, 4 or 5).
0     a 3dm archive is not being read/written
1     a version 1 3dm archive is being read/written
2     a version 2 3dm archive is being read/written
3     a version 3 3dm archive is being read/written
4     a version 4 3dm archive is being read/written
5     an old version 5 3dm archive is being read
50    a version 5 3dm archive is being read/written.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.EnableCRCCalculation(System.Boolean)
Expert user function to control CRC calculation while reading and writing.
Typically this is used when seeking around and reading/writing information
in non-serial order.
enable:
Returns:
Current state of CRC calculation.  Use the returned value to restore the
CRC calculation setting after you are finished doing your fancy pants
expert IO.
Since: 6.0

Rhino.FileIO.BinaryArchiveReader.CurrentPosition
current offset (in bytes) into archive ( like ftell() )
Since: 6.0

Rhino.FileIO.BinaryArchiveReader.SeekFromCurrentPosition(System.Int64)
seek from current position ( like fseek( ,SEEK_CUR) )
byteOffset:
Returns:

Rhino.FileIO.BinaryArchiveReader.SeekFromCurrentPosition(System.UInt64,System.Boolean)
seek from current position ( like fseek( ,SEEK_CUR) )
byteOffset:
forward: seek forward of backward in the archive
Returns:

Rhino.FileIO.BinaryArchiveReader.SeekFromStart(System.UInt64)
seek from start position ( like fseek( ,SEEK_SET) )
byteOffset:
Returns:

Rhino.FileIO.BinaryArchiveReader.BeginRead3dmChunk(System.UInt32,System.Int32@,System.Int32@)
Begins reading a chunk that must be in the archive at this location.
expectedTypeCode:
majorVersion:
minorVersion:
Returns:
True if beginning of the chunk was read.  In this case you must call EndRead3dmChunk(),
even if something goes wrong while you attempt to read the interior of the chunk.
False if the chunk did not exist at the current location in the file.
Since: 6.0

Rhino.FileIO.BinaryArchiveReader.BeginRead3dmChunk(System.UInt32@,System.Int64@)
Begins reading a chunk that must be in the archive at this location.
typeCode:
value:
Returns:

Rhino.FileIO.BinaryArchiveReader.EndRead3dmChunk(System.Boolean)
Calling this will skip rest of stuff in chunk if it was only partially read.
suppressPartiallyReadChunkWarning:
Generally, a call to ON_WARNING is made when a chunk is partially read.
If suppressPartiallyReadChunkWarning is true, then no warning is issued
for partially read chunks.
Returns:
Since: 6.0

Rhino.FileIO.BinaryArchiveReader.Read3dmChunkVersion(System.Int32@,System.Int32@)
A chunk version is a single byte that encodes a major.minor
version number.  Useful when creating I/O code for 3dm chunks
that may change in the future.  Increment the minor version
number if new information is added to the end of the chunk.
Increment the major version if the format of the chunk changes
in some other way.
major: 0 to 15.
minor: 0 to 16.
Returns: true on successful read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadDictionary
Reads a complete Rhino.Collections.ArchivableDictionary from the archive.
Returns: The newly instantiated object.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadBool
Reads a System.Boolean from the archive.
Returns: The value that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadByte
Reads a System.Byte from the archive.
Returns: The value that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadSByte
Reads a System.SByte from the archive.
Returns: The value that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadShort
Reads a System.Int16 from the archive.
Returns: The value that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadUShort
Reads a System.UInt16 from the archive.
Returns: The value that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadInt
Reads a System.Int32 from the archive.
Returns: The value that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadUInt
Reads a System.UInt32 from the archive.
Returns: The value that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadInt64
Reads a System.Int64 from the archive.
Returns: The value that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadSingle
Reads a System.Single from the archive.
Returns: The value that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadDouble
Reads a System.Double from the archive.
Returns: The value that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadGuid
Reads a System.Guid from the archive.
Returns: The value that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadString
Reads a System.String from the archive.
Returns: The value that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadUtf8String
Reads a System.String from the archive.
Returns: The value that was read.
Since: 6.0

Rhino.FileIO.BinaryArchiveReader.ReadBoolArray
Reads an array of System.Boolean from the archive.
An array is returned even if the input was another enumerable type.
Returns: The array that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadByteArray
Reads an array of System.Byte from the archive.
An array is returned even if the input was another enumerable type.
Returns: The array that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadCompressedBuffer
Reads an array of compressed System.Byte information from the archive and uncompresses it.
An array is returned even if the input was another enumerable type.
Returns: The array that was read.
Since: 5.9

Rhino.FileIO.BinaryArchiveReader.ReadSByteArray
Reads an array of System.SByte from the archive.
An array is returned even if the input was another enumerable type.
Returns: The array that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadShortArray
Reads an array of System.Int16 from the archive.
An array is returned even if the input was another enumerable type.
Returns: The array that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadIntArray
Reads an array of System.Int32 from the archive.
An array is returned even if the input was another enumerable type.
Returns: The array that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadSingleArray
Reads an array of System.Single from the archive.
An array is returned even if the input was another enumerable type.
Returns: The array that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadDoubleArray
Reads an array of System.Double from the archive.
An array is returned even if the input was another enumerable type.
Returns: The array that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadGuidArray
Reads an array of System.Guid from the archive.
An array is returned even if the input was another enumerable type.
Returns: The array that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadStringArray
Reads an array of System.String from the archive.
An array is returned even if the input was another enumerable type.
Returns: The array that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadColor
Reads a System.Drawing.Color from the archive.
Returns: The element that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadPoint
Reads a System.Drawing.Point from the archive.
Returns: The element that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadPointF
Reads a System.Drawing.PointF from the archive.
Returns: The element that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadRectangle
Reads a System.Drawing.Rectangle from the archive.
Returns: The element that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadRectangleF
Reads a System.Drawing.RectangleF from the archive.
Returns: The element that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadSize
Reads a System.Drawing.Size from the archive.
Returns: The element that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadSizeF
Reads a System.Drawing.SizeF from the archive.
Returns: The element that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadFont
Reads a System.Drawing.Font from the archive.
Returns: The element that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadObjRef
Reads a Rhino.DocObjects.ObjRef from the archive
Returns: the element that was read
Since: 5.8

Rhino.FileIO.BinaryArchiveReader.ReadObjRefArray
Reads an array of System.Double from the archive.
An array is returned even if the input was another enumerable type.
Returns: The array that was read.
Since: 5.8

Rhino.FileIO.BinaryArchiveReader.ReadInterval
Reads a Rhino.Geometry.Interval from the archive.
Returns: The element that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadPoint2d
Reads a Rhino.Geometry.Point2d from the archive.
Returns: The element that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadPoint3d
Reads a Rhino.Geometry.Point3d from the archive.
Returns: The element that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadPoint4d
Reads a Rhino.Geometry.Point4d from the archive.
Returns: The element that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadVector2d
Reads a Rhino.Geometry.Vector2d from the archive.
Returns: The element that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadVector3d
Reads a Rhino.Geometry.Vector3d from the archive.
Returns: The element that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadBoundingBox
Reads a Rhino.Geometry.BoundingBox from the archive.
Returns: The element that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadRay3d
Reads a Rhino.Geometry.Ray3d from the archive.
Returns: The element that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadTransform
Reads a Rhino.Geometry.Transform from the archive.
Returns: The element that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadPlane
Reads a Rhino.Geometry.Plane from the archive.
Returns: The element that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadLine
Reads a Rhino.Geometry.Line from the archive.
Returns: The element that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadPoint3f
Reads a Rhino.Geometry.Point3f from the archive.
Returns: The element that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadVector3f
Reads a Rhino.Geometry.Vector3f from the archive.
Returns: The element that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadMeshingParameters
Reads a Rhino.Geometry.MeshingParameters from the archive.
Returns: The element that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadGeometry
Reads a Rhino.Geometry.GeometryBase-derived object from the archive.
The Rhino.Geometry.GeometryBase class is abstract.
Returns: The element that was read.
Since: 5.0

Rhino.FileIO.BinaryArchiveReader.ReadGeometryArray
Since: 7.0

Rhino.FileIO.BinaryArchiveReader.ReadRenderSettings
Reads a Rhino.Render.RenderSettings-derived object from the archive.
Returns: The element that was read.
Since: 6.0

Rhino.FileIO.BinaryArchiveReader.ReadCheckSum
Reads a legacy ON_CheckSum, only provided to read data chunks from old
V5 files, the CheckSum read is discarded
Since: 6.0
6.0

Rhino.FileIO.BinaryArchiveReader.Read3dmStartSection(System.Int32@,System.String@)
version: .3dm file version (2, 3, 4, 5 or 50)
comment:
String with application name, et cetera.  This information is primarily
used when debugging files that contain problems.  McNeel and Associates
stores application name, application version, compile date, and the OS
in use when file was written.
Returns: true on success
Since: 5.1

Rhino.FileIO.BinaryArchiveReader.Dump3dmChunk(Rhino.FileIO.TextLog)
Function for studying contents of a file.  The primary use is as an aid
to help dig through files that have been damaged (bad disks, transmission
errors, etc.) If an error is found, a line that begins with the word
"ERROR" is printed.
log: log where information is printed to
Returns:
0 if something went wrong, otherwise the typecode of the chunk that
was just studied.
Since: 5.1

Rhino.FileIO.BinaryArchiveReader.AtEnd
true if at end of a file
Returns:
Since: 5.1

Rhino.FileIO.BinaryArchiveReader.BeginReadDictionaryEntry(System.Int32@,System.String@)
See return.
Returns:
0: serious IO error
1: success
read information and then call EndReadDictionaryEntry()
2: at end of dictionary.