Rhino.FileIO.FileRawWriteOptions
Options for writing a Raw file

Rhino.FileIO.FileRawWriteOptions.MeshingParameters
Since: 8.0

Rhino.FileIO.FileRawWriteOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0