Rhino.Render.PostEffects.PostEffect.SerialNumber
Since: 7.0

Rhino.Render.PostEffects.PostEffect.#ctor
Since: 7.0

Rhino.Render.PostEffects.PostEffect.Id
Since: 7.0

Rhino.Render.PostEffects.PostEffect.PostEffectType
Since: 7.0

Rhino.Render.PostEffects.PostEffect.Styles
Since: 7.0

Rhino.Render.PostEffects.PostEffect.LocalName
Since: 7.0

Rhino.Render.PostEffects.PostEffect.CanDisplayHelp
Since: 7.0

Rhino.Render.PostEffects.PostEffect.ExecuteWhileRenderingOption
Since: 7.0

Rhino.Render.PostEffects.PostEffect.On
Since: 7.0

Rhino.Render.PostEffects.PostEffect.Shown
Since: 7.0

Rhino.Render.PostEffects.PostEffect.Dispose
Since: 7.0

Rhino.Render.PostEffects.PostEffect.Dispose(System.Boolean)
Since: 7.0

Rhino.Render.PostEffects.PostEffect.RegisterPostEffect(Rhino.PlugIns.PlugIn)
Since: 7.0

Rhino.Render.PostEffects.PostEffect.RegisterPostEffect(System.Reflection.Assembly,System.Guid)
Since: 7.0

Rhino.Render.PostEffects.PostEffect.IsSelected
Return true if the post effect is selected.
Since: 7.0

Rhino.Render.PostEffects.PostEffect.Execute(Rhino.Render.PostEffects.PostEffectPipeline,System.Drawing.Rectangle)
Execute the post effect.
pipeline: pipeline provides access to the post-effect pipeline.
rect: rect is the pixel area to process.
Returns: Return true if successful, else false.
Since: 7.0

Rhino.Render.PostEffects.PostEffect.GetParam(System.String,System.Object@)
Get a parameter.
param: is the name of the parameter to get.
v: accepts the parameter value.
Returns:  Returns true if successful or false if the parameter was not found.
Since: 7.0

Rhino.Render.PostEffects.PostEffect.SetParam(System.String,System.Object)
Set a parameter.
param: is the name of the parameter to set.
v: specifies the type and value to set.
Returns: Return true if successful or false if the parameter could not be set.
Since: 7.0

Rhino.Render.PostEffects.PostEffect.ReadState(Rhino.Render.PostEffects.PostEffectState)
Read the state. If your post effect has no state, you must still return true for success.
state: PostEffectState
Returns:  Return true if successful, else false.
Since: 7.0

Rhino.Render.PostEffects.PostEffect.WriteState(Rhino.Render.PostEffects.PostEffectState@)
Write the state. If your post effect has no state, you must still return true for success.
state: PostEffectState
Returns: Return true if successful, else false.
Since: 7.0

Rhino.Render.PostEffects.PostEffect.ResetToFactoryDefaults
Reset the state to factory defaults.
Since: 7.0

Rhino.Render.PostEffects.PostEffect.AddUISections(Rhino.Render.PostEffects.PostEffectUI)
Create each of your UI sections using 'new' and then call ui.AddSection() on them.
RDK takes ownership of the sections.If your post effect does not need a UI, then
your implementation of this method can be a no-op.
ui: PostEffectUI
Since: 7.0

Rhino.Render.PostEffects.PostEffect.DisplayHelp
Displays the post effect's help page, if any.
Returns:  Return true if successful, else false.
Since: 7.0

Rhino.Render.PostEffects.PostEffect.CanExecute(Rhino.Render.PostEffects.PostEffectPipeline)
Return true if the post effect can execute, else false.
The base implementation checks if the post effect is 'On' and 'Shown'.
Post effect authors can override this to include other criteria but cannot disable the base criteria.
pipeline: PostEffectPipeline
Returns: Return true if the post effect can execute, else false
Since: 7.0

Rhino.Render.PostEffects.PostEffect.RequiredChannels
The RDK calls this method to determine which channels a post effect requires. If a required channel is not
available, the RDK will hide the post effect's UI and display explanatory text instead.
Note: As a convenience, the default implementation adds IRhRdkRenderWindow::chanRGBA to the output array.
Most post effects should be able to use this default with no need to override the method.
Returns: The channel Ids.The post effect should return all channels used by its implementation to this array.
Since: 7.0

Rhino.Render.PostEffects.PostEffect.ReadFromDocumentDefaults(Rhino.RhinoDoc)
Because post effects are now in the render settings, this function can no longer be called.
Since: 7.0
8.0

Rhino.Render.PostEffects.PostEffect.WriteToDocumentDefaults(Rhino.RhinoDoc)
Because post effects are now in the render settings, this function can no longer be called.
Since: 7.0
8.0

Rhino.Render.PostEffects.PostEffect.GetHashCode
A CRC of the state of this post effect.
Returns: returns a crc of post effect state
Since: 7.0

Rhino.Render.PostEffects.PostEffect.BeginChange(Rhino.Render.RenderContent.ChangeContexts)
Since: 7.0

Rhino.Render.PostEffects.PostEffect.EndChange
Since: 7.0

Rhino.Render.PostEffects.PostEffect.Changed
Since: 7.0