Rhino.DocObjects.HatchPattern.#ctor
Since: 5.0

Rhino.DocObjects.HatchPattern.#ctor(Rhino.DocObjects.HatchPattern)
Since: 8.15

Rhino.DocObjects.HatchPattern.ReadFromFile(System.String,System.Boolean)
Reads hatch pattern definitions from a file.
filename:
Name of an existing file. If filename is null or empty, default hatch pattern filename is used.
quiet:
Ignored.
Returns: An array of hatch patterns. This can be null, but not empty.
Since: 5.0

Rhino.DocObjects.HatchPattern.WriteToFile(System.String,Rhino.DocObjects.HatchPattern)
Writes a hatch pattern defintion to a file.
filename: Name of file to create. If file exists, it will be overwritten.
hatchPattern: The hatch pattern to write.
Returns: True if successful, false otherwise.
Remarks: Output file is in AutoCAD .PAT format.
Since: 8.15

Rhino.DocObjects.HatchPattern.WriteToFile(System.String,System.Collections.Generic.IEnumerable{Rhino.DocObjects.HatchPattern})
Writes one or more hatch pattern defintions to a file.
filename: Name of file to create. If file exists, it will be overwritten.
hatchPatterns: The enumeration of hatch patterns to write.
Returns: True if successful, false otherwise.
Remarks: Output file is in AutoCAD .PAT format.
Since: 8.15

Rhino.DocObjects.HatchPattern.ComponentType
Returns Rhino.DocObjects.ModelComponentType.HatchPattern.
Since: 6.0

Rhino.DocObjects.HatchPattern.IsDeleted
Deleted hatch patterns are kept in the runtime hatch pattern table so that undo
will work with hatch patterns.  Call IsDeleted to determine to determine if
a hatch pattern is deleted.
Since: 5.0

Rhino.DocObjects.HatchPattern.IsReference
Rhino allows multiple files to be viewed simultaneously. Hatch patterns in the
document are "normal" or "reference". Reference hatch patterns are not saved.
Since: 5.0

Rhino.DocObjects.HatchPattern.InUse
Returns true if the hatch pattern is in use by a Rhino object,
a layer, an instance definition, or a section style.
Since: 8.15

Rhino.DocObjects.HatchPattern.CreatePreviewGeometry(System.Int32,System.Int32,System.Double)
Creates preview line segments of the hatch pattern.
width: The width of the preview.
height: The height of the preview.
angle: The rotation angle of the pattern display in radians.
Returns: The preview line segments if successful, an empty array on failure.
Since: 6.8

Rhino.DocObjects.HatchPattern.Index
Index in the hatch pattern table for this pattern. -1 if not in the table.
Since: 5.0

Rhino.DocObjects.HatchPattern.Description
Gets and sets a short description of the pattern.
Since: 5.0

Rhino.DocObjects.HatchPattern.FillType
Gets the pattern's fill type.
Since: 5.0

Rhino.DocObjects.HatchPattern.HatchLineCount
Get the number of HatchLines in the pattern.
Since: 8.0

Rhino.DocObjects.HatchPattern.AddHatchLine(Rhino.DocObjects.HatchLine)
Add a HatchLine to the pattern.
hatchLine: The hatch line to add.
Returns: The index of newly added hatch line, or -1 on failure.
Since: 8.0

Rhino.DocObjects.HatchPattern.HatchLineAt(System.Int32)
Gets a HatchLine at an index.
hatchLineIndex: The index of the hatch line.
Returns: The hatch line, or null on failure.
Since: 8.0

Rhino.DocObjects.HatchPattern.RemoveHatchLine(System.Int32)
Remove a hatch line from the pattern.
hatchLineIndex: The index of the hatch line to remove.
Returns: True if successful, false if index is out of range.
Since: 8.0

Rhino.DocObjects.HatchPattern.RemoveAllHatchLines
Remove all of the hatch line from the pattern.
Since: 8.0

Rhino.DocObjects.HatchPattern.HatchLines
Gets all the hatch lines.
Since: 8.0

Rhino.DocObjects.HatchPattern.SetHatchLines(System.Collections.Generic.IEnumerable{Rhino.DocObjects.HatchLine})
Set all of the hatch lines at once. Existing hatch lines are deleted.
hatchLines: An enumeration of hatch lines.
Returns: The number of hatch lines added.
Since: 8.0

Rhino.DocObjects.HatchPattern.SetUserString(System.String,System.String)
Attach a user string (key,value combination) to this geometry.
key: id used to retrieve this string.
value: string associated with key.
Returns: true on success.
Since: 8.9

Rhino.DocObjects.HatchPattern.GetUserString(System.String)
Gets user string from this geometry.
key: id used to retrieve the string.
Returns: string associated with the key if successful. null if no key was found.
Since: 8.9

Rhino.DocObjects.HatchPattern.UserStringCount
Gets the amount of user strings.
Since: 8.9

Rhino.DocObjects.HatchPattern.GetUserStrings
Gets a copy of all (user key string, user value string) pairs attached to this geometry.
Returns: A new collection.
Since: 8.9

Rhino.DocObjects.HatchPattern.DeleteUserString(System.String)
Since: 8.9

Rhino.DocObjects.HatchPattern.DeleteAllUserStrings
Since: 8.9