Rhino.RhinoApp
.NET RhinoApp is parallel to C++ CRhinoApp.

Rhino.RhinoApp.SdkVersion
Rhino SDK 9 digit SDK version number in the form YYYYMMDDn
Rhino will only load plug-ins that were build with exactly the
same version of the SDK.
Since: 5.0

Rhino.RhinoApp.SdkServiceRelease
Rhino SDK 9 digit SDK service release number in the form YYYYMMDDn
Service release of the Rhino SDK supported by this executable. Rhino will only
load plug-ins that require a service release of <= this release number.
For example, SR1 will load all plug-ins made with any SDK released up through and including
the SR1 SDK. But, SR1 will not load a plug-in built using the SR2 SDK. If an "old" Rhino
tries to load a "new" plug-in, the user is told that they have to get a free Rhino.exe
update in order for the plug-in to load. Rhino.exe updates are available from http://www.rhino3d.com.
Since: 5.0

Rhino.RhinoApp.ExeVersion
Major version of Rhino executable 4, 5, ...
Since: 5.0

Rhino.RhinoApp.ExeServiceRelease
Service release version of Rhino executable (0, 1, 2, ...)
The integer is the service release number of Rhino.  For example,
this function returns "0" if Rhino V4SR0 is running and returns
"1" if Rhino V4SR1 is running.
Since: 5.0

Rhino.RhinoApp.BuildDate
Gets the build date.
Since: 5.0

Rhino.RhinoApp.VersionControlRevision
McNeel version control revision identifier at the time this version
of Rhino was built.
Since: 5.0

Rhino.RhinoApp.Version
File version of the main Rhino process
Since: 5.9

Rhino.RhinoApp.SerialNumber
Gets the product serial number, as seen in Rhino's ABOUT dialog box.
Since: 5.0

Rhino.RhinoApp.LicenseUserName
Gets the name of the user that owns the license or lease.
Since: 6.0

Rhino.RhinoApp.LicenseUserOrganization
Gets the name of the organization of the user that owns the license or lease.
Since: 6.0

Rhino.RhinoApp.InstallationTypeString
Gets the type of installation (product edition) of the license or lease.
Since: 6.0

Rhino.RhinoApp.Name
Gets the application name.
Since: 5.0

Rhino.RhinoApp.NodeType
Gets license the node type.
Since: 5.0

Rhino.RhinoApp.InstallationType
Gets the product installation type, as seen in Rhino's ABOUT dialog box.
Since: 5.0

Rhino.RhinoApp.SchemeName
Gets the current Registry scheme name.
Since: 6.0

Rhino.RhinoApp.CheckNewObject
Returns true if Rhino will validate each object added to the document.
This can be time consuming but is valuable for debugging.
Since: 8.7

Rhino.RhinoApp.GetDataDirectory(System.Boolean,System.Boolean)
Gets the data directory.
Returns: The data directory.
localUser: If set to true local user.
forceDirectoryCreation: If set to true force directory creation.
Since: 6.0

Rhino.RhinoApp.GetDataDirectory(System.Boolean,System.Boolean,System.String)
Gets the data directory.
Returns: The data directory.
localUser: If set to true local user.
forceDirectoryCreation: If set to true force directory creation.
subDirectory:
Sub directory, will get appended to the end of the data directory.  if forceDirectoryCreation
is true then this directory will get created and writable.
Since: 6.0

Rhino.RhinoApp.GetExecutableDirectory
directory
Since: 6.7

Rhino.RhinoApp.Rhino2Id
Gets the ID of Rhino 2.
Since: 5.0

Rhino.RhinoApp.Rhino3Id
Gets the ID of Rhino 3.
Since: 5.0

Rhino.RhinoApp.Rhino4Id
Gets the ID of Rhino 4.
Since: 5.0

Rhino.RhinoApp.Rhino5Id
Gets the ID of Rhino 5
Since: 5.0

Rhino.RhinoApp.Rhino6Id
Gets the ID of Rhino 6
Since: 7.0

Rhino.RhinoApp.Rhino7Id
Gets the ID of Rhino 7
Since: 7.3

Rhino.RhinoApp.CurrentRhinoId
Gets the current ID of Rhino.
Since: 5.0

Rhino.RhinoApp.IsParentDesktop
Returns true if Rhino's parent window is the desktop, false otherwise.
Remarks:
The parent of a top-level window is the desktop window.
Some applications like to re-parent Rhino's main window to a window they provide.
Use this property to determine if Rhino is in such a condition.
Note, this property is only valid on Windows.
Since: 8.14

Rhino.RhinoApp.IsRunningAutomated
Is Rhino currently being executed through automation
Since: 5.0

Rhino.RhinoApp.IsRunningHeadless
Is Rhino currently being executed in headless mode
Since: 6.1

Rhino.RhinoApp.IsSafeModeEnabled
Is Rhino being executed in safe mode
Since: 7.9

Rhino.RhinoApp.IsSkinned
Is Rhino currently using custom, user-interface Skin.
Since: 6.2

Rhino.RhinoApp.Write(System.String)
Print formatted text in the command window.
Since: 5.0

Rhino.RhinoApp.CommandLineOut
Provides a TextWriter that can write to the command line.
Since: 6.0

Rhino.RhinoApp.Write(System.String,System.Object)
Print formatted text in the command window.
Since: 5.0

Rhino.RhinoApp.Write(System.String,System.Object,System.Object)
Print formatted text in the command window.
Since: 5.0

Rhino.RhinoApp.Write(System.String,System.Object,System.Object,System.Object)
Print formatted text in the command window.
Since: 5.0

Rhino.RhinoApp.WriteLine
Print a newline in the command window.
Since: 5.0

Rhino.RhinoApp.WriteLine(System.String)
Print text in the command window.
Since: 5.0

Rhino.RhinoApp.WriteLine(System.String,System.Object)
Print formatted text with a newline in the command window.
Since: 5.0

Rhino.RhinoApp.WriteLine(System.String,System.Object,System.Object)
Print formatted text with a newline in the command window.
Since: 5.0

Rhino.RhinoApp.WriteLine(System.String,System.Object,System.Object,System.Object)
Print formatted text with a newline in the command window.
Since: 5.0

Rhino.RhinoApp.CommandWindowCaptureEnabled
Enable or disable capturing of the strings sent to the CommandWindow through
Write and WriteLine calls
Since: 7.0

Rhino.RhinoApp.SendWriteToConsole
Enable or disable sending command window strings to the console
RhinoApp.Write(...) calls would be sent to the console when this
is enabled
Since: 7.5

Rhino.RhinoApp.CapturedCommandWindowStrings(System.Boolean)
Get list of strings sent to the command window through calls to Write or WriteLine
when capturing has been enabled
clearBuffer: Clear the captured buffer after this call
Returns: array of captured strings
Since: 7.0

Rhino.RhinoApp.InCommand
Gets the nested command count.
Since: 8.0

Rhino.RhinoApp.OutputDebugString(System.String)
Print a string to the Visual Studio Output window, if a debugger is attached.
Note that the developer needs to add a newline manually if the next output should
come on a separate line.
str: The string to print to the Output window.
Since: 6.0

Rhino.RhinoApp.SetCommandPromptMessage(System.String)
Set the text that appears in the Rhino command prompt.
In general, you should use the SetCommandPrompt functions.
In rare cases, like worker thread messages, the message that
appears in the prompt has non-standard formatting. In these
rare cases, SetCommandPromptMessage can be used to literally
specify the text that appears in the command prompt window.
prompt: A literal text for the command prompt window.
Since: 6.0

Rhino.RhinoApp.SetCommandPrompt(System.String,System.String)
Sets the command prompt in Rhino.
prompt: The new prompt text.
promptDefault:
Text that appears in angle brackets and indicates what will happen if the user pressed ENTER.
Since: 5.0

Rhino.RhinoApp.SetCommandPrompt(System.String)
Set Rhino command prompt.
prompt: The new prompt text.
Since: 5.0

Rhino.RhinoApp.CommandPrompt
Rhino command prompt.
Since: 5.0

Rhino.RhinoApp.CommandHistoryWindowText
Text in Rhino's command history window.
Since: 5.0

Rhino.RhinoApp.ClearCommandHistoryWindow
Clear the text in Rhino's command history window.
Since: 5.0

Rhino.RhinoApp.SendKeystrokes(System.String,System.Boolean)
Sends a string of printable characters, including spaces, to Rhino's command line.
[in] A string to characters to send to the command line. This can be null.
[in] Append a return character to the end of the string.
Since: 5.0

Rhino.RhinoApp.SetFocusToMainWindow
Sets the focus to the main window. This function attempts to use the
ActiveDoc on Mac to figure out which window to set focus to.
Since: 5.0

Rhino.RhinoApp.SetFocusToMainWindow(Rhino.RhinoDoc)
Sets the focus to the main windows for a given document
doc:
the document to use for determining a "main window"
Since: 6.16

Rhino.RhinoApp.ReleaseMouseCapture
Releases the mouse capture.
Since: 5.0

Rhino.RhinoApp.Exit
Exits, or closes, Rhino.
Since: 5.0

Rhino.RhinoApp.Exit(System.Boolean)
Exits, or forcefully closes Rhino.
A prompt to allow saving will appear if necessary when forcefully exiting
Works on Windows and MacOS
true to allow the user to cancel exiting false to force exit

Rhino.RhinoApp.RunScript(System.UInt32,System.String,System.Boolean)
Runs a Rhino command script.
documentSerialNumber: [in] Document serial number for the document to run the script for.
script: [in] script to run.
echo:  [in]
Controls how the script is echoed in the command output window.
false = silent - nothing is echoed.
true = verbatim - the script is echoed literally.
Remarks:
Rhino acts as if each character in the script string had been typed in the command prompt.
When RunScript is called from a "script runner" command, it completely runs the
script before returning. When RunScript is called outside of a command, it returns and the
script is run. This way menus and buttons can use RunScript to execute complicated functions.
Throws System.ApplicationException:
If RunScript is being called while inside an event watcher.
Since: 7.12

Rhino.RhinoApp.RunScript(System.UInt32,System.String,System.String,System.Boolean)
Runs a Rhino command script.
documentSerialNumber: [in] Document serial number for the document to run the script for.
script: [in] script to run.
mruDisplayString: [in] String to display in the most recent command list.
echo:  [in]
Controls how the script is echoed in the command output window.
false = silent - nothing is echoed.
true = verbatim - the script is echoed literally.
Remarks:
Rhino acts as if each character in the script string had been typed in the command prompt.
When RunScript is called from a "script runner" command, it completely runs the
script before returning. When RunScript is called outside of a command, it returns and the
script is run. This way menus and buttons can use RunScript to execute complicated functions.
Throws System.ApplicationException:
If RunScript is being called while inside an event watcher.
Since: 7.12

Rhino.RhinoApp.RunScript(System.String,System.Boolean)
Runs a Rhino command script.
script: [in] script to run.
echo:
Controls how the script is echoed in the command output window.
false = silent - nothing is echoed.
true = verbatim - the script is echoed literally.
Remarks:
Rhino acts as if each character in the script string had been typed in the command prompt.
When RunScript is called from a "script runner" command, it completely runs the
script before returning. When RunScript is called outside of a command, it returns and the
script is run. This way menus and buttons can use RunScript to execute complicated functions.
Throws System.ApplicationException:
If RunScript is being called while inside an event watcher.
Since: 5.0

Rhino.RhinoApp.ExecuteCommand(Rhino.RhinoDoc,System.String)
Execute a Rhino command.
document: Document to execute the command for
commandName: Name of command to run.  Use command's localized name or preface with an underscore.
Returns: Returns the result of the command.
Since: 6.0

Rhino.RhinoApp.RunScript(System.String,System.String,System.Boolean)
Runs a Rhino command script.
script: [in] script to run.
mruDisplayString: [in] String to display in the most recent command list.
echo:
Controls how the script is echoed in the command output window.
false = silent - nothing is echoed.
true = verbatim - the script is echoed literally.
Remarks:
Rhino acts as if each character in the script string had been typed in the command prompt.
When RunScript is called from a "script runner" command, it completely runs the
script before returning. When RunScript is called outside of a command, it returns and the
script is run. This way menus and buttons can use RunScript to execute complicated functions.
Throws System.ApplicationException:
If RunScript is being called while inside an event watcher.
Since: 5.0

Rhino.RhinoApp.RunMenuScript(System.String)
Run a Rhino menu item script.  Will add the selected menu string to the MRU command menu.
script: [in] script to run.
Remarks:
Rhino acts as if each character in the script string had been typed in the command prompt.
When RunScript is called from a "script runner" command, it completely runs the
script before returning. When RunScript is called outside of a command, it returns and the
script is run. This way menus and buttons can use RunScript to execute complicated functions.
Throws System.ApplicationException:
If RunScript is being called while inside an event watcher.
Returns:
Since: 6.0

Rhino.RhinoApp.Wait
Pauses to keep Windows message pump alive so views will update
and windows will repaint.
Since: 5.0

Rhino.RhinoApp.InvokeOnUiThread(System.Delegate,System.Object[])
Execute a function on the main UI thread.
method: function to execute
args: parameters to pass to the function
Since: 6.0

Rhino.RhinoApp.InvokeAndWait(System.Action)
Work-In-Progress. Testing this with our unit test framework
action:
Since: 6.0

Rhino.RhinoApp.InvokeRequired
Returns true if we are currently not running on the main user interface thread
Since: 6.0

Rhino.RhinoApp.MainWindowHandle
Gets the HWND of the Rhino main window.
Since: 5.0

Rhino.RhinoApp.MainWindow
Main Rhino Window
Since: 5.0
6.0

Rhino.RhinoApp.MainApplicationWindow
Same as MainWindow function, but provides the concrete class instead of an interface
Since: 5.0

Rhino.RhinoApp.GetPlugInObject(System.Guid)
Gets the object that is returned by PlugIn.GetPlugInObject for a given
plug-in. This function attempts to find and load a plug-in with a given Id.
When a plug-in is found, it's GetPlugInObject function is called and the
result is returned here.
Note the plug-in must have already been installed in Rhino or the plug-in manager
will not know where to look for a plug-in with a matching id.
pluginId: Guid for a given plug-in.
Returns:
Result of PlugIn.GetPlugInObject for a given plug-in on success.
Since: 5.0

Rhino.RhinoApp.GetPlugInObject(System.String)
Gets the object that is returned by PlugIn.GetPlugInObject for a given
plug-in. This function attempts to find and load a plug-in with a given name.
When a plug-in is found, it's GetPlugInObject function is called and the
result is returned here.
Note the plug-in must have already been installed in Rhino or the plug-in manager
will not know where to look for a plug-in with a matching name.
plugin: Name of a plug-in.
Returns:
Result of PlugIn.GetPlugInObject for a given plug-in on success.
Since: 5.0

Rhino.RhinoApp.IsInstallationEvaluation(Rhino.ApplicationSettings.Installation)
If licenseType is an evaluation license, returns true. An evaluation license limits the ability of
Rhino to save based on either the number of saves or a fixed period of time.
Rhino.ApplicationSettings.Installation
licenseType:
Returns: true if licenseType is an evaluation license. false otherwise
Since: 5.6

Rhino.RhinoApp.IsInstallationCommercial(Rhino.ApplicationSettings.Installation)
If licenseType is a commercial license, returns true. A commercial license grants
full use of the product.
licenseType:
Rhino.ApplicationSettings.Installation
Returns: true if licenseType is a commercial license. false otherwise
Since: 5.6

Rhino.RhinoApp.IsInstallationBeta(Rhino.ApplicationSettings.Installation)
If licenseType is a beta license, returns true. A beta license grants
full use of the product during the pre-release development period.
licenseType:
Rhino.ApplicationSettings.Installation
Returns: true if licenseType is a beta license. false otherwise
Since: 5.6

Rhino.RhinoApp.LicenseExpires
Returns
true if the license will expire
false otherwise
Since: 5.6

Rhino.RhinoApp.IsEvaluation
Returns
true if Rhino is licensed as an Evaluation product
false otherwise

Rhino.RhinoApp.IsPreRelease
Returns
true if Rhino is compiled as pre-release build (Beta, WIP)
false otherwise
Since: 6.0

Rhino.RhinoApp.IsLicenseValidated
Returns
true if the license is validated
false otherwise
Since: 5.6

Rhino.RhinoApp.IsCloudZooNode
Returns
true if rhino is currently using the Cloud Zoo
false otherwise
Since: 6.0

Rhino.RhinoApp.IsInternetAccessAllowed
Returns true when Rhino is allowed to access the Internet, false otherwise.
Note, this does not test if Internet access is available.
Since: 6.15

Rhino.RhinoApp.IsOnMainThread
Is the current thread the main thread
Since: 8.10

Rhino.RhinoApp.CanSave
Returns true when Rhino is allowed to save, false otherwise
Conditions where Rhino is not allowed to save are: when evaluation licenses are expired;
when a Cloud Zoo lease is expired; when a license is shared by a single user on multiple
computers, and the current computer is not active.
Since: 7.0

Rhino.RhinoApp.UpdatesAndStatisticsStatus
Returns true when Rhino is allowed to access the Internet, false otherwise.
Note, this does not test if Internet access is available.
Since: 6.15

Rhino.RhinoApp.ValidationGracePeriodDaysLeft
Returns number of days within which validation must occur. Zero when
validation grace period has expired.
Raises InvalidLicenseTypeException if LicenseType is one of:
EvaluationSaveLimited
EvaluationTimeLimited
Viewer
Unknown
Since: 5.6

Rhino.RhinoApp.DaysUntilExpiration
Returns number of days until license expires. Zero when
license is expired.
Raises InvalidLicenseTypeException if LicenseExpires
would return false.
Since: 5.6

Rhino.RhinoApp.AskUserForRhinoLicense(System.Boolean,System.Object)
Display UI asking the user to enter a license for Rhino or use one from the Zoo.
standAlone: True to ask for a stand-alone license, false to ask the user for a license from the Zoo
parentWindow: Parent window for the user interface dialog.
Returns:
Since: 6.0

Rhino.RhinoApp.ValidateRhinoLicense(System.String,System.String)
Validates a stand-alone Rhino license key for the given Rhino account email
against the McNeel validation server, without asking the user for any input.
Shows the validation wizard's connection/validation progress steps; problems
reported by the server route to the wizard's normal interactive steps.
On success the license is locked to this computer (standalone node).
Used by the rhinoN://license protocol handler to install a license from a web link.
licenseKey: The Rhino license key to validate and install.
email: The Rhino account email to validate the key against.
Returns: true if the license validated and was installed; otherwise false.
Since: 8.34

Rhino.RhinoApp.ChangeLicenseKey(System.Guid)
Display UI asking the user to enter a license for the product specified by licenseId.
pluginId: Guid identifying the plug-in that is requesting a change of license key
Returns: true on success, false otherwise
Since: 6.0

Rhino.RhinoApp.RefreshRhinoLicense
Refresh the license used by Rhino. This allows any part of Rhino to ensure that the most current version of the license file on disk is in use.
Returns:
Since: 6.0

Rhino.RhinoApp.LoginToCloudZoo
Logs in to the cloud zoo.
Since: 6.0

Rhino.RhinoApp.LoggedInUserName
Returns the name of the logged in user, or null if the user is not logged in.
Since: 6.0

Rhino.RhinoApp.IsLoggedInAsMcNeelUser
Call this method to determine if the current user is logged in using a
@mcneel.com email. Use this to turn on features for internal McNeel
users for testing.

Rhino.RhinoApp.AreMcNeelOnlyFeaturesEnabled
Call this method to see if logged in with McNeel email address and if
the Rhino.Options.Advanced.EnableMcNeelOnlyFeatures flag is set

Rhino.RhinoApp.LoggedInUserAvatar
Returns the logged in user's avatar picture.
Returns a default avatar if the user does not have an avatar or if the avatar could not be fetched.
Since: 6.0

Rhino.RhinoApp.UserIsLoggedIn
Returns true if the user is logged in; else returns false.
A logged in user does not guarantee that the auth tokens managed by the CloudZooManager instance are valid.
Since: 6.0

Rhino.RhinoApp.IsClosing
Returns true if Rhino is in the process of closing, false otherwise.
This can be true even before the Closing event fires, such as when RhinoDoc.CloseDocument event is called.
Since: 6.26

Rhino.RhinoApp.IsExiting
Returns true if Rhino is in the process of exiting, false otherwise.
This can be true even before the Closing event fires, such as when RhinoDoc.CloseDocument event is called.
Since: 6.26

Rhino.RhinoApp.EscapeKeyPressed
Can add or removed delegates that are raised when the escape key is clicked.
Since: 5.0

Rhino.RhinoApp.m_keyboard_event


Rhino.RhinoApp.KeyboardEvent
Can add or removed delegates that are raised by a keyboard event.
Since: 5.2

Rhino.RhinoApp.Initialized
Is raised when the application is fully initialized.
Since: 5.0

Rhino.RhinoApp.Closing
Is raised when the application is about to close.
Since: 5.0

Rhino.RhinoApp.AppSettingsChanged
Is raised when settings are changed.
Since: 5.0

Rhino.RhinoApp.Idle
Occurs when the application finishes processing and is about to enter the idle state
Since: 5.1

Rhino.RhinoApp.MainLoop
Gets called every loop iteration inside Rhino's main message loop.
Since: 7.0

Rhino.RhinoApp.LicenseStateChanged
Fires when the license state has changed
Since: 7.0

Rhino.RhinoApp.RdkNewDocument
Monitors when RDK document information is rebuilt.
Since: 5.1

Rhino.RhinoApp.RdkGlobalSettingsChanged
Monitors when RDK global settings are modified.
Since: 5.1

Rhino.RhinoApp.RdkUpdateAllPreviews
Monitors when RDK thumbnails are updated.
Since: 5.1

Rhino.RhinoApp.RdkCacheImageChanged
Monitors when the RDK thumbnail cache images are changed.
Since: 5.1

Rhino.RhinoApp.RendererChanged
Monitors when Rhino's current renderer changes.
Since: 5.1

Rhino.RhinoApp.RdkPlugInUnloading
Monitors when RDK client plug-ins are unloaded.
Since: 5.1

Rhino.RhinoApp.ToolbarFiles
Collection of currently open toolbar files in the application
Since: 5.0

Rhino.RhinoApp.InFullScreen
Verifies that Rhino is running in full screen mode.
Returns: true if Rhino is running full screen, false otherwise.
Since: 6.0

Rhino.RhinoApp.DefaultUiFont
Default font used to render user interface
Since: 6.0

Rhino.RhinoApp.RunningOnVMWare
Verifies that Rhino is running on VMWare
Returns: true if Rhino is running in Windows on VMWare, false otherwise
Since: 6.0

Rhino.RhinoApp.RunningInRdp
Find out if Rhino is running in a remote session
Returns: true if Rhino is running in a RDP session, false otherwise
Since: 6.0

Rhino.RhinoApp.ParseTextField(System.String,Rhino.DocObjects.RhinoObject,Rhino.DocObjects.RhinoObject)
Parses a text field string.
formula: The text formula.
obj: The Rhino object. Value can be IntPtr.Zero.
topParentObject: The parent Rhino object. Value can be IntPtr.Zero.
Returns: The parsed text field if sucessful.
Since: 6.0

Rhino.RhinoApp.ParseTextField(System.String,Rhino.DocObjects.RhinoObject,Rhino.DocObjects.RhinoObject,Rhino.DocObjects.InstanceObject)
Parses a text field string.
formula: The text formula.
obj: The Rhino object. Value can be IntPtr.Zero.
topParentObject: The parent Rhino object. Value can be IntPtr.Zero.
immediateParent: The immediate parent instance object. Value can be IntPtr.Zero.
Returns: The parsed text field if sucessful.
Since: 8.10

Rhino.RhinoApp.PostEnterEvent(System.UInt32,System.Boolean)
Post an enter event to the command line
runtimeDocSerialNumber: Unique serialNumber for the document to post the event to.
bRepeatedEnter: if true, allow multiple enter events to be posted simultaneouslyt.
Since: 8.0

Rhino.RhinoApp.PostCancelEvent(System.UInt32)
Post a cancel event to the command line
runtimeDocSerialNumber: Unique serialNumber for the document to post the event to.
Since: 8.0