Rhino.Runtime.InteropWrappers.ArrayOfTArrayMarshal`1
Allows to marshal an array of arrays without copying the nested arrays to unmanaged memory and without additional calls.
The type to be marshaled.

Rhino.Runtime.InteropWrappers.ArrayOfTArrayMarshal`1.#ctor(System.Collections.Generic.IEnumerable{System.Collections.Generic.IEnumerable{`0}},Rhino.Runtime.InteropWrappers.NullItemsResponse)
Constructs.
arrayOfArray: This parameter can be null. Then, the marshaler will act accordingly.
nestedFirstLevelNulls: Behavior for null nested items.