Rhino.UI.CursorStyle
Standard mouse cursors in Rhino

Rhino.UI.CursorStyle.Default


Rhino.UI.CursorStyle.Wait
Wait

Rhino.UI.CursorStyle.CrossHair


Rhino.UI.CursorStyle.Hand


Rhino.UI.CursorStyle.Rotate


Rhino.UI.CursorStyle.Magnify


Rhino.UI.CursorStyle.ArrowCopy
arrow with +

Rhino.UI.CursorStyle.CrosshairCopy
