Rhino.FileIO.File3dmPlugInData
Represents custom plug-in data, in the 3dm file, written by a plug-in.

Rhino.FileIO.File3dmPlugInData.PlugInId
Gets the id of the plug-in that is associated with this custom data.
Since: 5.0