Rhino.Collections.Point3dList
Represents a list of Rhino.Geometry.Point3d.

Rhino.Collections.Point3dList.#ctor
Initializes a new empty list with default capacity.
Since: 5.0

Rhino.Collections.Point3dList.#ctor(System.Int32)
Initializes a new point list with a preallocated initial capacity.
initialCapacity: The number of added items before which the underlying array will be resized.
Since: 5.0

Rhino.Collections.Point3dList.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Initializes a new point list by copying the values from another set.
collection: The collection to copy from.
Since: 5.0

Rhino.Collections.Point3dList.#ctor(Rhino.Geometry.Point3d[])
Constructs a new point list from values in a point array.
initialPoints: Points to add to the list.
Since: 5.0

Rhino.Collections.Point3dList.BoundingBox
Even though this is a property, it is not a "fast" calculation. Every point is
evaluated in order to get the bounding box of the list.
Since: 5.0

Rhino.Collections.Point3dList.ClosestIndex(Rhino.Geometry.Point3d)
Finds the index of the point that is closest to a test point in this list.
testPoint: point to compare against.
Returns: index of closest point in the list on success. -1 on error.
Since: 5.0

Rhino.Collections.Point3dList.X
Returns an indexer with all X coordinates in this list.
Since: 5.0

Rhino.Collections.Point3dList.Y
Returns an indexer with all Y coordinates in this list.
Since: 5.0

Rhino.Collections.Point3dList.Z
Returns an indexer with all Z coordinates in this list.
Since: 5.0

Rhino.Collections.Point3dList.Add(System.Double,System.Double,System.Double)
Adds a Point3d to the end of the list with given x,y,z coordinates.
x: The X coordinate.
y: The Y coordinate.
z: The Z coordinate.
Since: 5.0

Rhino.Collections.Point3dList.Transform(Rhino.Geometry.Transform)
Applies a transform to all the points in the list.
xform: Transform to apply.
Since: 5.0

Rhino.Collections.Point3dList.SetAllX(System.Double)
Set all the X values for the points to a single value
xValue:
Since: 5.6

Rhino.Collections.Point3dList.SetAllY(System.Double)
Set all the Y values for the points to a single value
yValue:
Since: 5.6

Rhino.Collections.Point3dList.SetAllZ(System.Double)
Set all the Z values for the points to a single value
zValue:
Since: 5.6

Rhino.Collections.Point3dList.ClosestIndexInList(System.Collections.Generic.IList{Rhino.Geometry.Point3d},Rhino.Geometry.Point3d)
Finds the index of the point in a list of points that is closest to a test point.
list: A list of points.
testPoint: Point to compare against.
Returns: Index of closest point in the list on success or -1 on error.
Since: 5.0

Rhino.Collections.Point3dList.ClosestPointInList(System.Collections.Generic.IList{Rhino.Geometry.Point3d},Rhino.Geometry.Point3d)
Finds the point in a list of points that is closest to a test point.
list: A list of points.
testPoint: Point to compare against.
Returns: A point.
Throws System.ArgumentException:
List must contain at least one point and testPoint must be valid.
Since: 5.0

Rhino.Collections.Point3dList.Duplicate
Returns a deep copy of this point list instance.
Returns: The duplicated list.
Since: 6.0

Rhino.Collections.Point3dList.Equals(System.Object)
Overrides the default object equality to compare lists by value.
obj:
Returns: True is objects are exactly equal in value.

Rhino.Collections.Point3dList.Equals(Rhino.Collections.Point3dList)
Determines if the point lists are exactly equal.
other:
Returns: True is objects are exactly equal in value.
Since: 7.1

Rhino.Collections.Point3dList.GetHashCode
Creates a hash code for this object.
Returns: An int that serves as an hash code. This is currently a XOR of all doubles, XORed in line.