Rhino.Input.Custom.GetTorus
Class provides user interface to define a torus.

Rhino.Input.Custom.GetTorus.#ctor
Since: 7.0

Rhino.Input.Custom.GetTorus.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Input.Custom.GetTorus.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 7.0

Rhino.Input.Custom.GetTorus.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.Input.Custom.GetTorus.DefaultSize
Default radius or diameter (based on InDiameterMode)
Since: 7.0

Rhino.Input.Custom.GetTorus.InDiameterMode
Determines if the "size" value is representing a radius or diameter
Since: 7.0

Rhino.Input.Custom.GetTorus.FixInnerRadius
Second radius option. The first radius chosen sets the inner dimension of the torus and the second radius is constrained to be outside of the first radius.
Since: 7.0

Rhino.Input.Custom.GetTorus.InSecondDiameterMode
Second radius option. Determines if the second "size" value is representing a radius or diameter
Since: 7.0

Rhino.Input.Custom.GetTorus.SecondSize
Second radius or diameter (based on InSecondDiameterMode)
Since: 7.0

Rhino.Input.Custom.GetTorus.PromptForMeshDensity
Set true if you are prompting for a mesh or subd torus.
Since: 7.0

Rhino.Input.Custom.GetTorus.VerticalDirectionCount
The number of faces in the vertical direction.
Since: 7.0

Rhino.Input.Custom.GetTorus.VerticalDirectionMinimumCount
The minimum number of faces in the vertical direction.
Since: 7.0

Rhino.Input.Custom.GetTorus.AroundDirectionCount
The number of faces in the around direction.
Since: 7.0

Rhino.Input.Custom.GetTorus.AroundDirectionMinimumCount
The minimum number of faces in the around direction.
Since: 7.0

Rhino.Input.Custom.GetTorus.Get(Rhino.Geometry.Torus@)
Prompt for the getting of a torus.
torus: The torus geometry defined by the user.
Returns: The result of the getting operation.
Since: 7.0

Rhino.Input.Custom.GetTorus.GetMesh(System.Int32@,System.Int32@,Rhino.Geometry.Torus@)
Prompt for the getting of a mesh torus.
verticalFaces: The number of faces in the vertical direction.
aroundFaces: The number of faces in the around direction
torus: The torus geometry defined by the user.
Returns: The result of the getting operation.
Since: 7.0