Rhino.ApplicationSettings.ShortcutKeySettings
Contains static methods and properties to control keyboard shortcut keys

Rhino.ApplicationSettings.ShortcutKeySettings.GetShortcuts
Get all shortcuts registered with Rhino
Returns:
Since: 8.12

Rhino.ApplicationSettings.ShortcutKeySettings.GetDefaults
Get all the default shortcuts registered with Rhino
Returns:
Since: 8.13

Rhino.ApplicationSettings.ShortcutKeySettings.Update(System.Collections.Generic.IEnumerable{Rhino.ApplicationSettings.KeyboardShortcut},System.Boolean)
Add or modify shortcuts with a list or KeyboardShortcut elements
shortcuts:
replaceAll:
Since: 8.12

Rhino.ApplicationSettings.ShortcutKeySettings.GetMacro(Rhino.ApplicationSettings.ShortcutKey)
Get macro associated with a given keyboard shortcut
key:
Returns:
Since: 5.0

Rhino.ApplicationSettings.ShortcutKeySettings.SetMacro(Rhino.ApplicationSettings.ShortcutKey,System.String)
Set macro associated with a keyboard shortcut
key:
macro:
Since: 5.0

Rhino.ApplicationSettings.ShortcutKeySettings.SetMacro(Rhino.UI.KeyboardKey,Rhino.UI.ModifierKey,System.String)
Set a macro for a given key and modifier combination
key:
modifier:
macro:
Since: 8.12

Rhino.ApplicationSettings.ShortcutKeySettings.GetLabel(Rhino.ApplicationSettings.ShortcutKey)
Get the macro label associated with a given keyboard shortcut
key:
Returns:
Since: 8.0

Rhino.ApplicationSettings.ShortcutKeySettings.IsAcceptableKeyCombo(Rhino.UI.KeyboardKey,Rhino.UI.ModifierKey)
Is a key plus modifier combination one that can be used with Rhino
key:
modifier:
Returns:
Since: 8.12