Rhino.FileIO.FileReferenceStatus
Enumerates a list of file statuses.

Rhino.FileIO.FileReferenceStatus.Unknown
Status of a the full path is not known.

Rhino.FileIO.FileReferenceStatus.FullPathValid
Full path is valid.

Rhino.FileIO.FileReferenceStatus.FileNotFound
Unable to locate file.