Rhino.Render.CurrentEnvironmentImpl.On(Rhino.Render.RenderSettings.EnvironmentUsage)
For usage background, this checks if the background style is set to 'Environment'.
For reflection and skylighting, it checks if the relevant custom override is enabled.

Rhino.Render.CurrentEnvironmentImpl.SetOn(Rhino.Render.RenderSettings.EnvironmentUsage,System.Boolean)
Set the given environment override on/off. Only works for reflection and skylighting usages.