Rhino.PrivateMeshCommands.MeshTypes.WeshFace.InvariantOrder(System.Boolean)
Sets the first index in the face as the lowest value.
Optionally also sets the order based on the value of the second and last indices,
so that the resulting value is the second smallest among the two.
flipInvariance: If true, both flipped faces are transformed to the same result
Returns: False if the face direction was left unchanged; otherwise, false.

Rhino.PrivateMeshCommands.MeshTypes.WeshFace.RemoveIndex(System.Int32)
Remove any presence of index from the face.
index: The index to get rid of.
Returns: true if anythiong happened, otherwise false.