Rhino.Geometry.Point
Represents a geometric point.
This is fundamentally a class that derives from
Rhino.Geometry.GeometryBase and contains a single Rhino.Geometry.Point3d location.

Rhino.Geometry.Point.#ctor(Rhino.Geometry.Point3d)
Initializes a new point instance with a location.
location: A position in 3D space.
Since: 5.0

Rhino.Geometry.Point.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor for internal use.
info: Serialization data.
context: Serialization stream.

Rhino.Geometry.Point.Location
Gets or sets the location (position) of this point.
Since: 5.0