Rhino.Render.PostEffects.PostEffectUI
PostEffectUI class provides a way for post effect plug-ins to add ui sections.

Rhino.Render.PostEffects.PostEffectUI.CppPointer
Since: 7.0

Rhino.Render.PostEffects.PostEffectUI.#ctor(System.IntPtr)
Since: 7.0

Rhino.Render.PostEffects.PostEffectUI.Dispose
Since: 7.0

Rhino.Render.PostEffects.PostEffectUI.AddSection(Rhino.UI.Controls.ICollapsibleSection)
Add a section to the UI.
section:
Since: 7.0