Rhino.DocObjects.DimensionObject
Rhino Object that represents dimension geometry and attributes

Rhino.DocObjects.DimensionObject.DimensionStyle
Gets the Rhino.DocObjects.DimensionObject.DimensionStyle
associated with this OrdinateDimensionObject.
Since: 6.0