Rhino.Geometry.ArcCurve
Represent arcs and circles.
ArcCurve.IsCircle returns true if the curve is a complete circle.
Remarks:
Details:
an ArcCurve is a sub-curve of a circle, with a constant speed
parameterization. The parameterization is	an affine linear
reparameterization of the underlying arc	m_arc onto the domain m_t.
A valid ArcCurve has Radius()>0 and  0<AngleRadians()<=2*PI
and a strictly increasing Domain.

Rhino.Geometry.ArcCurve.#ctor
Initializes a new Rhino.Geometry.ArcCurve instance.
Radius is set to 1, position to Origin and Domain to full span (circle).
Since: 5.0

Rhino.Geometry.ArcCurve.#ctor(Rhino.Geometry.ArcCurve)
Initializes a new Rhino.Geometry.ArcCurve instance,
copying values from another Rhino.Geometry.ArcCurve.
other: Another ArcCurve.
Since: 5.0

Rhino.Geometry.ArcCurve.#ctor(Rhino.Geometry.Arc)
Initializes a new Rhino.Geometry.ArcCurve instance,
copying values from another Rhino.Geometry.ArcCurve.Arc.
arc: Another Arc.
Since: 5.0

Rhino.Geometry.ArcCurve.#ctor(Rhino.Geometry.Arc,System.Double,System.Double)
Initializes a new Rhino.Geometry.ArcCurve instance,
copying values from another Rhino.Geometry.ArcCurve.Arc and specifying the
needed parametrization of the arc.
Arc will not be cut again at these parameterizations.
arc: An original arc.
t0: A new Domain.T0 value.
t1: A new Domain.T1 value.
Since: 5.0

Rhino.Geometry.ArcCurve.#ctor(Rhino.Geometry.Circle)
Initializes a new Rhino.Geometry.ArcCurve instance,
copying the shape of a Rhino.Geometry.Circle.
Parameterization will be [0;circle.Circumference]
circle: The original circle.
Since: 5.0

Rhino.Geometry.ArcCurve.#ctor(Rhino.Geometry.Circle,System.Double,System.Double)
Initializes a new Rhino.Geometry.ArcCurve instance,
copying values from a Rhino.Geometry.Circle and specifying the
needed parametrization of the arc.
Circle will not be newly cut at these parameterizations.
circle: A circle.
t0: A new Domain.T0 value.
t1: A new Domain.T1 value.
Since: 5.0

Rhino.Geometry.ArcCurve.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor used in serialization.

Rhino.Geometry.ArcCurve.Arc
Gets the arc that is contained within this ArcCurve.
Since: 5.0

Rhino.Geometry.ArcCurve.IsCompleteCircle
Gets a value indicating whether or not this curve can be represented by a complete circle.
Since: 5.0

Rhino.Geometry.ArcCurve.Radius
Gets the radius of this ArcCurve.
Since: 5.0

Rhino.Geometry.ArcCurve.AngleRadians
Gets the angles of this arc in radians.
Since: 5.0

Rhino.Geometry.ArcCurve.AngleDegrees
Gets the angles of this arc in degrees.
Since: 5.0