Rhino.Render.ImageFileEvent
Since: 5.11

Rhino.Render.ImageFileEvent.Saved
Render image file has been successfully written

Rhino.Render.ImageFileEvent.Loaded
Render image file has been successfully loaded

Rhino.Render.ImageFileEvent.Deleted
Render image file was just deleted