Rhino.Render.PreviewGeometry
PreviewAppearance takes care of construction and destruction of PreviewGeometry

Rhino.Render.PreviewGeometry.CppPointer
CppPointer for PreviewGeometry
Since: 6.0

Rhino.Render.PreviewGeometry.#ctor(System.IntPtr)
Constructor for PreviewGeometry
Since: 6.0

Rhino.Render.PreviewGeometry.SetUpPreview(System.IntPtr,System.IntPtr,System.Boolean)
SetUpPreview
Since: 6.0

Rhino.Render.PreviewGeometry.ElementKind
ElementKind
Since: 6.0