Rhino.Geometry.Dimension.ForceText
OBSOLETE enum do not use.

Rhino.Geometry.Dimension.ForceText.Auto


Rhino.Geometry.Dimension.ForceText.Inside


Rhino.Geometry.Dimension.ForceText.Right


Rhino.Geometry.Dimension.ForceText.Left


Rhino.Geometry.Dimension.ForceText.HintRight


Rhino.Geometry.Dimension.ForceText.HintLeft
