Rhino.Render.Fields.Point2dField
Point2d field value class

Rhino.Render.Fields.Point2dField.#ctor(Rhino.Render.RenderContent,System.IntPtr)
Constructor
renderContent: RenderContent whose Fields owns this filed.
attachToPointer: Existing C++ pointer to attach to.

Rhino.Render.Fields.Point2dField.Value
Gets or sets the field value
Since: 5.1

Rhino.Render.Fields.Point2dField.ValueAsObject
Since: 5.7