Rhino.Geometry.SilhouetteType
Enumerates the different types of silhouettes and their origins.
Since: 6.0

Rhino.Geometry.SilhouetteType.None
None.

Rhino.Geometry.SilhouetteType.Projecting
Boundary of a region that projects to a curve.
The view direction is tangent to the surface over the entire region.

Rhino.Geometry.SilhouetteType.TangentProjects
Tangent silhouette curve where the curve projects to a point (within tolerance).
In this case side_fill[i] is meaningless so it's left unset.

Rhino.Geometry.SilhouetteType.Tangent
Tangent silhouette curve. The view direction is tangent to the surface along the curve.

Rhino.Geometry.SilhouetteType.Crease
Crease on geometry that is a silhouette.

Rhino.Geometry.SilhouetteType.Boundary
Boundary of geometry is always a silhouette.

Rhino.Geometry.SilhouetteType.NonSilhouetteCrease
A non-silhouette crease, meaning both sides are visible.

Rhino.Geometry.SilhouetteType.NonSilhouetteTangent
A non-silhouette tangent edge that is not a crease.

Rhino.Geometry.SilhouetteType.NonSilhouetteSeam
A non-silhouette surface seam.

Rhino.Geometry.SilhouetteType.SectionCut
Intersection with a clipping plane.

Rhino.Geometry.SilhouetteType.MiscellaneousFeature
Miscellaneous curve feature.

Rhino.Geometry.SilhouetteType.DraftCurve
Draft curve is a curve of constant draft angle.