Rhino.Render.FilterContentByUsage
Content collection filter value
Since: 6.9

Rhino.Render.FilterContentByUsage.None
No filter in use.

Rhino.Render.FilterContentByUsage.Used
Display only used contents.

Rhino.Render.FilterContentByUsage.Unused
Display only unused contents.

Rhino.Render.FilterContentByUsage.UsedSelected
Display only contents used by selected objects.