Rhino.FileIO.File3dmWriteOptions
Options used by File3dm.Write

Rhino.FileIO.File3dmWriteOptions.#ctor
Initializes properties to defaults.
Since: 5.9

Rhino.FileIO.File3dmWriteOptions.RenderMeshFlags
[Giulio, 2016 04 01]
Please keep these in sync with ON_BinaryArchive::m_save_3dm_render_mesh_flags
in opennurbs_archive.h

Rhino.FileIO.File3dmWriteOptions.Version
File version. Default is major version number of this assembly version.
Must be in range [2; current version].
Alternatively, 0 is a placeholder for the last valid version.
Rhino can read its current version, plus earlier file versions except 1.
Use latest version when possible.
Since: 5.9

Rhino.FileIO.File3dmWriteOptions.SaveRenderMeshes
Include Render meshes in the file. Default is true
Since: 5.9

Rhino.FileIO.File3dmWriteOptions.EnableRenderMeshes(Rhino.DocObjects.ObjectType,System.Boolean)
Activates saving of render meshes for specific types of objects.
If you do not specify the state for an object type, its default is used.
Specifically, currently SubD mesh saving is disabled by default, while Brep and Extrusion is on.
objectType: The object type. Mostly brep, extrusion and SubD (or their flag combinations) make sense here.
DO NOT specify a 'filter' or sub-object type.
enable: If false, disables saving for this object type.
Since: 6.0

Rhino.FileIO.File3dmWriteOptions.SaveAnalysisMeshes
Include analysis meshes in the file. Default is true
Since: 5.9

Rhino.FileIO.File3dmWriteOptions.EnableAnalysisMeshes(Rhino.DocObjects.ObjectType,System.Boolean)
Activates saving of analysis meshes for specific types of objects.
If you do not specify the state for an object type, its default is used.
Currently SubD mesh saving is disabled by default, while Brep and Extrusion is enabled.
objectType: The object type. Mostly mesh, brep, extrusion and SubD (or their flag combinations) make sense here.
DO NOT specify a 'filter' or sub-object type.
enable: If false, disables saving for this object type.
Since: 6.0

Rhino.FileIO.File3dmWriteOptions.SaveUserData
Include custom user data in the file. Default is true
Since: 5.9