Rhino.FileIO.FileRawReadOptions
Options for reading a Raw file

Rhino.FileIO.FileRawReadOptions.RawModelUnits
Since: 8.0

Rhino.FileIO.FileRawReadOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0