Rhino.Input.Custom.GetSphere.MeshSphereStyle
Mesh sphere styles enumeration.

Rhino.Input.Custom.GetSphere.MeshSphereStyle.UV
UV Sphere.

Rhino.Input.Custom.GetSphere.MeshSphereStyle.Triangle
Icosahedron Sphere.

Rhino.Input.Custom.GetSphere.MeshSphereStyle.Quad
Quad Sphere.