Rhino.ApplicationSettings.CurvatureGraphSettingsState
Represents a snapshot of Rhino.ApplicationSettings.CurvatureGraphSettings.

Rhino.ApplicationSettings.CurvatureGraphSettingsState.CurveHairColor
Gets or sets the curve hair color.
Since: 8.0

Rhino.ApplicationSettings.CurvatureGraphSettingsState.SurfaceUHairColor
Gets or sets the surface U hair color.
Since: 8.0

Rhino.ApplicationSettings.CurvatureGraphSettingsState.SurfaceVHairColor
Gets or sets the surface V hair color.
Since: 8.0

Rhino.ApplicationSettings.CurvatureGraphSettingsState.SrfUHair
Gets or sets the whether to show surface U hairs
Since: 8.0

Rhino.ApplicationSettings.CurvatureGraphSettingsState.SrfVHair
Gets or sets the whether to show surface V hairs
Since: 8.0

Rhino.ApplicationSettings.CurvatureGraphSettingsState.HairScale
Gets or sets the hair scale.
Since: 8.0

Rhino.ApplicationSettings.CurvatureGraphSettingsState.HairDensity
Gets or sets the hair density.
Since: 8.0

Rhino.ApplicationSettings.CurvatureGraphSettingsState.SampleDensity
Gets or sets the sample density.
Since: 8.0