Rhino.Geometry.SweepFrame
Frame types for creating swept surfaces
Since: 7.0

Rhino.Geometry.SweepFrame.Freeform
The cross-section curve rotates to maintain its angle to the rail throughout the sweep.

Rhino.Geometry.SweepFrame.Roadlike
Specify an axis for calculating the 3-D rotation of the cross-section.