Rhino.Geometry.PipeCapMode
Styles used for creating Brep pipes.
Since: 5.0

Rhino.Geometry.PipeCapMode.None
No cap.

Rhino.Geometry.PipeCapMode.Flat
Caps with planar surface.

Rhino.Geometry.PipeCapMode.Round
Caps with hemispherical surface.