Rhino.Geometry.SmoothingCoordinateSystem
The direction of the smoothing used by Curve, Surface, and Mesh Smooth.
Since: 6.0

Rhino.Geometry.SmoothingCoordinateSystem.World
World coordinates

Rhino.Geometry.SmoothingCoordinateSystem.CPlane
Construction plane coordinates

Rhino.Geometry.SmoothingCoordinateSystem.Object
Object u, v, and n coordinates