Rhino.Geometry.SubDHashType
ON_SubDHashType used used to specify what type of SubD information is hashed (topology or geometry).

Rhino.Geometry.SubDHashType.Unset
Unset indicates the hash type still needs to be selected. It is not a valid type
for calculating a hash.

Rhino.Geometry.SubDHashType.Topology
The Topology hash includes component ids, and all topological relationships
between vertices, edges, and faces. If two SubDs have the same topology hash,
then the have identical labeled control net topology.

Rhino.Geometry.SubDHashType.TopologyAndEdgeCreases
The TopologyAndEdgeCreases includes all information in a Topology hash.
The TopologyAndEdgeCreases adds edge crease/smooth attributes.
Many contexts, including face packing and exploding, take edge creases
into account when partitioning a SubD into regions.

Rhino.Geometry.SubDHashType.Geometry
A geometry hash includes all information in a TopologyAndEdgeCreases hash.
The Geometry hash adds vertex tags, vertex control net points,
and nonzero subdivision displacements on vertices, edges, and faces.
If two SubDs have the same geometry hash, then they have identical surface geometry.