Rhino.Render.ChangeQueue.Material
Representation of a Material through the change queue

Rhino.Render.ChangeQueue.Material.MeshInstanceId
Get the material InstanceAncestry
Since: 6.0

Rhino.Render.ChangeQueue.Material.Id
Get the material ID (crc)
Since: 6.0

Rhino.Render.ChangeQueue.Material.MeshIndex
Get mesh index
Since: 6.0