Rhino.Render.PreviewAppearance
PreviewAppearance class

Rhino.Render.PreviewAppearance.CppPointer
Previewappearances c++ pointer
Since: 6.0

Rhino.Render.PreviewAppearance.MetaData
Previewappearance MetaData
Since: 6.0

Rhino.Render.PreviewAppearance.#ctor(System.IntPtr)
Constructor for previewappearance
Since: 6.0

Rhino.Render.PreviewAppearance.Finalize
Destructor for previewappearance

Rhino.Render.PreviewAppearance.Dispose
Dispose for previewappearance
Since: 6.0

Rhino.Render.PreviewAppearance.RotationX
RotationX
Since: 6.0

Rhino.Render.PreviewAppearance.SetRotationX(System.Double)
SetRotationX
Since: 6.0

Rhino.Render.PreviewAppearance.RotationY
RotationY
Since: 6.0

Rhino.Render.PreviewAppearance.SetRotationY(System.Double)
SetRotationY
Since: 6.0

Rhino.Render.PreviewAppearance.Size
Size - used in the UI.  Always meters.
Since: 6.0
7.0

Rhino.Render.PreviewAppearance.Scale
Size - used in the UI.  Always meters.
Since: 7.0

Rhino.Render.PreviewAppearance.SceneScale
Scene size - the actual size that is rendered
Since: 7.0

Rhino.Render.PreviewAppearance.SetSize(System.Double)
SetSize
Since: 6.0
7.0

Rhino.Render.PreviewAppearance.RotationType
RotationType
Since: 6.0

Rhino.Render.PreviewAppearance.SetRotationType(Rhino.Render.IRhRdkPreviewSceneServer_eRotationType)
SetRotationType
Since: 6.0

Rhino.Render.PreviewAppearance.Geometry
Geometry
Since: 6.0

Rhino.Render.PreviewAppearance.FromMetaData(Rhino.Render.DataSources.MetaData)
Copy data from MetaData to PreviewAppearance
Since: 6.0

Rhino.Render.PreviewAppearance.ToMetaData
Copy PreviewAppearance to MetaData
Since: 6.0

Rhino.Render.PreviewAppearance.ToMetaData(Rhino.Render.MetaDataProxy)
Copy PreviewAppearance to MetaData
Since: 6.8

Rhino.Render.PreviewAppearance.Background
Background
Since: 6.0

Rhino.Render.PreviewAppearance.Lighting
Lighting
Since: 6.0