Rhino.Runtime.InteropWrappers.ClassArrayString
Wrapper for a C++ ON_ClassArray<ON_wString>
If you are not writing C++ code then this class is not for you.

Rhino.Runtime.InteropWrappers.ClassArrayString.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.
Since: 6.0

Rhino.Runtime.InteropWrappers.ClassArrayString.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.
Since: 6.0

Rhino.Runtime.InteropWrappers.ClassArrayString.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.ClassArrayString instance.
Since: 6.0

Rhino.Runtime.InteropWrappers.ClassArrayString.Count
Gets the number of strings in this array.
Since: 6.0

Rhino.Runtime.InteropWrappers.ClassArrayString.Add(System.String)
Adds a string to the list.
s: A string to add.
Since: 6.0

Rhino.Runtime.InteropWrappers.ClassArrayString.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.ClassArrayString.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 6.0

Rhino.Runtime.InteropWrappers.ClassArrayString.Dispose(System.Boolean)
disposing:

Rhino.Runtime.InteropWrappers.ClassArrayString.ToArray
Copies the unmanaged array to a managed counterpart.
Returns: The managed array.
Since: 6.0