Rhino.Geometry.PointCloudItem
Represents a single item in a point cloud. A PointCloud item
always has a location, but it has an optional normal vector and color.

Rhino.Geometry.PointCloudItem.Location
Gets or sets the location of this point cloud item.
Since: 5.0

Rhino.Geometry.PointCloudItem.X
Gets or sets the X component of this point cloud item location.
Since: 5.0

Rhino.Geometry.PointCloudItem.Y
Gets or sets the Y component of this point cloud item location.
Since: 5.0

Rhino.Geometry.PointCloudItem.Z
Gets or sets the Z component of this point cloud item location.
Since: 5.0

Rhino.Geometry.PointCloudItem.Normal
Gets or sets the normal vector for this point cloud item.
If this point cloud item does not have a normal vector,
Vector3d.Unset is returned.
Since: 5.0

Rhino.Geometry.PointCloudItem.Color
Gets or sets the color of this point cloud item.
If this point cloud item does not have a color, System.Drawing.Color.Black is returned.
Since: 5.0

Rhino.Geometry.PointCloudItem.Hidden
Gets or sets the hidden flag of this point cloud item.
If this point cloud item does not have a hidden flag, false is returned.
Since: 5.0

Rhino.Geometry.PointCloudItem.PointValue
Gets or set the extra value of this point cloud item.
The extra value can be used to store a user-defined value, such as intensity.
If this point cloud item does not have an extra value, RhinoMath.UnsetValue is returned.
Since: 7.5

Rhino.Geometry.PointCloudItem.Index
Gets the index of this point cloud item.
Since: 5.0