Rhino.FileIO.FileSlc
Support for writing slice (SLC) file format

Rhino.FileIO.FileSlc.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileSlcWriteOptions)
Write a SLC file based on the contents of a RhinoDoc
filename: path to write a file to
doc: document to get geometry from
options: options used for generating the SLC file
Returns: true on success
Since: 7.0