Rhino.FileIO.File3dmViewTable
Provides access to views in the 3dm file.

Rhino.FileIO.File3dmViewTable.FindName(System.String)
Finds a ViewInfo given its name.
name: The name of the ViewInfo to be searched.
Returns: An ViewInfo, or null on error.
Since: 6.0

Rhino.FileIO.File3dmViewTable.IndexOf(Rhino.DocObjects.ViewInfo)
Returns the index of the current ViewInfo.
item: The item to be searched.
Returns: The index of the ViewInfo.
Since: 6.0

Rhino.FileIO.File3dmViewTable.Delete(System.Int32)
Removes an item.
index: The index of the item to remove.
Returns: True if the item was removed.
Since: 6.0

Rhino.FileIO.File3dmViewTable.Item(System.Int32)
Gets the view info at an index. The set method always throws NotSupportedException.
index: The index of the item to search for.
Returns: A non-null instance, or an exception is thrown.
Throws System.ArgumentOutOfRangeException: If index is invalid.

Rhino.FileIO.File3dmViewTable.Add(Rhino.DocObjects.ViewInfo)
Adds a
item:
Since: 6.0

Rhino.FileIO.File3dmViewTable.Clear
Removes all items from the table.
Since: 6.0

Rhino.FileIO.File3dmViewTable.Contains(Rhino.DocObjects.ViewInfo)
Returns an indication of the presence of a view in the table.
item: The view to check.
Returns: true if the item is in the table; false otherwise.
Since: 6.0

Rhino.FileIO.File3dmViewTable.CopyTo(Rhino.DocObjects.ViewInfo[],System.Int32)
Copies the content of the table to an array.
array:
arrayIndex:
Since: 6.0

Rhino.FileIO.File3dmViewTable.Count
Gets the amount of items in the table.
Since: 6.0

Rhino.FileIO.File3dmViewTable.Delete(Rhino.DocObjects.ViewInfo)
Deletes an item.
item:
Returns:
Since: 6.0

Rhino.FileIO.File3dmViewTable.GetEnumerator
Returns an enumerator that yields all views in the table.
Returns: An enumerator.
Since: 6.0

Rhino.FileIO.File3dmViewTable.System#Collections#IEnumerable#GetEnumerator
Since: 6.0