Rhino.Geometry.CurveEvaluationSide
Defines enumerated values for the options that defines a curve evaluation side when evaluating kinks.
Since: 5.0

Rhino.Geometry.CurveEvaluationSide.Default
The default evaluation side.

Rhino.Geometry.CurveEvaluationSide.Below
The below evaluation side.

Rhino.Geometry.CurveEvaluationSide.Above
The above evaluation side.