Rhino.Geometry.SweepRebuild
Rebuild types for creating swept surfaces
Since: 6.16

Rhino.Geometry.SweepRebuild.None
Do not simplify cross section curves.

Rhino.Geometry.SweepRebuild.Rebuild
Rebuild cross section curves through points.

Rhino.Geometry.SweepRebuild.Refit
Refit cross section curves to tolerance.