Rhino.UI.Controls.ContentUI
[AddCustomUISections]
This class represents the user interface (UI) of a content. A content's UI appears inside
an editor which is represented by IRhRdkContentEditor.The UI is the part of the editor which
allows the user to view and modify the persistent state of the selected content(s).
This interface is implemented by RDK internally in the core content class, CRhRdkCoreContent.
If you do not override CRhRdkCoreContent::CreateUI() you do not have to concern yourself with
the details.If however, you do want to override CreateUI() to create your own custom UI, then
you must derive your UI class from CRhRdkCustomContentUI and implement this interface to support
your own UI design. \note CRhRdkCustomContentUI implements some of this interface for you.

Rhino.UI.Controls.ContentUI.CppPointer
Since: 7.11

Rhino.UI.Controls.ContentUI.#ctor(System.IntPtr)
ContentUI constructor
pContentUI:
Since: 7.11

Rhino.UI.Controls.ContentUI.Finalize
ContentUI destructor

Rhino.UI.Controls.ContentUI.Dispose
Since: 7.11

Rhino.UI.Controls.ContentUI.Uuid
Get the unique identifier of the UI.
Returns:
Since: 7.11

Rhino.UI.Controls.ContentUI.IsShown
Returns true if the UI is being shown, else false
Returns:
Since: 7.11

Rhino.UI.Controls.ContentUI.IsCreated
Returns true if the UI is created, else false
Since: 7.11

Rhino.UI.Controls.ContentUI.ContentUIHolder
Returns the holder that contains the UI sections, if this is an expandable
content UI with sections inside holders. Returns null for custom UIs.
Returns:
Since: 7.11

Rhino.UI.Controls.ContentUI.EditorUuid
Get the unique identifier of the editor that the UI is being displayed in.
Returns:
Since: 7.11