Rhino.Render.Fields.Color4fField
Color4f field value class

Rhino.Render.Fields.Color4fField.#ctor(Rhino.Render.RenderContent,System.IntPtr)
Constructor
renderContent: RenderContent whose Fields owns this filed.
attachToPointer: Existing C++ pointer to attach to.

Rhino.Render.Fields.Color4fField.Value
Gets or sets the field value
Since: 5.1

Rhino.Render.Fields.Color4fField.ValueAsObject
Since: 5.7

Rhino.Render.Fields.Color4fField.SystemColorValue
Gets or sets the field value
Since: 5.1