Rhino.Geometry.Torus
Represents the value of a plane and two radii in a torus that is oriented in three-dimensional space.

Rhino.Geometry.Torus.Unset
Gets an invalid Torus.
Since: 5.0

Rhino.Geometry.Torus.#ctor(Rhino.Geometry.Plane,System.Double,System.Double)
Initializes a new Torus from base pane and two radii.
basePlane: Base plane for major radius circle.
majorRadius: Radius of circle that lies at the heart of the torus.
minorRadius: Radius of torus section.
Since: 5.0

Rhino.Geometry.Torus.IsValid
Gets a value indicating whether this torus is valid.
Since: 5.0

Rhino.Geometry.Torus.Plane
Gets or sets the plane for the torus large circle.
Since: 5.0

Rhino.Geometry.Torus.MajorRadius
Gets or sets the radius of the circle that lies at the heart of the torus.
Since: 5.0

Rhino.Geometry.Torus.MinorRadius
Gets or sets the radius of the torus section.
Since: 5.0

Rhino.Geometry.Torus.ToNurbsSurface
Converts this torus to its NURBS surface representation.
This is synonymous with calling Rhino.Geometry.NurbsSurface.CreateFromTorus(Rhino.Geometry.Torus).
Returns: A NURBS surface representation of this torus, or null on error.
Since: 5.0

Rhino.Geometry.Torus.ToRevSurface
Converts this torus to a surface of revolution representation.
This is synonymous with calling Rhino.Geometry.RevSurface.CreateFromTorus(Rhino.Geometry.Torus).
Returns: A surface of revolution representation of this torus, or null on error.
Since: 5.0

Rhino.Geometry.Torus.ToBrep
Converts this torus to a Brep.
This is synonymous with calling Rhino.Geometry.Brep.CreateFromTorus(Rhino.Geometry.Torus).
Returns: A Brep representation of this torus, or null on error.
Since: 8.1

Rhino.Geometry.Torus.EpsilonEquals(Rhino.Geometry.Torus,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:
Since: 5.4