Rhino.Geometry.InstanceDefinitionGeometry
Represents a block definition in a File3dm. This is the same as
Rhino.DocObjects.InstanceDefinition, but not associated with a RhinoDoc.

Rhino.Geometry.InstanceDefinitionGeometry.#ctor(System.Guid,Rhino.RhinoDoc)
This is here if we make InstanceDefinition derive from InstanceDefinitionGeometry.
DO NOT USE unless that becomes true.

Rhino.Geometry.InstanceDefinitionGeometry.#ctor
Initializes a new block definition.
Since: 5.0

Rhino.Geometry.InstanceDefinitionGeometry.Description
Gets or sets the description of the definition.
Since: 5.0

Rhino.Geometry.InstanceDefinitionGeometry.Url
Gets or sets the URL or hyperlink of the definition.
Since: 7.0

Rhino.Geometry.InstanceDefinitionGeometry.UrlDescription
Gets or sets the description of the URL or hyperlink of the definition.
Since: 7.0

Rhino.Geometry.InstanceDefinitionGeometry.SourceArchive
Gets the full file path for linked instance definitions.
Since: 8.0

Rhino.Geometry.InstanceDefinitionGeometry.ComponentType
Returns Rhino.DocObjects.ModelComponentType.InstanceDefinition.
Since: 6.0

Rhino.Geometry.InstanceDefinitionGeometry.GetObjectIds
Returns the unique identifiers of all objects that are part of this instance definition's geometry table.
Returns: An array of System.Guid values representing the object IDs in the instance geometry table.
Since: 5.6

Rhino.Geometry.InstanceDefinitionGeometry.SetUserString(System.String,System.String)
Attach a user string (key,value combination) to this geometry.
key: id used to retrieve this string.
value: string associated with key.
Returns: true on success.
Since: 8.9

Rhino.Geometry.InstanceDefinitionGeometry.GetUserString(System.String)
Gets user string from this geometry.
key: id used to retrieve the string.
Returns: string associated with the key if successful. null if no key was found.
Since: 8.9

Rhino.Geometry.InstanceDefinitionGeometry.UserStringCount
Gets the amount of user strings.
Since: 8.9

Rhino.Geometry.InstanceDefinitionGeometry.GetUserStrings
Gets a copy of all (user key string, user value string) pairs attached to this geometry.
Returns: A new collection.
Since: 8.9

Rhino.Geometry.InstanceDefinitionGeometry.DeleteUserString(System.String)
Deletes the user string with the specified key from this geometry.
key: The key of the user string to delete.
Returns: True if the user string was deleted or did not exist; otherwise, false.
Since: 8.9

Rhino.Geometry.InstanceDefinitionGeometry.DeleteAllUserStrings
Deletes all user strings attached to this geometry.
Since: 8.9