Rhino.Render.Projection
When a mapping primitive, like a plane, sphere, box,
or cylinder, is used, there are two projection options.
If m_type = srfp_mapping, then m_projection is ignored.
Since: 8.15

Rhino.Render.Projection.None
None

Rhino.Render.Projection.ClosestPoint
ClosestPoint: world xyz maps to the point on the
mapping primitive that is closest to xyz.
In this case, ON_TextureMapping::Evaluate
ignores the vector argument.

Rhino.Render.Projection.Ray
Ray:   world xyz + world vector defines a world line.
The world line is intersected with the mapping
primitive and the intersection point that is
closest to the world xyz point is used to
calculate the mapping parameters.