Rhino.UI.Controls.ThumbnailUI.ThumbData.PropertyChanged
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.ThumbData.TopLevel
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.ThumbData.InUseColor
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.ThumbData.Content
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.ThumbData.PreviewAppearance
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.ThumbData.Image
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.ThumbData.Children
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.ThumbData.Parent
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.ThumbData.Name
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.ThumbData.Selected
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.ThumbData.Type
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.ThumbData.Intensity
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.ThumbData.Id
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.ThumbData.InUse
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.ThumbData.Tags
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.ThumbData.GetPreviewHeigth(Rhino.Render.DataSources.Sizes,Rhino.Render.DataSources.Shapes)
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.ThumbData.GetPreviewWidth(Rhino.Render.DataSources.Sizes,Rhino.Render.DataSources.Shapes)
Since: 6.0
6.6