Rhino.Render.DataSources.RdkSelectionNavigator.CppPointer
Since: 6.0

Rhino.Render.DataSources.RdkSelectionNavigator.#ctor(System.IntPtr)
Since: 6.0

Rhino.Render.DataSources.RdkSelectionNavigator.Dispose
Since: 6.0

Rhino.Render.DataSources.RdkSelectionNavigator.Clear
Clear the navigator.
Since: 6.0

Rhino.Render.DataSources.RdkSelectionNavigator.Add(Rhino.Render.RenderContentCollection)
Add a selection of contents at the current position.
Clears the navigator ahead of the current position.
selectedContentArray: The selected content
Since: 6.0

Rhino.Render.DataSources.RdkSelectionNavigator.CanGoBackwards
Check the backwards status of the navigator
Returns: True if it is possible to navigate backwards, else false
Since: 6.0

Rhino.Render.DataSources.RdkSelectionNavigator.CanGoForwards
Check the forwards status of the navigator
Returns: True if it is possible to navigate forwards, else false
Since: 6.0

Rhino.Render.DataSources.RdkSelectionNavigator.GoBackwards(Rhino.Render.RenderContentCollection@)
Navigate backwards if possible
selectedContentArray: selectedContentArray is the new selection after navigating backwards
Returns: true on success, else false
Since: 6.0

Rhino.Render.DataSources.RdkSelectionNavigator.GoForwards(Rhino.Render.RenderContentCollection@)
Navigate forwards if possible
selectedContentArray: selectedContentArray is the new selection after navigating forwards
Returns: true on success, else false
Since: 6.0