Rhino.FileIO.File3dmRenderContent


Rhino.FileIO.File3dmRenderContent.#ctor(System.Guid,Rhino.FileIO.File3dm)
Constructor for when the object is top-level.

Rhino.FileIO.File3dmRenderContent.#ctor(System.Guid,Rhino.FileIO.File3dmRenderContent)
Constructor for when the object is a child.

Rhino.FileIO.File3dmRenderContent.Kind
the kind of render content as a string.
Since: 8.0

Rhino.FileIO.File3dmRenderContent.TypeName
The internal name of the content type.
Since: 8.0

Rhino.FileIO.File3dmRenderContent.TypeId
The unique id of the content type.
Since: 8.0

Rhino.FileIO.File3dmRenderContent.RenderEngineId
The content's render-engine id.
Since: 8.0

Rhino.FileIO.File3dmRenderContent.PlugInId
The content's plug-in id.
Since: 8.0

Rhino.FileIO.File3dmRenderContent.GroupId
The content's group id.
Since: 8.0

Rhino.FileIO.File3dmRenderContent.Notes
The content's notes.
Since: 8.0

Rhino.FileIO.File3dmRenderContent.Tags
The content's tags.
Since: 8.0

Rhino.FileIO.File3dmRenderContent.Hidden
True if the content is hidden.
Since: 8.0

Rhino.FileIO.File3dmRenderContent.Reference
True if the content is a reference content.
Since: 8.0

Rhino.FileIO.File3dmRenderContent.AutoDelete
True if the content is automatically deleted when not in use.
Since: 8.0

Rhino.FileIO.File3dmRenderContent.GetParameter(System.String)
Gets a named parameter.
The parameter value or null if not found.
Since: 8.0

Rhino.FileIO.File3dmRenderContent.SetParameter(System.String,System.Object)
Sets a named parameter.
True if the parameter was set, else false.
Since: 8.0

Rhino.FileIO.File3dmRenderContent.File3dmParent
The parent File3dm of the entire hierarchy.
Since: 8.0

Rhino.FileIO.File3dmRenderContent.Parent
The parent content or null if this is the top level object.
Since: 8.0

Rhino.FileIO.File3dmRenderContent.TopLevel
The top-level parent content. Returns this if this is the top-level item.
Since: 8.0

Rhino.FileIO.File3dmRenderContent.Children
Since: 8.0

Rhino.FileIO.File3dmRenderContent.IsTopLevel
True if this is a top-level render content (i.e., has no parent; is not a child).
Since: 8.0

Rhino.FileIO.File3dmRenderContent.IsChild
True if this is a child of another render content (i.e., has a parent; is not top-level).
Since: 8.0

Rhino.FileIO.File3dmRenderContent.ChildSlotName
The render content's child slot name.
Since: 8.0

Rhino.FileIO.File3dmRenderContent.ChildSlotOn(System.String)
True if a particular child slot is 'on'.
Since: 8.0

Rhino.FileIO.File3dmRenderContent.DeleteChild(System.String)
Deletes any existing child with the specified child slot name.
True if successful, else false.
Since: 8.0

Rhino.FileIO.File3dmRenderContent.FindChild(System.String)
The child with the specified child slot name, or null if no such child exists.
Since: 8.0

Rhino.FileIO.File3dmRenderContent.XML(System.Boolean)
Gets the render content's state as an XML string.
Since: 8.0

Rhino.FileIO.File3dmRenderContent.ComponentType
Returns Rhino.DocObjects.ModelComponentType.RenderContent.
Since: 8.0

Rhino.FileIO.File3dmRenderContent._InternalGetConstPointer
