Rhino.Runtime.LicenseTypes
Different licensing modes that Rhino can run in
Since: 6.0

Rhino.Runtime.LicenseTypes.Undefined
Licensing mode not define

Rhino.Runtime.LicenseTypes.Standalone
Standalone license installed on this computer.

Rhino.Runtime.LicenseTypes.ZooAutoDetect
Classic Zoo license with the Zoo server automatically detected at runtime.

Rhino.Runtime.LicenseTypes.ZooManualDetect
Classic Zoo license with the Zoo server specified by hostname or IP

Rhino.Runtime.LicenseTypes.CloudZoo
Cloud Zoo licenese