Rhino.DocObjects.ObjectPlotColorSource
Defines enumerated values for the source of plotting/printing color of single objects.
Since: 5.0

Rhino.DocObjects.ObjectPlotColorSource.PlotColorFromLayer
use plot color assigned to layer.

Rhino.DocObjects.ObjectPlotColorSource.PlotColorFromObject
use plot color assigned to object.

Rhino.DocObjects.ObjectPlotColorSource.PlotColorFromDisplay
use display color.

Rhino.DocObjects.ObjectPlotColorSource.PlotColorFromParent
for objects with parents (like objects in instance references, use parent plot color)
if no parent, treat as plot_color_from_layer.