Rhino.DocObjects.Tables.InstanceDefinitionTableEventArgs.Document
Since: 5.3

Rhino.DocObjects.Tables.InstanceDefinitionTableEventArgs.EventType
Since: 5.3

Rhino.DocObjects.Tables.InstanceDefinitionTableEventArgs.InstanceDefinitionIndex
Since: 5.3

Rhino.DocObjects.Tables.InstanceDefinitionTableEventArgs.NewState
Since: 5.3

Rhino.DocObjects.Tables.InstanceDefinitionTableEventArgs.OldState
Since: 5.3