Rhino.Input.StringParserSettings
Parameters for parsing strings

Rhino.Input.StringParserSettings.#ctor
Since: 6.0

Rhino.Input.StringParserSettings.Dispose
Since: 6.0

Rhino.Input.StringParserSettings.DefaultParseSettings
- The default settings parse just about everything in
a reasonable way.
- Any angle values with unspecified units will be
treated as radians. Angles without units can be
encountered while parsing formulas, lengths and
points and need to be thoughtfully considered in
most parsing situations.
Since: 6.0

Rhino.Input.StringParserSettings.ParseSettingsRadians
- The default settings parse just about everything in
a reasonable way.
- Any angle values with unspecified units will be
treated as radians.Angles without units can be
encountered while parsing formulas, lengths and
points and need to be thoughtfully considered in
most parsing situations.
Since: 6.0

Rhino.Input.StringParserSettings.ParseSettingsDegrees
- The default settings parse just about everything in
a reasonable way.
- Any angle values with unspecified units will be
treated as degrees.Angles without units can be
encountered while parsing formulas, lengths and
points and need to be thoughtfully considered in
most parsing situations.
Since: 6.0

Rhino.Input.StringParserSettings.ParseSettingsIntegerNumber
- The integer settings parse and optional unary + or unary - and
then parses one or more digits.Parsing stops after the last digit.
Since: 6.0

Rhino.Input.StringParserSettings.ParseSettingsRationalNumber
- The rational number settings parse and optional unary + or unary -
and then parse one or more digits.If a rational number fraction
bar follows the last digit in the numerator, then it is parsed
and an integer denominator is parsed.The denominator cannot
have a unary + or - preceding the digits.Parsing stops after
the last digit in the denominator.
Since: 6.0

Rhino.Input.StringParserSettings.ParseSettingsDoubleNumber
- The double number settings parse and optional unary + or unary -
and then parse a number that can be integer, decimal, or
scientific e notation.
Since: 6.0

Rhino.Input.StringParserSettings.ParseSettingsRealNumber
- The real number settings parse and optional unary + or unary -
and then parse a number that can be integer, decimal,
scientific e notation or pi.
Since: 6.0

Rhino.Input.StringParserSettings.ParseSettingsEmpty
- ON_ParseSetting::FalseSettings has all parsing options
set to false.
- A common use of ON_ParseSettings FalseSettings is to initialize
ON_ParseSettings classes that are used to report what happened
during parsing.Any parsing results value set to true after
parsing indicates that type of parsing occurred.
Since: 6.0

Rhino.Input.StringParserSettings.DefaultAngleUnitSystem
Since: 6.0

Rhino.Input.StringParserSettings.DefaultLengthUnitSystem
Since: 6.0

Rhino.Input.StringParserSettings.SetAllFieldsToFalse
Since: 6.0

Rhino.Input.StringParserSettings.SetAllExpressionSettingsToFalse
Since: 6.0

Rhino.Input.StringParserSettings.ParseLeadingWhiteSpace
Since: 6.0

Rhino.Input.StringParserSettings.ParseArithmeticExpression
Since: 6.0

Rhino.Input.StringParserSettings.ParseMathFunctions
Since: 6.0

Rhino.Input.StringParserSettings.ParseExplicitFormulaExpression
Since: 6.0

Rhino.Input.StringParserSettings.ParseUnaryMinus
Since: 6.0

Rhino.Input.StringParserSettings.ParseUnaryPlus
Since: 6.0

Rhino.Input.StringParserSettings.ParseSignificandIntegerPart
Since: 6.0

Rhino.Input.StringParserSettings.ParseSignificandFractionalPart
Since: 6.0

Rhino.Input.StringParserSettings.ParseSignificandDigitSeparators
Since: 6.0

Rhino.Input.StringParserSettings.ParseScientificENotation
Since: 6.0

Rhino.Input.StringParserSettings.ParseDAsExponentInScientificENotation
Since: 6.0

Rhino.Input.StringParserSettings.ParseFullStopAsDecimalPoint
Since: 6.0

Rhino.Input.StringParserSettings.ParseFullStopAsDigitSeparator
Since: 6.0

Rhino.Input.StringParserSettings.ParseCommaAsDecimalPoint
Since: 6.0

Rhino.Input.StringParserSettings.ParseCommaAsDigitSeparator
Since: 6.0

Rhino.Input.StringParserSettings.ParseSpaceAsDigitSeparator
Since: 6.0

Rhino.Input.StringParserSettings.ParseHyphenMinusAsNumberDash
Since: 6.0

Rhino.Input.StringParserSettings.ParseHyphenAsNumberDash
Since: 6.0

Rhino.Input.StringParserSettings.ParseRationalNumber
Since: 6.0

Rhino.Input.StringParserSettings.ParsePi
Since: 6.0

Rhino.Input.StringParserSettings.ParseMultiplication
Since: 6.0

Rhino.Input.StringParserSettings.ParseDivision
Since: 6.0

Rhino.Input.StringParserSettings.ParseAddition
Since: 6.0

Rhino.Input.StringParserSettings.ParseSubtraction
Since: 6.0

Rhino.Input.StringParserSettings.ParsePairedParentheses
Since: 6.0

Rhino.Input.StringParserSettings.ParseIntegerDashFraction
Since: 6.0

Rhino.Input.StringParserSettings.ParseFeetInches
Since: 6.0

Rhino.Input.StringParserSettings.ParseArcDegreesMinutesSeconds
Since: 6.0

Rhino.Input.StringParserSettings.ParseSurveyorsNotation
Since: 6.0

Rhino.Input.StringParserSettings.PreferedLocaleId
Since: 6.0