Rhino.Render.RenderPanels
This class is used to extend the standard Render user interface

Rhino.Render.RenderPanels.FromRenderSessionId(Rhino.PlugIns.PlugIn,System.Type,System.Guid)
Get the instance of a render panel associated with a specific render
session, this is useful when it is necessary to update a control from a
Rhino.Render.RenderPipeline
plugIn:
The plug-in that registered the custom user interface
panelType:
The type of panel to return
renderSessionId:
The Rhino.Render.RenderPipeline.RenderSessionId of a specific render
session.
Returns:
Returns the custom panel object if found; otherwise null is returned.
Since: 5.11

Rhino.Render.RenderPanels.RegisterPanel(Rhino.PlugIns.PlugIn,Rhino.Render.RenderPanelType,System.Type,System.String,System.Boolean,System.Boolean)
Register custom render user interface with Rhino.  This should only be
done in Rhino.PlugIns.RenderPlugIn.RegisterRenderPanels(Rhino.Render.RenderPanels).  Panels
registered after Rhino.PlugIns.RenderPlugIn.RegisterRenderPanels(Rhino.Render.RenderPanels) is called
will be ignored.
plugin:
The plug-in providing the custom user interface
renderPanelType:
See Rhino.Render.RenderPanelType for supported user interface types.
panelType:
The type of object to be created and added to the render container.
caption:
The caption for the custom user interface.
alwaysShow:
If true the custom user interface will always be visible, if false then
it may be hidden or shown as requested by the user.
initialShow:
Initial visibility state of the custom user interface control.
Since: 5.11
7.0

Rhino.Render.RenderPanels.RegisterPanel(Rhino.PlugIns.PlugIn,Rhino.Render.RenderPanelType,System.Type,System.Guid,System.String,System.Boolean,System.Boolean,Rhino.Render.RenderPanels.ExtraSidePanePosition)
Register custom render user interface with Rhino.  This should only be done in
Rhino.PlugIns.RenderPlugIn.RegisterRenderPanels(Rhino.Render.RenderPanels).
Panels registered after Rhino.PlugIns.RenderPlugIn.RegisterRenderPanels(Rhino.Render.RenderPanels) is called will be ignored.
plugin: The plug-in providing the custom user interface
renderPanelType: See Rhino.Render.RenderPanelType for supported user interface types.
panelType: The type of object to be created and added to the render container.
renderEngineId: The render engine id allowing the UI to be shown.
caption: The caption for the custom user interface.
alwaysShow: If true the custom user interface will always be visible, if false then
it may be hidden or shown as requested by the renderer.
initialShow: Initial visibility state of the custom user interface control.
pos: The position to dock the extra side pane at.
Since: 8.0

Rhino.Render.RenderPanels.RegisterPanel(Rhino.PlugIns.PlugIn,Rhino.Render.RenderPanelType,System.Type,System.Guid,System.String,System.Boolean,System.Boolean)
Register custom render user interface with Rhino.  This should only be done in
Rhino.PlugIns.RenderPlugIn.RegisterRenderPanels(Rhino.Render.RenderPanels).
Panels registered after Rhino.PlugIns.RenderPlugIn.RegisterRenderPanels(Rhino.Render.RenderPanels) is called will be ignored.
plugin: The plug-in providing the custom user interface
renderPanelType: See Rhino.Render.RenderPanelType for supported user interface types.
panelType: The type of object to be created and added to the render container.
renderEngineId: The render engine id allowing the UI to be shown.
caption: The caption for the custom user interface.
alwaysShow: If true the custom user interface will always be visible, if false then
it may be hidden or shown as requested by the renderer.
initialShow: Initial visibility state of the custom user interface control.
Since: 7.0