Rhino.ApplicationSettings.WidgetColor
Contains enumerated constant values to represent logical colors associated with elements of the user interface.

Rhino.ApplicationSettings.WidgetColor.UAxisColor
The color of the mapping widget u-axis.

Rhino.ApplicationSettings.WidgetColor.VAxisColor
The color of the mapping widget v-axis..

Rhino.ApplicationSettings.WidgetColor.WAxisColor
The color of the mapping widget w-axis.