Rhino.FileIO.FileStp
Support for writing STEP (STP) file format

Rhino.FileIO.FileStp.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileStpWriteOptions)
Write a STP file based on the contents of a RhinoDoc
filename: path to write a file to
doc: document to get geometry from
options: options used for generating the STP file
Returns: true on success
Since: 7.0

Rhino.FileIO.FileStp.Read(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileStpReadOptions)
Read a Stp file into a RhinoDoc
path: path to read a file from
doc: document to import geometry into
options: options used for importing the Stp file
Returns: true on success
Since: 8.0