Rhino.Display.DisplayPipelineAttributes.ClippingEdgeColorUse
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ClippingEdgeColorUse.PlaneColor
Uses the clipping plane's color (object or layer).

Rhino.Display.DisplayPipelineAttributes.ClippingEdgeColorUse.SolidColor
Solid color

Rhino.Display.DisplayPipelineAttributes.ClippingEdgeColorUse.ObjectColor
Uses the object's color (object or layer).