Rhino.Input.Custom.GetOption
If you want to explicitly get string input, then use GetString class with
options. If you only want to get options, then use this class (GetOption)

Rhino.Input.Custom.GetOption.#ctor
Since: 5.0

Rhino.Input.Custom.GetOption.Get
Call to get an option. A return value of "option" means the user selected
a valid option. Use Option() the determine which option.
Returns: If the user chose an option, then Rhino.Input.GetResult.Option; another enumeration value otherwise.
Since: 5.0