Rhino.Geometry.Point3dGrid
Represents a rectangular grid of 3D points.

Rhino.Geometry.Point3dGrid.#ctor
Initializes a rectangular grid of points, with no points in it.
Since: 5.0

Rhino.Geometry.Point3dGrid.#ctor(System.Int32,System.Int32)
Initializes a rectangular grid of points with a given number of columns and rows.
rows: An amount of rows.
columns: An amount of columns.
Since: 5.0

Rhino.Geometry.Point3dGrid.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor for internal use.
info: Serialization data.
context: Serialization stream.