Rhino.FileIO.FileEps
Support for reading eps file format

Rhino.FileIO.FileEps.Read(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileEpsReadOptions)
Read a Eps file into a RhinoDoc
path: path to read a file from
doc: document to import geometry into
options: options used for importing the Ai file
Returns: true on success
Since: 8.0