Rhino.Runtime.RhinoAccounts.RhinoAccountsException
Base exception for all Rhino Accounts operations.

Rhino.Runtime.RhinoAccounts.RhinoAccountsException.#ctor(System.String,System.Exception)
Generates a new instance of the exception.
message: The message of the exception.
innerException: The inner exception.
Since: 7.0

Rhino.Runtime.RhinoAccounts.RhinoAccountsException.#ctor(System.Exception)
Generates a new instance of the exception.
innerException: The inner exception.
Since: 7.0