Rhino.DocObjects.Font
Defines a format for text.

Rhino.DocObjects.Font.#ctor(System.String)
Since: 6.0

Rhino.DocObjects.Font.#ctor(System.String,Rhino.DocObjects.Font.FontWeight,Rhino.DocObjects.Font.FontStyle,System.Boolean,System.Boolean)
Since: 6.0

Rhino.DocObjects.Font.#ctor(System.String,Rhino.DocObjects.Font.FontWeight,Rhino.DocObjects.Font.FontStyle,Rhino.DocObjects.Font.FontStretch,System.Boolean,System.Boolean)
Since: 8.0

Rhino.DocObjects.Font.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor for internal use.
info: Serialization data.
context: Serialization stream.
Since: 8.0

Rhino.DocObjects.Font.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Populates a System.Runtime.Serialization.SerializationInfo with the data needed to serialize the target object.
info: The System.Runtime.Serialization.SerializationInfo to populate with data.
context: The destination (see System.Runtime.Serialization.StreamingContext) for this serialization.
Since: 8.0

Rhino.DocObjects.Font.FromQuartetProperties(System.String,System.Boolean,System.Boolean)
Since: 6.7

Rhino.DocObjects.Font.FromRichTextProperties(System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Returns a font with the requested rich-text (family) name, preserving that name even
when the font is not installed on the current machine. If an installed font matches it
is returned; otherwise a "not on device" managed font that keeps the requested name is
returned (rendered with a fallback quartet). Use this to author a font by name on a
machine that does not have it installed: the Font constructor and
Rhino.DocObjects.Font.FromQuartetProperties(System.String,System.Boolean,System.Boolean) both substitute the family in that case, losing the
requested name when the file is written.
richTextFontName: The rich-text font (family) name to store.
bold: True to select the heavier member of the rich-text quartet.
italic: True to select the more slanted member of the rich-text quartet.
underlined: True for underlined text.
strikethrough: True for strikethrough text.
Returns: A font that preserves the requested name, or null if none could be created.
Since: 8.35

Rhino.DocObjects.Font.AvailableFontFaceNames
Since: 5.0

Rhino.DocObjects.Font.InstalledFonts
Since: 6.5

Rhino.DocObjects.Font.InstalledFonts(System.String)
Since: 6.5

Rhino.DocObjects.Font.InstalledFontsAsQuartets
Since: 6.7

Rhino.DocObjects.Font.QuartetName
Since: 6.7

Rhino.DocObjects.Font.EnglishQuartetName
Since: 6.12

Rhino.DocObjects.Font.FaceName
Returns Face name
Since: 5.0

Rhino.DocObjects.Font.EnglishFaceName
Returns English Face name
Since: 6.9

Rhino.DocObjects.Font.LogfontName
Returns Windows LOGFONT Face name
Since: 6.5

Rhino.DocObjects.Font.FamilyPlusFaceName
Returns concatenated Family and Face names
Since: 6.9

Rhino.DocObjects.Font.PostScriptName
Returns the Font PostScriptName - "Apple font name"
Since: 6.5

Rhino.DocObjects.Font.RichTextFontName
Returns the Font RichTextFontName used in RTF strings:
{\\fonttbl...{\\fN RichTextFontName;}...}
Since: 6.5

Rhino.DocObjects.Font.Description
Returns a long description that includes family, face, weight, stretch and style information.
Generally not useful for finding matching fonts.
Since: 6.5

Rhino.DocObjects.Font.Bold
Since: 5.0

Rhino.DocObjects.Font.Italic
Since: 5.0

Rhino.DocObjects.Font.Underlined
Since: 6.0

Rhino.DocObjects.Font.Strikeout
Since: 6.0

Rhino.DocObjects.Font.IsEngravingFont
Since: 6.10

Rhino.DocObjects.Font.IsSymbolFont
Since: 6.5

Rhino.DocObjects.Font.IsSingleStrokeFont
Since: 6.5

Rhino.DocObjects.Font.IsSimulated
Since: 6.5

Rhino.DocObjects.Font.Style
Since: 6.0

Rhino.DocObjects.Font.Weight
Since: 6.0

Rhino.DocObjects.Font.Stretch
Since: 8.0

Rhino.DocObjects.Font.PointSize
Since: 6.0

Rhino.DocObjects.Font.FamilyName
Since: 6.5

Rhino.DocObjects.Font.EnglishFamilyName
Since: 6.9

Rhino.DocObjects.Font.IsInstalled
Is this font installed on the system
Since: 8.7

Rhino.DocObjects.Font.GetSubstituteFont
If this font is not installed on the system, try to find a substitute
Returns:
Since: 8.7