Rhino.UI.Controls.ICollapsibleSection2.OnAttachingToHolder(Rhino.UI.Controls.ICollapsibleSectionHolder2)
Since: 7.4

Rhino.UI.Controls.ICollapsibleSection2.OnAttachedToHolder(Rhino.UI.Controls.ICollapsibleSectionHolder2)
Since: 7.4

Rhino.UI.Controls.ICollapsibleSection2.OnDetachingFromHolder(Rhino.UI.Controls.ICollapsibleSectionHolder2)
Since: 7.4

Rhino.UI.Controls.ICollapsibleSection2.OnDetachedFromHolder(Rhino.UI.Controls.ICollapsibleSectionHolder2)
Since: 7.4

Rhino.UI.Controls.ICollapsibleSection2.EnableHeaderButton(System.Int32,System.Boolean)
Since: 7.4

Rhino.UI.Controls.ICollapsibleSection2.ShowHeaderButton(System.Int32,System.Boolean)
Since: 7.4

Rhino.UI.Controls.ICollapsibleSection2.NewHeaderButtonHandler
Since: 7.4