Rhino.DocObjects.Tables.BitmapTable
Stores the list of bitmaps in a Rhino document.

Rhino.DocObjects.Tables.BitmapTable.ComponentType
Returns Rhino.DocObjects.ModelComponentType.Image.
Since: 6.0

Rhino.DocObjects.Tables.BitmapTable.Item(System.Int32)
Conceptually, the bitmap table is an array of bitmaps.  The operator[]
can be used to get individual bitmaps.
index: zero based array index.
Returns:
Reference to the bitmap.  If index is out of range, then null is
returned. Note that this reference may become invalid after AddBitmap()
is called.

Rhino.DocObjects.Tables.BitmapTable.FindIndex(System.Int32)
Retrieves a BitmapEntry object based on Index. This search type of search is discouraged.
We are moving towards using only IDs for all tables.
index: The index to search for.
Returns: A BitmapEntry object, or null if none was found.
Since: 6.0

Rhino.DocObjects.Tables.BitmapTable.Find(System.String,System.Boolean,System.String@)
This function first attempts to find the file with "name" on the disk.
If it does find it, "fileName" is set to the full path of the file and
the BitmapEntry returned will be null, even if there was a BitmapEntry
with "name" in the bitmap table.
If the function cannot find the file on the disk, it searches the bitmap
table.  If it finds it, the returned BitmapEntry entry will be the entry
in the table with that name.
Additionally, if "createFile" is true, and an entry is found, the file
will be written to the disk and it's full path will be contained in "fileName".
name:
Name of the file to search for including file extension.
createFile:
If this is true, and the file is not found on the disk but is found in
the BitmapTable, then the BitmapEntry will get saved to the Rhino bitmap
file cache and fileName will contain the full path to the cached file.
fileName:
The full path to the current location of this file or an empty string
if the file was not found and/or not extracted successfully.
Returns:
Returns null if "name" was found on the disk.  If name was not found on the disk,
returns the BitmapEntry with the specified name if it is found in the bitmap table
and null if it was not found in the bitmap table.
Since: 5.1

Rhino.DocObjects.Tables.BitmapTable.AddBitmap(System.String,System.Boolean)
Adds a new bitmap with specified name to the bitmap table.
bitmapFilename:
If NULL or empty, then a unique name of the form "Bitmap 01" will be automatically created.
replaceExisting:
If true and the there is already a bitmap using the specified name, then that bitmap is replaced.
If false and there is already a bitmap using the specified name, then -1 is returned.
Returns:
index of new bitmap in table on success. -1 on error.
Since: 5.0

Rhino.DocObjects.Tables.BitmapTable.DeleteBitmap(System.String)
Deletes a bitmap.
bitmapFilename: The bitmap file name.
Returns:
true if successful. false if the bitmap cannot be deleted because it
is the current bitmap or because it bitmap contains active geometry.
Since: 5.0

Rhino.DocObjects.Tables.BitmapTable.Delete(Rhino.DocObjects.BitmapEntry)
Removes the bitmap from the table.
item: The item to remove. Null will always return false.
Returns: True if the item could be deleted; otherwise, false.
Since: 6.0

Rhino.DocObjects.Tables.BitmapTable.ExportToFiles(System.String,System.Int32)
Exports all the bitmaps in the table to files.
directoryPath:
full path to the directory where the bitmaps should be saved.
If NULL, a dialog is used to interactively get the directory name.
overwrite: 0 = no, 1 = yes, 2 = ask.
Returns: Number of bitmaps written.
Since: 5.0

Rhino.DocObjects.Tables.BitmapTable.ExportToFile(System.Int32,System.String)
Writes a bitmap to a file.
index: The index of the bitmap to be written.
path:
The full path, including file name and extension, name of the file to write.
Returns: true if successful.
Since: 5.0