Rhino.DocObjects.CentermarkObject
Rhino Object that represents a centermark geometry and attributes

Rhino.DocObjects.CentermarkObject.CentermarkGeometry
Get the dimension geometry for this object.
Since: 6.0