Rhino.Geometry.BrepRegion
Represents a brep topological region that has sides.

Rhino.Geometry.BrepRegion.Brep
Gets a reference to the Brep this region belongs to.
Since: 5.0

Rhino.Geometry.BrepRegion.Index
Gets the index of region in the RegionTopology array.
Since: 5.0

Rhino.Geometry.BrepRegion.IsFinite
Gets a value indicating whether this region is finite.
Since: 5.0

Rhino.Geometry.BrepRegion.BoundingBox
Gets the region bounding box.
Since: 5.0

Rhino.Geometry.BrepRegion.BoundaryBrep
Gets the boundary of a region as a brep object. If the region is finite,
the boundary will be a closed  manifold brep. The boundary may have more than one
connected component.
Returns: A brep or null on error.
Since: 5.0

Rhino.Geometry.BrepRegion.GetFaceSides
Gets an array of Rhino.Geometry.BrepRegionFaceSide entities delimiting this region.
Returns: An array of region face sides. This array might be empty on failure.
Since: 5.0

Rhino.Geometry.BrepRegion.NonConstOperation
