Rhino.Commands.MostRecentCommandDescription
Stores the macro and display string of the most recent command.

Rhino.Commands.MostRecentCommandDescription.DisplayString
Since: 5.0

Rhino.Commands.MostRecentCommandDescription.Macro
Since: 5.0