Rhino.Display.BlendMode
Defines enumerated constants for display blend modes.
Since: 5.0

Rhino.Display.BlendMode.Zero
Blends using 0.

Rhino.Display.BlendMode.One
Blends using 1.

Rhino.Display.BlendMode.SourceColor
Blends using source color.

Rhino.Display.BlendMode.OneMinusSourceColor
Blends using 1-source color.

Rhino.Display.BlendMode.SourceAlpha
Blends using the source alpha channel.

Rhino.Display.BlendMode.OneMinusSourceAlpha
Blends using 1-the source alpha channel.

Rhino.Display.BlendMode.DestinationAlpha
Blends using the destination alpha channel.

Rhino.Display.BlendMode.OneMinusDestinationAlpha
Blends using 1-the destination alpha channel.

Rhino.Display.BlendMode.DestinationColor
Blends using the destination color.

Rhino.Display.BlendMode.OneMinusDestinationColor
Blends using 1-the destination color.

Rhino.Display.BlendMode.SourceAlphaSaturate
Blends using the source alpha saturation.