Rhino.DocObjects.BitmapEntry
Rhino.DocObjects.Tables.BitmapTable entry

Rhino.DocObjects.BitmapEntry.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
serialization constructor
info:
context:

Rhino.DocObjects.BitmapEntry.ComponentType
Returns Rhino.DocObjects.ModelComponentType.Image.
Since: 6.0

Rhino.DocObjects.BitmapEntry.IsReference
Gets a value indicting whether this bitmap is a referenced bitmap.
Referenced bitmaps are part of referenced documents.
Since: 5.1

Rhino.DocObjects.BitmapEntry.FileName
The name of this bitmap.
Since: 5.1

Rhino.DocObjects.BitmapEntry.Save(System.String)
fileName:
Returns:
Since: 5.1