Rhino.ApplicationSettings.MouseSelectMode
Defines enumerated constant values to indicate a particular window selection mode.
Since: 5.0

Rhino.ApplicationSettings.MouseSelectMode.Crossing
Anything that crosses this window will be selected.

Rhino.ApplicationSettings.MouseSelectMode.Window
Anything that is inside this window will be selected.

Rhino.ApplicationSettings.MouseSelectMode.Combo
Drag a rectangle from left to right for window select. Drag a rectangle from right to left for crossing select.