Rhino.Input.Custom.CommandLineOption.IsValidOptionName(System.String)
Test a string to see if it can be used as an option name in any of the RhinoGet::AddCommandOption...() functions.
optionName: The string to be tested.
Returns: true if string can be used as an option name.
Since: 5.0

Rhino.Input.Custom.CommandLineOption.IsValidOptionValueName(System.String)
Test a string to see if it can be used as an option value in RhinoGet::AddCommandOption,
RhinoGet::AddCommandOptionToggle, or RhinoGet::AddCommandOptionList.
optionValue: The string to be tested.
Returns: true if string can be used as an option value.
Since: 5.0

Rhino.Input.Custom.CommandLineOption.Index
Since: 5.0

Rhino.Input.Custom.CommandLineOption.OptionType
The type of this command line option
Since: 8.0

Rhino.Input.Custom.CommandLineOption.EnglishName
The English command option name
Since: 5.0

Rhino.Input.Custom.CommandLineOption.LocalName
The localized command option name
Since: 6.24

Rhino.Input.Custom.CommandLineOption.StringOptionValue
Assigned by RhinoGet.Get if an option value is specified in a script or by a command window control.
Since: 6.24

Rhino.Input.Custom.CommandLineOption.CurrentListOptionIndex
Since: 5.0

Rhino.Input.Custom.CommandLineOption.ListOptions(System.Boolean)
If this OptionType is a list, then the option should contain a list of values
that the user can pick from.
english: return the English or local versions of the list options
Returns:
Since: 8.0

Rhino.Input.Custom.CommandLineOption.ToggleValues(System.Boolean,System.String@,System.String@)
english:
offValue:
onValue:
Since: 8.0

Rhino.Input.Custom.CommandLineOption.CurrentToggleValue
Since: 8.0

Rhino.Input.Custom.CommandLineOption.CurrentNumericValue
Since: 8.0