Rhino.Geometry.Collections.MeshTopologyVertexList
Provides access to the mesh topology vertices of a mesh. Topology vertices are
sets of vertices in the MeshVertexList that can topologically be considered the
same vertex.

Rhino.Geometry.Collections.MeshTopologyVertexList.Count
Gets or sets the number of mesh topology vertices.
Since: 5.0

Rhino.Geometry.Collections.MeshTopologyVertexList.Item(System.Int32)
Gets or sets the vertex at the given index. Setting a location adjusts all vertices
in the mesh's vertex list that are defined by this topological vertex
The index must be valid or an IndexOutOfRangeException will be thrown.
index: Index of topology vertex to access.
Returns: The topological vertex at [index].

Rhino.Geometry.Collections.MeshTopologyVertexList.TopologyVertexIndex(System.Int32)
Gets the topology vertex index for an existing mesh vertex in the mesh's
VertexList.
vertexIndex: Index of a vertex in the Mesh.Vertices.
Returns: Index of a topology vertex in the Mesh.TopologyVertices.
Since: 5.0

Rhino.Geometry.Collections.MeshTopologyVertexList.MeshVertexIndices(System.Int32)
Gets all indices of the mesh vertices that a given topology vertex represents.
topologyVertexIndex: Index of a topology vertex in Mesh.TopologyVertices to query.
Returns:
Indices of all vertices that in Mesh.Vertices that a topology vertex represents.
Since: 5.0

Rhino.Geometry.Collections.MeshTopologyVertexList.IndicesFromFace(System.Int32)
Returns TopologyVertexIndices for a given mesh face index.
faceIndex: The index of a face to query.
Returns: An array of vertex indices.
Since: 5.0

Rhino.Geometry.Collections.MeshTopologyVertexList.ConnectedTopologyVertices(System.Int32)
Gets all topological vertices that are connected to a given vertex.
topologyVertexIndex: index of a topology vertex in Mesh.TopologyVertices.
Returns:
Indices of all topological vertices that are connected to this topological vertex.
null if no vertices are connected to this vertex.
Since: 5.0

Rhino.Geometry.Collections.MeshTopologyVertexList.ConnectedTopologyVertices(System.Int32,System.Boolean)
Gets all topological vertices that are connected to a given vertex.
topologyVertexIndex: index of a topology vertex in Mesh.TopologyVertices.
sorted: if true, the vertices are returned in a radially sorted order.
Returns:
Indices of all topological vertices that are connected to this topological vertex.
null if no vertices are connected to this vertex.
Since: 5.0

Rhino.Geometry.Collections.MeshTopologyVertexList.SortEdges
Sorts the edge list for the mesh topology vertex list so that
the edges are in radial order when you call ConnectedTopologyVertices.
A non-manifold edge is treated as a boundary edge with respect
to sorting.  If any boundary or non-manifold edges end at the
vertex, then the first edge will be a boundary or non-manifold edge.
Returns: true on success.
Since: 5.0

Rhino.Geometry.Collections.MeshTopologyVertexList.SortEdges(System.Int32)
Sorts the edge list for as single mesh topology vertex so that
the edges are in radial order when you call ConnectedTopologyVertices.
A non-manifold edge is treated as a boundary edge with respect
to sorting.  If any boundary or non-manifold edges end at the
vertex, then the first edge will be a boundary or non-manifold edge.
topologyVertexIndex: index of a topology vertex in Mesh.TopologyVertices>
Returns: true on success.
Since: 5.0

Rhino.Geometry.Collections.MeshTopologyVertexList.IsHidden(System.Int32)
Returns true if the topological vertex is hidden. The mesh topology
vertex is hidden if and only if all the ON_Mesh vertices it represents is hidden.
topologyVertexIndex: index of a topology vertex in Mesh.TopologyVertices.
Returns: true if mesh topology vertex is hidden.
Since: 5.0

Rhino.Geometry.Collections.MeshTopologyVertexList.ConnectedFaces(System.Int32)
Gets all faces that are connected to a given vertex.
topologyVertexIndex: Index of a topology vertex in Mesh.TopologyVertices.
Returns:
Indices of all faces in Mesh.Faces that are connected to this topological vertex.
null if no faces are connected to this vertex.
Since: 5.0

Rhino.Geometry.Collections.MeshTopologyVertexList.ConnectedEdgesCount(System.Int32)
Gets the count of edges that are connected to a given vertex.
topologyVertexIndex: Index of a topology vertex in Mesh.TopologyVertices.
Returns: The amount of edges at this vertex. This can be 0.
Since: 6.0

Rhino.Geometry.Collections.MeshTopologyVertexList.ConnectedEdge(System.Int32,System.Int32)
Gets a particular edge that is connected to a topological vertex.
Call TopologyVertices.SortVertices before this if you are interested in ordered edges.
topologyVertexIndex: Index of a topology vertex in Mesh.TopologyVertices.
edgeAtVertexIndex: Index of the edge at the vertex.
Returns:
The index of the connected edge.
Since: 6.0

Rhino.Geometry.Collections.MeshTopologyVertexList.ConnectedEdges(System.Int32)
Gets all edges that are connected to a given vertex.
Call TopologyVertices.SortVertices before this if you are interested in ordered edges.
topologyVertexIndex: Index of a topology vertex in Mesh.TopologyVertices.
Returns:
Indices of all edges around vertex that are connected to this topological vertex.
null if no faces are connected to this vertex.
Since: 6.0

Rhino.Geometry.Collections.MeshTopologyVertexList.GetEnumerator
Gets an enumerator that yields all topology vertices in this collection.
Returns: The enumerator.
Since: 5.0

Rhino.Geometry.Collections.MeshTopologyVertexList.System#Collections#IEnumerable#GetEnumerator
Since: 5.0