Rhino.Geometry.TransformRigidType
Lists all possible outcomes for rigid transformation.
Since: 6.12

Rhino.Geometry.TransformRigidType.RigidReversing
Transformation is an orientation reversing isometry.

Rhino.Geometry.TransformRigidType.NotRigid
Transformation is not an orthogonal transformation.

Rhino.Geometry.TransformRigidType.Rigid
Transformation is an rigid transformation.