Rhino.Runtime.Notifications.ButtonType
The type of button in a notification.
Since: 6.0

Rhino.Runtime.Notifications.ButtonType.CancelOrClose
Denotes either the Cancel button as well as, on some platforms, the close button if present.

Rhino.Runtime.Notifications.ButtonType.Confirm
The Confirm buttton.

Rhino.Runtime.Notifications.ButtonType.Alternate
The Alternate button.