Rhino.IRhinoDocObserver
Implement this interface if you are a modeless interface to aid in
handling multiple document implementations

Rhino.IRhinoDocObserver.RhinoDocClosed(Rhino.RhinoDocObserverArgs)
When a document is closed
e:
Since: 6.0

Rhino.IRhinoDocObserver.ActiveRhinoDocChanged(Rhino.RhinoDocObserverArgs)
In Windows Rhino this will mean a new document has been created or
opened.  In Mac Rhino this can mean the same thing as well it can
indicate switching from one active open document to another.
e:
Since: 6.0