Rhino.FileIO.FileObjWriter.WriteFile(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileObjWriteOptions)
filename:
doc:
options:
Returns:

Rhino.FileIO.FileObjWriter.WriteFile(System.IO.StreamWriter,Rhino.RhinoDoc,Rhino.FileIO.FileObjWriteOptions)
file:
doc:
options:
Returns:
Remarks:  No .mtl file is written, hence no materials, when the WriteFile that takes a StreamWriter
is called directly.  If you need materials call the WriteFile that takes a string for the
obj file path.