Rhino.Render.ChangeQueue.MappingChannelCollection
MappingChannels for a Mesh

Rhino.Render.ChangeQueue.MappingChannelCollection.SingleMapping
Since: 8.0

Rhino.Render.ChangeQueue.MappingChannelCollection.Count
Get count of MappingChannels in this collection
Since: 6.0

Rhino.Render.ChangeQueue.MappingChannelCollection.Item(System.Int32)
Get MappingChannel on index
i:
Returns:

Rhino.Render.ChangeQueue.MappingChannelCollection.Channels
Enumerate all available channels in this mapping
Since: 6.0