Rhino.Display.DisplayBitmap
A bitmap resource that can be used by the display pipeline (currently only
in OpenGL display).  Reuse DisplayBitmaps for drawing if possible; it is
much more expensive to construct new DisplayBitmaps than it is to reuse
existing DisplayBitmaps.

Rhino.Display.DisplayBitmap.#ctor(System.Drawing.Bitmap)
Constructs a DisplayBitmap from an existing bitmap.
bitmap: The original bitmap.
Since: 5.0

Rhino.Display.DisplayBitmap.#ctor(System.String,System.Drawing.Bitmap)
Creates a DisplayBitmap either from a path, or a bitmap.
If the path is null, a random tag name will be used.
If the bitmap is null, the bitmap will be loaded from the path.
If both are null, the object is invalid.
if both are valid objects, the bitmap will be used and it will be added to Rhino's bitmap
cache with the path supplied.  In other words, this is a way to add a bitmap from memory
directly into Rhino's memory cache.
path: If null, use a temporary tag name.  If non-null, use that path in Rhino's bitmap cache.  Note, this version does not support URLs.
bitmap: If null, load the bitmap from the supplied path.  If non-null, creates the bitmap from the data supplied.
Since: 7.16

Rhino.Display.DisplayBitmap.Update(System.Drawing.Bitmap)
Update the image used for this DisplayBitmap
bitmap:
Since: 8.14

Rhino.Display.DisplayBitmap.Load(System.String)
Load a DisplayBitmap from and image file on disk or from URL. If path starts
with http:// or https:// then an attempt is made to load the bitmap from an
online resource
path: A location from which to load the file.
Returns: The new display bitmap, or null on error.
Since: 5.0

Rhino.Display.DisplayBitmap.SetBlendFunction(Rhino.Display.BlendMode,Rhino.Display.BlendMode)
Sets blending function used to determine how this bitmap is blended
with the current frame buffer color.  The default setting is SourceAlpha
for source and OneMinusSourceAlpha for destination.  See OpenGL's
glBlendFunc for details.
http://www.opengl.org/sdk/docs/man/xhtml/glBlendFunc.xml
source: The source blend mode.
destination: The destination blend mode.
Since: 5.0

Rhino.Display.DisplayBitmap.GetBlendModes(Rhino.Display.BlendMode@,Rhino.Display.BlendMode@)
Gets the source and destination blend modes.
source: The source blend mode is assigned to this out parameter.
destination: The destination blend mode is assigned to this out parameter.
Since: 5.0

Rhino.Display.DisplayBitmap.Size
Size of the underlying bitmap image
Since: 7.0

Rhino.Display.DisplayBitmap.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Display.DisplayBitmap.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0

Rhino.Display.DisplayBitmap.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.