Rhino.Render.PreviewSceneQuality
Quality levels when creating preview images
Since: 5.1

Rhino.Render.PreviewSceneQuality.RealtimeQuick
Very fast preview. Typically using the internal OpenGL preview generator.

Rhino.Render.PreviewSceneQuality.RefineFirstPass
Low quality rendering for quick preview.

Rhino.Render.PreviewSceneQuality.RefineSecondPass
Medium quality rendering for intermediate preview.

Rhino.Render.PreviewSceneQuality.RefineThirdPass
Full quality rendering (quality comes from user settings)

Rhino.Render.PreviewSceneQuality.None
No quality set.

Rhino.Render.PreviewSceneQuality.Low
Low quality rendering for quick preview.

Rhino.Render.PreviewSceneQuality.Medium
Medium quality rendering for intermediate preview.

Rhino.Render.PreviewSceneQuality.IntermediateProgressive
Intermediate update, always considered better quality than the previous
IntermediateProgressive, but not as high as Full.

Rhino.Render.PreviewSceneQuality.Full
Full quality rendering (quality comes from user settings).