QuadRemeshPrivate.QuadRemesherFileIo.TempInputFilePath
Location of EXO mesh file to be remeshed on disk

QuadRemeshPrivate.QuadRemesherFileIo.TempOutputFilePath
Location of the re-meshed EXO file on disk

QuadRemeshPrivate.QuadRemesherFileIo.TempProgressPath
location of the remesh progress text file on disk

QuadRemeshPrivate.QuadRemesherFileIo.SettingsFilePath
location of the remesh settings file on disk

QuadRemeshPrivate.QuadRemesherFileIo.ReadExomeshFile(System.String)
Reads an EXO from disk to a Rhino Mesh object
filename:
Returns:

QuadRemeshPrivate.QuadRemesherFileIo.WriteEngineSettings(QuadRemeshPrivate.QuadRemeshSettings)
Writes the configured engine settings to disk
remeshSettings:
Returns:

QuadRemeshPrivate.QuadRemesherFileIo.GetExoQuadMeshFromDisk
Waits for the Exo mesh to be available and reads it
This is called after the process has exited
Returns:

QuadRemeshPrivate.QuadRemesherFileIo.GetEnginePath
Returns the location of the remeshing engine on disk.
Returns: