Rhino.Render.PostEffects.PostEffectCollection
Represents the collection of post effects in render settings.

Rhino.Render.PostEffects.PostEffectCollection.#ctor
Create a utility object not associated with any document
Since: 8.0

Rhino.Render.PostEffects.PostEffectCollection.#ctor(Rhino.Render.PostEffects.PostEffectCollection)
Create a utility object not associated with any document from another object
c: The other collection.
Since: 8.0

Rhino.Render.PostEffects.PostEffectCollection.Dispose
Since: 8.0

Rhino.Render.PostEffects.PostEffectCollection.PostEffectDataFromId(System.Guid)
Get a post effect data for an id.
Since: 8.0

Rhino.Render.PostEffects.PostEffectCollection.MovePostEffectBefore(System.Guid,System.Guid)
Move a post effect before another post effect in the list.
Param 'id_move' is the id of the post effect to move.
Param 'id_before' is the id of a post effect before which the post effect should be moved.
If this is Guid.Empty, the post effect is moved to the end of the list.
If the post effect identified by 'id_before' is not found, the method will fail.
Returns true if successful, else false.
Since: 8.0

Rhino.Render.PostEffects.PostEffectCollection.GetSelectedPostEffect(Rhino.Render.PostEffects.PostEffectType,System.Guid@)
Gets the selected post effect for a certain type into 'id'.
Returns true if successful or false if the selection information could not be found.
Since: 8.0

Rhino.Render.PostEffects.PostEffectCollection.SetSelectedPostEffect(Rhino.Render.PostEffects.PostEffectType,System.Guid)
Sets the selected post effect for a certain type.
Since: 8.0

Rhino.Render.PostEffects.PostEffectCollection.CopyFrom(Rhino.Render.FreeFloatingBase)
Since: 8.0

Rhino.Render.PostEffects.PostEffectCollection.GetEnumerator
Get an enumerator for accessing PostEffectData.
Since: 8.0

Rhino.Render.PostEffects.PostEffectCollection.System#Collections#IEnumerable#GetEnumerator
Get an enumerator for accessing PostEffectData.
Since: 8.0