Rhino.DocObjects.Custom.UserData
Provides a base class for custom classes of information which may be attached to
geometry or attribute classes.

Rhino.DocObjects.Custom.UserData.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.DocObjects.Custom.UserData.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0

Rhino.DocObjects.Custom.UserData.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.DocObjects.Custom.UserData.Description
Descriptive name of the user data.
Since: 5.0

Rhino.DocObjects.Custom.UserData.ShouldWrite
If you want to save this user data in a 3dm file, override
ShouldWrite and return true.  If you do support serialization,
you must also override the Read and Write functions.
Since: 5.0

Rhino.DocObjects.Custom.UserData.Write(Rhino.FileIO.BinaryArchiveWriter)
Writes the content of this data to a stream archive.
archive: An archive.
Returns: true if the data was successfully written. The default implementation always returns false.

Rhino.DocObjects.Custom.UserData.Read(Rhino.FileIO.BinaryArchiveReader)
Reads the content of this data from a stream archive.
archive: An archive.
Returns: true if the data was successfully written. The default implementation always returns false.

Rhino.DocObjects.Custom.UserData.OnTransform(Rhino.Geometry.Transform)
Is called when the object associated with this data is transformed. If you override this
function, make sure to call the base class if you want the stored Transform to be updated.
transform: The transform being applied.

Rhino.DocObjects.Custom.UserData.OnGetChangeSerialNumber
Is called when DataCRC on a user data is called that derives from Custom.UserData.
Note that this doesn't really implement a DataCRC, but rather it'll return the
current change serial number if the implementing class supports that, or 0 by default.
Currently ArchivableDictionary supports this where each SetItem call increments the
change serial number of the instance.
Returns:

Rhino.DocObjects.Custom.UserData.OnDuplicate(Rhino.DocObjects.Custom.UserData)
Is called when the object is being duplicated.
source: The source data.

Rhino.DocObjects.Custom.UserData.OnGetChangeSerialNumber(System.Int32,System.UInt32)
Get the current change serial number, if supported by the implement class. 0 by defauult
if a UD is found, otherwise just the currentRemainder as given.
Note that this builds on the DataCRC method to reuse it in a way for which it wasn't
designed. Instead an increasing change serial number is returned. Increases happen on
SetItem in ArchivableDictionary at least.
serialNumber:
currentRemainder:
Returns:

Rhino.DocObjects.Custom.UserData.Copy(Rhino.Runtime.CommonObject,Rhino.Runtime.CommonObject)
Expert user tool that copies user data that has a positive
CopyCount from the source object to a destination object.
Generally speaking you don't need to use Copy().
Simply rely on things like the copy constructors to do the right thing.
source: A source object for the data.
destination: A destination object for the data.
Since: 5.0

Rhino.DocObjects.Custom.UserData.MoveUserDataFrom(Rhino.Runtime.CommonObject)
Moves the user data from objectWithUserData to a temporary data storage
identified by the return Guid.  When MoveUserDataFrom returns, the
objectWithUserData will not have any user data.
objectWithUserData: Object with user data attached.
Returns:
Guid identifier for storage of UserData that is held in a temporary list
by this class. This function should be used in conjunction with MoveUserDataTo
to transfer the user data to a different object.
Returns Guid.Empty if there was no user data to transfer.
Since: 5.0

Rhino.DocObjects.Custom.UserData.MoveUserDataTo(Rhino.Runtime.CommonObject,System.Guid,System.Boolean)
Moves the user data.
See Rhino.DocObjects.Custom.UserData.MoveUserDataFrom(Rhino.Runtime.CommonObject) for more information.
objectToGetUserData: Object data source.
id: Target.
append: If the data should be appended or replaced.
Since: 5.0

Rhino.DocObjects.Custom.UserData.Transform
Updated if user data is attached to a piece of geometry that is
transformed and the virtual OnTransform() is not overridden.  If you
override OnTransform() and want Transform to be updated, then call the
base class OnTransform() in your override.
The default constructor sets Transform to the identity.
Since: 5.0