Rhino.Render.ChangeQueue.Light
ChangeQueue Light change representation

Rhino.Render.ChangeQueue.Light.Id
Get the light object id
Since: 6.0

Rhino.Render.ChangeQueue.Light.IdCrc
Get CRC computed from Id
Since: 6.0

Rhino.Render.ChangeQueue.Light.Data
Get the actual light data
Since: 6.0

Rhino.Render.ChangeQueue.Light.MaterialId
Get material ID of the material assigned to the light. Material ID
is 0 if no material was assigned.
Since: 7.9

Rhino.Render.ChangeQueue.Light.ChangeType
Get what type of light change this represents
Since: 6.0