Rhino.Geometry.Morphs.TwistSpaceMorph
Deforms objects by rotating them around an axis.

Rhino.Geometry.Morphs.TwistSpaceMorph.#ctor
Constructs a twist space morph.
Since: 5.1

Rhino.Geometry.Morphs.TwistSpaceMorph.TwistAxis
Axis to rotate about.
Since: 5.1

Rhino.Geometry.Morphs.TwistSpaceMorph.TwistAngleRadians
Twist angle in radians.
Since: 5.1

Rhino.Geometry.Morphs.TwistSpaceMorph.InfiniteTwist
If true, the deformation is constant throughout the object, even if the axis is shorter than the object.
If false, the deformation takes place only the length of the axis.
Since: 5.1

Rhino.Geometry.Morphs.TwistSpaceMorph.MorphPoint(Rhino.Geometry.Point3d)
Morphs an Euclidean point. This method is abstract.
point: A point that will be morphed by this function.
Returns: Resulting morphed point.
Since: 5.1

Rhino.Geometry.Morphs.TwistSpaceMorph.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Geometry.Morphs.TwistSpaceMorph.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.1

Rhino.Geometry.Morphs.TwistSpaceMorph.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.