Rhino.Geometry.GeometryBase
Provides a common base for most geometric classes. This class is abstract.

Rhino.Geometry.GeometryBase.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor for internal use.
info: Serialization data.
context: Serialization stream.

Rhino.Geometry.GeometryBase.OnSwitchToNonConst
Is called when a non-constant operation occurs.

Rhino.Geometry.GeometryBase.IsDocumentControlled
If true this object may not be modified. Any properties or functions that attempt
to modify this object when it is set to "IsReadOnly" will throw a NotSupportedException.
Since: 5.0

Rhino.Geometry.GeometryBase.DuplicateShallow
Constructs a light copy of this object. By "light", it is meant that the same
underlying data is used until something is done to attempt to change it. For example,
you could have a shallow copy of a very heavy mesh object and the same underlying
data will be used when doing things like inspecting the number of faces on the mesh.
If you modify the location of one of the mesh vertices, the shallow copy will create
a full duplicate of the underlying mesh data and the shallow copy will become a
deep copy.
Returns: An object of the same type as this object.
This behavior is overridden by implementing classes.
Since: 5.0

Rhino.Geometry.GeometryBase.IsShallowDuplicate
Is this instance a 'shallow copy'. Shallow copies are no different
than regular instances with the exception that they will convert to
complete independent 'deep' copies if a non const operation is
perform on the instance (something that mutates the internal data)

Rhino.Geometry.GeometryBase.Duplicate
Constructs a deep (full) copy of this object.
Returns: An object of the same type as this, with the same properties and behavior.
Since: 5.0

Rhino.Geometry.GeometryBase.ObjectType
Useful for switch statements that need to differentiate between
basic object types like points, curves, surfaces, and so on.
Since: 5.0

Rhino.Geometry.GeometryBase.Transform(Rhino.Geometry.Transform)
Transforms the geometry. If the input Transform has a SimilarityType of
OrientationReversing, you may want to consider flipping the transformed
geometry after calling this function when it makes sense. For example,
you may want to call Flip() on a Brep after transforming it.
xform:
Transformation to apply to geometry.
Returns: true if geometry successfully transformed.
Since: 5.0

Rhino.Geometry.GeometryBase.Translate(Rhino.Geometry.Vector3d)
Translates the object along the specified vector.
translationVector: A moving vector.
Returns: true if geometry successfully translated.
Since: 5.0

Rhino.Geometry.GeometryBase.Translate(System.Double,System.Double,System.Double)
Translates the object along the specified vector.
x: The X component.
y: The Y component.
z: The Z component.
Returns: true if geometry successfully translated.
Since: 5.0

Rhino.Geometry.GeometryBase.Scale(System.Double)
Scales the object by the specified factor. The scale is centered at the origin.
scaleFactor: The uniform scaling factor.
Returns: true if geometry successfully scaled.
Since: 5.0

Rhino.Geometry.GeometryBase.Rotate(System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Rotates the object about the specified axis. A positive rotation
angle results in a counter-clockwise rotation about the axis (right hand rule).
angleRadians: Angle of rotation in radians.
rotationAxis: Direction of the axis of rotation.
rotationCenter: Point on the axis of rotation.
Returns: true if geometry successfully rotated.
Since: 5.0

Rhino.Geometry.GeometryBase.MemoryEstimate
Computes an estimate of the number of bytes that this object is using in memory.
Returns: An estimated memory footprint.
Since: 5.0

Rhino.Geometry.GeometryBase.DataCRC(System.UInt32)
Returns a CRC calculated from the information that defines the object.
This CRC can be used as a quick way to see if two objects are not identical.
currentRemainder: The current remainder value.
Returns: CRC of the information the defines the object.
Since: 7.20

Rhino.Geometry.GeometryBase.GetBoundingBox(System.Boolean)
Bounding box solver. Gets the world axis aligned bounding box for the geometry.
accurate: If true, a physically accurate bounding box will be computed.
If not, a bounding box estimate will be computed. For some geometry types there is no
difference between the estimate and the accurate bounding box. Estimated bounding boxes
can be computed much (much) faster than accurate (or "tight") bounding boxes.
Estimated bounding boxes are always similar to or larger than accurate bounding boxes.
Returns:
The bounding box of the geometry in world coordinates or BoundingBox.Empty
if not bounding box could be found.
Since: 5.0

Rhino.Geometry.GeometryBase.GetBoundingBox(Rhino.Geometry.Transform)
Aligned Bounding box solver. Gets the world axis aligned bounding box for the transformed geometry.
xform: Transformation to apply to object prior to the BoundingBox computation.
The geometry itself is not modified.
Returns: The accurate bounding box of the transformed geometry in world coordinates
or BoundingBox.Empty if not bounding box could be found.
Since: 5.0

Rhino.Geometry.GeometryBase.GetBoundingBox(Rhino.Geometry.Plane)
Aligned Bounding box solver. Gets the plane aligned bounding box.
plane: Orientation plane for BoundingBox.
Returns: A BoundingBox in plane coordinates.
Since: 5.0

Rhino.Geometry.GeometryBase.GetBoundingBox(Rhino.Geometry.Plane,Rhino.Geometry.Box@)
Aligned Bounding box solver. Gets the plane aligned bounding box.
plane: Orientation plane for BoundingBox.
worldBox: Aligned box in World coordinates.
Returns: A BoundingBox in plane coordinates.
Since: 5.0

Rhino.Geometry.GeometryBase.IsDeformable
true if object can be accurately modified with "squishy" transformations like
projections, shears, and non-uniform scaling.
Since: 5.0

Rhino.Geometry.GeometryBase.MakeDeformable
If possible, converts the object into a form that can be accurately modified
with "squishy" transformations like projections, shears, an non-uniform scaling.
Returns:
false if object cannot be converted to a deformable object. true if object was
already deformable or was converted into a deformable object.
Since: 5.0

Rhino.Geometry.GeometryBase.HasBrepForm
Returns true if the Brep.TryConvertBrep function will be successful for this object
Since: 5.6

Rhino.Geometry.GeometryBase.ComponentIndex
If this piece of geometry is a component in something larger, like a BrepEdge
in a Brep, then this function returns the component index.
Returns:
This object's component index.  If this object is not a sub-piece of a larger
geometric entity, then the returned index has
m_type = ComponentIndex.InvalidType
and m_index = -1.
Since: 5.0

Rhino.Geometry.GeometryBase.SetUserString(System.String,System.String)
Attach a user string (key,value combination) to this geometry.
key: id used to retrieve this string.
value: string associated with key.
Returns: true on success.
Since: 5.0

Rhino.Geometry.GeometryBase.GetUserString(System.String)
Gets user string from this geometry.
key: id used to retrieve the string.
Returns: string associated with the key if successful. null if no key was found.
Since: 5.0

Rhino.Geometry.GeometryBase.UserStringCount
Gets the amount of user strings.
Since: 5.0

Rhino.Geometry.GeometryBase.GetUserStrings
Gets a copy of all (user key string, user value string) pairs attached to this geometry.
Returns: A new collection.
Since: 5.0

Rhino.Geometry.GeometryBase.DeleteUserString(System.String)
Since: 8.9

Rhino.Geometry.GeometryBase.DeleteAllUserStrings
Since: 8.9

Rhino.Geometry.GeometryBase.Dispose(System.Boolean)
Overridden in order to destroy local display cache information
disposing:

Rhino.Geometry.GeometryBase.NonConstOperation
Destroy cache handle

Rhino.Geometry.GeometryBase.GeometryEquals(Rhino.Geometry.GeometryBase,Rhino.Geometry.GeometryBase)
Determines if two geometries equal one another, in pure geometrical shape.
This version only compares the geometry itself and does not include any user
data comparisons.
This is a comparison by value: for two identical items it will be true, no matter
where in memory they may be stored.
first: The first geometry
second: The second geometry
Returns: The indication of equality
Since: 6.0

Rhino.Geometry.GeometryBase.GeometryReferenceEquals(Rhino.Geometry.GeometryBase,Rhino.Geometry.GeometryBase)
Determines if two objects are respectively shallow copies,
new managed instantiations of the same geometry, or similar
internal references to the exact same geometry, both in managed and in unmanaged code.
one: The first object
other: The other object
Returns: True if indeed the objects are really the same. False otherwise.
Since: 7.2