Rhino.Runtime.MonoHost
This class should only ever be called from the MonoManager.rhp. Luckily
when embedding mono, you can call private classes with no problem so we
don't need to expose this to the SDK.