Rhino.DocObjects.Layer.#ctor
Since: 5.0

Rhino.DocObjects.Layer.GetDefaultLayerProperties
Constructs a layer with the current default properties.
The default layer properties are:
color = Rhino.ApplicationSettings.AppearanceSettings.DefaultLayerColor
line style = Rhino.ApplicationSettings.AppearanceSettings.DefaultLayerLineStyle
material index = -1
IGES level = -1
mode = NormalLayer
name = empty
layer index = 0 (ignored by AddLayer)
Returns: A new layer instance.
Since: 5.0

Rhino.DocObjects.Layer.CommitChanges
Since: 5.0
6.0

Rhino.DocObjects.Layer.ComponentType
Returns Rhino.DocObjects.ModelComponentType.Layer.
Since: 6.0

Rhino.DocObjects.Layer.ComponentStatus
Gets or sets the status of the layer.
Since: 6.0

Rhino.DocObjects.Layer.IsDeleted
Gets a value indicating whether this layer has been deleted and is
currently in the Undo buffer.
Since: 5.0

Rhino.DocObjects.Layer.IsReference
Gets a value indicting whether this layer is a referenced layer.
Referenced layers are part of referenced documents.
Since: 5.0

Rhino.DocObjects.Layer.Name
Gets or sets the name of this layer.
Since: 5.0

Rhino.DocObjects.Layer.FullPath
Gets the full path to this layer. The full path includes nesting information.
Since: 5.0

Rhino.DocObjects.Layer.LayerIndex
Gets or sets the index of this layer.
Since: 5.0

Rhino.DocObjects.Layer.Id
Gets or sets the ID of this layer object.
You typically do not need to assign a custom ID.
Since: 5.0

Rhino.DocObjects.Layer.ParentLayerId
Gets the ID of the parent layer. Layers can be organized in a hierarchical structure,
in which case this returns the parent layer ID. If the layer has no parent,
Guid.Empty will be returned.
Since: 5.0

Rhino.DocObjects.Layer.IgesLevel
Gets or sets the IGES level for this layer.
Since: 5.0

Rhino.DocObjects.Layer.HasPerViewportSettings(System.Guid)
Verifies that a layer has per viewport settings.
viewportId:
If not Guid.Empty, then checks for settings for that specific viewport.
If Guid.Empty, then checks for any viewport settings.
Returns: True if the layer has per viewport settings, false otherwise.
Since: 6.0

Rhino.DocObjects.Layer.DeletePerViewportSettings(System.Guid)
Deletes per viewport layer settings.
viewportId:
If not Guid.Empty, then the settings for that viewport are deleted.
If Guid.Empty, then all per viewport settings are deleted.
Since: 6.0

Rhino.DocObjects.Layer.Color
Gets or sets the display color for this layer.
Since: 5.0

Rhino.DocObjects.Layer.PerViewportColor(System.Guid)
Gets the display color for this layer.
viewportId: If not Guid.Empty, then the setting applies only to the viewport with the specified id.
Returns: The display color.
Since: 6.0

Rhino.DocObjects.Layer.SetPerViewportColor(System.Guid,System.Drawing.Color)
Sets the display color for this layer.
viewportId: If not Guid.Empty, then the setting applies only to the viewport with the specified id.
color: The display color.
Since: 6.0

Rhino.DocObjects.Layer.DeletePerViewportColor(System.Guid)
Remove any per viewport layer color setting so the layer's overall setting will be used for all viewports.
viewportId:
If not Guid.Empty, then the setting for this viewport will be deleted.
If Guid.Empty, the all per viewport layer color settings will be removed.
Since: 6.0

Rhino.DocObjects.Layer.PlotColor
Gets or sets the plot color for this layer.
Since: 5.0

Rhino.DocObjects.Layer.DeletePlotColor
Removes the plot color for layer. The layer's color will be used for the plot color.
Since: 8.26

Rhino.DocObjects.Layer.PerViewportPlotColor(System.Guid)
Gets the plot color for this layer.
viewportId: If not Guid.Empty, then the setting applies only to the viewport with the specified id.
Returns: The plot color.
Since: 6.0

Rhino.DocObjects.Layer.SetPerViewportPlotColor(System.Guid,System.Drawing.Color)
Sets the plot color for this layer.
viewportId: If not Guid.Empty, then the setting applies only to the viewport with the specified id.
color: The plot color.
Since: 6.0

Rhino.DocObjects.Layer.DeletePerViewportPlotColor(System.Guid)
Remove any per viewport layer plot color setting so the layer's overall setting will be used for all viewports.
viewportId:
If not Guid.Empty, then the setting for this viewport will be deleted.
If Guid.Empty, the all per viewport layer color settings will be removed.
Since: 6.0

Rhino.DocObjects.Layer.PlotWeight
Gets or sets the weight of the plotting pen in millimeters.
A weight of 0.0 indicates the "default" pen weight should be used.
A weight of -1.0 indicates the layer should not be printed.
Since: 5.0

Rhino.DocObjects.Layer.PerViewportPlotWeight(System.Guid)
Gets the plot weight, in millimeters, for this layer.
viewportId: If not Guid.Empty, then the setting applies only to the viewport with the specified id.
Returns: The plot color.
Since: 6.0

Rhino.DocObjects.Layer.SetPerViewportPlotWeight(System.Guid,System.Double)
Sets the plot weight, in millimeters, for this layer.
viewportId: If not Guid.Empty, then the setting applies only to the viewport with the specified id.
plotWeight:
The plot weight in millimeters.
A weight of  0.0 indicates the "default" pen weight should be used.
A weight of -1.0 indicates the layer should not be printed.
Since: 6.0

Rhino.DocObjects.Layer.DeletePerViewportPlotWeight(System.Guid)
Remove any per viewport layer plot weight setting so the layer's overall setting will be used for all viewports.
viewportId:
If not Guid.Empty, then the setting for this viewport will be deleted.
If Guid.Empty, the all per viewport layer color settings will be removed.
Since: 6.0

Rhino.DocObjects.Layer.LinetypeIndex
Gets or sets the line-type index for this layer.
Since: 5.0

Rhino.DocObjects.Layer.RenderMaterialIndex
Gets or sets the index of render material for objects on this layer that have
MaterialSource() == MaterialFromLayer.
A material index of -1 indicates no material has been assigned
and the material created by the default Material constructor
should be used.
Since: 5.0

Rhino.DocObjects.Layer.IsVisible
Gets or sets the global visibility of this layer.
Since: 5.0

Rhino.DocObjects.Layer.PerViewportIsVisible(System.Guid)
Gets the per viewport visibility of this layer.
viewportId:
If not Guid.Empty, then the visibility setting for that viewport is returned.
If Guid.Empty, the IsVisible property is returned.
Returns: Returns true if objects on layer are visible.
Since: 6.0

Rhino.DocObjects.Layer.SetPerViewportVisible(System.Guid,System.Boolean)
Controls layer visibility in specific viewports.
viewportId:
If not Guid.Empty, then the setting applies only to the viewport with the specified id.
If Guid.Empty, then the setting applies to all viewports with per viewport layer settings.
visible: true to make layer visible, false to make layer invisible.
Since: 6.0

Rhino.DocObjects.Layer.DeletePerViewportVisible(System.Guid)
Remove any per viewport visibility setting so the layer's overall setting will be used for all viewports.
viewportId:
If not Guid.Empty, then the setting for this viewport will be deleted.
If Guid.Empty, the all per viewport visibility settings will be removed.
Since: 6.0

Rhino.DocObjects.Layer.PerViewportPersistentVisibility(System.Guid)
Gets the per layer persistent visibility. The persistent viability setting is used for layers whose visibility can be changed by a parent layer.
In this case, when a parent layer is turned off, then child layers are also turned off.
The persistent visibility setting determines what happens when the parent is turned on again.
viewportId:
Returns:
Return true if this layer's visibility in the specified viewport is controlled by a parent object and the parent is turned on (after being off),
then this layer will also be turned on in the specified viewport.
Returns false if this layer's visibility in the specified viewport is controlled by a parent object and the parent layer is turned on(after being off),
then this layer will continue to be off in the specified viewport.
Since: 6.0

Rhino.DocObjects.Layer.SetPerViewportPersistentVisibility(System.Guid,System.Boolean)
Sets the per layer persistent visibility. The persistent viability setting is used for layers whose visibility can be changed by a parent layer.
In this case, when a parent layer is turned off, then child layers are also turned off.
The persistent visibility setting determines what happens when the parent is turned on again.
viewportId:
If not Guid.Empty, then the setting applies only to the viewport with the specified id.
If Guid.Empty, then the setting applies to all viewports with per viewport layer settings.
persistentVisibility:
If true, this layer's visibility in the specified viewport is controlled by a parent object and the parent is turned on (after being off),
then this layer will also be turned on in the specified viewport.
If false, this layer's visibility in the specified viewport is controlled by a parent object and the parent layer is turned on (after being off),
then this layer will continue to be off in the specified viewport.
Since: 6.0

Rhino.DocObjects.Layer.UnsetPerViewportPersistentVisibility(System.Guid)
Remove any per viewport persistent visibility setting so the layer's overall setting will be used for all viewports.
viewportId:
If not Guid.Empty, then the setting for this viewport will be deleted.
If Guid.Empty, the all per viewport visibility settings will be removed.
Since: 6.0

Rhino.DocObjects.Layer.IsLocked
Gets or sets a value indicating the locked state of this layer.
Since: 5.0

Rhino.DocObjects.Layer.GetPersistentVisibility
The global persistent visibility setting is used for layers whose visibility can
be changed by a "parent" object. A common case is when a layer is a
child layer (ParentId is not nil). In this case, when a parent layer is
turned off, then child layers are also turned off. The persistent
visibility setting determines what happens when the parent is turned on
again.
Remarks:
Returns true if this layer's visibility is controlled by a parent
object and the parent is turned on (after being off), then this
layer will also be turned on.
Returns false if this layer's visibility is controlled by a parent
object and the parent layer is turned on (after being off), then
this layer will continue to be off.
When the persistent viability is not explicitly set, this
property returns the current value of IsVisible
Since: 5.5

Rhino.DocObjects.Layer.SetPersistentVisibility(System.Boolean)
Set the global persistent visibility setting for this layer.
persistentVisibility:
Since: 5.5

Rhino.DocObjects.Layer.PersistentVisibility
Gets or sets the global persistent visibility setting for this layer.
Since: 8.0

Rhino.DocObjects.Layer.ModelIsVisible
Gets or sets the model visiblity of this layer.
Since: 8.0

Rhino.DocObjects.Layer.ModelPersistentVisibility
Gets or sets the model persistent visibility of this layer.
The persistent viability setting is used for layers whose visibility can be changed by a parent layer.
In this case, when a parent layer is turned off, then child layers are also turned off.
The persistent visibility setting determines what happens when the parent is turned on again.
Since: 8.0

Rhino.DocObjects.Layer.UnsetModelPersistentVisibility
Remove any model persistent visibility setting from this layer.
Since: 8.0

Rhino.DocObjects.Layer.DeleteModelVisible
Remove any model visibility setting so the layer's global setting will be used for all viewports.
Since: 8.0

Rhino.DocObjects.Layer.UnsetPersistentVisibility
Remove any explicit persistent visibility setting from this layer
Since: 5.5

Rhino.DocObjects.Layer.GetPersistentLocking
The persistent locking setting is used for layers that can be locked by
a "parent" object. A common case is when a layer is a child layer
(Layer.ParentI is not nil). In this case, when a parent layer is locked,
then child layers are also locked. The persistent locking setting
determines what happens when the parent is unlocked again.
Returns:
Since: 5.5

Rhino.DocObjects.Layer.SetPersistentLocking(System.Boolean)
Set the persistent locking setting for this layer
persistentLocking:
Since: 5.5

Rhino.DocObjects.Layer.UnsetPersistentLocking
Remove any explicitly persistent locking settings from this layer
Since: 5.5

Rhino.DocObjects.Layer.IsExpanded
Gets or sets a value indicating whether this layer is expanded in the Rhino Layer dialog.
Since: 5.0

Rhino.DocObjects.Layer.HasSelectedObjects(System.Boolean)
Returns true if the layer has one or more selected Rhino objects.
checkSubObjects:
If true, the search will include objects that have some subset of the object selected, like some edges of a Brep.
If false, objects where the entire object is not selected are ignored.
Returns: true if the layer has selected Rhino objects, false otherwise.
Since: 8.0

Rhino.DocObjects.Layer.IsCurrent
Returns true if the layer is the current layer.
Since: 8.0

Rhino.DocObjects.Layer.IsReferenceParentLayer
Returns true if the layer is a parent layer of the layer tree from a linked instance definition
or the layer tree from a worksession reference model.
Since: 8.0

Rhino.DocObjects.Layer.IsVisibleInUserInterface
Return true if the layer is visible in user interfaces that display layers.
Returns false if the layer not visible in user interfaces.
This is a runtime property that does not persist in .3dm files.
This property is also used by the Layers panel to filter layers.
Since: 8.9

Rhino.DocObjects.Layer.ParentLayer(System.Boolean)
Returns parent of a layer.
rootLevelParent:
If true, the root level parent is returned. The root level parent never has a parent.
If false, the immediate parent is returned. The immediate parent may have a parent.
Returns: The parent layer, or null if the layer does not have a parent.
Since: 8.0

Rhino.DocObjects.Layer.RenderMaterial
Gets or sets the Rhino.Render.RenderMaterial for objects on
this layer that have MaterialSource() == MaterialFromLayer.
A null result indicates that no Rhino.Render.RenderMaterial has
been assigned  and the material created by the default Material
constructor or the Rhino.DocObjects.Layer.RenderMaterialIndex should be used.
Since: 5.7

Rhino.DocObjects.Layer.SortIndex
Runtime index used to sort layers in layer dialog.
Since: 5.0

Rhino.DocObjects.Layer.Default
Sets layer to default settings.
Since: 5.0

Rhino.DocObjects.Layer.CopyAttributesFrom(Rhino.DocObjects.Layer)
Copy typical attributes from another layer
otherLayer:
Since: 6.0

Rhino.DocObjects.Layer.IsValidName(System.String)
Determines if a given string is valid for a layer name.
name: A name to be validated.
Returns: true if the name is valid for a layer name; otherwise, false.
Since: 5.0
8.0

Rhino.DocObjects.Layer.PathSeparator
The string "::" (colon,colon) is used to
separate parent and child layer names.
Since: 6.0

Rhino.DocObjects.Layer.GetLeafName(System.String)
Get a layer name's "leaf" level name
fullPath:
Returns:
leaf name or String.Empty if fullPath does not contain a leaf
Since: 6.0

Rhino.DocObjects.Layer.GetLeafName(Rhino.DocObjects.Layer)
Get a layer name's "leaf" level name
layer:
Returns:
leaf name or String.Empty if fullPath does not contain a leaf
Since: 6.0

Rhino.DocObjects.Layer.GetParentName(System.String)
Get a layer's "parent" path name
fullPath:
Returns:
parent name or String.Empty
Since: 6.0

Rhino.DocObjects.Layer.GetParentName(Rhino.DocObjects.Layer)
Get a layer's "parent" path name
layer:
Returns:
parent name or String.Empty
Since: 6.0

Rhino.DocObjects.Layer.IsChildOf(System.Int32)
Since: 5.0

Rhino.DocObjects.Layer.IsChildOf(Rhino.DocObjects.Layer)
Since: 5.0

Rhino.DocObjects.Layer.IsChildOf(System.Guid)
Since: 6.0

Rhino.DocObjects.Layer.IsParentOf(System.Int32)
Since: 5.0

Rhino.DocObjects.Layer.IsParentOf(Rhino.DocObjects.Layer)
Since: 5.0

Rhino.DocObjects.Layer.IsParentOf(System.Guid)
Since: 6.0

Rhino.DocObjects.Layer.GetChildren
Gets immediate children of this layer. Note that child layers may have their own children.
Returns: Array of child layers, sorted by layer index, or null if this layer does not have any children.
Since: 5.0

Rhino.DocObjects.Layer.GetChildren(System.Boolean)
Gets the children of this layer.
allChildren:
If false, the immediate children are returned.
If true, immediate children, their children, and so on, are returned.
Returns: Array of child layers, sorted by layer index, or null if this layer does not have any children.
Since: 8.0

Rhino.DocObjects.Layer.PerViewportIsVisibleInNewDetails
Gets and sets the initial per viewport visibility of this layer in newly created detail views.
Since: 8.0

Rhino.DocObjects.Layer.GetCustomSectionStyle
Get an optional custom section style associated with these attributes.
Since: 8.0

Rhino.DocObjects.Layer.SetCustomSectionStyle(Rhino.DocObjects.SectionStyle)
Since: 8.0

Rhino.DocObjects.Layer.RemoveCustomSectionStyle
Since: 8.0

Rhino.DocObjects.Layer.SetUserString(System.String,System.String)
Attach a user string (key,value combination) to this geometry.
key: id used to retrieve this string.
value: string associated with key.
Returns: true on success.
Since: 5.0

Rhino.DocObjects.Layer.GetUserString(System.String)
Gets user string from this geometry.
key: id used to retrieve the string.
Returns: string associated with the key if successful. null if no key was found.
Since: 5.0

Rhino.DocObjects.Layer.UserStringCount
Gets the amount of user strings.
Since: 5.0

Rhino.DocObjects.Layer.GetUserStrings
Gets a copy of all (user key string, user value string) pairs attached to this geometry.
Returns: A new collection.
Since: 5.0

Rhino.DocObjects.Layer.DeleteUserString(System.String)
Since: 8.9

Rhino.DocObjects.Layer.DeleteAllUserStrings
Since: 8.9

Rhino.DocObjects.Layer.Equals(Rhino.DocObjects.Layer)
Since: 6.0

Rhino.DocObjects.Layer.op_Equality(Rhino.DocObjects.Layer,Rhino.DocObjects.Layer)
Since: 6.0

Rhino.DocObjects.Layer.op_Inequality(Rhino.DocObjects.Layer,Rhino.DocObjects.Layer)
Since: 6.0