Rhino.Geometry.LightStyle
Defines enumerated values to represent light styles or types, such as directional or spotlight.
Since: 5.0

Rhino.Geometry.LightStyle.None
No light type. This is the default value of the enumeration type.

Rhino.Geometry.LightStyle.CameraDirectional
Light location and direction in camera coordinates.
+x points to right, +y points up, +z points towards camera.

Rhino.Geometry.LightStyle.CameraPoint
Light location and direction in camera coordinates.
+x points to right, +y points up, +z points towards camera.

Rhino.Geometry.LightStyle.CameraSpot
Light location and direction in camera coordinates.
+x points to right, +y points up, +z points towards camera.

Rhino.Geometry.LightStyle.WorldDirectional
Light location and direction in world coordinates.

Rhino.Geometry.LightStyle.WorldPoint
Light location and direction in world coordinates.

Rhino.Geometry.LightStyle.WorldSpot
Light location and direction in world coordinates.

Rhino.Geometry.LightStyle.Ambient
Ambient light.

Rhino.Geometry.LightStyle.WorldLinear
Linear light in world coordinates.

Rhino.Geometry.LightStyle.WorldRectangular
Rectangular light in world coordinates.