Rhino.Runtime.HostUtils
Contains static methods to deal with the runtime environment.

Rhino.Runtime.HostUtils.LoadAssemblyFrom(System.String)
Calls Assembly.LoadFrom in .NET 4.8. May call a different routine under .NET Core
path:
Returns:
Since: 8.0

Rhino.Runtime.HostUtils.LoadAssemblyFromStream(System.IO.Stream)
Calls Assembly.Load(byte[]) in .NET 4.8. May call a different routine under .NET Core
stream:
Returns:
Since: 8.23

Rhino.Runtime.HostUtils.LoadAssemblyFromName(System.Reflection.AssemblyName)
Calls Assembly.Load(AssemblyName) in .NET 4.8. May call a different routine under .NET Core
assemblyName:
Returns:
Since: 8.32

Rhino.Runtime.HostUtils.RhinoAssemblyDirectory
Gets the Rhino system managed assembly directory.
Since: 8.0

Rhino.Runtime.HostUtils.RunningAsRhinoInside
Indicates whether Rhino is running inside another application.
returns false if Rhino.exe is the top-level application.
returns true if some other application is the top-level application.
Since: 7.0

Rhino.Runtime.HostUtils.GetCurrentProcessInfo(System.String@,System.Version@)
Returns information about the current process. If Rhino is the top level process,
processName is "Rhino". Otherwise, processName is the name, without extension, of the main
module that is executing. For example, "compute.backend" or "Revit".
processVersion is the System.Version of the running process. It is the FileVersion
of the executable.
Since: 6.15

Rhino.Runtime.HostUtils.OperatingSystemEdition
Returns Operating System Edition: "Professional" | "ServerDatacenter" | ... | "Unknown"
Since: 6.15

Rhino.Runtime.HostUtils.OperatingSystemInstallationType
Returns Operating System Installation Type: "Client" | "Server" | "Unknown"
Since: 6.15

Rhino.Runtime.HostUtils.OperatingSystemProductName
Returns Operating System Edition: "Professional" | "ServerDatacenter" | ... | "Unknown"
Since: 6.15

Rhino.Runtime.HostUtils.OperatingSystemVersion
Returns Operating System Version "6.1" | "6.3" | ... | "Unknown"
Since: 6.15

Rhino.Runtime.HostUtils.OperatingSystemBuildNumber
Returns Operating System Build Number "11763" | "7601" | ... | "Unknown"
Since: 6.15

Rhino.Runtime.HostUtils.GetPrinterNames
Get list of printers available on this system
Returns:
Since: 8.0

Rhino.Runtime.HostUtils.GetPrinterFormNames(System.String)
Get list of form names available for a given printer
printerName: name or printer to query
Returns:
Since: 8.0

Rhino.Runtime.HostUtils.GetPrinterFormSize(System.String,System.String,System.Double@,System.Double@)
Get the size of a sheet for a given form name / printer combination
printerName:
formName:
widthMillimeters:
heightMillimeters:
Returns: true on success
Since: 8.0

Rhino.Runtime.HostUtils.GetPrinterFormMargins(System.String,System.String,System.Boolean,System.Double@,System.Double@,System.Double@,System.Double@)
Get limit margins for a given form (page size) and a given printer.
This is the physical limit area that a printer can print on a given page
printerName:
formName:
portrait:
leftMillimeters:
topMillimeters:
rightMillimeters:
bottomMillimeters:
Returns: true on success
Since: 8.5

Rhino.Runtime.HostUtils.GetPrinterDPI(System.String,System.Boolean)
Get the output resolution for a given printer.
printerName:
horizontal: get the horizontal or vertical resolution
Returns:
Dot per inch resolution for a given printer on success. 0 if an error occurred
Since: 8.2

Rhino.Runtime.HostUtils.GetPlatformService``1(System.String,System.String)
For internal use only. Loads an assembly for dependency injection via IPlatformServiceLocator.
assemblyPath: The relative path of the assembly, relative to the position of RhinoCommon.dll
typeFullName: The full name of the type that is IPlatformServiceLocator. This is optional.
The type of the service to be instantiated.
Returns: An instance, or null.
Since: 6.0

Rhino.Runtime.HostUtils.IsManagedDll(System.String)
Inspects a dll to see if it is compiled as native code or as a .NET assembly
path:
Returns:
Since: 6.0

Rhino.Runtime.HostUtils.ClearFpuExceptionStatus
Clear FPU exception and busy flags (Intel assembly fnclex)
Since: 6.0

Rhino.Runtime.HostUtils.RegisterNamedCallback(System.String,System.EventHandler{Rhino.Runtime.NamedParametersEventArgs})
Register a named callback
name:
callback:
Since: 6.15

Rhino.Runtime.HostUtils.RemoveNamedCallback(System.String)
Remove a named callback from the dictionary of callbacks
name:
Since: 7.18

Rhino.Runtime.HostUtils.ExecuteNamedCallback(System.String,Rhino.Runtime.NamedParametersEventArgs)
Execute a named callback
name:
args:
Since: 7.0

Rhino.Runtime.HostUtils.RegisterComputeEndpoint(System.String,System.Type)
Register a class that can participate as a compute endpoint
endpointPath:
t:
Since: 7.0

Rhino.Runtime.HostUtils.GetCustomComputeEndpoints
Used by compute to define custom endpoints
Returns:
Since: 7.0

Rhino.Runtime.HostUtils.GetAssemblySearchPaths
Returns list of directory names where additional assemblies (plug-ins, DLLs, Grasshopper components)
may be located
Returns:
Since: 5.0

Rhino.Runtime.HostUtils.AddSearchPathsWithoutDuplicatePackages(System.Collections.Generic.List{System.String}@,System.Collections.Generic.IEnumerable{System.IO.DirectoryInfo})
Add packageVersionDirs to directories unless a version or runtime dir for that package already exists.
Used in GetAssemblySearchPaths().

Rhino.Runtime.HostUtils.InPlaceConstCast(Rhino.Geometry.GeometryBase,System.Boolean)
DO NOT USE UNLESS YOU ARE CERTAIN ABOUT THE IMPLICATIONS.
This is an expert user function which should not be needed in most
cases. This function is similar to a const_cast in C++ to allow an object
to be made temporarily modifiable without causing RhinoCommon to convert
the class from const to non-const by creating a duplicate.
You must call this function with a true parameter, make your
modifications, and then restore the const flag by calling this function
again with a false parameter. If you have any questions, please
contact McNeel developer support before using!
geometry: Some geometry.
makeNonConst: A boolean value.
Since: 5.0

Rhino.Runtime.HostUtils.RunningOnWindows
Tests if this process is currently executing on the Windows platform.
Since: 5.0

Rhino.Runtime.HostUtils.RunningOnOSX
Tests if this process is currently executing on the Mac OSX platform.
Since: 5.0

Rhino.Runtime.HostUtils.RunningOniOS
Tests if this process is currently executing on the iOS platform.
Since: 5.0

Rhino.Runtime.HostUtils.IsPreRelease
Returns true when Rhino build is Beta or WIP, false otherwise
Since: 7.22

Rhino.Runtime.HostUtils.RunningOnServer
Tests if this process is currently executing in a server environment.
Since: 7.8

Rhino.Runtime.HostUtils.RunningInWindowsContainer
Tests if this process is currently executing inside a Windows Container.
Since: 7.1

Rhino.Runtime.HostUtils.RunningInDarkMode
Returns true if the host operating system is in dark mode and Rhino
supports dark mode.
Since: 6.19

Rhino.Runtime.HostUtils.DeviceName
Name of the computer running Rhino. If the computer is part of a
Windows Domain, the computer name has "@[DOMAIN]" appended.
Since: 6.0

Rhino.Runtime.HostUtils.ComputerSerialNumber
Gets the serial number of the computer running Rhino.
Since: 6.0

Rhino.Runtime.HostUtils.CurrentOSLanguage
Get the current operating system language.
Returns: A Windows LCID (on Windows and macOS).  On Windows, this will be
LCID value regardless of those languages that Rhino supports.  On macOS, this only
returns LCID values for languages that Rhino does support.
Since: 6.8

Rhino.Runtime.HostUtils.DeviceId
The DeviceId is a unique, stable ID that anonymously identifies the device
that Rhino is running on. It is computed based on hardware information that
should not change when the OS is upgraded, or if commonly modified hardware
are added or removed from the computer. The machine-specific information is
hashed using a cryptographic hash to make it anonymous.
Since: 6.0

Rhino.Runtime.HostUtils.RunningInMono
Tests if this process is currently executing under the Mono runtime.
Since: 5.0

Rhino.Runtime.HostUtils.RunningInNetFramework
Tests if this process is currently executing under the .NET Framework runtime.
Since: 8.0

Rhino.Runtime.HostUtils.RunningInNetCore
Tests if this process is currently executing under the .NET Core runtime.
Since: 8.0

Rhino.Runtime.HostUtils.GetSystemReferenceAssemblies
Gets the system reference assemblies to use when compiling code dynamically with Roslyn.
Includes RhinoCommon, Rhino.UI, and Eto.
Remarks:
Note that this list of assemblies is not guaranteed to be loadable and should only be used when compiling
code dynamically.
Returns: An enumeration of paths to each of the rhino system assemblies to be used for compilation
Since: 8.0

Rhino.Runtime.HostUtils.RunningInRhino
Tests if RhinoCommon is currently executing inside of the Rhino.exe process.
There are other cases where RhinoCommon could be running; specifically inside
of Visual Studio when something like a windows form is being worked on in the
resource editor or running stand-alone when compiled to be used as a version
of OpenNURBS.
Since: 5.0

Rhino.Runtime.HostUtils.CheckForRdk(System.Boolean,System.Boolean)
Determines if the RDK is loaded.
throwOnFalse: if the RDK is not loaded, then throws a
Rhino.Runtime.RdkNotLoadedException.
usePreviousResult: if true, then the last result can be used instaed of
performing a full check.
Returns: true if the RDK is loaded; false if the RDK is not loaded. Note that the
Rhino.Runtime.RdkNotLoadedException will hinder the retrieval of any return value.
Since: 5.0

Rhino.Runtime.HostUtils.GetAbsolutePath(System.String,System.Boolean,System.String,System.Boolean,System.String@)
Call this method to convert a relative path to an absolute path
relative to the specified path.
relativePath:
Relative path to convert to an absolute path
bRelativePathisFileName:
If true then lpsFrom is treated as a file name otherwise it is treated
as a directory name
relativeTo:
File or folder the path is relative to
bRelativeToIsFileName:
If true then lpsFrom is treated as a file name otherwise it is treated
as a directory name
pathOut:
Reference to string which will receive the computed absolute path
Returns:
Returns true if parameters are valid and lpsRelativePath is indeed
relative to lpsRelativeTo otherwise returns false
Since: 6.0

Rhino.Runtime.HostUtils.IsRhinoFileExtension(System.String)
Check to see if the file extension is a valid Rhino file extension.
fileExtension:
Returns:
Returns true if fileExtension is ".3dm", "3dm", ".3dx" or "3dx",
ignoring case.
Since: 6.0

Rhino.Runtime.HostUtils.FileNameEndsWithRhinoExtension(System.String)
Strip file extension from file name and check to see if it is a valid
Rhino file extension.
fileName:
File name to check.
Returns:
Returns true if the file name has an extension like 3dm.
Since: 6.0

Rhino.Runtime.HostUtils.IsRhinoBackupFileExtension(System.String)
Check to see if the file extension is a valid Rhino file extension.
fileExtension:
Returns:
Return true if fileExtension is ".3dmbak", "3dmbak", ".3dm.bak", "3dm.bak",
".3dx.bak" or "3dx.bak", ignoring case.
Since: 6.0

Rhino.Runtime.HostUtils.FileNameEndsWithRhinoBackupExtension(System.String)
Strip file extension from file name and check to see if it is a valid
Rhino backup file extension.
fileName:
File name to check.
Returns:
Returns true if the file name has an extension like 3dmbak.
Since: 6.0

Rhino.Runtime.HostUtils.SafeInvoke(System.EventHandler,System.Object)
Safetly invokes (catching exceptions) the method represented by the provided handler.
handler: Event handler
sender: Event sender
Remarks: All handlers will be called even one of it throws an exception.

Rhino.Runtime.HostUtils.SafeInvoke``1(System.EventHandler{``0},System.Object,``0)
Invokes safely (catching exceptions) the method represented by the provided handler.
handler: Event handler
sender: Event sender
args: Event arguments
Remarks: All handlers will be called even one of it throws an exception.

Rhino.Runtime.HostUtils.DebugString(System.String)
Prints a debug message to the Rhino Command Line.
The message will only appear if the SendDebugToCommandLine property is set to true.
msg: Message to print.
Since: 5.0

Rhino.Runtime.HostUtils.DebugString(System.String,System.Object[])
Prints a debug message to the Rhino Command Line.
The message will only appear if the SendDebugToCommandLine property is set to true.
format: Message to format and print.
args: An Object array containing zero or more objects to format.
Since: 5.0

Rhino.Runtime.HostUtils.LogDebugEvent(System.String)
Logs a debug event.
The function will log the filename and line number from where this function is called,
in addition to the input message.
message: The event message.
Since: 8.5

Rhino.Runtime.HostUtils.SendDebugToCommandLine
Gets or sets whether debug messages are printed to the command line.
Since: 5.0

Rhino.Runtime.HostUtils.ExceptionReport(System.Exception)
Informs RhinoCommon of an exception that has been handled but that the developer wants to screen.
ex: An exception.
Since: 5.0

Rhino.Runtime.HostUtils.ExceptionReport(System.String,System.Exception)
Informs RhinoCommon of an exception that has been handled but that the developer wants to screen.
source: An exception source text.
ex: An exception.
Since: 5.0

Rhino.Runtime.HostUtils.OnExceptionReport
Is raised when an exception is reported with one of the Rhino.Runtime.HostUtils.ExceptionReport(System.Exception) method.
Since: 5.0

Rhino.Runtime.HostUtils.SendLogMessageToCloudCallbackProc(Rhino.Runtime.HostUtils.LogMessageType,System.IntPtr,System.IntPtr,System.IntPtr)
Informs RhinoCommon of an message that has been handled but that the developer wants to screen.
pwStringClass: The top level message type.
pwStringDesc: Finer grained description of the message.
pwStringMessage: The message.
msg_type: The messag type
Since: 6.4

Rhino.Runtime.HostUtils.OnSendLogMessageToCloud
Is raised when an exception is reported with one of the  method.
Since: 6.4

Rhino.Runtime.HostUtils.DebugDumpToString(Rhino.Geometry.GeometryBase)
Gets the debug dumps. This is a text description of the geometric contents.
DebugDump() is intended for debugging and is not suitable for creating high
quality text descriptions of an object.
geometry: Some geometry.
Returns: A debug dump text.
Since: 5.0

Rhino.Runtime.HostUtils.DebugDumpToString(Rhino.Geometry.BezierCurve)
Gets the debug dumps. This is a text description of the geometric contents.
DebugDump() is intended for debugging and is not suitable for creating high
quality text descriptions of an object.
bezierCurve: curve to evaluate
Returns: A debug dump text.
Since: 5.0

Rhino.Runtime.HostUtils.DescribeGeometry(Rhino.Geometry.GeometryBase)
Returns a description that is similar to the one in the _What command, except for not mentioning units and other attribute data.
This description is translated in the current Rhino version.
Since: 8.0

Rhino.Runtime.HostUtils.RecordInitInstanceTime(System.String)
Used to help record times at startup with the -stopwatch flag to help
determine bottlenecks in start up speed
description:
Since: 6.0

Rhino.Runtime.HostUtils.CreateCommands(Rhino.PlugIns.PlugIn)
Parses a plugin and create all the commands defined therein.
plugin: Plugin to harvest for commands.
Since: 5.0

Rhino.Runtime.HostUtils.CreateCommands(System.IntPtr,System.Reflection.Assembly)
Parses a plugin and create all the commands defined therein.
pPlugIn: Plugin to harvest for commands.
pluginAssembly: Assembly associated with the plugin.
Returns: The number of newly created commands.
Since: 5.0

Rhino.Runtime.HostUtils.RegisterDynamicCommand(Rhino.PlugIns.PlugIn,Rhino.Commands.Command)
Adds a new dynamic command to Rhino.
plugin: Plugin that owns the command.
cmd: Command to add.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Runtime.HostUtils.ExtractUnitFromFunctionString(System.String,Rhino.UnitSystem)
examines a text function string such as CurveLength to see if the function is using document units or some other unit defined within the function
functionString:
defaultUnit:
Returns:

Rhino.Runtime.HostUtils.EvaluateTextFieldHelper(System.IntPtr,System.IntPtr,System.IntPtr,System.IntPtr,System.IntPtr)
This function is called from the C++ textfield evaluator
ptrFormula:
pRhinoObject:
ptrParseResult:
pTopParent:
pImmediateParent: pointer to immediate instance object parent
Returns:

Rhino.Runtime.HostUtils.AutoInstallPlugInFolder(System.Boolean)
Gets the auto install plug-in folder for machine or current user.
currentUser: true if the query relates to the current user.
Returns: The full path to the revelant auto install plug-in directory.
Since: 6.0

Rhino.Runtime.HostUtils.GetActivePlugInVersionFolders
Recurses through the auto install plug-in folders and returns the directories containing "active" versions of plug-ins.
Returns:
Remarks: If the same package is installed in both the user and machine locations, the newest directory wins.
Since: 7.17

Rhino.Runtime.HostUtils._package_folder_blocklist
list of package names that should never be passed to rhino
i.e. removed from package server to be shipped with rhino

Rhino.Runtime.HostUtils.GetActivePlugInVersionFolders(System.Boolean)
Recurses through the auto install plug-in folders and returns the directories containing "active" versions of plug-ins.
currentUser: Current user (true) or machine (false).
Returns:
Since: 6.0

Rhino.Runtime.HostUtils.InitializeRhinoCommon
Makes sure all static RhinoCommon components is set up correctly.
This happens automatically when a plug-in is loaded, so you probably won't
have to call this method.
Remarks: Subsequent calls to this method will be ignored.
Since: 5.0

Rhino.Runtime.HostUtils.InitializeRhinoCommon_RDK
Makes sure all static RhinoCommon RDK components are set up correctly.
This happens automatically when the RDK is loaded, so you probably won't
have to call this method.
Remarks: Subsequent calls to this method will be ignored.
Since: 6.0

Rhino.Runtime.HostUtils.ShutDownRhinoCommon_RDK
Makes sure all static RhinoCommon RDK components are de-initialized so they aren't calling into space when the RDK is unloaded.
Remarks: Subsequent calls to this method will be ignored.
Since: 6.0

Rhino.Runtime.HostUtils.RhinoCommonExceptionHandler(System.String,System.Object,System.Exception)
For internal use only!!!
Unhanded exception handler, writes stack trace to RhinoDotNet.txt file
title:
Exception title to write to text file
sender:
ex:
Since: 6.0

Rhino.Runtime.HostUtils.UnhandledThreadException(System.Object,System.Threading.ThreadExceptionEventArgs)
Exception handler for exceptions occurring on the UI thread
sender:
e:
Since: 6.0

Rhino.Runtime.HostUtils.InitializeZooClient
Initializes the ZooClient and Rhino license manager, this should get
called automatically when RhinoCommon is loaded so you probably won't
have to call this method.
Since: 5.6

Rhino.Runtime.HostUtils.CallFromCoreRhino(System.String)
Don't change this function in ANY way unless you chat with Steve first!
This function is called by Rhino on initial startup and the signature
must be exact
task:
Returns:
Since: 6.0

Rhino.Runtime.HostUtils.OnNetCoreShutdown(System.IntPtr,System.Int32)
Used to call the above method from unmanaged code.  Do not remove.

Rhino.Runtime.HostUtils.CreatePlugIn(System.Type,System.Boolean)
Instantiates a plug-in type and registers the associated commands and classes.
pluginType: A plug-in type. This type must derive from Rhino.PlugIns.PlugIn.
printDebugMessages: true if debug messages should be printed.
Returns: A new plug-in instance.
Since: 5.0

Rhino.Runtime.HostUtils.CreatePlugIn(System.Type,System.Reflection.Assembly,System.Boolean,System.Boolean)
Instantiates a plug-in type and registers the associated commands and classes.
pluginType: A plug-in type. This type must derive from Rhino.PlugIns.PlugIn.
pluginAssembly:
printDebugMessages: true if debug messages should be printed.
useRhinoDotNet:
Returns: A new plug-in instance.

Rhino.Runtime.HostUtils.DisplayOleAlerts(System.Boolean)
Defines if Ole alerts ("Server busy") alerts should be visualized.
This function makes no sense on Mono.
display: Whether alerts should be visible.
Since: 5.0

Rhino.Runtime.HostUtils.GetSystemProcessorCount
Get the processor count on this hardware. It supports
querying on CPUs with more than 64 processors (Windows).
Since: 7.4

Rhino.Runtime.HostUtils.GetRhinoDotNetAssembly
Only works on Windows. Returns null on Mac.
Returns: An assembly.
Since: 5.0

Rhino.Runtime.HostUtils.SetInShutDown
Informs the runtime that the application is shutting down.
Since: 5.0