Rhino.Geometry.CurveOrientation
Defines enumerated values for closed curve orientations.
Since: 5.0

Rhino.Geometry.CurveOrientation.Undefined
Unable to compute the curve's orientation.

Rhino.Geometry.CurveOrientation.Clockwise
The curve's orientation is clockwise in the XY plane.

Rhino.Geometry.CurveOrientation.CounterClockwise
The curve's orientation is counter clockwise in the XY plane.