Rhino.Runtime.HostUtils.LogMessageType
Represents the type of message that is being sent to the OnSendLogMessageToCloud event
Since: 6.4

Rhino.Runtime.HostUtils.LogMessageType.unknown
Unknown message type

Rhino.Runtime.HostUtils.LogMessageType.information
Message is informational only

Rhino.Runtime.HostUtils.LogMessageType.warning
Message is a warning

Rhino.Runtime.HostUtils.LogMessageType.error
Message is an error

Rhino.Runtime.HostUtils.LogMessageType.assert
Message is a debug ASSERT