Rhino.FileIO.Nrbf.BinaryFormatter
.NET Remoting Binary Format formatter
Remarks:

Rhino.FileIO.Nrbf.BinaryFormatter.#ctor
Initializes a new instance of the BinaryFormatter

Rhino.FileIO.Nrbf.BinaryFormatter.#ctor(Rhino.FileIO.SerializationOptions)
Initializes a new instance of the BinaryFormatter
options:

Rhino.FileIO.Nrbf.BinaryFormatter.Options
Gets or sets the Rhino.FileIO.SerializationOptions for this formatter.

Rhino.FileIO.Nrbf.BinaryFormatter.Serialize(System.IO.Stream,System.Object)
Writes a graph of objects to the current stream.
stream:
graph:
Throws System.Runtime.Serialization.SerializationException:

Rhino.FileIO.Nrbf.BinaryFormatter.Deserialize(System.IO.Stream)
Reads a graph of objects from the current stream.
stream:
Returns:
Throws System.Runtime.Serialization.SerializationException:

Rhino.FileIO.Nrbf.BinaryFormatter.TryDeconstruct(System.Object,System.Collections.Generic.IReadOnlyDictionary{System.String,System.Object}@)
Try to deconstruct an object into its type and member values
serializable:
members:
Returns:
Throws System.NotImplementedException:

Rhino.FileIO.Nrbf.BinaryFormatter.TryConstruct(System.Type,System.Collections.Generic.IReadOnlyDictionary{System.String,System.Object}@)
Try to construct an object from its type and member values
type:
members:
Returns: