Rhino.RhinoDoc.RenderContentTableEventArgs
Passed to the Rhino.RhinoDoc.RenderMaterialsTableEvent, Rhino.RhinoDoc.RenderEnvironmentTableEvent and the
Rhino.RhinoDoc.RenderTextureTableEvent events.

Rhino.RhinoDoc.RenderContentTableEventArgs.Document
Document the table belongs to
Since: 5.7

Rhino.RhinoDoc.RenderContentTableEventArgs.EventType
Event type
Since: 5.7