Rhino.DocObjects.AnimationProperties
Contains information used by the Animation Tools to create sun, season,
turntable and fly through animations.

Rhino.DocObjects.AnimationProperties.#ctor
Initializes a new instance of the Rhino.DocObjects.AnimationProperties class.
Since: 6.11

Rhino.DocObjects.AnimationProperties.#ctor(Rhino.DocObjects.AnimationProperties)
Initialize new instance of the AnimationProperties class.
source: If not null, settings are copied from source
Since: 6.11

Rhino.DocObjects.AnimationProperties.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.DocObjects.AnimationProperties.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 6.11

Rhino.DocObjects.AnimationProperties.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.DocObjects.AnimationProperties.CaptureType
Gets or sets the capture type of the animation.
Since: 6.11

Rhino.DocObjects.AnimationProperties.FileExtension
Gets or sets the file extension of the saved frames created by the animation.
Since: 6.11

Rhino.DocObjects.AnimationProperties.CaptureMethod
Gets or sets the capture method of the animation which is either preview or full.
Since: 6.11

Rhino.DocObjects.AnimationProperties.ViewportName
Gets or sets the viewport that will be captured.
Since: 6.11

Rhino.DocObjects.AnimationProperties.AnimationName
Gets or sets the name of the animation sequence.
Since: 6.11

Rhino.DocObjects.AnimationProperties.DisplayMode
Gets or sets the ID of the view display mode (wireframe, shaded...).
Since: 6.11

Rhino.DocObjects.AnimationProperties.CameraPoints
Gets or sets points of the camera path.
Since: 6.11

Rhino.DocObjects.AnimationProperties.TargetPoints
Gets or sets points of the target path.
Since: 6.11

Rhino.DocObjects.AnimationProperties.FrameCount
Gets or sets the number of frames to be captured.
Since: 6.11

Rhino.DocObjects.AnimationProperties.CurrentFrame
Gets or sets the current frame during animation record.
Since: 7.12

Rhino.DocObjects.AnimationProperties.CameraPathId
Gets or sets the object ID of the camera path.
Since: 6.11

Rhino.DocObjects.AnimationProperties.TargetPathId
Gets or sets the object ID of the target path.
Since: 6.11

Rhino.DocObjects.AnimationProperties.Latitude
Gets or sets the latitude for sun animations in the range of -90 to +90.
Since: 6.11

Rhino.DocObjects.AnimationProperties.Longitude
Gets or sets the longitude for sun animations in the range of -180 to +180.
Since: 6.11

Rhino.DocObjects.AnimationProperties.NorthAngle
Gets or sets the world angle corresponding to North in degrees.
This angle is zero along the x-axis and increases anticlockwise.
Since: 6.11

Rhino.DocObjects.AnimationProperties.StartDay
Gets or sets the start day for seasonal/one day sun animation in the range 1 to 31.
Since: 6.11

Rhino.DocObjects.AnimationProperties.StartMonth
Gets or sets the start month for seasonal/one day sun animation in the range 1 to 12.
Since: 6.11

Rhino.DocObjects.AnimationProperties.StartYear
Gets or sets the start year for seasonal/one day sun animation in the range 1800 to 2199.
Since: 6.11

Rhino.DocObjects.AnimationProperties.StartHour
Gets or sets the start hour for seasonal/one day sun animation in the range 0 to 23.
Since: 6.11

Rhino.DocObjects.AnimationProperties.StartMinutes
Gets or sets the start minutes for seasonal/one day sun animation in the range 0 to 59.
Since: 6.11

Rhino.DocObjects.AnimationProperties.StartSeconds
Gets or sets the start seconds for seasonal/one day sun animation in the range 0 to 59.
Since: 6.11

Rhino.DocObjects.AnimationProperties.EndDay
Gets or sets the end day for seasonal day sun animation in the range 1 to 31.
Since: 6.11

Rhino.DocObjects.AnimationProperties.EndMonth
Gets or sets the end month for seasonal day sun animation in the range 1 to 12.
Since: 6.11

Rhino.DocObjects.AnimationProperties.EndYear
Gets or sets the end year for seasonal day sun animation in the range 1800 to 2199.
Since: 6.11

Rhino.DocObjects.AnimationProperties.EndHour
Gets or sets the end hour for one day sun animation in the range 0 to 23.
Since: 6.11

Rhino.DocObjects.AnimationProperties.EndMinutes
Gets or sets the end minutes for one day sun animation in the range 0 to 59.
Since: 6.11

Rhino.DocObjects.AnimationProperties.EndSeconds
Gets or sets the end seconds for one day sun animation in the range 0 to 59.
Since: 6.11

Rhino.DocObjects.AnimationProperties.DaysBetweenFrames
Gets or sets the days between captured frames for seasonal sun animation.
Since: 6.11

Rhino.DocObjects.AnimationProperties.MinutesBetweenFrames
Gets or sets the minutes between captured frames for one day sun animation.
Since: 6.11

Rhino.DocObjects.AnimationProperties.LightIndex
Internal value used while previewing animation.
Since: 6.11

Rhino.DocObjects.AnimationProperties.FolderName
Gets or sets the location for the saved frames.
Since: 6.11

Rhino.DocObjects.AnimationProperties.HtmlFileName
Gets or sets the HTML file name. This property is the same as Rhino.DocObjects.AnimationProperties.AnimationName.
Since: 7.12

Rhino.DocObjects.AnimationProperties.HtmlFullPath
Return HTML file path consisting of FolderName and HtmlFileName.
To change this set FolderName and HtmlFileName.
Since: 7.12

Rhino.DocObjects.AnimationProperties.Images
Gets or sets the full path to the saved frames of an animation.
Since: 6.11

Rhino.DocObjects.AnimationProperties.Dates
Gets or sets the dates that are calculated for seasonal/one day sun animations.
Since: 6.11

Rhino.DocObjects.AnimationProperties.RenderFull
Gets or sets a value indicating whether to capture a frame in rendered mode.
Since: 6.11

Rhino.DocObjects.AnimationProperties.RenderPreview
Gets or sets a value indicating whether to capture a frame in preview rendered mode.
Since: 6.11