Rhino.Geometry.SurfaceFillet
New interactive FilletSrf

Rhino.Geometry.SurfaceFillet.#ctor(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,System.Double)
FaceA:
uvA:
FaceB:
uvB:
radius:
tolerance:

Rhino.Geometry.SurfaceFillet.#ctor(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double,System.Boolean,System.Double)
FaceA:
uvA:
FaceB:
uvB:
radius:
allowExtend:
tolerance:

Rhino.Geometry.SurfaceFillet.ChangeRadius(System.Double)
This will clear out the existing rails and fillet surfaces,
and redo the offset intersections, etc.
radius: The new radius
Returns: true if successful