Rhino.DocObjects.Custom.ObjectGripsType
The kind of grips a Rhino.DocObjects.Custom.CustomObjectGrips presents. Several Rhino commands
dispatch on this, so claiming a control point type is what lets a plug-in's grips reach
code paths otherwise reserved for Rhino's own curve and surface control points.
Remarks:
The values match the native CRhinoGripObject::GRIP_TYPE numbering, so further types can be
added here later without changing any signature.

Rhino.DocObjects.Custom.ObjectGripsType.CurveControlPoint
The grips control the control points of a NURBS curve. A grip that does not report the
control points it drives is skipped, not reported as an error.

Rhino.DocObjects.Custom.ObjectGripsType.SurfaceControlPoint
The grips control the control points of a NURBS surface. A grip that does not report the
control points it drives is skipped, not reported as an error.

Rhino.DocObjects.Custom.ObjectGripsType.Custom
The grips mean something private to the plug-in. Rhino draws a drag line for them.

Rhino.DocObjects.Custom.ObjectGripsType.CustomNoDragLine
As Rhino.DocObjects.Custom.ObjectGripsType.Custom, but Rhino draws no drag line.