Rhino.Render.ChangeQueue.GroundPlane
ChangeQueue ground plane

Rhino.Render.ChangeQueue.GroundPlane.IsShadowOnly
Get true if ground plane should be shadow-only
Since: 6.0

Rhino.Render.ChangeQueue.GroundPlane.ShowUnderside
True if ground plane underside should be shown.
Since: 7.9

Rhino.Render.ChangeQueue.GroundPlane.Altitude
Get the altitude for ground plane
Since: 6.0

Rhino.Render.ChangeQueue.GroundPlane.MaterialId
The CRC / RenderHash of the material on this ground plane
Since: 6.0

Rhino.Render.ChangeQueue.GroundPlane.TextureScale
Get texture scale on the ground plane
Since: 6.0

Rhino.Render.ChangeQueue.GroundPlane.TextureOffset
Get texture offset on the ground plane
Since: 6.0

Rhino.Render.ChangeQueue.GroundPlane.TextureRotation
Get texture rotation on the ground plane
Since: 6.0

Rhino.Render.ChangeQueue.GroundPlane.Enabled
Return true if ground plane is enabled
Since: 6.0

Rhino.Render.ChangeQueue.GroundPlane.Crc
Get the checksum of this groundplane object
Since: 6.0