Rhino.Runtime.ImportOptionsSections
Standard CRhImportOptions sections to import

Rhino.Runtime.ImportOptionsSections.AdvancedDisplay


Rhino.Runtime.ImportOptionsSections.Alias


Rhino.Runtime.ImportOptionsSections.Appearance


Rhino.Runtime.ImportOptionsSections.ChooseOneObject


Rhino.Runtime.ImportOptionsSections.ControlPointContextMenu


Rhino.Runtime.ImportOptionsSections.CursorToolTip


Rhino.Runtime.ImportOptionsSections.Display


Rhino.Runtime.ImportOptionsSections.File


Rhino.Runtime.ImportOptionsSections.General


Rhino.Runtime.ImportOptionsSections.Grid


Rhino.Runtime.ImportOptionsSections.ModelAid


Rhino.Runtime.ImportOptionsSections.Mouse


Rhino.Runtime.ImportOptionsSections.NeverRepeatCommands


Rhino.Runtime.ImportOptionsSections.ObjectContextMenu


Rhino.Runtime.ImportOptionsSections.SearchPath


Rhino.Runtime.ImportOptionsSections.ShortcutKey


Rhino.Runtime.ImportOptionsSections.Smarttrack


Rhino.Runtime.ImportOptionsSections.View


Rhino.Runtime.ImportOptionsSections.ViewportContextMenu


Rhino.Runtime.ImportOptionsSections.ToolPaletteSettings
Tool palette settings for Mac, ignored for Windows

Rhino.Runtime.ImportOptionsSections.Count
Must always be the last item