Rhino.Geometry.Collections.BrepEdgeList
Provides access to all the Edges in a Brep object.

Rhino.Geometry.Collections.BrepEdgeList.Count
Gets the number of brep edges.
Since: 5.0

Rhino.Geometry.Collections.BrepEdgeList.Item(System.Int32)
Gets the BrepEdge at the given index.
The index must be valid or an IndexOutOfRangeException will be thrown.
index: Index of BrepEdge to access.
Throws System.IndexOutOfRangeException: Thrown when the index is invalid.
Returns: The BrepEdge at [index].

Rhino.Geometry.Collections.BrepEdgeList.RemoveNakedMicroEdges(System.Double)
Finds any naked edges with the same start and end vertex and an arc-length less than tolerance
and attempts to remove them by removing trims and extending the adjacent to meet.
tolerance: The tolerance. When in doubt, use the document's model absolute tolerance.
Returns: The number of naked micro edges that were removed.
Since: 7.0

Rhino.Geometry.Collections.BrepEdgeList.RemoveNakedMicroEdges(System.Double,System.Boolean)
Finds any naked edges with the same start and end vertex and an arc-length less than tolerance
and attempts to remove them by removing trims and extending the adjacent to meet.
tolerance: The tolerance. When in doubt, use the document's model absolute tolerance.
cleanUp:
If true, then the method cleans up the Brep by setting tolerances, boxes, flags, and then compacts.
If false, then the caller should do this at some point.
Returns: The number of naked micro edges that were removed.
Since: 7.0

Rhino.Geometry.Collections.BrepEdgeList.MergeEdge(System.Int32,System.Double)
Merge adjacent edges to a specified edge recursively.
A pair of adjacent edges in a Brep  are mergeable if the angle between them is less than tolerance and the valence of the shared vertex is 2.
edgeIndex: >Index of edge to merge.
angleTolerance: The maximum allowable difference of angle in radian between adjacent edges that can be merged.
Returns: The number of edges merged.
Since: 6.23

Rhino.Geometry.Collections.BrepEdgeList.MergeAllEdges(System.Double)
Merges all possible Brep edges. Edges across kinks cannot be merged.
A pair of adjacent edges in a Brep  are mergeable if the angle between them is less than tolerance and the valence of the shared vertex is 2.
angleTolerance: The maximum allowable difference of angle in radian between adjacent edges that can be merged.
Returns: The number of edges merged.
Since: 6.23

Rhino.Geometry.Collections.BrepEdgeList.SplitKinkyEdge(System.Int32,System.Double)
Splits the edge into G1 pieces.
edgeIndex: Index of edge to test and split.
kinkToleranceRadians: The split tolerance in radians.
Returns: true if successful.
Remarks:
This function leaves deleted stuff in the brep.  Call Brep.Compact() to
remove deleted stuff.
Since: 5.0

Rhino.Geometry.Collections.BrepEdgeList.SplitEdgeAtParameters(System.Int32,System.Collections.Generic.IEnumerable{System.Double})
Splits an edge at the specified parameters.
edgeIndex: The index of the edge to be addressed.
edgeParameters: The parameter along that edge.
Returns:
Number of splits applied to the edge.
Remarks:
This function leaves deleted stuff in the brep.  Call Brep.Compact() to
remove deleted stuff.
Since: 5.0

Rhino.Geometry.Collections.BrepEdgeList.Add(System.Int32)
Create and add a new edge to this list
curve3dIndex:
Returns:
Since: 5.4

Rhino.Geometry.Collections.BrepEdgeList.Add(Rhino.Geometry.BrepVertex,Rhino.Geometry.BrepVertex,System.Int32,Rhino.Geometry.Interval,System.Double)
Create and add a new edge to this list
startVertex:
endVertex:
curve3dIndex:
subDomain:
edgeTolerance:
Returns:
Since: 5.4

Rhino.Geometry.Collections.BrepEdgeList.Add(Rhino.Geometry.BrepVertex,Rhino.Geometry.BrepVertex,System.Int32,System.Double)
Create and add a new edge to this list
startVertex:
endVertex:
curve3dIndex:
edgeTolerance:
Returns:
Since: 5.4

Rhino.Geometry.Collections.BrepEdgeList.Add(System.Int32,System.Int32,System.Int32,Rhino.Geometry.Interval,System.Double)
Create and add a new edge to this list
startVertexIndex:
endVertexIndex:
curve3dIndex:
subDomain:
edgeTolerance:
Returns:
Since: 5.6

Rhino.Geometry.Collections.BrepEdgeList.Add(System.Int32,System.Int32,System.Int32,System.Double)
Create and add a new edge to this list
startVertexIndex:
endVertexIndex:
curve3dIndex:
edgeTolerance:
Returns:
Since: 5.6

Rhino.Geometry.Collections.BrepEdgeList.System#Collections#IEnumerable#GetEnumerator
Gets the same enumerator as Rhino.Geometry.Collections.BrepEdgeList.GetEnumerator.
Returns: The enumerator.
Since: 5.0

Rhino.Geometry.Collections.BrepEdgeList.GetEnumerator
Gets an enumerator that visits all edges.
Returns: The enumerator.
Since: 5.0