Rhino.Runtime.RhinoAccounts.RhinoAccountsProxyException
Exception thrown when there is a problem with a proxy setting during a Rhino Accounts operation.

Rhino.Runtime.RhinoAccounts.RhinoAccountsProxyException.#ctor(System.String,System.Exception)
Generates a new instance of the exception.
message: The message of the exception.
innerException: The inner exception.
Since: 7.0

Rhino.Runtime.RhinoAccounts.RhinoAccountsProxyException.#ctor(System.Exception)
Generates a new instance of the exception.
innerException: The inner exception.
Since: 7.0