Rhino.Runtime.NamedParametersEventArgs
Dictionary style class used for named callbacks from C++ -> .NET

Rhino.Runtime.NamedParametersEventArgs.#ctor
Construct a new named parameter even args. You should dispose this class when you are done with it
Since: 7.0

Rhino.Runtime.NamedParametersEventArgs.Finalize
Finalizer in case Dispose wasn't called

Rhino.Runtime.NamedParametersEventArgs.Dispose
Dispose native resources
Since: 7.0

Rhino.Runtime.NamedParametersEventArgs.TryGetString(System.String,System.String@)
Try to get a string value for a given key name
name:
value:
Returns:
Since: 6.15

Rhino.Runtime.NamedParametersEventArgs.Set(System.String,System.String)
Set a string value for a given key name
name:
value:
Since: 7.0

Rhino.Runtime.NamedParametersEventArgs.TryGetStrings(System.String,System.String[]@)
Try to get a string array for a given key name
name:
value:
Returns:
Since: 7.0

Rhino.Runtime.NamedParametersEventArgs.Set(System.String,System.Collections.Generic.IEnumerable{System.String})
Set a list of strings as a value for a given key name
name:
strings:
Since: 7.0

Rhino.Runtime.NamedParametersEventArgs.TryGetObjRefs(System.String,Rhino.DocObjects.ObjRef[]@)
Try to get an array of ObjRef instances for a given key name
name:
value:
Returns:
Since: 8.0

Rhino.Runtime.NamedParametersEventArgs.Set(System.String,System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjRef})
Set a list of ObjRef instances as a value for a given key name
name:
values:
Since: 8.0

Rhino.Runtime.NamedParametersEventArgs.TryGetUints(System.String,System.UInt32[]@)
Try to get a uint array value for a given key name
name:
value:
Returns:
Since: 8.0

Rhino.Runtime.NamedParametersEventArgs.Set(System.String,System.Collections.Generic.IEnumerable{System.UInt32})
Set a list of uint as a value for a given key name
name:
values:
Since: 8.0

Rhino.Runtime.NamedParametersEventArgs.TryGetGuids(System.String,System.Guid[]@)
Try to get a UUID array value for a given key name
name:
value:
Returns:
Since: 7.0

Rhino.Runtime.NamedParametersEventArgs.Set(System.String,System.Collections.Generic.IEnumerable{System.Guid})
Set a list of UUIDs as a value for a given key name
name:
guidList:
Since: 7.0

Rhino.Runtime.NamedParametersEventArgs.TryGetBool(System.String,System.Boolean@)
Try to get a bool value for a given key name
name:
value:
Returns:
Since: 6.15

Rhino.Runtime.NamedParametersEventArgs.Set(System.String,System.Boolean)
Set a bool value for a given key name
name:
value:
Since: 7.0

Rhino.Runtime.NamedParametersEventArgs.TryGetInt(System.String,System.Int32@)
Try to get an int value for a given key name
name:
value:
Returns:
Since: 6.15

Rhino.Runtime.NamedParametersEventArgs.Set(System.String,System.Int32)
Set an int value for a given key name
name:
value:
Since: 7.0

Rhino.Runtime.NamedParametersEventArgs.TryGetUnsignedInt(System.String,System.UInt32@)
Try to get an unsigned int for a given key name
name:
value:
Returns:
Since: 7.0

Rhino.Runtime.NamedParametersEventArgs.Set(System.String,System.UInt32)
Set an unsigned int for a given key name
name:
value:
Since: 7.0

Rhino.Runtime.NamedParametersEventArgs.TryGetDouble(System.String,System.Double@)
Try to get a double value for a given key name
name:
value:
Returns:
Since: 6.15

Rhino.Runtime.NamedParametersEventArgs.Set(System.String,System.Double)
Set a double value for a given key name
name:
value:
Since: 7.0

Rhino.Runtime.NamedParametersEventArgs.TryGetPoint2i(System.String,System.Drawing.Point@)
Try to get a Point value for a given key name
name:
value:
Returns:
Since: 8.0

Rhino.Runtime.NamedParametersEventArgs.Set(System.String,System.Drawing.Point)
Set a Point value for a given key name
name:
value:
Since: 8.0

Rhino.Runtime.NamedParametersEventArgs.TryGetPoint(System.String,Rhino.Geometry.Point3d@)
Try to get a Point3d value for a given key name
name:
value:
Returns:
Since: 7.0

Rhino.Runtime.NamedParametersEventArgs.Set(System.String,Rhino.Geometry.Point3d)
Set a Point3d value for a given key name
name:
value:
Since: 7.0

Rhino.Runtime.NamedParametersEventArgs.TryGetVector(System.String,Rhino.Geometry.Vector3d@)
Try to get a Vector3d value for a given key name
name:
value:
Returns:
Since: 7.0

Rhino.Runtime.NamedParametersEventArgs.Set(System.String,Rhino.Geometry.Vector3d)
Set a Vector3d value for a given key name
name:
value:
Since: 7.0

Rhino.Runtime.NamedParametersEventArgs.TryGetColor(System.String,System.Drawing.Color@)
Try to get a Color value for a given key name
name:
value:
Returns:
Since: 7.0

Rhino.Runtime.NamedParametersEventArgs.Set(System.String,System.Drawing.Color)
Set a Color value for a given key name
name:
value:
Since: 7.0

Rhino.Runtime.NamedParametersEventArgs.TryGetGuid(System.String,System.Guid@)
Try to get a Color value for a given key name
name:
value:
Returns:
Since: 7.0

Rhino.Runtime.NamedParametersEventArgs.Set(System.String,System.Guid)
Set a Color value for a given key name
name:
value:
Since: 7.0

Rhino.Runtime.NamedParametersEventArgs.TryGetViewport(System.String,Rhino.DocObjects.ViewportInfo@)
Try to get a viewport for a given key name
name:
viewport:
Returns:
Since: 7.0

Rhino.Runtime.NamedParametersEventArgs.Set(System.String,Rhino.Geometry.GeometryBase)
Set geometry for a given key name
name:
value:
Since: 7.0

Rhino.Runtime.NamedParametersEventArgs.Set(System.String,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})
Set a list of geometry for a given key name
name:
values:
Since: 7.0

Rhino.Runtime.NamedParametersEventArgs.SetWindowHandle(System.String,System.IntPtr)
Set a HWND on Windows or NSView* on Mac
name:
value:
Since: 7.0

Rhino.Runtime.NamedParametersEventArgs.TryGetWindowImageHandle(System.String,System.IntPtr@)
Gets a HWND on Windows or NSVIew* on Mac
name:
value:
Returns:
Since: 7.0

Rhino.Runtime.NamedParametersEventArgs.SetWindowImageHandle(System.String,System.IntPtr)
Set a HWND on Windows or NSView* on Mac
name:
value:
Since: 7.0

Rhino.Runtime.NamedParametersEventArgs.TryGetWindowHandle(System.String,System.IntPtr@)
Gets a HWND on Windows or NSVIew* on Mac
name:
value:
Returns:
Since: 7.0

Rhino.Runtime.NamedParametersEventArgs.TryGetUnmangedPointer(System.String,System.IntPtr@)
Gets a HWND on Windows or NSVIew* on Mac
name:
value:
Returns:
Since: 7.0

Rhino.Runtime.NamedParametersEventArgs.TryGetGeometry(System.String,Rhino.Geometry.GeometryBase[]@)
name:
values:
Returns:
Since: 7.0

Rhino.Runtime.NamedParametersEventArgs.TryGetRhinoObjects(System.String,Rhino.DocObjects.RhinoObject[]@)
Get array of RhinoObject for the specified key
key:
values:
Returns:
Since: 7.0

Rhino.Runtime.NamedParametersEventArgs.TryGetHatchObjects(System.String,System.Collections.Generic.List{Rhino.DocObjects.HatchObject}@)
Keep internal for now. This is used by the hatch command.
name:
value:
Returns:

Rhino.Runtime.NamedParametersEventArgs.SetHatchObjects(System.String,System.Collections.Generic.IEnumerable{Rhino.DocObjects.HatchObject})
Keep internal for now. This is used by the hatch command.
name:
value:

Rhino.Runtime.NamedParametersEventArgs.TryGetLine(System.String,Rhino.Geometry.Line@)
Get a line for the specified key
name:
value:
Returns:
Since: 8.0

Rhino.Runtime.NamedParametersEventArgs.Set(System.String,Rhino.Geometry.Line)
Set a line for the specified key
name:
value:
Since: 8.0

Rhino.Runtime.NamedParametersEventArgs.TryGetArc(System.String,Rhino.Geometry.Arc@)
Get a arc for the specified key
name:
value:
Returns:
Since: 8.0

Rhino.Runtime.NamedParametersEventArgs.Set(System.String,Rhino.Geometry.Arc)
Set an arc for the specified key
name:
value:
Since: 8.0

Rhino.Runtime.NamedParametersEventArgs.TryGetPlane(System.String,Rhino.Geometry.Plane@)
Get a plane for the specified key
name:
plane:
Returns:
Since: 8.0

Rhino.Runtime.NamedParametersEventArgs.Set(System.String,Rhino.Geometry.Plane)
Set a plane for the specified key
name:
plane:
Since: 8.0

Rhino.Runtime.NamedParametersEventArgs.TryGetPoints(System.String,Rhino.Geometry.Point3d[]@)
Gets a point array for the specified key
name:
pts:
Returns:
Since: 8.0

Rhino.Runtime.NamedParametersEventArgs.Set(System.String,Rhino.Geometry.Point3d[])
Set a point array for the specified key
name:
pts:
Since: 8.0

Rhino.Runtime.NamedParametersEventArgs.TryGetMeshParameters(System.String,Rhino.Geometry.MeshingParameters@)
Get an MeshingParameters for the specified key
name:
value:
Returns:
Since: 8.0

Rhino.Runtime.NamedParametersEventArgs.Set(System.String,Rhino.Geometry.MeshingParameters)
Set an MeshingParameters for the specified key
name:
value:
Since: 8.0