Rhino.ReadFileResult
ON::ReadFileResult reports what happened when a file read was attempted.

Rhino.ReadFileResult.Unset
No result is available.

Rhino.ReadFileResult.Completed
Read completed with no errors.

Rhino.ReadFileResult.CompletedWithErrors
Read completed with non fatal errors.

Rhino.ReadFileResult.Failed
Read failed.