Rhino.UI.RhinoUiServiceLocater
A single instance of this class is created in Rhino.UI.Runtime.Initialization.Initialize
located in  ...\src4\DotNetSDK\Rhino.UI\Runtime\Initialization.cs

Rhino.UI.RhinoUiServiceLocater.DialogService
Get the Rhino.UI assemblies IRhinoUiDialogService or return NotImplementedRhinoUiDialogService