Rhino.Display.DisplayPipeline
The display pipeline calls events during specific phases of drawing
During the drawing of a single frame the events are called in the following order.
[Begin Drawing of a Frame]
CalculateBoundingBox
CalculateClippingPanes
SetupFrustum
SetupLighting
InitializeFrameBuffer
DrawBackground
If this is a layout and detail objects exist the channels are called in the
same order for each detail object (drawn as a nested viewport)
PreDrawObjects
For Each Visible Non Highlighted Object
SetupObjectDisplayAttributes
PreDrawObject
DrawObject
PostDrawObject
PostDrawObjects - depth writing/testing on
DrawForeGround - depth writing/testing off
For Each Visible Highlighted Object
SetupObjectDisplayAttributes
PreDrawObject
DrawObject
PostDrawObject
PostProcessFrameBuffer (If a delegate exists that requires this)
DrawOverlay (if Rhino is in a feedback mode)
[End of Drawing of a Frame]
NOTE: There may be multiple DrawObject calls for a single object. An example of when this could
happen would be with a shaded sphere. The shaded mesh is first drawn and these channels would
be processed; then at a later time the isocurves for the sphere would be drawn.

Rhino.Display.DisplayPipeline.ObjectCulling
Since: 5.3

Rhino.Display.DisplayPipeline.CalculateBoundingBox
Since: 5.0

Rhino.Display.DisplayPipeline.CalculateBoundingBoxZoomExtents
Calculate a bounding to include in the Zoom Extents command.
Since: 5.0

Rhino.Display.DisplayPipeline.InitFrameBuffer
Since: 6.18

Rhino.Display.DisplayPipeline.PreDrawObjects
Called before objects are been drawn. Depth writing and testing are on.
Since: 5.0

Rhino.Display.DisplayPipeline.PreDrawTransparentObjects
Called before transparent objects have been drawn. Depth writing and testing are on.
Since: 6.12

Rhino.Display.DisplayPipeline.PreDrawObject
Called right before an individual object is being drawn. NOTE: Do not use this event
unless you absolutely need to.  It is called for every object in the document and can
slow display down if a large number of objects exist in the document
Since: 5.0

Rhino.Display.DisplayPipeline.PostDrawObject
Called right after an individual object has been drawn. NOTE: Do not use this event
unless you absolutely need to.  It is called for every object in the document and can
slow display down if a large number of objects exist in the document
Since: 7.0

Rhino.Display.DisplayPipeline.PostDrawObjects
Called after all non-highlighted objects have been drawn. Depth writing and testing are
still turned on. If you want to draw without depth writing/testing, see DrawForeground.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawForeground
Called after all non-highlighted objects have been drawn and PostDrawObjects has been called.
Depth writing and testing are turned OFF. If you want to draw with depth writing/testing,
see PostDrawObjects.
Remarks:
This event is actually passed a DrawForegroundEventArgs, but we could not change
the event declaration without breaking the SDK. Cast to a DrawForegroundEventArgs
if you need it.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawOverlay
If Rhino is in a feedback mode, the draw overlay call allows for temporary geometry to be drawn on top of
everything in the scene. This is similar to the dynamic draw routine that occurs with custom get point.
Since: 5.0

Rhino.Display.DisplayPipeline.ViewportProjectionChanged
Called when the projection changes for a viewport being drawn.
Since: 6.18

Rhino.Display.DisplayPipeline.DisplayModeChanged
Since: 6.18

Rhino.Display.DisplayPipeline.Technology
Get the GPU technology that this pipeline is actively using
Since: 8.35

Rhino.Display.DisplayPipeline.FrameSize
Gets the size of the frame buffer that this pipeline is drawing to.
Since: 5.0

Rhino.Display.DisplayPipeline.FrameBuffer
Gets the contents of the frame buffer that this pipeline is drawing to.
Since: 6.0

Rhino.Display.DisplayPipeline.IsInTiledDraw(System.Drawing.Size@,System.Drawing.Rectangle@)
Returns true if the currently drawn frame is part of a tiled capture. Tiled captures
are performed when creating large raster outputs.
fullSize: Final full size area that is being created
currentTile: What portion of the fullSize area that is currently being drawn
Returns:
true if a tiled capture is being performed. If false, the fullSize parameter will have the
same size as currentTile
Since: 8.2

Rhino.Display.DisplayPipeline.DefaultCurveThickness
Gets the curve thickness as defined by the current display mode.
Note: this only applies to curve objects, Brep and Mesh wires may have different settings.
Since: 5.0

Rhino.Display.DisplayPipeline.IsOpenGL
Gets a value indicating whether or not this pipeline is drawing into an OpenGL context.
Since: 5.0

Rhino.Display.DisplayPipeline.AvailableOpenGLVersion(System.Boolean@)
If Rhino is using OpenGL for display, this function will return
major.minor version of OpenGL available for this instance of Rhino
coreProfile:
If true, OpenGL is being used in "core profile" mode
Returns:
major version * 10 + minor version
For example, OpenGL 4.5 returns 45
Since: 6.21

Rhino.Display.DisplayPipeline.MakeDefaultOpenGLContextCurrent
Make a "default" OpenGL context current
Returns:
Since: 7.0

Rhino.Display.DisplayPipeline.IsStereoMode
Gets a value that indicates whether this pipeline is currently using an
engine that is performing stereo style drawing. Stereo drawing is for
providing an "enhanced 3-D" effect through stereo viewing devices.
Since: 5.0

Rhino.Display.DisplayPipeline.IsPrinting
Gets a value that indicates whether this pipeline
is currently drawing for printing purposes.
Since: 5.0

Rhino.Display.DisplayPipeline.IsInViewCapture
Gets a value that indicates whether this pipeline is currently drawing
for ViewCaptureToFile or ViewCaptureToClipboard
Since: 6.0

Rhino.Display.DisplayPipeline.IsDynamicDisplay
Gets a value that indicates whether the viewport is in Dynamic Display state.
Dynamic display is the state a viewport is in when it is rapidly redrawing because of
an operation like panning or rotating. The pipeline will drop some level of detail
while inside a dynamic display state to keep the frame rate as high as possible.
Since: 5.0

Rhino.Display.DisplayPipeline.SupportsShading
Gets whether or not this pipeline supports shaded meshes.
Since: 5.0

Rhino.Display.DisplayPipeline.StereoProjection
Gets the current stereo projection if stereo mode is on.
0 = left
1 = right
If stereo mode is not enables, this property always returns 0.
Since: 5.0

Rhino.Display.DisplayPipeline.ModelTransform
Gets or sets the current model transformation that is applied to vertices when drawing.
Since: 5.0

Rhino.Display.DisplayPipeline.ModelTransformIsIdentity
Gets a value that indicates whether the Model Transform is an Identity transformation.
Since: 5.0

Rhino.Display.DisplayPipeline.RenderPass
Gets the current pass that the pipeline is in for drawing a frame.
Typically drawing a frame requires a single pass through the DrawFrameBuffer
function, but some special display effects can be achieved through
drawing with multiple passes.
Since: 5.0

Rhino.Display.DisplayPipeline.NestLevel
Gets the current nested viewport drawing level.
This is used to know if you are currently inside the drawing of a nested viewport (detail object in Rhino).
Nest level = 0 Drawing is occurring in a standard Rhino viewport or on the page viewport.
Nest level = 1 Drawing is occurring inside a detail view object.
Since: 5.0

Rhino.Display.DisplayPipeline.ActiveTopLevelObject
Since: 6.7

Rhino.Display.DisplayPipeline.ActiveObject
Since: 6.7

Rhino.Display.DisplayPipeline.ActiveObjectNestingLevel
Since: 6.7

Rhino.Display.DisplayPipeline.ActiveObjectNestingStack
Since: 6.7

Rhino.Display.DisplayPipeline.Open
Opens the pipeline.
Returns: True if the pipeline was opened, false if it was already open
or failed to open.
Since: 7.0

Rhino.Display.DisplayPipeline.IsOpen
Is true of the pipeline is open, false otherwise.
Since: 7.0

Rhino.Display.DisplayPipeline.Close
Closes the pipeline.
Returns: True if the pipeline was closed, false if it was already closed
or failed to close.
Since: 7.0

Rhino.Display.DisplayPipeline.Clone(Rhino.Display.RhinoViewport)
Clones the pipeline. Creates an identical copy of "this" pipeline.
Copies all conduits from "this" pipeline to the new pipeline.
Returns: The newly cloned pipeline if successful, null otherwise.
or failed to close.
Since: 7.0

Rhino.Display.DisplayPipeline.DrawingWires
Gets a value that indicates whether the pipeline is currently in a curve
drawing operation. This is useful when inside of a draw event or display
conduit to check and see if the geometry is about to be drawn is going to
be drawing the wire representation of the geometry (mesh, extrusion, or
brep).  See DrawingSurfaces to check and see if the shaded mesh representation
of the geometry is going to be drawn.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawingGrips
Gets a value that indicates whether the pipeline is currently in a grip drawing operation.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawingSurfaces
Gets a value that indicates whether the pipeline is currently in a surface
drawing operation.  Surface drawing means draw the shaded triangles of a mesh
representing the surface (mesh, extrusion, or brep).  This is useful when
inside of a draw event or display conduit to check and see if the geometry is
about to be drawn as a shaded set of triangles representing the geometry.
See DrawingWires to check and see if the wireframe representation of the
geometry is going to be drawn.
Since: 5.0

Rhino.Display.DisplayPipeline.ShadingRequired
Gets or sets the "ShadingRequired" flag. This flag gets set inside the pipeline when a request is
made to draw a shaded mesh but the current render engine doesn't support shaded
mesh drawing...at this point the redraw mechanism will make sure everything will
work the next time around.
Since: 5.0

Rhino.Display.DisplayPipeline.Viewport
Since: 5.0

Rhino.Display.DisplayPipeline.DisplayPipelineAttributes
Since: 5.3

Rhino.Display.DisplayPipeline.DpiScale
Scale factor used for high resolution displays. When a monitor that this
pipeline is drawing to is at a DPI of 96, this value is one. On high
DPI monitors, this value will commonly be greater than one.
Since: 6.0

Rhino.Display.DisplayPipeline.PushModelTransform(Rhino.Geometry.Transform)
Push a model transformation on the engine's model transform stack.
xform: Transformation to push.
Since: 5.0

Rhino.Display.DisplayPipeline.PopModelTransform
Pop a model transformation off the engine's model transform stack.
Since: 5.0

Rhino.Display.DisplayPipeline.EnableDepthTesting(System.Boolean)
Enable or disable the DepthTesting behavior of the engine.
When DepthTesting is disabled, objects in front will no
longer occlude objects behind them.
enable: true to enable DepthTesting, false to disable.
Since: 5.0

Rhino.Display.DisplayPipeline.EnableDepthWriting(System.Boolean)
Enable or disable the DepthWriting behavior of the engine.
When DepthWriting is disabled, drawn geometry does not affect the Z-Buffer.
enable: true to enable DepthWriting, false to disable.
Since: 5.0

Rhino.Display.DisplayPipeline.EnableColorWriting(System.Boolean)
Enable or disable the ColorWriting behavior of the engine.
enable: true to enable ColorWriting, false to disable.
Since: 5.0

Rhino.Display.DisplayPipeline.EnableLighting(System.Boolean)
Enable or disable the Lighting logic of the engine.
enable: true to enable Lighting, false to disable.
Since: 5.0

Rhino.Display.DisplayPipeline.GetLights
Get lights that this pipeline is current using
Returns:
Since: 6.3

Rhino.Display.DisplayPipeline.EnableClippingPlanes(System.Boolean)
Enable or disable the Clipping Plane logic of the engine.
enable: true to enable Clipping Planes, false to disable.
Since: 5.0

Rhino.Display.DisplayPipeline.AddClippingPlane(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)
Add a clipping plane to be used during the drawing of this frame
point: point on the plane
normal: vector perpendicular to the plane
Returns: index for the added clipping plane
Since: 6.3

Rhino.Display.DisplayPipeline.RemoveClippingPlane(System.Int32)
Remove a clipping plane from the pipeline for this frame
index:
Since: 6.3

Rhino.Display.DisplayPipeline.PushDepthTesting(System.Boolean)
Push a DepthTesting flag on the engine's stack.
enable: DepthTesting flag.
Since: 5.0

Rhino.Display.DisplayPipeline.PopDepthTesting
Pop a DepthTesting flag off the engine's stack.
Since: 5.0

Rhino.Display.DisplayPipeline.PushDepthWriting(System.Boolean)
Push a DepthWriting flag on the engine's stack.
enable: DepthWriting flag.
Since: 5.0

Rhino.Display.DisplayPipeline.PopDepthWriting
Pop a DepthWriting flag off the engine's stack.
Since: 5.0

Rhino.Display.DisplayPipeline.PushClipTesting(System.Boolean)
Push a ClipTesting flag on the engine's stack.
enable: ClipTesting flag.
Since: 5.0
6.0

Rhino.Display.DisplayPipeline.PopClipTesting
Pop a ClipTesting flag off the engine's stack.
Since: 5.0
6.0

Rhino.Display.DisplayPipeline.PushCullFaceMode(Rhino.Display.CullFaceMode)
Push a FaceCull flag on the engine's stack.
mode: FaceCull flag.
Since: 5.0

Rhino.Display.DisplayPipeline.PopCullFaceMode
Pop a FaceCull flag off the engine's stack.
Since: 5.0

Rhino.Display.DisplayPipeline.Push2dProjection
Push the current view projection and set the viewport up to be a
simple 2D top projection where the camera frustum matches the same
size as the screen port. This allows geometry draw functions to act
like they are working with typical 2d graphics APIs on a window
Since: 8.0

Rhino.Display.DisplayPipeline.PopProjection
Pop a view projection off this pipelines projection stack
Since: 8.0

Rhino.Display.DisplayPipeline.DepthMode
Since: 5.0

Rhino.Display.DisplayPipeline.ZBiasMode
Since: 5.0

Rhino.Display.DisplayPipeline.GetDrawListSerialNumbers(System.UInt32@,System.UInt32@)
Gets the current model and page view draw list serial numbers, which can
be used to determine if a model or page view needs to be redrawn.
modelSerialNumber: The current model draw list serial number.
pageSerialNumber: The current page view draw list serial number.
Since: 7.0

Rhino.Display.DisplayPipeline.CullControlPolygon
Returns a value indicating if only points on the side of the surface that
face the camera are displayed.
Returns: true if back faces of surface and mesh control polygons are culled.
This value is determined by the _CullControlPolygon command.
Since: 5.0

Rhino.Display.DisplayPipeline.ClearFrameBuffer(System.Drawing.Color)
Fill the frame buffer with a single color. This function also clears
the depth buffer for engines that support depth buffered drawing.
color: the color to fill the frame buffer with
Since: 8.0

Rhino.Display.DisplayPipeline.Flush
Force the pipeline to immediately flush any cached geometry to the display
Since: 7.0

Rhino.Display.DisplayPipeline.IsVisible(Rhino.Geometry.Point3d)
Test a given 3d world coordinate point for visibility inside the view
frustum under the current viewport and model transformation settings.
worldCoordinate: Point to test for visibility.
Returns: true if the point is visible, false if it is not.
Since: 5.0

Rhino.Display.DisplayPipeline.IsVisible(Rhino.DocObjects.RhinoObject)
Test a given object for visibility inside the view frustum under the current viewport and model
transformation settings. This function calls a virtual IsVisibleFinal function that
sub-classed pipelines can add extra tests to. In the base class, this test only tests
visibility based on the objects world coordinates location and does not pay attention
to the object's attributes.
NOTE: Use CRhinoDisplayPipeline::IsVisible() to perform "visibility"
tests based on location (is some part of the object in the view frustum).
Use CRhinoDisplayPipeline::IsActive() to perform "visibility"
tests based on object type.
rhinoObject: Object to test.
Returns: true if the object is visible, false if not.
Since: 5.0

Rhino.Display.DisplayPipeline.IsVisible(Rhino.Geometry.BoundingBox)
Test a given box for visibility inside the view frustum under the current
viewport and model transformation settings.
bbox: Box to test for visibility.
Returns: true if at least some portion of the box is visible, false if not.
Since: 5.0

Rhino.Display.DisplayPipeline.IsActive(Rhino.DocObjects.RhinoObject)
Determines if an object can be visible in this viewport based on it's object type and display attributes.
This test does not check for visibility based on location of the object.
NOTE: Use CRhinoDisplayPipeline::IsVisible() to perform "visibility"
tests based on location (is some part of the object in the view frustum).
Use CRhinoDisplayPipeline::IsActive() to perform "visibility"
tests based on object type.
rhinoObject: Object to test.
Returns:
true if this object can be drawn in the pipeline's viewport based on it's object type and display attributes.
Since: 5.0

Rhino.Display.DisplayPipeline.InterruptDrawing
Tests to see if the pipeline should stop drawing more geometry and just show what it has so far.
If a drawing operation is taking a long time, this function will return true and tell Rhino it should just
finish up and show the frame buffer. This is used in dynamic drawing operations.
Returns:
true if the pipeline should stop attempting to draw more geometry and just show the frame buffer.
Since: 5.0

Rhino.Display.DisplayPipeline.GetOpenGLWorldToCamera(System.Boolean)
Get an array of 16 floats that represents the "world" to "camera" coordinate
transformation in OpenGL's right handed coordinate system
includeModelTransform:
Returns:
Since: 6.0

Rhino.Display.DisplayPipeline.GetOpenGLWorldToClip(System.Boolean)
Get an array of 16 floats that represents the "world" to "clip" coordinate
transformation in OpenGL's right handed coordinate system
includeModelTransform:
Returns:
Since: 6.0

Rhino.Display.DisplayPipeline.GetOpenGLCameraToClip
Get an array of 16 floats that represents the "camera" to "clip" coordinate
transformation in OpenGL's right handed coordinate system
Returns:
Since: 6.0

Rhino.Display.DisplayPipeline.DrawToBitmap(Rhino.Display.RhinoViewport,System.Int32,System.Int32)
Draw a given viewport to an off-screen bitmap.
viewport: Viewport to draw.
width: Width of target image.
height: Height of target image.
Returns: A bitmap containing the given view, or null on error.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawStereoFrameBuffer(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.ViewportInfo,System.UInt32@,System.UInt32@)
Draws the viewport as seen from the left and the right eye viewports
and returns the result as OpenGL texture handles.
viewportLeft: The viewport representing the left eye location and look direction.
viewportRight: The viewport representing the right eye location and look direction.
handleLeft: Will contain the OpenGL texture handle which references the left output color buffer.
handleRight: Will contain the OpenGL texture handle which references the right output color buffer.
Returns: true if drawing succeeded, false otherwise.
Since: 6.8

Rhino.Display.DisplayPipeline.DrawMeshWires(Rhino.Geometry.Mesh,System.Drawing.Color)
Draws all the wires in a given mesh.
mesh: Mesh for wire drawing.
color: Color of mesh wires.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawMeshWires(Rhino.Geometry.Mesh,System.Drawing.Color,System.Int32)
Draws all the wires in a given mesh.
mesh: Mesh for wire drawing.
color: Color of mesh wires.
thickness: Thickness (in pixels) of mesh wires.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawMeshVertices(Rhino.Geometry.Mesh,System.Drawing.Color)
Draws all the vertices in a given mesh.
mesh: Mesh for vertex drawing.
color: Color of mesh vertices.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawMeshShaded(Rhino.Geometry.Mesh,Rhino.Display.DisplayMaterial)
Draws the shaded faces of a given mesh.
mesh: Mesh to draw.
material: Material to draw faces with.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawMeshShaded(Rhino.Geometry.Mesh,Rhino.Display.DisplayMaterial,System.Int32[])
Draws the shaded faces of a given mesh.
mesh: Mesh to draw.
material: Material to draw faces with.
faceIndices: Indices of specific faces to draw.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawMeshShaded(Rhino.Geometry.Mesh,Rhino.Display.DisplayMaterial,System.Collections.Generic.IEnumerable{System.Int32})
Draws the shaded faces of a given mesh.
mesh: Mesh to draw.
material: Material to draw faces with.
faceIndices: An enumeration of the indices of specific faces to draw.
Since: 8.20

Rhino.Display.DisplayPipeline.DrawMeshFalseColors(Rhino.Geometry.Mesh)
Draws the mesh faces as false color patches.
The mesh must have Vertex Colors defined for this to work.
mesh: Mesh to draw.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawSubDShaded(Rhino.Geometry.SubD,Rhino.Display.DisplayMaterial)
Draw a shaded mesh representation of a SubD
subd: SubD to draw
material: Material to draw faces with
Since: 7.0

Rhino.Display.DisplayPipeline.DrawSubDWires(Rhino.Geometry.SubD,System.Drawing.Color,System.Single)
Draws all the wireframe curves of a SubD object
subd: SubD to draw
color: wire color
thickness: wire thickness
Since: 7.0

Rhino.Display.DisplayPipeline.DrawSubDWires(Rhino.Geometry.SubD,Rhino.Display.DisplayPen,Rhino.Display.DisplayPen,Rhino.Display.DisplayPen,Rhino.Display.DisplayPen)
Draws all the wireframe curves os a SubD object using different pens
subd: SubD to draw
boundaryPen: Pen to use for boundary wires. If null, no boundary wires will be drawn
smoothInteriorPen: Pen to use for smooth interior wires. If null, no smooth interior wires will be drawn
creasePen: Pen to use for crease wires. If null, no crease wires will be drawn
nonmanifoldPen: Pen to use for non-manifold wires. If null, no non-manifold wires will be drawn
Since: 8.11

Rhino.Display.DisplayPipeline.DrawBrepShaded(Rhino.Geometry.Brep,Rhino.Display.DisplayMaterial)
Draws a shaded mesh representation of a brep.
brep: Brep to draw.
material: Material to draw faces with.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawBrepWires(Rhino.Geometry.Brep,System.Drawing.Color)
Draws all the wireframe curves of a brep object.
brep: Brep to draw.
color: Color of Wireframe curves.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawBrepWires(Rhino.Geometry.Brep,System.Drawing.Color,System.Int32)
Draws all the wireframe curves of a brep object.
brep: Brep to draw.
color: Color of Wireframe curves.
wireDensity:
"Density" of wireframe curves.
-1 = no internal wires.
0 = default internal wires.
>0 = custom high density.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawExtrusionWires(Rhino.Geometry.Extrusion,System.Drawing.Color)
Draws all the wireframe curves of an extrusion object.
extrusion: Extrusion to draw.
color: Color of Wireframe curves.
Since: 6.0

Rhino.Display.DisplayPipeline.DrawExtrusionWires(Rhino.Geometry.Extrusion,System.Drawing.Color,System.Int32)
Draws all the wireframe curves of an extrusion object.
extrusion: Extrusion to draw.
color: Color of Wireframe curves.
wireDensity:
"Density" of wireframe curves.
-1 = no internal wires.
0 = default internal wires.
>0 = custom high density.
Since: 6.0

Rhino.Display.DisplayPipeline.DrawZebraPreview(Rhino.Geometry.Brep,System.Drawing.Color)
Draws a shaded Brep with Zebra stripe preview.
brep: Brep to draw.
color: Object color.
Since: 6.16

Rhino.Display.DisplayPipeline.DrawZebraPreview(Rhino.Geometry.Mesh,System.Drawing.Color)
Draws a shaded Mesh with Zebra stripe preview.
mesh: Mesh to draw.
color: Object color.
Since: 7.4

Rhino.Display.DisplayPipeline.DrawActivePoint(Rhino.Geometry.Point3d)
Draws a point in style used during "GetPoint" operations
point: Location of the point in world coordinates
Since: 6.0

Rhino.Display.DisplayPipeline.DrawPoint(Rhino.Geometry.Point3d)
Draws a point using the current display attribute size, style and color
point: Location of point in world coordinates.
Since: 6.0

Rhino.Display.DisplayPipeline.DrawPoint(Rhino.Geometry.Point3d,System.Drawing.Color)
Draws a point with a given radius, style and color.
point: Location of point in world coordinates.
color: Color of point.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawPoint(Rhino.Geometry.Point3d,Rhino.Display.PointStyle,System.Single,System.Drawing.Color)
Draws a point with a given radius, style and color.
point: Location of point in world coordinates.
style: Point display style.
radius: Point size in pixels.
color:
Color of point. If style is ControlPoint, this will be the border color.
Since: 6.0

Rhino.Display.DisplayPipeline.DrawPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.Display.PointStyle,System.Single,System.Drawing.Color)
Draw a set of points with a given radius, style and color.
points: Location of points in world coordinates.
style: Point display style.
radius: Point size in pixels.
color:
Color of points. If style is ControlPoint, this will be the border color.
Since: 6.0

Rhino.Display.DisplayPipeline.DrawPoint(Rhino.Geometry.Point3d,Rhino.Display.PointStyle,System.Drawing.Color,System.Drawing.Color,System.Single,System.Single,System.Single,System.Single,System.Boolean,System.Boolean)
Since: 6.0

Rhino.Display.DisplayPipeline.DrawPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.Display.PointStyle,System.Drawing.Color,System.Drawing.Color,System.Single,System.Single,System.Single,System.Single,System.Boolean,System.Boolean)
Since: 6.0

Rhino.Display.DisplayPipeline.DrawPoints(Rhino.Display.DisplayPointSet)
Since: 8.0

Rhino.Display.DisplayPipeline.DrawPoints(Rhino.Display.DisplayPointSet,Rhino.Display.DisplayPointAttributes,Rhino.Display.DisplayPointAttributes)
Since: 8.0

Rhino.Display.DisplayPipeline.DrawPoint(Rhino.Geometry.Point3d,Rhino.Display.PointStyle,System.Int32,System.Drawing.Color)
Draws a point with a given radius, style and color.
point: Location of point in world coordinates.
style: Point display style.
radius: Point size in pixels.
color:
Color of point. If style is ControlPoint, this will be the border color.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.Display.PointStyle,System.Int32,System.Drawing.Color)
Draw a set of points with a given radius, style and color.
points: Location of points in world coordinates.
style: Point display style.
radius: Point size in pixels.
color:
Color of points. If style is ControlPoint, this will be the border color.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawPointCloud(Rhino.Geometry.PointCloud,System.Single)
Draws a point cloud.
cloud: Point cloud to draw, if the cloud has a color array, it will be used, otherwise the points will be black.
size: Size of points.
Since: 6.0

Rhino.Display.DisplayPipeline.DrawPointCloud(Rhino.Geometry.PointCloud,System.Single,System.Drawing.Color)
Draws a point cloud.
cloud: Point cloud to draw.
size: Size of points.
color: Color of points in the cloud, if the cloud has a color array this setting is ignored.
Since: 6.0

Rhino.Display.DisplayPipeline.DrawPointCloud(Rhino.Geometry.PointCloud,System.Int32)
Draws a point cloud.
cloud: Point cloud to draw, if the cloud has a color array, it will be used, otherwise the points will be black.
size: Size of points.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawPointCloud(Rhino.Geometry.PointCloud,System.Int32,System.Drawing.Color)
Draws a point cloud.
cloud: Point cloud to draw.
size: Size of points.
color: Color of points in the cloud, if the cloud has a color array this setting is ignored.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawInferenceLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Drawing.Color,Rhino.Display.DisplayPipeline.InferenceLineType)
Draw an inference line used in gesture based snapping
P: First point used to define the line in world coordinates
O: Second point used to define the line in world coordinates
color: Color of line
type: Type of line Rhino.Display.DisplayPipeline.InferenceLineType
Since: 8.17

Rhino.Display.DisplayPipeline.DraweInferencePoint(Rhino.Geometry.Point3d,System.Drawing.Color)
Draw inference point used in gesture based snapping
P: Location of point in world coordinates
color: Color of the point
Since: 8.17

Rhino.Display.DisplayPipeline.DrawDirectionArrow(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Color)
Since: 5.0

Rhino.Display.DisplayPipeline.DrawArrow(Rhino.Geometry.Line,System.Drawing.Color)
Draws a single arrow object. An arrow consists of a Shaft and an Arrow head at the end of the shaft.
line: Arrow shaft.
color: Color of arrow.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawArrow(Rhino.Geometry.Line,System.Drawing.Color,System.Double,System.Double)
Draws a single arrow object.
An arrow consists of a Shaft and an Arrow head at the end of the shaft.
line: Arrow shaft.
color: Color of arrow.
screenSize: If screenSize != 0.0 then the size (in screen pixels) of the arrow head will be equal to screenSize.
relativeSize: If relativeSize != 0.0 and screen size == 0.0 the size of the arrow head will be proportional to the arrow shaft length.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawArrows(Rhino.Geometry.Line[],System.Drawing.Color)
Draws a collection of arrow objects. An arrow consists of a Shaft and an Arrow head at the end of the shaft.
lines: Arrow shafts.
color: Color of arrows.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawArrows(System.Collections.Generic.IEnumerable{Rhino.Geometry.Line},System.Drawing.Color)
Draws a collection of arrow objects. An arrow consists of a Shaft and an Arrow head at the end of the shaft.
lines: Arrow shafts.
color: Color of arrows.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawArrowHead(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Color,System.Double,System.Double)
Draws a single arrow head.
tip: Point of arrow head tip.
direction: Direction in which arrow head is pointing.
color: Color of arrow head.
screenSize: If screenSize != 0.0, then the size (in screen pixels) of the arrow head will be equal to the screenSize.
worldSize: If worldSize != 0.0 and screen size == 0.0 the size of the arrow head will be equal to the number of units in worldSize.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawLineArrow(Rhino.Geometry.Line,System.Drawing.Color,System.Int32,System.Double)
Draws an arrow made up of three line segments.
line: Base line for arrow.
color: Color of arrow.
thickness: Thickness (in pixels) of the arrow line segments.
size: Size (in world units) of the arrow tip lines.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawLine(Rhino.Geometry.Line,System.Drawing.Color)
Draws a single line object.
line: Line to draw.
color: Color to draw line in.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawLine(Rhino.Geometry.Line,System.Drawing.Color,System.Int32)
Draws a single line object.
line: Line to draw.
color: Color to draw line in.
thickness: Thickness (in pixels) of line.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Drawing.Color)
Draws a single line object.
from: Line from point.
to: Line to point.
color: Color to draw line in.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Drawing.Color,System.Int32)
Draws a single line object.
from: Line from point.
to: Line to point.
color: Color to draw line in.
thickness: Thickness (in pixels) of line.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawLineNoClip(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Drawing.Color,System.Int32)
Draws a single line object .This version of line drawing will draw the
segments of the line that extend beyond the near and far planes of the
view frustum with depths on those planes
from: Line from point.
to: Line to point.
color: Color to draw line in.
thickness: Thickness (in pixels) of line.
Since: 7.1

Rhino.Display.DisplayPipeline.DrawLinesNoClip(System.Collections.Generic.IEnumerable{Rhino.Geometry.Line},System.Drawing.Color,System.Int32)
Draws a multiple lines. This version of line drawing will draw the
segments of the line that extend beyond the near and far planes of the
view frustum with depths on those planes
lines: the lines to draw
color: Color to draw lines in
thickness: Thickness (in pixels) of lines
Since: 8.15

Rhino.Display.DisplayPipeline.DrawDottedLine(Rhino.Geometry.Line,System.Drawing.Color)
Draws a single dotted line.
line: Line to draw.
color: Color of line.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawPatternedLine(Rhino.Geometry.Line,System.Drawing.Color,System.Int32,System.Int32)
Draws a single line with specified pattern.
line: Line to draw.
color: Color of line.
pattern: Pattern of the line (like 0x00001111 for dotted line).
thickness: Thickness (in pixels) of lines.
Since: 6.0

Rhino.Display.DisplayPipeline.DrawDottedLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Drawing.Color)
Draws a single dotted line.
from: Line start point.
to: Line end point.
color: Color of line.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawPatternedLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Drawing.Color,System.Int32,System.Int32)
Draws a single line with specified pattern.
from: Line start point.
to: Line end point.
color: Color of line.
pattern: Pattern of the line (like 0x00001111 for dotted line).
thickness: Thickness (in pixels) of lines.
Since: 6.0

Rhino.Display.DisplayPipeline.DrawDottedPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Drawing.Color,System.Boolean)
Draws a set of connected lines (polyline) in a dotted pattern (0x00001111).
points: End points of each line segment.
color: Color of polyline.
close: Draw a line between the first and last points.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawPatternedPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Drawing.Color,System.Int32,System.Int32,System.Boolean)
Draws a set of connected lines (polyline) with specified pattern.
points: End points of each line segment.
color: Color of polyline.
pattern: Pattern to use for the line (like 0x00001111 for dotted).
thickness: Thickness (in pixels) of lines.
close: Draw a line between the first and last points.
Since: 6.0

Rhino.Display.DisplayPipeline.DrawLines(System.Collections.Generic.IEnumerable{Rhino.Geometry.Line},System.Drawing.Color)
Draws a set of lines with a given color and thickness. If you want the fastest possible set of lines
to be drawn, pass a Line[] for lines.
lines: Lines to draw.
color: Color to draw with.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawLines(System.Collections.Generic.IEnumerable{Rhino.Geometry.Line},System.Drawing.Color,System.Int32)
Draws a set of lines with a given color and thickness. If you want the fastest possible set of lines
to be drawn, pass a Line[] for lines.
lines: Lines to draw.
color: Color to draw with.
thickness: Thickness (in pixels) of lines.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Drawing.Color)
Draws a single Polyline object.
polyline: Polyline to draw.
color: Color to draw in.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Drawing.Color,System.Int32)
Draws a single Polyline object.
polyline: Polyline to draw.
color: Color to draw in.
thickness: Thickness (in pixels) of the Polyline.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawPolygon(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Drawing.Color,System.Boolean)
Draws a filled, convex polygon from a collection of points.
points:
Collection of world coordinate points that are connected by lines to form a closed shape.
Collection must contain at least 3 points.
color: Color to draw with.
filled:
true if the closed area should be filled with color.
false if you want to draw just the border of the closed shape.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawBitmap(Rhino.Display.DisplayBitmap,System.Int32,System.Int32)
Draws a bitmap in screen coordinates
bitmap: bitmap to draw
left: where top/left corner of bitmap should appear in screen coordinates
top: where top/left corner of bitmap should appear in screen coordinates
Since: 5.10

Rhino.Display.DisplayPipeline.DrawDot(System.Single,System.Single,System.String,System.Drawing.Color,System.Drawing.Color)
Draws a text dot in screen coordinates.
screenX: X coordinate (in pixels) of dot center.
screenY: Y coordinate (in pixels) of dot center.
text: Text content of dot.
dotColor: Dot background color.
textColor: Dot foreground color.
Since: 6.0

Rhino.Display.DisplayPipeline.DrawDot(System.Single,System.Single,System.String)
Draws a text dot in screen coordinates.
screenX: X coordinate (in pixels) of dot center.
screenY: Y coordinate (in pixels) of dot center.
text: Text content of dot.
Since: 6.0

Rhino.Display.DisplayPipeline.DrawDot(Rhino.Geometry.Point3d,System.String,System.Drawing.Color,System.Drawing.Color)
Draw a text dot in world coordinates.
worldPosition: Location of dot in world coordinates.
text: Text content of dot.
dotColor: Dot background color.
textColor: Dot foreground color.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawDot(Rhino.Geometry.Point3d,System.String)
Draws a text dot in world coordinates.
worldPosition: Location of dot in world coordinates.
text: Text content of dot.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawDot(Rhino.Geometry.TextDot,System.Drawing.Color,System.Drawing.Color,System.Drawing.Color)
Draw a text dot as defined by the text dot class
dot:
fillColor:
textColor:
borderColor:
Since: 6.0

Rhino.Display.DisplayPipeline.DrawHatch(Rhino.Geometry.Hatch,System.Drawing.Color,System.Drawing.Color)
Since: 6.0

Rhino.Display.DisplayPipeline.DrawHatch(Rhino.Geometry.Hatch,System.Drawing.Color,Rhino.Display.DisplayPen,System.Drawing.Color)
Since: 8.0

Rhino.Display.DisplayPipeline.DrawGradientHatch(Rhino.Geometry.Hatch,System.Drawing.Color,System.Drawing.Color,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Single,System.Drawing.Color)
Draw a two point gradient filled hatch
hatch:
color1:
color2:
point1:
point2:
linearGradient:
boundaryThickness:
boundaryColor:
Since: 7.0

Rhino.Display.DisplayPipeline.DrawGradientHatch(Rhino.Geometry.Hatch,System.Collections.Generic.IEnumerable{Rhino.Display.ColorStop},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Single,System.Single,System.Drawing.Color)
Since: 7.0

Rhino.Display.DisplayPipeline.DrawGradientHatch(Rhino.Geometry.Hatch,System.Collections.Generic.IEnumerable{Rhino.Display.ColorStop},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Single,Rhino.Display.DisplayPen,System.Drawing.Color)
Since: 8.0

Rhino.Display.DisplayPipeline.DrawGradientMesh(Rhino.Geometry.Mesh,System.Collections.Generic.IEnumerable{Rhino.Display.ColorStop},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Single)
Since: 7.0

Rhino.Display.DisplayPipeline.DrawGradientLines(System.Collections.Generic.IEnumerable{Rhino.Geometry.Line},System.Single,System.Collections.Generic.IEnumerable{Rhino.Display.ColorStop},Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean,System.Single)
Since: 7.0

Rhino.Display.DisplayPipeline.DrawBox(Rhino.Geometry.BoundingBox,System.Drawing.Color)
Draws the edges of a BoundingBox.
box: Box to draw.
color: Color to draw in.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawBox(Rhino.Geometry.BoundingBox,System.Drawing.Color,System.Int32)
Draws the edges of a BoundingBox.
box: Box to draw.
color: Color to draw in.
thickness: Thickness (in pixels) of box edges.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawBox(Rhino.Geometry.Box,System.Drawing.Color)
Draws the edges of a Box object.
box: Box to draw.
color: Color to draw in.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawBox(Rhino.Geometry.Box,System.Drawing.Color,System.Int32)
Draws the edges of a Box object.
box: Box to draw.
color: Color to draw in.
thickness: Thickness (in pixels) of box edges.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawBoxCorners(Rhino.Geometry.BoundingBox,System.Drawing.Color)
Draws corner widgets of a world aligned bounding box.
Widget size will be 5% of the Box diagonal.
box: Box to draw.
color: Color to draw with.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawBoxCorners(Rhino.Geometry.BoundingBox,System.Drawing.Color,System.Double)
Draws corner widgets of a world aligned bounding box.
box: Box to draw.
color: Color to draw with.
size: Size (in model units) of the corner widgets.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawBoxCorners(Rhino.Geometry.BoundingBox,System.Drawing.Color,System.Double,System.Int32)
Draws corner widgets of a world aligned bounding box.
box: Box to draw.
color: Color to draw with.
size: Size (in model units) of the corner widgets.
thickness: Thickness (in pixels) of the corner widgets.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawMarker(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Color)
Draws an arrow marker as a view-aligned widget.
tip: Location of arrow tip point.
direction: Direction of arrow.
color: Color of arrow widget.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawMarker(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Color,System.Int32)
Draws an arrow marker as a view-aligned widget.
tip: Location of arrow tip point.
direction: Direction of arrow.
color: Color of arrow widget.
thickness: Thickness of arrow widget lines.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawMarker(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Color,System.Int32,System.Double)
Draws an arrow marker as a view-aligned widget.
tip: Location of arrow tip point.
direction: Direction of arrow.
color: Color of arrow widget.
thickness: Thickness of arrow widget lines.
size: Size (in pixels) of the arrow shaft.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawMarker(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Color,System.Int32,System.Double,System.Double)
Draws an arrow marker as a view-aligned widget.
tip: Location of arrow tip point.
direction: Direction of arrow.
color: Color of arrow widget.
thickness: Thickness of arrow widget lines.
size: Size (in pixels) of the arrow shaft.
rotation: Rotational angle adjustment (in radians, counter-clockwise of direction.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawLight(Rhino.Geometry.Light,System.Drawing.Color)
Draws a light.
light: The light to draw.
wireframeColor: The wireframe color.
Since: 8.4

Rhino.Display.DisplayPipeline.DrawConstructionPlane(Rhino.DocObjects.ConstructionPlane)
Draws a construction plane.
constructionPlane: The construction plane to draw.
Since: 5.0

Rhino.Display.DisplayPipeline.Draw2dText(System.String,System.Drawing.Color,Rhino.Geometry.Point2d,System.Boolean)
Draws 2D text on the viewport.
text: the string to draw.
color: text color.
screenCoordinate: definition point in screen coordinates (0,0 is top-left corner)
middleJustified: if true text is centered around the definition point, otherwise it is lower-left justified.
Since: 5.0

Rhino.Display.DisplayPipeline.Draw2dText(System.String,System.Drawing.Color,Rhino.Geometry.Point2d,System.Boolean,System.Int32)
Draws 2D text on the viewport.
text: the string to draw.
color: text color.
screenCoordinate: definition point in screen coordinates (0,0 is top-left corner)
middleJustified: if true text is centered around the definition point, otherwise it is lower-left justified.
height: height in pixels (good default is 12)
Since: 5.0

Rhino.Display.DisplayPipeline.Draw2dText(System.String,System.Drawing.Color,Rhino.Geometry.Point2d,System.Boolean,System.Int32,System.String)
Draws 2D text on the viewport.
text: the string to draw.
color: text color.
screenCoordinate: definition point in screen coordinates (0,0 is top-left corner)
middleJustified: if true text is centered around the definition point, otherwise it is lower-left justified.
height: height in pixels (good default is 12)
fontface: font name (good default is "Arial")
Since: 5.0

Rhino.Display.DisplayPipeline.Draw2dText(System.String,System.Drawing.Color,Rhino.Geometry.Point3d,System.Boolean)
Draws 2D text on the viewport.
text: the string to draw.
color: text color.
worldCoordinate: definition point in world coordinates.
middleJustified: if true text is centered around the definition point, otherwise it is lower-left justified.
Since: 5.0

Rhino.Display.DisplayPipeline.Draw2dText(System.String,System.Drawing.Color,Rhino.Geometry.Point3d,System.Boolean,System.Int32)
Draws 2D text on the viewport.
text: the string to draw.
color: text color.
worldCoordinate: definition point in world coordinates.
middleJustified: if true text is centered around the definition point, otherwise it is lower-left justified.
height: height in pixels (good default is 12)
Since: 5.0

Rhino.Display.DisplayPipeline.Draw2dText(System.String,System.Drawing.Color,Rhino.Geometry.Point3d,System.Boolean,System.Int32,System.String)
Draws 2D text on the viewport.
text: The string to draw.
color: Text color.
worldCoordinate: Definition point in world coordinates.
middleJustified: If true text is centered around the definition point, otherwise it is lower-left justified.
height: Height in pixels (good default is 12).
fontface: Font name (good default is "Arial").
Since: 5.0

Rhino.Display.DisplayPipeline.Draw3dText(System.String,System.Drawing.Color,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean,Rhino.DocObjects.TextHorizontalAlignment,Rhino.DocObjects.TextVerticalAlignment)
Since: 6.4

Rhino.Display.DisplayPipeline.Draw3dText(System.String,System.Drawing.Color,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean)
Since: 6.0

Rhino.Display.DisplayPipeline.Draw3dText(System.String,System.Drawing.Color,Rhino.Geometry.Plane,System.Double,System.String)
Since: 5.0

Rhino.Display.DisplayPipeline.Draw3dText(Rhino.Display.Text3d,System.Drawing.Color)
Since: 5.0

Rhino.Display.DisplayPipeline.Draw3dText(Rhino.Display.Text3d,System.Drawing.Color,Rhino.Geometry.Plane)
Draws 3d text with a different plane than what is defined in the Text3d class.
text: The string to draw.
color: Text color.
textPlane: The plane for the text object.
Since: 5.0

Rhino.Display.DisplayPipeline.Draw3dText(Rhino.Display.Text3d,System.Drawing.Color,Rhino.Geometry.Point3d)
Draws 3d text using the Text3d plane with an adjusted origin.
text: The string to draw.
color: Text color.
textPlaneOrigin: The origin of the plane to draw.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawText(Rhino.Geometry.TextEntity,System.Drawing.Color)
Since: 6.0

Rhino.Display.DisplayPipeline.DrawText(Rhino.Geometry.TextEntity,System.Drawing.Color,System.Double)
Since: 6.0

Rhino.Display.DisplayPipeline.DrawText(Rhino.Geometry.TextEntity,System.Drawing.Color,Rhino.Geometry.Transform)
Since: 6.0

Rhino.Display.DisplayPipeline.Measure2dText(System.String,Rhino.Geometry.Point2d,System.Boolean,System.Double,System.Int32,System.String)
Determines screen rectangle that would be drawn to using the Draw2dText(..) function
with the same parameters.
text: text to measure.
definitionPoint: either lower-left or middle of text.
middleJustified: true=middle justified. false=lower-left justified.
rotationRadians: text rotation in radians
height: height in pixels (good default is 12)
fontFace: font name (good default is "Arial")
Returns: rectangle in the viewport's screen coordinates on success.
Since: 5.10

Rhino.Display.DisplayPipeline.DrawObject(Rhino.DocObjects.RhinoObject)
Draws a RhinoObject.
rhinoObject: The Rhino object.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawObject(Rhino.DocObjects.RhinoObject,Rhino.Geometry.Transform)
Draws a RhinoObject with an applied transformation.
rhinoObject: The Rhino object.
xform: The transformation.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawInstanceDefinition(Rhino.DocObjects.InstanceDefinition)
Draws an InstanceDefinition.
instanceDefinition: The instance definition.
Since: 7.15

Rhino.Display.DisplayPipeline.DrawInstanceDefinition(Rhino.DocObjects.InstanceDefinition,Rhino.Geometry.Transform)
Draws an InstanceDefinition.
instanceDefinition: The instance definition.
xform: The transformation.
Since: 7.15

Rhino.Display.DisplayPipeline.DrawInstanceDefinitionShaded(Rhino.DocObjects.InstanceDefinition,Rhino.Display.DisplayMaterial)
Draws a shaded InstanceDefinition.
instanceDefinition: The instance definition.
material: Material to draw faces with.
Since: 7.15

Rhino.Display.DisplayPipeline.DrawInstanceDefinitionShaded(Rhino.DocObjects.InstanceDefinition,Rhino.Display.DisplayMaterial,Rhino.Geometry.Transform)
Draws a shaded InstanceDefinition.
instanceDefinition: The instance definition.
material: Material to draw faces with.
xform: The transformation.
Since: 7.15

Rhino.Display.DisplayPipeline.DrawAnnotation(Rhino.Geometry.AnnotationBase,System.Drawing.Color)
Since: 6.0

Rhino.Display.DisplayPipeline.DrawAnnotationArrowhead(Rhino.Geometry.Arrowhead,Rhino.Geometry.Transform,System.Drawing.Color)
Since: 6.0

Rhino.Display.DisplayPipeline.DrawArc(Rhino.Geometry.Arc,System.Drawing.Color)
Draw a single arc object.
arc: Arc to draw.
color: Color to draw with.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawArc(Rhino.Geometry.Arc,System.Drawing.Color,System.Int32)
Draw a single arc object.
arc: Arc to draw.
color: Color to draw with.
thickness: Thickness (in pixels) of arc.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawCircle(Rhino.Geometry.Circle,System.Drawing.Color)
Draw a single circle object.
circle: Circle to draw.
color: Color to draw with.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawCircle(Rhino.Geometry.Circle,System.Drawing.Color,System.Int32)
Draw a single circle object.
circle: Circle to draw.
color: Color to draw with.
thickness: Thickness (in pixels) of circle.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawSphere(Rhino.Geometry.Sphere,System.Drawing.Color)
Draw a wireframe sphere.
sphere: Sphere to draw.
color: Color to draw with.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawSphere(Rhino.Geometry.Sphere,System.Drawing.Color,System.Int32)
Draw a wireframe sphere.
sphere: Sphere to draw.
color: Color to draw with.
thickness: Thickness (in pixels) of Sphere wires.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawTorus(Rhino.Geometry.Torus,System.Drawing.Color)
Draw a wireframe torus.
torus: Torus to draw.
color: Color to draw with.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawTorus(Rhino.Geometry.Torus,System.Drawing.Color,System.Int32)
Draw a wireframe torus.
torus: Torus to draw.
color: Color to draw with.
thickness: Thickness (in pixels) of torus wires.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawCylinder(Rhino.Geometry.Cylinder,System.Drawing.Color)
Draw a wireframe cylinder.
cylinder: Cylinder to draw.
color: Color to draw with.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawCylinder(Rhino.Geometry.Cylinder,System.Drawing.Color,System.Int32)
Draw a wireframe cylinder.
cylinder: Cylinder to draw.
color: Color to draw with.
thickness: Thickness (in pixels) of cylinder wires.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawCone(Rhino.Geometry.Cone,System.Drawing.Color)
Draw a wireframe cone.
cone: Cone to draw.
color: Color to draw with.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawCone(Rhino.Geometry.Cone,System.Drawing.Color,System.Int32)
Draw a wireframe cone.
cone: Cone to draw.
color: Color to draw with.
thickness: Thickness (in pixels) of Cone wires.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawCurve(Rhino.Geometry.Curve,System.Drawing.Color)
Draw a single Curve object.
curve: Curve to draw.
color: Color to draw with.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawCurve(Rhino.Geometry.Curve,System.Drawing.Color,System.Int32)
Draw a single Curve object.
curve: Curve to draw.
color: Color to draw with.
thickness: Thickness (in pixels) of curve.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawCurve(Rhino.Geometry.Curve,Rhino.Display.DisplayPen)
Since: 8.0

Rhino.Display.DisplayPipeline.DrawLine(Rhino.Geometry.Line,Rhino.Display.DisplayPen)
Since: 8.0

Rhino.Display.DisplayPipeline.DrawLines(Rhino.Geometry.Line[],Rhino.Display.DisplayPen)
Since: 8.0

Rhino.Display.DisplayPipeline.DrawCurvatureGraph(Rhino.Geometry.Curve,System.Drawing.Color)
Draw a typical Rhino Curvature Graph.
curve: Base curve for curvature graph.
color: Color of curvature graph.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawCurvatureGraph(Rhino.Geometry.Curve,System.Drawing.Color,System.Int32)
Draw a typical Rhino Curvature Graph.
curve: Base curve for curvature graph.
color: Color of curvature graph.
hairScale: 100 = true length, > 100 magnified, < 100 shortened.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawCurvatureGraph(Rhino.Geometry.Curve,System.Drawing.Color,System.Int32,System.Int32,System.Int32)
Draw a typical Rhino Curvature Graph.
curve: Base curve for curvature graph.
color: Color of curvature graph.
hairScale: 100 = true length, > 100 magnified, < 100 shortened.
hairDensity: >= 0 larger numbers = more hairs (good default is 1).
sampleDensity: Between 1 and 10. Higher numbers draw smoother outer curves. (good default is 2).
Since: 5.0

Rhino.Display.DisplayPipeline.DrawSurface(Rhino.Geometry.Surface,System.Drawing.Color,System.Int32)
Draw wireframe display for a single surface.
surface: Surface to draw.
wireColor: Color to draw with.
wireDensity: Thickness (in pixels) or wires to draw.
Since: 5.0

Rhino.Display.DisplayPipeline.DrawSprite(Rhino.Display.DisplayBitmap,Rhino.Geometry.Point3d,System.Single,System.Boolean)
Since: 5.0

Rhino.Display.DisplayPipeline.DrawSprite(Rhino.Display.DisplayBitmap,Rhino.Geometry.Point3d,System.Single,System.Drawing.Color,System.Boolean)
Since: 5.0

Rhino.Display.DisplayPipeline.DrawSprite(Rhino.Display.DisplayBitmap,Rhino.Geometry.Point2d,System.Single)
Since: 5.0

Rhino.Display.DisplayPipeline.DrawSprite(Rhino.Display.DisplayBitmap,Rhino.Geometry.Point2d,System.Single,System.Drawing.Color)
Since: 5.0

Rhino.Display.DisplayPipeline.DrawSprite(Rhino.Display.DisplayBitmap,Rhino.Geometry.Point2d,System.Single,System.Single)
Draw screen oriented image centered at 2d screen location
bitmap:
screenLocation:
width:
height:
Since: 7.0

Rhino.Display.DisplayPipeline.DrawSprites(Rhino.Display.DisplayBitmap,Rhino.Display.DisplayBitmapDrawList,System.Single,System.Boolean)
Since: 5.0

Rhino.Display.DisplayPipeline.DrawSprites(Rhino.Display.DisplayBitmap,Rhino.Display.DisplayBitmapDrawList,System.Single,Rhino.Geometry.Vector3d,System.Boolean)
Since: 5.0

Rhino.Display.DisplayPipeline.DrawParticles(Rhino.Geometry.ParticleSystem)
Since: 5.0

Rhino.Display.DisplayPipeline.DrawParticles(Rhino.Geometry.ParticleSystem,Rhino.Display.DisplayBitmap)
Since: 5.0

Rhino.Display.DisplayPipeline.DrawParticles(Rhino.Geometry.ParticleSystem,Rhino.Display.DisplayBitmap[])
Since: 5.0

Rhino.Display.DisplayPipeline.Draw2dRectangle(System.Drawing.Rectangle,System.Drawing.Color,System.Int32,System.Drawing.Color)
Since: 5.10

Rhino.Display.DisplayPipeline.DrawRoundedRectangle(System.Drawing.PointF,System.Single,System.Single,System.Single,System.Drawing.Color,System.Single,System.Drawing.Color)
Since: 6.0

Rhino.Display.DisplayPipeline.Draw2dLine(System.Drawing.Point,System.Drawing.Point,System.Drawing.Color,System.Single)
Since: 6.0

Rhino.Display.DisplayPipeline.Draw2dLine(System.Drawing.PointF,System.Drawing.PointF,System.Drawing.Color,System.Single)
Since: 6.0

Rhino.Display.DisplayPipeline.SetupDisplayMaterial(Rhino.RhinoDoc,Rhino.DocObjects.RhinoObject)
Sets up a display material.
doc: The active document.
rhinoObject: The Rhino object.
Returns: A display material if successful, null otherwise.
Since: 8.0

Rhino.Display.DisplayPipeline.SetupDisplayMaterial(System.Drawing.Color)
Since: 8.0

Rhino.Display.DisplayPipeline.SetupDisplayMaterial(Rhino.RhinoDoc,Rhino.DocObjects.RhinoObject,Rhino.DocObjects.ObjectAttributes)
Sets up a display material.
doc: The active document.
rhinoObject: The Rhino object.
attributes: The object attributes.
Returns: A display material if successful, null otherwise.
Since: 8.0

Rhino.Display.DisplayPipeline.SetupDisplayMaterial(Rhino.RhinoDoc,Rhino.DocObjects.RhinoObject,Rhino.DocObjects.ObjectAttributes,Rhino.Geometry.Transform)
Sets up a display material.
doc: The active document.
rhinoObject: The Rhino object.
attributes: The object attributes.
instanceTransform: The instance object transformation.
Returns: A display material if successful, null otherwise.
Since: 8.0