Rhino.Geometry.Intersect.LineCylinderIntersection
Represents all possible cases of a Line|Cylinder intersection event.
Since: 5.0

Rhino.Geometry.Intersect.LineCylinderIntersection.None
No intersections.

Rhino.Geometry.Intersect.LineCylinderIntersection.Single
One intersection.

Rhino.Geometry.Intersect.LineCylinderIntersection.Multiple
Two intersections.

Rhino.Geometry.Intersect.LineCylinderIntersection.Overlap
Line lies on cylinder.