Rhino.Geometry.MeshExtruderFaceDirectionMode
Defines how mesh extruder decides orients faces

Rhino.Geometry.MeshExtruderFaceDirectionMode.Keep
Maintain all face directions

Rhino.Geometry.MeshExtruderFaceDirectionMode.OrientClosedFrontOut
Orient closed meshes front face out