Rhino.DocObjects.TextVerticalAlignment
Vertical location of text attach point relative to text

Rhino.DocObjects.TextVerticalAlignment.Top
Attach to top of an "I" on the first line. (Independent of glyphs being displayed.)

Rhino.DocObjects.TextVerticalAlignment.MiddleOfTop
Attach to middle of an "I" on the first line. (Independent of glyphs being displayed.)

Rhino.DocObjects.TextVerticalAlignment.BottomOfTop
Attach to baseline of first line. (Independent of glyphs being displayed.)

Rhino.DocObjects.TextVerticalAlignment.Middle
Attach to middle of text vertical advance. (Independent of glyphs being displayed.)

Rhino.DocObjects.TextVerticalAlignment.MiddleOfBottom
Attach to middle of an "I" on the last line. (Independent of glyphs being displayed.)

Rhino.DocObjects.TextVerticalAlignment.Bottom
Attach to the baseline of the last line. (Independent of glyphs being displayed.)

Rhino.DocObjects.TextVerticalAlignment.BottomOfBoundingBox
Attach to the bottom of the boudning box of the visible glyphs.