Rhino.Render.CustomRenderMeshes.RenderMeshProvider
A RenderMeshProvider delivers custom render primitives (in the form of RenderMeshes).  Derive a public class from this with a public constructor,
and this primitive provider will be added to the RDK forming a collection of providers.
Each RenderMeshProvider::HasCustomRenderMeshes will be called and if it returns true, a call to RenderMeshes will be made. It is up to the provider
to cache its own primitives - the IRenderMeshes::ProviderTracking class is provided for that.
A provider may optionally return a collection of non-object Ids that it will provide custom render primitives for.  An example of this is Grasshopper, which
which will typically return a collection of the Ids of each CustomPreview component.
Override this class if you are a plug-in developer intending to supply a custom set of primitives for a given object, or objectId.  Examples of IRenderMeshProviders
are CurvePiping, EdgeSoftening, Displacement, Shutlining, Grasshopper's CustomPreview component.

Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Name
The localized name of the provider for UI display.
Since: 8.0

Rhino.Render.CustomRenderMeshes.RenderMeshProvider.ProviderId
The localized name of the provider for UI display.
Since: 8.0

Rhino.Render.CustomRenderMeshes.RenderMeshProvider.NonObjectIds
A provider may optionally return a collection of non-object Ids that it will provide custom render primitives for.  An example of this is Grasshopper, which
which will typically return a collection of the Ids of each CustomPreview component.
Since: 8.0

Rhino.Render.CustomRenderMeshes.RenderMeshProvider.HasCustomRenderMeshes(Rhino.Geometry.MeshType,Rhino.DocObjects.ViewportInfo,Rhino.RhinoDoc,System.Guid,Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Flags@,Rhino.PlugIns.PlugIn,Rhino.Display.DisplayPipelineAttributes)
Determine if custom render primitives will be supplied for a particular object.
mt: The mesh type to provide meshes for
vp: The viewport being rendered
doc: The Rhino document associated with the objectId
objectId: The objectId for which the primitives should be supplied.
flags: See Flags.
plugin: The requesting plug-in - typically the render plug-in requesting the primitives.
attrs: The display attributes currently being used - nullptr if this is production rendering.
Returns: True if RenderMeshes will return a set of primitives, otherwise false.  RenderMeshes may still return an empty collection - in case of cancelation something similar.
Since: 8.0

Rhino.Render.CustomRenderMeshes.RenderMeshProvider.RenderMeshes(Rhino.Geometry.MeshType,Rhino.DocObjects.ViewportInfo,Rhino.RhinoDoc,System.Guid,System.Collections.Generic.List{Rhino.DocObjects.InstanceObject},Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Flags@,Rhino.Render.CustomRenderMeshes.RenderMeshes,Rhino.PlugIns.PlugIn,Rhino.Display.DisplayPipelineAttributes)
Returns a complete set of custom render primitives for a given ObjectId.
mt: The mesh type to provide meshes for
vp: The viewport being rendered
doc: The Rhino document associated with the objectId
objectId: The objectId for which the primitives should be supplied.
ancestry: The ancestry of the object - ie, block references referring to this definition.
This is only used to handle ByParent attributes, and should not be used to transform geometry.
flags: See Flags.
previousPrimitives: Optionally a custom set of initial primitives.  If this parameter is empty, the standard render primitives
for the object will be used, or an empty set of primitives will be used where they are not available.  This is typically used in meshing exporters, which
produce specific meshes for the output rather than using the render primitives.
plugin: The requesting plug-in - typically the render plug-in requesting the meshes.
attrs: The display attributes currently being used - nullptr if this is production rendering.
Returns:
Since: 8.0

Rhino.Render.CustomRenderMeshes.RenderMeshProvider.GetParameter(Rhino.RhinoDoc,System.Guid,System.String)
Runtime access to specific parameters on for a given objectId relating to this primitive provider.
doc: The Rhino document of interest.
objectId: The objectId for which the parameter should be supplied.
parameterName: The name of the parameter.
Returns: The value of the parameter for the specified ObjectId. IConvertable.
Since: 8.0

Rhino.Render.CustomRenderMeshes.RenderMeshProvider.SetParameter(Rhino.RhinoDoc,System.Guid,System.String,System.Object)
doc: The Rhino document of interest.
objectId: The objectId for which the parameter should be supplied.
parameterName: The name of the parameter.
value: The value to set.
Returns:
Since: 8.0

Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Progress(Rhino.RhinoDoc,System.Guid[])
Provides details on the progress of custom render meshes for a document or collection of objects
doc:
optional_objectIds:
Returns:
Since: 8.0

Rhino.Render.CustomRenderMeshes.RenderMeshProvider.ProgressForAll(Rhino.RhinoDoc,System.Guid[])
Returns a complete list of progress reports for all providers for either the document or a collection of objects
doc:
optional_objectIds:
Returns:
Since: 8.0

Rhino.Render.CustomRenderMeshes.RenderMeshProvider.FromSerialNumber(System.Int32)
This method is called by the virtual hooks to get the runtime managed
object from a serial number.
serialNumber:
Returns:

Rhino.Render.CustomRenderMeshes.RenderMeshProvider.RegisterProviders(Rhino.PlugIns.PlugIn)
Register RenderMeshProviders without relying on the auto-plug-in registration
plugin:
Since: 8.0

Rhino.Render.CustomRenderMeshes.RenderMeshProvider.RegisterProviders(System.Reflection.Assembly,Rhino.PlugIns.PlugIn)
Register RenderMeshProviders without relying on the auto-plug-in registration
assembly:
plugin:
Since: 8.0

Rhino.Render.CustomRenderMeshes.RenderMeshProvider.RegisterProvider(Rhino.Render.CustomRenderMeshes.RenderMeshProvider,Rhino.PlugIns.PlugIn)
Register RenderMeshProvider without relying on the auto-plug-in registration.
provider:
plugin:
Since: 8.0

Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Finalize
Finalizer to ensure correctly implemented dispose pattern.

Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Dispose
Dispose method
Since: 8.0

Rhino.Render.CustomRenderMeshes.RenderMeshProvider.m_disposed
m_disposed available for sub-classes to check.

Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Dispose(System.Boolean)
Dispose method.  Note that you should only ever call Dispose if you explicitly registered this RenderMeshProvider using RegisterProvider
If this provider was created using automatic registration, the Dispose function will thrown an exception.
isDisposing: