Rhino.DocObjects.Custom.CustomGripObject.#ctor
Since: 5.0

Rhino.DocObjects.Custom.CustomGripObject.Dispose
Since: 5.0

Rhino.DocObjects.Custom.CustomGripObject.Index
The grip's index. CustomObjectGrips.AddGrip already assigns this the grip's position in
the grips list, and Rhino passes it back as the gripIndex argument of NeighborGrip and
as the key of the grip direction cache. Setting it to anything else makes those
arguments disagree with CustomObjectGrips.Grip(int), which is indexed by list position.
Since: 5.0

Rhino.DocObjects.Custom.CustomGripObject.OriginalLocation
Since: 5.0

Rhino.DocObjects.Custom.CustomGripObject.Weight
Since: 5.0

Rhino.DocObjects.Custom.CustomGripObject.NewLocation
Since: 5.0

Rhino.DocObjects.Custom.CustomGripObject.EvaluateGripDirections(Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@)
Evaluates this grip's directions. For a surface control point these are the two surface
tangents and the normal; for a curve control point, the tangent and a frame around it.
Rhino caches the result per grip and does not ask again, so the directions must not
change once reported.
x: First direction.
y: Second direction.
z: Third direction.
Returns: true if the directions were set. The default implementation returns false.

Rhino.DocObjects.Custom.CustomGripObject.EvaluateCurveParameter(System.Double@)
The curve parameter of the control point this grip drives.
t: The curve parameter.
Returns: true on success. The default implementation returns false.

Rhino.DocObjects.Custom.CustomGripObject.EvaluateSurfaceParameters(System.Double@,System.Double@)
The surface parameters of the control point this grip drives.
u: The first surface parameter.
v: The second surface parameter.
Returns: true on success. The default implementation returns false.

Rhino.DocObjects.Custom.CustomGripObject.EvaluateCurveCVIndices
The indices of the NURBS curve control points this grip drives. A grip may drive more
than one, as at a closed or periodic seam.
Returns: The control point indices, or null if this grip drives none.

Rhino.DocObjects.Custom.CustomGripObject.EvaluateSurfaceCVIndices
The indices of the NURBS surface control points this grip drives. A grip may drive more
than one, as at a closed or periodic seam or a singular edge.
Every index must lie inside the surface returned by the owning CustomObjectGrips'
NurbsSurface(). Rhino writes through these indices without checking them, so a grip
reporting one outside the control point grid is refused whole.
Returns: The control point indices, or null if this grip drives none.
Remarks:
IndexPair rather than the Tuple used by GripObject.GetSurfaceCVIndices: this is called
once per grip while Rhino maps a whole surface, and IndexPair is a struct.

Rhino.DocObjects.Custom.CustomGripObject.MovedOtherThanLocation
Set this when the grip changes something other than its location, such as a weight, so
that Rhino counts the grip as moved. Rhino already counts a grip whose location moved,
so this only adds to that. Cleared when Rhino undoes the grip move.
Remarks:
A stored flag rather than something Rhino asks for: it is read once per grip per draw,
so answering it across the managed boundary would cost a transition per grip per frame.
Real time work driven by grip movement belongs in CustomObjectGrips.OnDraw, which runs
on the display thread, together with the NewLocation latch.

Rhino.DocObjects.Custom.CustomGripObject.OnUndoMove
Called when Rhino undoes a grip move. Restore anything the grip changed alongside its
location, such as a weight. The location itself is restored by Rhino.