Rhino.Render.UICommands.RenderUICommandContext
RenderUICommandContext indicates which control the user is interacting with.

Rhino.Render.UICommands.RenderUICommandContext.Unknown
Unknown control.

Rhino.Render.UICommands.RenderUICommandContext.MainThumb
The main content editor thumbnail list.

Rhino.Render.UICommands.RenderUICommandContext.MainTree
The main content editor tree control.

Rhino.Render.UICommands.RenderUICommandContext.EditorPreview
The content editor preview thumbnail list.

Rhino.Render.UICommands.RenderUICommandContext.SubNodeCtrl
A sub-node control.

Rhino.Render.UICommands.RenderUICommandContext.ColorButton
A color button.

Rhino.Render.UICommands.RenderUICommandContext.CreateNewButton
A 'Create New' button - AKA [+] button.

Rhino.Render.UICommands.RenderUICommandContext.ContentCtrl
An old-style content control.

Rhino.Render.UICommands.RenderUICommandContext.NewContentCtrl
A new-style content control.

Rhino.Render.UICommands.RenderUICommandContext.NewContentCtrlDropDown
A new-style content control's drop-down thumbnail list.

Rhino.Render.UICommands.RenderUICommandContext.BreadcrumbCtrl
A breadcrumb control.

Rhino.Render.UICommands.RenderUICommandContext.FloatingPreview
A floating preview.

Rhino.Render.UICommands.RenderUICommandContext.Spanner
Spanner menu.

Rhino.Render.UICommands.RenderUICommandContext.ContentTypeSection
Content type section.

Rhino.Render.UICommands.RenderUICommandContext.ContentTypeBrowserNew
Content type browser 'new' page.

Rhino.Render.UICommands.RenderUICommandContext.ContentTypeBrowserExisting
Content type browser 'existing' page.

Rhino.Render.UICommands.RenderUICommandContext.ContentInstanceBrowser
Content instance browser.

Rhino.Render.UICommands.RenderUICommandContext.ToolTipPreview
Tool-tip preview.