Rhino.ApplicationSettings.CursorMode
Defines enumerated constant values for particular OSnap cursor colors.
Since: 5.0

Rhino.ApplicationSettings.CursorMode.None
No OSnap cursor.

Rhino.ApplicationSettings.CursorMode.BlackOnWhite
Black on white OSnap cursor.

Rhino.ApplicationSettings.CursorMode.WhiteOnBlack
White on black OSnap cursor.