Rhino.Geometry.MeshingParameters
Represents settings used for creating a mesh representation of a brep or surface.

Rhino.Geometry.MeshingParameters.#ctor
Initializes a new instance with default values.
Initial values are same as Rhino.Geometry.MeshingParameters.Default.
Since: 5.0

Rhino.Geometry.MeshingParameters.#ctor(Rhino.Geometry.MeshingParameters)
Initializes a new instance copying values from source.
Initial values are same as Rhino.Geometry.MeshingParameters.Default.
Since: 8.0

Rhino.Geometry.MeshingParameters.#ctor(System.Double)
Initializes a new instance with simple values,
similar to that of Rhino's meshing slider interface.
density:
The density and number of mesh polygons, where 0.0 <= density <= 1.0,
where 0 quickly creates coarse meshes, and 1 slowly creates dense meshes.
Since: 6.0

Rhino.Geometry.MeshingParameters.#ctor(System.Double,System.Double)
Initializes a new instance with simple values,
similar to that of Rhino's meshing slider interface.
density:
The density and number of mesh polygons, where 0.0 <= density <= 1.0,
where 0 quickly creates coarse meshes, and 1 slowly creates dense meshes.
minimumEdgeLength: The minimum allowed mesh edge length.
Since: 6.0

Rhino.Geometry.MeshingParameters.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Geometry.MeshingParameters.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Since: 8.0

Rhino.Geometry.MeshingParameters.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Called by BinaryFormatter.Deserialize to create a new MeshParamaters
object.
info:
context:
Since: 8.0

Rhino.Geometry.MeshingParameters.ToEncodedString
Returns a encoded string that represents the MeshingParameters.
Returns:
A encoded string that represents the MeshingParameters.
Since: 8.0

Rhino.Geometry.MeshingParameters.FromEncodedString(System.String)
Converts encoded serialized string into a MeshingParameters
value:
Encoded string returned by MeshingParameters.ToString()
Returns:
Returns a new MeshingParameters created by decoding and deserializing
the string or null if value is invalid.
Since: 8.0

Rhino.Geometry.MeshingParameters.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0

Rhino.Geometry.MeshingParameters.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.Geometry.MeshingParameters.GetHashCode
Computes a hash number that represents the current MeshingParameters.
Returns: A hash code for MeshingParameters.

Rhino.Geometry.MeshingParameters.Equals(System.Object)
Determines whether the specified MeshingParameters has the same values as the present MeshingParameters.
obj: The specified MeshingParameters.
Returns: true if MeshingParameters has the same values as this; otherwise false.
Since: 8.0

Rhino.Geometry.MeshingParameters.Equals(Rhino.Geometry.MeshingParameters)
Determines whether the specified MeshingParameters has the same values as the present MeshingParameters.
other: The specified MeshingParameters.
Returns: true if MeshingParameters has the same values as this; otherwise false.
Since: 8.0

Rhino.Geometry.MeshingParameters.op_Equality(Rhino.Geometry.MeshingParameters,Rhino.Geometry.MeshingParameters)
Determines whether the two MeshingParameters have equal values.
mp1: The first MeshingParameters.
mp2: The second MeshingParameters.
Returns: true if all of components of the two MeshingParameters are equal; otherwise false.
Since: 8.0

Rhino.Geometry.MeshingParameters.op_Inequality(Rhino.Geometry.MeshingParameters,Rhino.Geometry.MeshingParameters)
Determines whether the two MeshingParameters do not have equal values.
mp1: The first MeshingParameters.
mp2: The second MeshingParameters.
Returns: true if any components of the two MeshingParameters are not equal; otherwise false.
Since: 8.0

Rhino.Geometry.MeshingParameters.DocumentCurrentSetting(Rhino.RhinoDoc)
Gets the MeshingParameters that are currently set for a document.
These are the same settings that are shown in the DocumentProperties
"mesh settings" user interface.
doc: A Rhino document to query.
Returns: Meshing parameters of the document.
Throws System.ArgumentNullException: If doc is null.
Since: 5.0

Rhino.Geometry.MeshingParameters.Minimal
Gets minimal meshing parameters.
Since: 5.0

Rhino.Geometry.MeshingParameters.Default
Gets mesh creation parameters to create the default render mesh.
Only use this if you plan on specifying your own custom meshing
parameters.
Since: 5.0

Rhino.Geometry.MeshingParameters.Coarse
Gets mesh creation parameters for coarse meshing.
This corresponds with the "Jagged and Faster" default in Rhino.
Since: 5.0

Rhino.Geometry.MeshingParameters.FastRenderMesh
Gets mesh creation parameters to create the a render mesh when
meshing speed is preferred over mesh quality.
Since: 6.0

Rhino.Geometry.MeshingParameters.Smooth
Gets mesh creation parameters for smooth meshing.
This corresponds with the "Smooth and Slower" default in Rhino.
Since: 5.0

Rhino.Geometry.MeshingParameters.QualityRenderMesh
Gets mesh creation parameters to create the a render mesh when mesh
quality is preferred over meshing speed.
Since: 6.0

Rhino.Geometry.MeshingParameters.DefaultAnalysisMesh
Gets mesh creation parameters to create the default analysis mesh.
Since: 6.0

Rhino.Geometry.MeshingParameters.TextureRange
Gets or sets how and if textures will be packed.
Since: 6.0

Rhino.Geometry.MeshingParameters.JaggedSeams
Gets or sets whether or not the mesh is allowed to have jagged seams.
When this flag is set to true, meshes on either side of a Brep Edge will not match up.
Since: 5.0

Rhino.Geometry.MeshingParameters.RefineGrid
Gets or sets a value indicating whether or not the sampling grid can be refined
when certain tolerances are not met.
Since: 5.0

Rhino.Geometry.MeshingParameters.DoublePrecision
Gets or sets a value indicating whether or not the mesh should have
double precision vertices in addition to the floats.
Since: 8.0

Rhino.Geometry.MeshingParameters.SimplePlanes
Gets or sets a value indicating whether or not planar areas are allowed
to be meshed in a simplified manner.
Since: 5.0

Rhino.Geometry.MeshingParameters.ComputeCurvature
Gets or sets a value indicating whether or not surface curvature
data will be embedded in the mesh.
Since: 5.0

Rhino.Geometry.MeshingParameters.ClosedObjectPostProcess
Gets or sets a value indicating whether or not to post process non-closed meshes
that should be closed. If the Brep being meshed is closed, JaggedSeams = false,
and ClosedObjectPostProcess = true, and the resulting mesh is not closed, then a
post meshing process is applied to find and close gaps in the mesh. Typically the
resulting mesh is not closed because the input Brep has a geometric flaw, like
loops in trimming curve.
Since: 6.0

Rhino.Geometry.MeshingParameters.GridMinCount
Gets or sets the minimum number of grid quads in the initial sampling grid.
Since: 5.0

Rhino.Geometry.MeshingParameters.GridMaxCount
Gets or sets the maximum number of grid quads in the initial sampling grid.
Since: 5.0

Rhino.Geometry.MeshingParameters.GridAngle
Gets or sets the maximum allowed angle difference (in radians)
for a single sampling quad. The angle pertains to the surface normals.
Since: 5.0

Rhino.Geometry.MeshingParameters.GridAspectRatio
Gets or sets the maximum allowed aspect ratio of sampling quads.
Since: 5.0

Rhino.Geometry.MeshingParameters.GridAmplification
Gets or sets the grid amplification factor.
Values lower than 1.0 will decrease the number of initial quads,
values higher than 1.0 will increase the number of initial quads.
Since: 5.0

Rhino.Geometry.MeshingParameters.Tolerance
Gets or sets the maximum allowed edge deviation.
This tolerance is measured between the center of the mesh edge and the surface.
Since: 5.0

Rhino.Geometry.MeshingParameters.MinimumTolerance
Gets or sets the minimum tolerance.
Since: 5.0

Rhino.Geometry.MeshingParameters.RelativeTolerance
Gets or sets the relative tolerance.
Since: 5.0

Rhino.Geometry.MeshingParameters.MinimumEdgeLength
Gets or sets the minimum allowed mesh edge length.
Since: 5.0

Rhino.Geometry.MeshingParameters.MaximumEdgeLength
Gets or sets the maximum allowed mesh edge length.
Since: 5.0

Rhino.Geometry.MeshingParameters.RefineAngle
Gets or sets the mesh parameter refine angle in radians.
Since: 5.0

Rhino.Geometry.MeshingParameters.RefineAngleInDegrees
Gets or sets the mesh parameter refine angle in degrees.
Since: 8.0

Rhino.Geometry.MeshingParameters.SubDDisplayParameters
Gets the SubD display parameters.
Returns: The SubD display parameters.
Since: 7.18

Rhino.Geometry.MeshingParameters.SetSubDDisplayParameters(Rhino.Geometry.SubDDisplayParameters)
Sets the SubD display parameters.
subDDisplayParameters: The SubD display parameters.
Since: 7.18

Rhino.Geometry.MeshingParameters.CopyFrom(Rhino.Geometry.MeshingParameters)
Call this method to copy MeshingParameters from another instance.
source:
Since: 8.0