Rhino.Geometry.ShutLiningCurveInfo
Contains shutlining curve information. This is used in Rhino.Geometry.Mesh.WithShutLining(System.Boolean,System.Double,System.Collections.Generic.IEnumerable{Rhino.Geometry.ShutLiningCurveInfo}).

Rhino.Geometry.ShutLiningCurveInfo.#ctor(Rhino.Geometry.Curve,System.Double,System.Int32,System.Boolean,System.Boolean,System.Collections.Generic.IEnumerable{Rhino.Geometry.Interval},System.Boolean)
Creates a new instance of the ShutLining curve information class.
curve: The profile curve.
radius: The profile radius.
profile: The profile type.
pull: True if the curve should be pulled.
isBump: True if profile constitutes a bump. See Rhino's Help for more information.
curveIntervals: The parts of the curve to use as profiles.
enabled: If true, this curve is active.
Throws System.ArgumentNullException: If curve is null.
Since: 6.0

Rhino.Geometry.ShutLiningCurveInfo.Curve
The profile curve.
Since: 6.0

Rhino.Geometry.ShutLiningCurveInfo.Enabled
If true, this curve is active.
Since: 6.0

Rhino.Geometry.ShutLiningCurveInfo.Radius
The profile radius.
Since: 6.0

Rhino.Geometry.ShutLiningCurveInfo.Profile
>The profile type.
Since: 6.0

Rhino.Geometry.ShutLiningCurveInfo.Pull
True if the curve should be pulled.
Since: 6.0

Rhino.Geometry.ShutLiningCurveInfo.IsBump
True if profile constitutes a bump. See Rhino's Help for more information.
Since: 6.0

Rhino.Geometry.ShutLiningCurveInfo.CurveIntervals
The parts of the curve to use as profiles.
Since: 6.0