Rhino.Geometry.InstanceReferenceGeometry
Represents a reference to the geometry in a block definition.

Rhino.Geometry.InstanceReferenceGeometry.#ctor(System.Guid,Rhino.Geometry.Transform)
Constructor used when creating nested instance references.
instanceDefinitionId:
transform:
Since: 5.1

Rhino.Geometry.InstanceReferenceGeometry.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor for internal use.
info: Serialization data.
context: Serialization stream.

Rhino.Geometry.InstanceReferenceGeometry.ParentIdefId
The unique id for the parent instance definition of this instance reference.
Since: 5.6

Rhino.Geometry.InstanceReferenceGeometry.Xform
Transformation for this reference.
Since: 5.6