Rhino.ApplicationSettings.AppearanceSettingsState
snapshot of the values in Rhino.ApplicationSettings.AppearanceSettings

Rhino.ApplicationSettings.AppearanceSettingsState.DefaultFontFaceName
Gets or sets the name of the default font face.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettingsState.DefaultLayerColor
Gets or sets the default layer color.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettingsState.SelectedObjectColor
The color used to draw selected objects.
The default is yellow, but this can be customized by the user.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettingsState.LockedObjectColor
Gets or sets the color used to draw locked objects.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettingsState.SelectionWindowStrokeColor
Gets or sets the color used to draw the stroke of a selection window
Since: 7.0

Rhino.ApplicationSettings.AppearanceSettingsState.SelectionWindowFillColor
Gets or sets the color used to fill a selection window
Since: 7.0

Rhino.ApplicationSettings.AppearanceSettingsState.SelectionWindowCrossingStrokeColor
Gets or sets the color used to draw the stroke of a crossing selection window
Since: 7.0

Rhino.ApplicationSettings.AppearanceSettingsState.SelectionWindowCrossingFillColor
Gets or sets the color used to fill a crossing selection window
Since: 7.0

Rhino.ApplicationSettings.AppearanceSettingsState.WorldCoordIconXAxisColor
Gets or sets the color of the world X axis of the world coordinates icon,
appearing usually bottom left in viewports.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettingsState.WorldCoordIconYAxisColor
Gets or sets the color of the world Y axis of the world coordinate icon,
appearing usually bottom left in viewports.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettingsState.WorldCoordIconZAxisColor
Gets or sets the color of the world Z axis of the world coordinate icon,
appearing usually bottom left in viewports.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettingsState.TrackingColor
Gets or sets the tracking color.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettingsState.FeedbackColor
Gets or sets the feedback color.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettingsState.DefaultObjectColor
Gets or sets the default object color.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettingsState.ViewportBackgroundColor
Gets or sets the viewport background color.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettingsState.FrameBackgroundColor
Gets or sets the frame background color.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettingsState.CommandPromptTextColor
Gets or sets the command prompt text color.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettingsState.CommandPromptHypertextColor
Gets or sets the command prompt hypertext color.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettingsState.CommandPromptBackgroundColor
Gets or sets the command prompt background color.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettingsState.CommandPromptFontSize
Size of the font used in the command prompt (in points)
Since: 7.0

Rhino.ApplicationSettings.AppearanceSettingsState.CommandPromptFontName
Name of the font used in the command prompt
Since: 8.0

Rhino.ApplicationSettings.AppearanceSettingsState.CrosshairColor
Gets or sets the crosshair color.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettingsState.PageviewPaperColor
CRhinoPageView paper background. A rectangle is drawn into the background
of page views to represent the printed area. The alpha portion of the color
is used to draw the paper blended into the background
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettingsState.CurrentLayerBackgroundColor
Gets or sets the color used by the layer manager dialog as the background color for the current layer.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettingsState.EditCandidateColor
Gets or sets the color of objects that are eligible to be edited.
Since: 7.0

Rhino.ApplicationSettings.AppearanceSettingsState.EchoPromptsToHistoryWindow
Gets or sets a value that determines if prompt messages are written to the history window.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettingsState.EchoCommandsToHistoryWindow
Gets or sets a value that determines if command names are written to the history window.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettingsState.ShowTitleBar
Shows or hides title bar.
Since: 8.0

Rhino.ApplicationSettings.AppearanceSettingsState.ShowFullPathInTitleBar
Gets or sets a value that determines if the full path of the document is shown in the Rhino title bar.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettingsState.ShowCrosshairs
Gets or sets a value that determines if cross hairs are visible.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettingsState.ShowLayoutDropShadow
Display the drop shadow of layouts
Since: 8.0

Rhino.ApplicationSettings.AppearanceSettingsState.MenuVisible
Get/Set menu visibility
Since: 8.0

Rhino.ApplicationSettings.AppearanceSettingsState.ShowStatusBar
Get/Set status bar visibility
Since: 8.0

Rhino.ApplicationSettings.AppearanceSettingsState.ShowViewportTitles
Get/Set viewport title visibility
Since: 8.0

Rhino.ApplicationSettings.AppearanceSettingsState.ViewportTabsVisibleAtStart
Display viewport tabs at start
Since: 8.0

Rhino.ApplicationSettings.AppearanceSettingsState.DirectionArrowIconShaftSize
Set the arrow icon shaft size.
Since: 8.0

Rhino.ApplicationSettings.AppearanceSettingsState.DirectionArrowIconHeadSize
Set the arrow icon head size.
Since: 8.0

Rhino.ApplicationSettings.AppearanceSettingsState.GridThinLineColor
Gets or sets the color of the thin line in the grid.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettingsState.GridThickLineColor
Gets or sets the color of the thick line in the grid.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettingsState.GridXAxisLineColor
Gets or sets the color of X axis line in the grid.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettingsState.GridYAxisLineColor
Gets or sets the color of Y axis line in the grid.
Since: 5.0

Rhino.ApplicationSettings.AppearanceSettingsState.GridZAxisLineColor
Gets or sets the color of Z axis line in the grid.
Since: 5.0