Rhino.Render.SceneServerData
The Scene Server Data used by the PreviewSceneServer

Rhino.Render.SceneServerData.CppPointer
The CppPointer of SceneServerData
Since: 6.0

Rhino.Render.SceneServerData.#ctor(Rhino.Render.PreviewGeometry,Rhino.Render.PreviewBackground,Rhino.Render.PreviewLighting,Rhino.Render.SceneServerDataUsage)
Constructor for SceneServerData
Since: 6.0
8.0

Rhino.Render.SceneServerData.#ctor(Rhino.Render.PreviewAppearance,Rhino.Render.SceneServerDataUsage)
Since: 8.0

Rhino.Render.SceneServerData.Finalize
Destructor for SceneServerData

Rhino.Render.SceneServerData.Dispose
Dispose for SceneServerData
Since: 6.0

Rhino.Render.SceneServerData.Dispose(System.Boolean)
Dispose for SceneServerData