Rhino.DocObjects.Tables.NamedConstructionPlaneTable
Contains all named construction planes in a rhino document.
This class cannot be inherited.

Rhino.DocObjects.Tables.NamedConstructionPlaneTable.Document
Gets the document that owns this table.
Since: 5.0

Rhino.DocObjects.Tables.NamedConstructionPlaneTable.Count
Number of construction planes in the table.
Since: 5.0

Rhino.DocObjects.Tables.NamedConstructionPlaneTable.Item(System.Int32)
Conceptually, the named construction plane table is an array of ConstructionPlanes
and their associated names. The operator[] can be used to get individual ConstructionPlanes.
index: Zero based array index.
Returns:
A construction plane at the index, or null on error.

Rhino.DocObjects.Tables.NamedConstructionPlaneTable.Find(System.String)
Finds a named construction plane.
name:
Name of construction plane to search for.
Returns:
>=0 index of the construction plane with the given name.
-1 no construction plane found with the given name.
Since: 5.0

Rhino.DocObjects.Tables.NamedConstructionPlaneTable.Add(System.String,Rhino.Geometry.Plane)
Adds named construction plane to document.
name:
If name is empty, a unique name is automatically created.
If there is already a named construction plane with the same name, that
construction plane is replaced.
plane: The plane value.
Returns:
0 based index of named construction plane.
-1 on failure.
Since: 5.0

Rhino.DocObjects.Tables.NamedConstructionPlaneTable.Add(Rhino.DocObjects.ConstructionPlane)
Adds named construction plane to document.
constructionPlane: The construction plane value.
Returns:
0 based index of named construction plane.
-1 on failure.
Since: 8.18

Rhino.DocObjects.Tables.NamedConstructionPlaneTable.Delete(System.Int32)
Remove named construction plane from the document.
index: zero based array index.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.NamedConstructionPlaneTable.Delete(System.String)
Remove named construction plane from the document.
name: name of the construction plane.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.NamedConstructionPlaneTable.GetEnumerator
Since: 5.0

Rhino.DocObjects.Tables.NamedConstructionPlaneTable.System#Collections#IEnumerable#GetEnumerator
Since: 5.0