Rhino.Geometry.SurfaceToRailFillet
New interactive FilletSrf

Rhino.Geometry.SurfaceToRailFillet.#ctor(Rhino.Geometry.BrepFace,Rhino.Geometry.Curve,Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double)
RailFace:
Rail3d:
Face:
uv:
tolerance:
Throws System.NullReferenceException:

Rhino.Geometry.SurfaceToRailFillet.ChangeRadius(System.Double)
This will clear out the existing rails and fillet surfaces,
and redo the offset intersections, etc.
radius: The new radius
Returns: true if successful