Rhino.UI.ILocalizationService.LocalizeCommandName(System.Reflection.Assembly,System.Int32,System.String)
Since: 6.0

Rhino.UI.ILocalizationService.LocalizeDialogItem(System.Reflection.Assembly,System.Int32,System.String,System.String)
Since: 6.0

Rhino.UI.ILocalizationService.LocalizeForm(System.Reflection.Assembly,System.Int32,System.Object)
Since: 6.0

Rhino.UI.ILocalizationService.LocalizeString(System.Reflection.Assembly,System.Int32,System.String,System.Int32)
Since: 6.0