Rhino.Input.Custom.GetPoint
Used to interactively get a point.

Rhino.Input.Custom.GetPoint.#ctor
Create a new GetPoint.
Since: 5.0

Rhino.Input.Custom.GetPoint.SetBasePoint(Rhino.Geometry.Point3d,System.Boolean)
Sets a base point used by ortho snap, from snap, planar snap, etc.
basePoint: The new base point.
showDistanceInStatusBar:
If true, then the distance from base_point to the current point will be in the
status bar distance pane.
Since: 5.0

Rhino.Input.Custom.GetPoint.TryGetBasePoint(Rhino.Geometry.Point3d@)
Since: 5.0

Rhino.Input.Custom.GetPoint.GetPlanarConstraint(Rhino.Display.RhinoViewport@,Rhino.Geometry.Plane@)
Since: 6.0

Rhino.Input.Custom.GetPoint.ConstrainDistanceFromBasePoint(System.Double)
Sets distance constraint from base point.
distance:
pass UnsetValue to clear this constraint. Pass 0.0 to disable the
ability to set this constraint by typing a number during GetPoint.
Remarks:
If the base point is set and the distance from base point constraint
is > 0, then the picked point is constrained to be this distance
from the base point.
Since: 5.0

Rhino.Input.Custom.GetPoint.DynamicDrawColor
Color used by CRhinoGetPoint::DynamicDraw to draw the current point and
the line from the base point to the current point.
Since: 5.0

Rhino.Input.Custom.GetPoint.SetCursor(Rhino.UI.CursorStyle)
Sets cursor that will be used when Get() is called and snap is not
happening.
cursor:
Since: 6.0

Rhino.Input.Custom.GetPoint.EnableObjectSnapCursors(System.Boolean)
Enables or disables object snap cursors. By default, object snap cursors are enabled.
enable: If true then object snap cursors (plus sign with "near", "end", etc.)
are used when the point snaps to a object.
Since: 6.0

Rhino.Input.Custom.GetPoint.DrawLineFromPoint(Rhino.Geometry.Point3d,System.Boolean)
Use DrawLineFromPoint() if you want a dynamic line drawn from a point to the point being picked.
startPoint:
The line is drawn from startPoint to the point being picked. If the base
point has not been set, then it is set to startPoint.
showDistanceInStatusBar:
if true, the distance from the basePoint to the point begin picked is shown in the status bar.
Remarks:
Calling DrawLineFromPoint automatically enables drawing the line. Use
EnableDrawLineFromPoint() to toggle the line drawing state.
Since: 5.0

Rhino.Input.Custom.GetPoint.EnableDrawLineFromPoint(System.Boolean)
Controls drawing of dynamic a line from the start point.
enable:
if true, a dynamic line is drawn from the DrawLineFromPoint startPoint to the point being picked.
Since: 5.0

Rhino.Input.Custom.GetPoint.EnableNoRedrawOnExit(System.Boolean)
The default functionality of the GetPoint operation is to perform a redraw on exit.
Calling this function with true turns off automatic redraw at the end of GetPoint.
May be needed in some commands for flicker free feedback.
When set to true, the caller is responsible for cleaning up the screen
after GetPoint.
noRedraw:
Since: 6.0

Rhino.Input.Custom.GetPoint.PermitOrthoSnap(System.Boolean)
Controls availability of ortho snap. Default is true.
permit:
if true, then GetPoint pays attention to the Rhino "ortho snap" and "planar snap" settings
reported by ModelAidSettings.Ortho and ModelAidSettings.Planar.
Since: 5.0

Rhino.Input.Custom.GetPoint.PermitFromOption(System.Boolean)
Control the availability of the built-in "From" option. By default, the "From" option is enabled.
permit:
if true, then the "From" option is automatically available in GetPoint.
Remarks:
The GetPoint "From" option is never visible on the command line and the user must
type the complete option name to activate the "From" option. When the GetPoint "From"
snap is enabled, the user set/change the base point during GetPoint by typing "From" and
picking a point.
A related option is the built-in distance from base point constraint that is can be set
before GetPoint is called by passing a value to GetPoint::ConstrainDistanceFromBasePoint
or during GetPoint by entering a number.
Since: 5.0

Rhino.Input.Custom.GetPoint.PermitConstraintOptions(System.Boolean)
Control the availability of the built-in linear, planar, curve, and surface
constraint options like "Along", "AlongPerp", "AlongTan", "AlongParallel",
"Between", "OnCrv", "OnSrf", ".x", ".y", ".z", ".xy", etc.
permit:
if true, then the built-in constraint options are automatically available in GetPoint.
Remarks:
By default, these built-in constraint options are available unless an explicit
constraint is added by calling one of the GetPoint::Constrain functions. Calling
GetPoint::ClearConstraints automatically enables the built-in constraint options.
The built-in constraint options are never visible on the command line and the
user must type the complete option name to activate these options.
Since: 5.0

Rhino.Input.Custom.GetPoint.PermitTabMode(System.Boolean)
Permits the use of the tab key to define a line constraint.
permit: If true, then the built-in tab key mode is available.
Remarks: By default, use of the tab key is supported.
Since: 5.0

Rhino.Input.Custom.GetPoint.PermitElevatorMode(System.Int32)
Permits the use of the control key to define a line constraint.
permitMode:
0: no elevator modes are permitted
1: fixed plane elevator mode (like the Line command)
2: cplane elevator mode (like object dragging)
Since: 5.0

Rhino.Input.Custom.GetPoint.PermitObjectSnap(System.Boolean)
By default, object snaps like "end", "near", etc. are controlled by the user.
If you want to disable this ability, then call PermitObjectSnap(false).
permit: true to permit snapping to objects.
Since: 5.0

Rhino.Input.Custom.GetPoint.AddSnapPoint(Rhino.Geometry.Point3d)
Adds a point to the list of osnap points.
point: A point.
Returns: Total number of snap points.
Remarks:
When point osnap is enabled, GetPoint will snap to points in the Rhino model.
If you want the user to be able to snap to additional points, then use
GetPoint::AddSnapPoints to specify the locations of these additional points.
Since: 5.0

Rhino.Input.Custom.GetPoint.AddSnapPoints(Rhino.Geometry.Point3d[])
Adds points to the list of osnap points.
points: An array of points to snap onto.
Returns: Total number of snap points.
Remarks:
When point osnap is enabled, GetPoint will snap to points in the Rhino model.
If you want the user to be able to snap to additional points, then use
GetPoint::AddSnapPoints to specify the locations of these additional points.
Since: 5.0

Rhino.Input.Custom.GetPoint.AddConstructionPoint(Rhino.Geometry.Point3d)
Adds a point to the list of construction points.
point: A point to be added.
Returns: Total number of construction points.
Remarks:
Construction points are like snap points except that they get snapped to even when
point osnap is off.  Typically, there are only a few construction points while there
can be many snap points. For example, when polylines are drawn the start point is a
construction point and the other points are snap points.
Since: 5.0

Rhino.Input.Custom.GetPoint.AddConstructionPoints(Rhino.Geometry.Point3d[])
Adds points to the list of construction points.
points: An array of points to be added.
Returns: Total number of construction points.
Remarks:
Construction points are like snap points except that they get snapped to even when
point osnap is off.  Typically, there are only a few construction points while there
can be many snap points. For example, when polylines are drawn the start point is a
construction point and the other points are snap points.
Since: 5.0

Rhino.Input.Custom.GetPoint.ClearSnapPoints
Remove all snap points.
Remarks:
When point osnap is enabled, GetPoint will snap to points in the Rhino model.
If you want the user to be able to snap to additional points, then use GetPoint::AddSnapPoints
to specify the locations of these additional points.
Since: 5.0

Rhino.Input.Custom.GetPoint.ClearConstructionPoints
Remove all construction points.
Remarks:
Construction points are like snap points except that they get snapped to
even when point osnap is off. Typically, there are only a few construction
points while there can be many snap points. For example, when polylines
are drawn the start point is a construction point and the other points are
snap points.
Since: 5.0

Rhino.Input.Custom.GetPoint.GetSnapPoints
Gets current snap points.
Returns: An array of points.
Since: 5.0

Rhino.Input.Custom.GetPoint.GetConstructionPoints
Gets current construction points.
Returns: An array of points.
Remarks:
Construction points are like snap points except that they get snapped to
even when point osnap is off. Typically, there are only a few construction
points while there can be many snap points. For example, when polylines
are drawn the start point is a construction point and the other points are
snap points.
Since: 5.0

Rhino.Input.Custom.GetPoint.EnableCurveSnapTangentBar(System.Boolean,System.Boolean)
Controls display of the curve snap tangent bar icon.
drawTangentBarAtSnapPoint:
true to draw a tangent bar icon whenever GetPoint snaps to a curve.
drawEndPoints:
true to draw points at the end of the tangent bar.
Remarks:
The tangent bar is drawn by GetPoint::DynamicDraw. If you override GetPoint::DynamicDraw,
then you must call the base class function.
Since: 5.0

Rhino.Input.Custom.GetPoint.EnableCurveSnapPerpBar(System.Boolean,System.Boolean)
Controls display of the curve snap perpendicular bar icon.
drawPerpBarAtSnapPoint:
true to draw a tangent bar icon  whenever GetPoint snaps to a curve.
drawEndPoints:
true to draw points at the end of the tangent bar.
Since: 5.0

Rhino.Input.Custom.GetPoint.EnableCurveSnapArrow(System.Boolean,System.Boolean)
Controls display of the curve snap arrow icon.
drawDirectionArrowAtSnapPoint:
true to draw arrow icon whenever GetPoint snaps to a curve.
reverseArrow:
true if arrow icon direction should be the reverse of the first derivative direction.
Remarks:
The tangent bar is drawn by GetPoint::DynamicDraw. If you override GetPoint::DynamicDraw,
then you must call the base class function.
Since: 5.0

Rhino.Input.Custom.GetPoint.EnableSnapToCurves(System.Boolean)
If you want GetPoint() to try to snap to curves when the mouse is near a curve
(like the center point in the Circle command when the AroundCurve option is on),
then enable the snap to curves option.
enable: Whether points should be enabled.
Since: 5.0

Rhino.Input.Custom.GetPoint.Constrain(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Constrains the picked point to lie on a line.
from: The start point of constraint.
to: The end point of constraint.
Returns: true if constraint could be applied.
Since: 5.0

Rhino.Input.Custom.GetPoint.Constrain(Rhino.Geometry.Line)
Constrains the picked point to lie on a line.
line: A line to use as constraint.
Returns: true if constraint could be applied.
Since: 5.0

Rhino.Input.Custom.GetPoint.Constrain(Rhino.Geometry.Arc)
Constrains the picked point to lie on an arc.
arc: An arc to use as constraint.
Returns: true if constraint could be applied.
Since: 5.0

Rhino.Input.Custom.GetPoint.Constrain(Rhino.Geometry.Circle)
Constrains the picked point to lie on a circle.
circle: A circle to use as constraint.
Returns: true if constraint could be applied.
Since: 5.0

Rhino.Input.Custom.GetPoint.Constrain(Rhino.Geometry.Plane,System.Boolean)
constrain the picked point to lie on a plane.
plane: A plane to use as constraint.
allowElevator: true if elevator mode should be allowed at user request.
Returns: true if constraint could be applied.
Since: 5.0

Rhino.Input.Custom.GetPoint.Constrain(Rhino.Geometry.Sphere)
Constrains the picked point to lie on a sphere.
sphere: A sphere to use as constraint.
Returns: true if constraint could be applied.
Since: 5.0

Rhino.Input.Custom.GetPoint.Constrain(Rhino.Geometry.Cylinder)
Constrains the picked point to lie on a cylinder.
cylinder: A cylinder to use as constraint.
Returns: true if constraint could be applied.
Since: 5.0

Rhino.Input.Custom.GetPoint.Constrain(Rhino.Geometry.Curve,System.Boolean)
Constrains the picked point to lie on a curve.
curve: A curve to use as constraint.
allowPickingPointOffObject:
defines whether the point pick is allowed to happen off object. When false,
a "no no" cursor is shown when the cursor is not on the object. When true,
a normal point picking cursor is used and the marker is visible also when
the cursor is not on the object.
Returns: true if constraint could be applied.
Since: 5.0

Rhino.Input.Custom.GetPoint.Constrain(Rhino.Geometry.Surface,System.Boolean)
Constrains the picked point to lie on a surface.
surface: A surface to use as constraint.
allowPickingPointOffObject:
defines whether the point pick is allowed to happen off object. When false,
a "no no" cursor is shown when the cursor is not on the object. When true,
a normal point picking cursor is used and the marker is visible also when
the cursor is not on the object.
Returns: true if constraint could be applied.
Since: 5.0

Rhino.Input.Custom.GetPoint.Constrain(Rhino.Geometry.Brep,System.Int32,System.Int32,System.Boolean)
Constrains the picked point to lie on a brep.
brep: A brep to use as constraint.
wireDensity:
When wire_density<0, isocurve intersection snapping is turned off, when wire_density>=0, the value
defines the isocurve density used for isocurve intersection snapping.
faceIndex:
When face_index <0, constrain to whole brep. When face_index >=0, constrain to individual face.
allowPickingPointOffObject:
defines whether the point pick is allowed to happen off object. When false,
a "no no" cursor is shown when the cursor is not on the object. When true,
a normal point picking cursor is used and the marker is visible also when
the cursor is not on the object.
Returns: true if constraint could be applied.
Since: 5.0

Rhino.Input.Custom.GetPoint.Constrain(Rhino.Geometry.Mesh,System.Boolean)
Constrains the picked point to lie on a mesh.
mesh: A mesh to use as constraint.
allowPickingPointOffObject:
defines whether the point pick is allowed to happen off object. When false,
a "no no" cursor is shown when the cursor is not on the object. When true,
a normal point picking cursor is used and the marker is visible also when
the cursor is not on the object.
Returns: true if constraint could be applied.
Since: 5.0

Rhino.Input.Custom.GetPoint.ConstrainToConstructionPlane(System.Boolean)
If enabled, the picked point is constrained to be on the active construction plane.
If the base point is set, then the point is constrained to be on the plane that contains
the base point and is parallel to the active construction plane. By default this
constraint is enabled.
throughBasePoint: true if the base point should be used as compulsory level reference.
Returns:
If true and the base point is set, then the point is constrained to be on the plane parallel
to the construction plane that passes through the base point, even when planar mode is off.
If throughBasePoint is false, then the base point shift only happens if planar mode is on.
Since: 5.0

Rhino.Input.Custom.GetPoint.ConstrainToTargetPlane
Constrains point to lie on a plane that is parallel to the
viewing plane and passes through the view's target point.
Since: 5.0

Rhino.Input.Custom.GetPoint.ConstrainToVirtualCPlaneIntersection(Rhino.Geometry.Plane)
If enabled, the picked point is constrained to be on the
intersection of the plane and the virtual CPlane going through
the plane origin.
If the planes are parallel, the constraint works just like planar constraint.
plane: The plane used for the plane - virtual CPlane intersection.
Returns: true if the operation succeeded; false otherwise.
Since: 5.0

Rhino.Input.Custom.GetPoint.ClearConstraints
Removes any explicit constraints added by calls to GetPoint::Constraint() and enable
the built-in constraint options.
Since: 5.0

Rhino.Input.Custom.GetPoint.InterruptMouseMove
If you have lengthy computations in OnMouseMove() and/or DymanicDraw()
overrides, then periodically call InterruptMouseMove() to see if you
should interrupt your work because the mouse has moved again.
Returns: true if you should interrupt your work; false otherwise.
Since: 5.0

Rhino.Input.Custom.GetPoint.MouseMove
Called every time the mouse moves. MouseMove is called once per mouse move and is called
BEFORE any calls to OnDynamicDraw. If you are doing anything that takes a long time,
periodically call InterruptMouseMove() to see if you should stop. If the view is such
that the 2d screen point can't be mapped to a 3d point, the 'point' argument will be Unset.
Since: 5.0

Rhino.Input.Custom.GetPoint.OnMouseMove(Rhino.Input.Custom.GetPointMouseEventArgs)
Calls the Rhino.Input.Custom.GetPoint.MouseMove event and can/should be called by overriding implementation.
e: Current argument for the event.

Rhino.Input.Custom.GetPoint.Tag
Gets or sets an arbitrary object that can be attached to this Rhino.Input.Custom.GetPoint instance.
Useful for passing some/ information that you may need in a DynamicDraw event since you can get at this Tag from
the GetPointDrawEventArgs.
Since: 5.0

Rhino.Input.Custom.GetPoint.MouseDown
Called during Get2dRectangle, Get2dLine, and GetPoint(..,true) when the mouse down event for
the initial point occurs. This function is not called during ordinary point getting because
the mouse down event terminates an ordinary point get and returns a GetResult.Point result.
Since: 5.0

Rhino.Input.Custom.GetPoint.OnMouseDown(Rhino.Input.Custom.GetPointMouseEventArgs)
Default calls the MouseDown event.
e: Current argument for the event.

Rhino.Input.Custom.GetPoint.DynamicDraw
Event to use if you want to dynamically draw things as the mouse/digitizer moves.
Every time the mouse moves, DynamicDraw will be called once per viewport. The
calls to DynamicDraw happen AFTER the call to MouseMove.
If you are drawing anything that takes a long time, periodically call
InterruptMouseMove() to see if you should stop.
Since: 5.0

Rhino.Input.Custom.GetPoint.OnDynamicDraw(Rhino.Input.Custom.GetPointDrawEventArgs)
Default calls the DynamicDraw event.
e: Current argument for the event.

Rhino.Input.Custom.GetPoint.FullFrameRedrawDuringGet
In the "RARE" case that you need to draw some depth buffered geometry during
a Get() operation, setting this value to true will force entire frames to be redrawn
while the user moves the mouse. This allows DisplayPipeline events to be triggered
as well as OnPostDrawObjects
NOTE!! Setting this value to true comes with a significant performance penalty because the
scene needs to be fully regenerated every frame where the standard
DynamicDraw event draws temporary decorations (geometry) on top of a static scene.
Since: 5.0

Rhino.Input.Custom.GetPoint.PostDrawObjects
Same as the DisplayPipeline.PostDrawObjects, but only works during the
operation of the Get() function.
NOTE: You must set FullFrameRedrawDuringGet to true in order for this
event to be called.
Since: 5.0

Rhino.Input.Custom.GetPoint.OnPostDrawObjects(Rhino.Display.DrawEventArgs)
In the "rare" case that you need to draw some depth buffered geometry during
a GetPoint operation, override the OnPostDrawObjects function.
NOTE!! Overriding this function comes with a significant performance penalty because the
scene needs to be fully regenerated every frame where the standard
DynamicDraw event draws temporary decorations (geometry) on top of a static scene.
e: Current argument for the event.

Rhino.Input.Custom.GetPoint.Get(System.Boolean)
After setting up options and so on, call this method to get a 3d point.
onMouseUp:
If false, the point is returned when the left mouse button goes down.
If true, the point is returned when the left mouse button goes up.
Returns: Rhino.Input.GetResult.Point if the user chose a point; other enumeration value otherwise.
Since: 5.0

Rhino.Input.Custom.GetPoint.Get(System.Boolean,System.Boolean)
After setting up options and so on, call this method to get a 2d or 3d point.
onMouseUp:
If false, the point is returned when the left mouse button goes down.
If true, the point is returned when the left mouse button goes up.
get2DPoint: If true then get a 2d point otherwise get a 2d point
Returns: Rhino.Input.GetResult.Point if the user chose a 3d point; Rhino.Input.GetResult.Point2d if the user chose a 2d point; other enumeration value otherwise.
Since: 5.12

Rhino.Input.Custom.GetPoint.Get
After setting up options and so on, call GetPoint::Get to get a 3d point. The
point is retrieved when the mouse goes down.
Since: 5.0

Rhino.Input.Custom.GetPoint.OsnapEventType
Gets the type of object snap used to obtain the point.
Since: 6.24

Rhino.Input.Custom.GetPoint.NumberPreview(System.Double@)
If the user is typing a number, but hasn't pressed Enter,
true is returned, along with the number the user typed.
number: The number typed by the user.
Returns: true if successful, false otherwise.
Since: 7.23

Rhino.Input.Custom.GetPoint.PointOnObject
Call this function to see if the point was on an object. If the point was
on an object an ObjRef is returned; otherwise null is returned.
Returns: A point object reference.
Since: 5.0

Rhino.Input.Custom.GetPoint.PointOnCurve(System.Double@)
Use to determine is point was on a curve.
t:
If the point was on a curve, then the t is the curve
parameter for the point.  The point returned by Point()
is the same as curve.PointAt(t).
Returns: A curve at a specified parameter value.
Since: 5.0

Rhino.Input.Custom.GetPoint.PointOnSurface(System.Double@,System.Double@)
Use to determine if point was on a surface. If the point was on a surface,
then the (u,v) are the surface parameters for the point. The point returned
by Point() is the same as surface.PointAt(u,v).
u: If the point was on a surface, then the u parameter.
v: If the point was on a surface, then the v parameter.
Returns: The surface or null if the point was not on a surface.
Since: 6.0

Rhino.Input.Custom.GetPoint.PointOnBrep(System.Double@,System.Double@)
Use to determine if point was on a Brep face. If the point was on a Brep face,
then the (u,v) are the face parameters for the point.
u: If the point was on a Brep face, then the u parameter.
v: If the point was on a Brep face, then the v parameter.
Returns: The Brep face or null if the point was not on a Brep face.
Since: 6.0