Rhino.DocObjects.Environment.BackgroundProjections
The available background projections.
Since: 8.0

Rhino.DocObjects.Environment.BackgroundProjections.Planar
Planar.

Rhino.DocObjects.Environment.BackgroundProjections.Spherical
Spherical.

Rhino.DocObjects.Environment.BackgroundProjections.Emap
Environment map.

Rhino.DocObjects.Environment.BackgroundProjections.Box
Box.

Rhino.DocObjects.Environment.BackgroundProjections.Automatic
Automatic.

Rhino.DocObjects.Environment.BackgroundProjections.LightProbe
Light probe.

Rhino.DocObjects.Environment.BackgroundProjections.CubeMap
Cube map.

Rhino.DocObjects.Environment.BackgroundProjections.VerticalCrossCubeMap
Vertical cross cube map.

Rhino.DocObjects.Environment.BackgroundProjections.HorizontalCrossCubeMap
Horizontal cross cube map.

Rhino.DocObjects.Environment.BackgroundProjections.Hemispherical
Hemispherical.