Rhino.Commands.CommandStyleAttribute
Decorates commands to provide styles.

Rhino.Commands.CommandStyleAttribute.#ctor(Rhino.Commands.Style)
Initializes a new command style attribute class.
styles:
Set of values combined using a bitwise OR operation to get the desired combination
of command styles.
Since: 5.0

Rhino.Commands.CommandStyleAttribute.Styles
Gets the associated style.
Since: 5.0