Rhino.DocumentOpenEventArgs
Provides document information for RhinoDoc events.

Rhino.DocumentOpenEventArgs.FileName
Name of file being opened.
Since: 5.0

Rhino.DocumentOpenEventArgs.Merge
true if file is being merged into the current document. This
occurs during the "Import" command.
Since: 5.0

Rhino.DocumentOpenEventArgs.Reference
true if file is opened as a reference file.
Since: 5.0