Rhino.FileIO.FileVdaWriteOptions
Options for writing a Vda file

Rhino.FileIO.FileVdaWriteOptions.SendingCompany
Since: 8.0

Rhino.FileIO.FileVdaWriteOptions.SendersName
Since: 8.0

Rhino.FileIO.FileVdaWriteOptions.TelephoneNumber
Since: 8.0

Rhino.FileIO.FileVdaWriteOptions.Address
Since: 8.0

Rhino.FileIO.FileVdaWriteOptions.ProjectName
Since: 8.0

Rhino.FileIO.FileVdaWriteOptions.ObjectCode
Since: 8.0

Rhino.FileIO.FileVdaWriteOptions.Variant
Since: 8.0

Rhino.FileIO.FileVdaWriteOptions.Confidentiality
Since: 8.0

Rhino.FileIO.FileVdaWriteOptions.DateEffective
Since: 8.0

Rhino.FileIO.FileVdaWriteOptions.CompanyName
Since: 8.0

Rhino.FileIO.FileVdaWriteOptions.ReceivingDepartment
Since: 8.0

Rhino.FileIO.FileVdaWriteOptions.PointDeviationHairsAsMDI
Since: 8.0

Rhino.FileIO.FileVdaWriteOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0