Rhino.DocObjects.Tables.GroupTableEventType
Defines the types of group table events.
Since: 5.0

Rhino.DocObjects.Tables.GroupTableEventType.Added
A group was added.

Rhino.DocObjects.Tables.GroupTableEventType.Deleted
A group was deleted.

Rhino.DocObjects.Tables.GroupTableEventType.Undeleted
A group was undeleted.

Rhino.DocObjects.Tables.GroupTableEventType.Modified
A group was modified.

Rhino.DocObjects.Tables.GroupTableEventType.Sorted
The group table was sorted.