Rhino.DisplayDeviceInfo
Get information about display devices found on this machine (GPUs).

Rhino.DisplayDeviceInfo.GpuNames
Get a list with the names of all GPUs on this machine.
Returns: List of strings
Since: 7.3

Rhino.DisplayDeviceInfo.GpuDeviceInfos
Get a list of GpuDeviceInfo for GPUs found on this machine.
Returns: List of GpuDeviceInfo
Since: 7.3