Rhino.RhinoDoc.UserStringChangedArgs
This event is raised when document user text strings are changed

Rhino.RhinoDoc.UserStringChangedArgs.Document
Document containing the user string
Since: 7.7

Rhino.RhinoDoc.UserStringChangedArgs.Key
Key for the string being changed
Since: 7.7