Rhino.DocObjects.DimensionStyle.ZeroSuppression
Marks leading and trailing zeros for removal.

Rhino.DocObjects.DimensionStyle.ZeroSuppression.None
No zero suppression.

Rhino.DocObjects.DimensionStyle.ZeroSuppression.SuppressLeading
Suppress leading zeros.

Rhino.DocObjects.DimensionStyle.ZeroSuppression.SuppressTrailing
Suppress trailing zeros.

Rhino.DocObjects.DimensionStyle.ZeroSuppression.SuppressLeadingAndTrailing
Suppress leading and trailing zeros.

Rhino.DocObjects.DimensionStyle.ZeroSuppression.SuppressZeroFeet
Suppress zero feet.

Rhino.DocObjects.DimensionStyle.ZeroSuppression.SuppressZeroInches
Suppress zero inches.

Rhino.DocObjects.DimensionStyle.ZeroSuppression.SuppressZeroFeetAndZeroInches
Suppress zero feet and zero inches.