Rhino.Commands.Command
Defines a base class for all commands. This class is abstract.

Rhino.Commands.Command.IsValidCommandName(System.String)
Determines if a string is a valid command name.
name: A string.
Returns: true if the string is a valid command name.
Since: 5.0

Rhino.Commands.Command.LastCommandId
Gets the ID of the last commands.
Since: 5.0

Rhino.Commands.Command.LastCommandResult
Gets the result code of the last command.
Since: 5.0

Rhino.Commands.Command.GetMostRecentCommands
Gets an array of most recent command descriptions.
Returns: An array of command descriptions.
Since: 5.0

Rhino.Commands.Command.RunProxyCommand(Rhino.Commands.Command.RunCommandDelegate,Rhino.RhinoDoc,System.Object)
Execute some code as if it were running in a command
doc:
commandCallback:
data: optional extra data to pass to callback
Since: 6.13

Rhino.Commands.Command.#ctor
Default protected constructor. It only allows instantiation through sub-classing.

Rhino.Commands.Command.PlugIn
Gets the plug-in where this commands is placed.
Since: 5.0

Rhino.Commands.Command.Id
Gets the  unique ID of this command. It is best to use a Guid
attribute for each custom derived command class since this will
keep the id consistent between sessions of Rhino
GuidAttribute
Since: 5.0

Rhino.Commands.Command.EnglishName
Gets the name of the command.
This method is abstract.
Since: 5.0

Rhino.Commands.Command.LocalName
Gets the local name of the command.
Since: 5.0

Rhino.Commands.Command.Settings
Gets the settings of the command.
Since: 5.0

Rhino.Commands.Command.HistoryReplayOnObjectAttributeChange
By default, object attribute changes do not trigger history replay.
Set this property to true, typically in the command's constructor, if you
want objects created with this command to trigger history replay when their
attributes change.
Since: 8.34

Rhino.Commands.Command.RunCommand(Rhino.RhinoDoc,Rhino.Commands.RunMode)
Executes the command.
doc: The current document.
mode: The command running mode.
Returns: The command result code.

Rhino.Commands.Command.OnHelp
Is called when the user needs assistance with this command.

Rhino.Commands.Command.CommandContextHelpUrl
Gets the URL of the command contextual help. This is usually a location of a local CHM file.
The default implementation return an empty string.

Rhino.Commands.Command.GetCommandStack
Determines if Rhino is currently running a command. Because Rhino allow for transparent commands
(commands that can be run from inside of other commands), this method returns the total ids of
active commands.
Returns:
Ids of running commands or null if no commands are currently running.
The "active" command is at the end of this list.
Since: 5.0

Rhino.Commands.Command.InCommand
Determines if Rhino is currently running a command.
Returns: true if a command is currently running, false if no commands are currently running.
Since: 5.0

Rhino.Commands.Command.InScriptRunnerCommand
This is a low level tool to determine if Rhino is currently running
a script running command like "ReadCommandFile" or the RhinoScript
plug-in's "RunScript".
Returns: true if a script running command is active.
Since: 5.0

Rhino.Commands.Command.IsCommand(System.String)
Determines is a string is a command.
name: A string.
Returns: true if the string is a command.
Since: 5.0

Rhino.Commands.Command.LookupCommandId(System.String,System.Boolean)
Returns the ID of a command.
name: The name of the command.
searchForEnglishName: true if the name is to searched in English. This ensures that a '_' is prepended to the name.
Returns: An of the command, or System.Guid.Empty on error.
Since: 5.0

Rhino.Commands.Command.LookupCommandName(System.Guid,System.Boolean)
Returns the command name given a command ID.
commandId: A command ID.
englishName: true if the requested command is in English.
Returns: The command name, or null on error.
Since: 5.0

Rhino.Commands.Command.GetCommandContextHelpUrl(System.Guid)
Returns a command's context help url.
commandId: A command ID.
Returns: The command's context url if provided.
Since: 8.18

Rhino.Commands.Command.GetCommandNames(System.Boolean,System.Boolean)
Gets list of command names in Rhino. This list does not include Test, Alpha, or System commands.
english:
if true, retrieve the English name for every command.
if false, retrieve the local name for every command.
loaded:
if true, only get names of currently loaded commands.
if false, get names of all registered (may not be currently loaded) commands.
Returns: An array instance with command names. This array could be empty, but not null.
Since: 5.0

Rhino.Commands.Command.DisplayHelp(System.Guid)
Displays help for a command.
commandId: A command ID.
Since: 5.0

Rhino.Commands.Command.BeginCommand
Called just before command.RunCommand().
Since: 5.0

Rhino.Commands.Command.EndCommand
Called immediately after command.RunCommand().
Since: 5.0

Rhino.Commands.Command.UndoRedo
Used to monitor Rhino's built in undo/redo support.
Since: 5.0

Rhino.Commands.Command.ReplayHistory(Rhino.DocObjects.ReplayHistoryData)
Repeats an operation of a command.
In order to make this function work, you will likely need to grab the Result property that gives the
list of input objects. Then, you will be able to replace these inputs by using one of the UpdateToX() methods
of the ReplayHistoryResult.
You should NOT use any document AddX() or ReplaceX() functions, as they will break history.
replayData: The replay history information.
Returns: true if the operation succeeded.
The default implementation always returns false.