Rhino.PersistentSettingsConverter
Used to convert string to string lists and string dictionaries and back
to strings again.

Rhino.PersistentSettingsConverter.IsStringList(System.String)
Determines if the string value is formatted as a string list.
s: String to check
Returns:
Returns true if it is a XML string list otherwise return false.
Since: 6.0

Rhino.PersistentSettingsConverter.IsStringDictionary(System.String)
Determines if the string value is formatted as a key value pair
string list.
s: String to check
Returns:
Returns true if it is a XML key value pair list otherwise return false.
Since: 6.0

Rhino.PersistentSettingsConverter.TryParseStringList(System.String,System.String[]@)
Attempts to convert a string to a string value list.
s: String to parse
value:
Result will get copied here, if the string is null or empty then this
will be an empty list, if there was an error parsing then this will be
null otherwise it will be the string parsed as a list.
Returns:
Returns true if the string is not empty and properly formatted as a
string list otherwise returns false.
Since: 6.0

Rhino.PersistentSettingsConverter.ToString(System.String[])
Converts a string array to a properly formatted string list XML string.
values:
List of strings to turn into a string list XML string.
Returns:
Returns a properly formatted XML string that represents the list of
strings.
Since: 6.0

Rhino.PersistentSettingsConverter.TryParseStringDictionary(System.String,System.Collections.Generic.KeyValuePair{System.String,System.String}[]@)
Attempts to convert a string to a key value string pair array.
s: String to parse
value:
Result will get copied here, if the string is null or empty then this
will be an empty array, if there was an error parsing then this will be
null otherwise it will be the string parsed as a key value string pair
array.
Returns:
Returns true if the string is not empty and properly formatted as a
key value string pair list otherwise returns false.

Rhino.PersistentSettingsConverter.ToString(System.Collections.Generic.KeyValuePair{System.String,System.String}[])
Converts a key value string pair array to a properly formatted string
dictionary XML string.
value:
List of string pairs to turn into a dictionary XML string.
Returns:
Returns a properly formatted XML string that represents the string
dictionary.

Rhino.PersistentSettingsConverter.NewXmlWriterSettings
XmlWriterSettings object used by the ToString(...) methods.
Returns:

Rhino.PersistentSettingsConverter.TryParseEnum(System.Type,System.String,System.String@)
Converts an enumerated value string (integer as string) to
a enumerated value name.
type: The enumerated type
intValueAsString: enumerated integer value as string
value: Output value, will be null on error
Returns:
Returns true if the successfully converted or false if not.
Since: 6.0

Rhino.PersistentSettingsConverter.TryParseEnum(System.Type,System.String,System.Int32@)
Converts an enumerated value name to its integer
equivalent.
type: The enumerated type
enumValueName: Enumerated value name as string
value: Output value, will get set to -1 on error
Returns:
Returns true if the successfully converted or false if not.
Since: 6.0

Rhino.PersistentSettingsConverter.ToString(System.Double)
Converts a double value to a string.
value: double value
Returns:
Returns the double value as a settings file formatted string.
Since: 6.10

Rhino.PersistentSettingsConverter.TryParseDouble(System.String,System.Double@)
Converts the string representation of a number to its double-precision
floating-point number equivalent. A return value indicates whether the
conversion succeeded or failed.
system culture.
s: A string containing a number to convert.
value:
When this method returns, contains the double-precision floating-point
number equivalent of the s parameter, if the conversion succeeded, or
zero if the conversion failed. The conversion fails if the s parameter
is null or Empty, is not a number in a valid format, or represents a
number less than MinValue or greater than MaxValue. This parameter is
passed uninitialized; any value originally supplied in result will be
overwritten.
Returns:
Returns true if s was converted successfully; otherwise, false..
Since: 6.10