Rhino.Geometry.BezierCurve
Represents a Bezier curve.
Note: as an exception, the bezier curve is not derived from Rhino.Geometry.Curve.

Rhino.Geometry.BezierCurve.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Geometry.BezierCurve.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor for internal use.
info: Serialization data.
context: Serialization stream.

Rhino.Geometry.BezierCurve.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Populates a System.Runtime.Serialization.SerializationInfo with the data needed to serialize the target object.
info: The System.Runtime.Serialization.SerializationInfo to populate with data.
context: The destination (see System.Runtime.Serialization.StreamingContext) for this serialization.
Since: 6.3

Rhino.Geometry.BezierCurve.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0

Rhino.Geometry.BezierCurve.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.Geometry.BezierCurve.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d})
Create bezier curve with controls defined by a list of 2d points
controlPoints:
Since: 5.0

Rhino.Geometry.BezierCurve.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Create bezier curve with controls defined by a list of 3d points
controlPoints:
Since: 5.0

Rhino.Geometry.BezierCurve.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point4d})
Create bezier curve with controls defined by a list of 4d points
controlPoints:
Since: 5.0

Rhino.Geometry.BezierCurve.Dimension
Dimension of Bezier
Since: 6.3

Rhino.Geometry.BezierCurve.IsValid
Tests an object to see if it is valid.
Since: 5.0

Rhino.Geometry.BezierCurve.CreateLoftedBezier(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Loft a bezier through a list of points
points: 2 or more points to interpolate
Returns: new bezier curve if successful
Since: 5.0

Rhino.Geometry.BezierCurve.CreateLoftedBezier(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d})
Loft a bezier through a list of points
points: 2 or more points to interpolate
Returns: new bezier curve if successful
Since: 5.0

Rhino.Geometry.BezierCurve.GetBoundingBox(System.Boolean)
Bounding box solver. Gets the world axis aligned bounding box for the curve.
accurate: If true, a physically accurate bounding box will be computed.
If not, a bounding box estimate will be computed. For some geometry types there is no
difference between the estimate and the accurate bounding box. Estimated bounding boxes
can be computed much (much) faster than accurate (or "tight") bounding boxes.
Estimated bounding boxes are always similar to or larger than accurate bounding boxes.
Returns:
The bounding box of the geometry in world coordinates or BoundingBox.Empty
if not bounding box could be found.
Since: 5.0

Rhino.Geometry.BezierCurve.PointAt(System.Double)
Evaluates point at a curve parameter.
t: Evaluation parameter.
Returns: Point (location of curve at the parameter t).
Remarks: No error handling.
Since: 5.0

Rhino.Geometry.BezierCurve.TangentAt(System.Double)
Evaluates the unit tangent vector at a curve parameter.
t: Evaluation parameter.
Returns: Unit tangent vector of the curve at the parameter t.
Remarks: No error handling.
Since: 5.0

Rhino.Geometry.BezierCurve.CurvatureAt(System.Double)
Evaluate the curvature vector at a curve parameter.
t: Evaluation parameter.
Returns: Curvature vector of the curve at the parameter t.
Remarks: No error handling.
Since: 5.0

Rhino.Geometry.BezierCurve.ToNurbsCurve
Constructs a NURBS curve representation of this curve.
Returns: NURBS representation of the curve on success, null on failure.
Since: 5.0

Rhino.Geometry.BezierCurve.IsRational
Gets a value indicating whether or not the curve is rational.
Rational curves have control-points with custom weights.
Since: 5.0

Rhino.Geometry.BezierCurve.ControlVertexCount
Number of control vertices in this curve
Since: 5.0

Rhino.Geometry.BezierCurve.GetControlVertex2d(System.Int32)
Get location of a control vertex.
index:
Control vertex index (0 <= index < ControlVertexCount)
Returns:
If the bezier is rational, the euclidean location is returned.
Throws System.ArgumentOutOfRangeException: when index is out of range
Since: 5.0

Rhino.Geometry.BezierCurve.GetControlVertex3d(System.Int32)
Gets the 3D location of a control vertex at the specified index.
index:
Control vertex index (0 <= index < ControlVertexCount).
Returns:
The 3D location of the control vertex. If the Bezier is rational, the euclidean location is returned.
Returns Rhino.Geometry.Point3d.Unset if the index is out of range or the control vertex cannot be retrieved.
Throws System.ArgumentOutOfRangeException: Thrown when index is out of range.
Since: 5.0

Rhino.Geometry.BezierCurve.GetControlVertex4d(System.Int32)
Gets the homogeneous (4D) value of a control vertex at the specified index.
index:
Control vertex index (0 <= index < ControlVertexCount).
Returns:
The homogeneous value of the control vertex. If the Bezier is not rational, the weight is 1.
Returns Rhino.Geometry.Point4d.Unset if the index is out of range or the control vertex cannot be retrieved.
Throws System.ArgumentOutOfRangeException: Thrown when index is out of range.
Since: 5.0

Rhino.Geometry.BezierCurve.MakeRational
Make bezier rational
Returns: true if successful
Since: 5.0

Rhino.Geometry.BezierCurve.MakeNonRational
Make bezier non-rational
Returns: true if successful
Since: 5.0

Rhino.Geometry.BezierCurve.IncreaseDegree(System.Int32)
Increase degree of bezier
desiredDegree:
Returns: true if successful.  false if desiredDegree < current degree.
Since: 5.0

Rhino.Geometry.BezierCurve.ChangeDimension(System.Int32)
Change dimension of bezier.
desiredDimension:
Returns: true if successful.  false if desired_dimension < 1
Since: 5.0

Rhino.Geometry.BezierCurve.Split(System.Double,Rhino.Geometry.BezierCurve@,Rhino.Geometry.BezierCurve@)
Divides the Bezier curve at the specified parameter.
t: parameter must satisfy 0 < t < 1
left:
right:
Returns: true on success
Since: 6.0

Rhino.Geometry.BezierCurve.CreateCubicBeziers(Rhino.Geometry.Curve,System.Double,System.Double)
Constructs an array of cubic, non-rational Beziers that fit a curve to a tolerance.
sourceCurve: A curve to approximate.
distanceTolerance:
The max fitting error. Use RhinoMath.SqrtEpsilon as a minimum.
kinkTolerance:
If the input curve has a g1-discontinuity with angle radian measure
greater than kinkTolerance at some point P, the list of beziers will
also have a kink at P.
Returns: A new array of bezier curves. The array can be empty and might contain null items.
Since: 5.0

Rhino.Geometry.BezierCurve.CreateBeziers(Rhino.Geometry.Curve)
Create an array of Bezier curves that fit to an existing curve. Please note, these
Beziers can be of any order and may be rational.
sourceCurve: The curve to fit Beziers to
Returns: A new array of Bezier curves
Since: 6.0