Rhino.FileIO.FilePovWriteOptions
Options for writing a POV file

Rhino.FileIO.FilePovWriteOptions.ExportAsOneFile
Since: 8.0

Rhino.FileIO.FilePovWriteOptions.MeshingParameters
Since: 8.0

Rhino.FileIO.FilePovWriteOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0