Rhino.PlugIns.LicenseData
Zoo plug-in license data.

Rhino.PlugIns.LicenseData.#ctor
Public constructor.
Since: 5.0

Rhino.PlugIns.LicenseData.#ctor(System.String,System.String,System.String)
Public constructor
productLicense: License string to be saved by ZooClient
serialNumber: Serial number to be displayed to end user
licenseTitle: Title of license (Rhino 6.0 Evaluation)
Since: 5.0

Rhino.PlugIns.LicenseData.#ctor(System.String,System.String,System.String,Rhino.PlugIns.LicenseBuildType)
Public constructor
productLicense: License string to be saved by ZooClient
serialNumber: Serial number to be displayed to end user
licenseTitle: Title of license (Rhino 6.0 Evaluation)
buildType: A LicenseBuildType value
Since: 5.0

Rhino.PlugIns.LicenseData.#ctor(System.String,System.String,System.String,Rhino.PlugIns.LicenseBuildType,System.Int32)
Public constructor
productLicense: License string to be saved by ZooClient
serialNumber: Serial number to be displayed to end user
licenseTitle: Title of license (Rhino 6.0 Evaluation)
buildType: A LicenseBuildType value
licenseCount: Number of licenses represented by this string. Allows the Zoo to hand out multiple license keys when greater than 1.
Since: 5.0

Rhino.PlugIns.LicenseData.#ctor(System.String,System.String,System.String,Rhino.PlugIns.LicenseBuildType,System.Int32,System.Nullable{System.DateTime})
Public constructor
productLicense: License string to be saved by ZooClient
serialNumber: Serial number to be displayed to end user
licenseTitle: Title of license (Rhino 6.0 Evaluation)
buildType: A LicenseBuildType value
licenseCount: Number of licenses represented by this string. Allows the Zoo to hand out multiple license keys when greater than 1.
expirationDate: Date when license expires, null if license never expires.

Rhino.PlugIns.LicenseData.#ctor(System.String,System.String,System.String,Rhino.PlugIns.LicenseBuildType,System.Int32,System.Nullable{System.DateTime},System.Drawing.Icon)
Public constructor
productLicense: License string to be saved by ZooClient
serialNumber: Serial number to be displayed to end user
licenseTitle: Title of license (Rhino 6.0 Evaluation)
buildType: A LicenseBuildType value
licenseCount: Number of licenses represented by this string. Allows the Zoo to hand out multiple license keys when greater than 1.
expirationDate: Date when license expires, null if license never expires.
productIcon: Icon to display in Rhino License Options user interface when showing this license

Rhino.PlugIns.LicenseData.#ctor(System.String,System.String,System.String,Rhino.PlugIns.LicenseBuildType,System.Int32,System.Nullable{System.DateTime},System.Drawing.Icon,System.Boolean,System.Boolean)
Public constructor
productLicense: License string to be saved by ZooClient
serialNumber: Serial number to be displayed to end user
licenseTitle: Title of license (Rhino 6.0 Evaluation)
buildType: A LicenseBuildType value
licenseCount: Number of licenses represented by this string. Allows the Zoo to hand out multiple license keys when greater than 1.
expirationDate: Date when license expires, null if license never expires.
productIcon: Icon to display in Rhino License Options user interface when showing this license
requiresOnlineValidation: True if online validation server should be called with this license key; false otherwise. If true, caller must pass implementation of VerifyOnlineValidationCodeDelegate to GetLicense/AskUserForLicense
isUpgradeFromPreviousVersion: True if this license key requires a previous version license; false otherwise. If true, caller must pass implementation of VerifyPreviousVersionLicenseDelegate to GetLicense/AskUserForLicense

Rhino.PlugIns.LicenseData.IsValid
Public validator.
Since: 5.0

Rhino.PlugIns.LicenseData.IsValid(System.Boolean)
Since: 6.0

Rhino.PlugIns.LicenseData.Dispose
Since: 5.0

Rhino.PlugIns.LicenseData.ProductLicense
The actual product license.
This is provided by the plug-in that validated the license.
Since: 5.0

Rhino.PlugIns.LicenseData.SerialNumber
The "for display only" product license.
This is provided by the plug-in that validated the license.
Since: 5.0

Rhino.PlugIns.LicenseData.LicenseTitle
The title of the license.
This is provided by the plug-in that validated the license.
(e.g. "Rhinoceros 6.0 Commercial")
Since: 5.0

Rhino.PlugIns.LicenseData.BuildType
The build of the product that this license work with.
When your product requests a license from the Zoo, it
will specify one of these build types.
Since: 5.0

Rhino.PlugIns.LicenseData.LicenseCount
The number of instances supported by this license.
This is provided by the plug in that validated the license.
Since: 5.0

Rhino.PlugIns.LicenseData.DateToExpire
The date and time the license is set to expire.
This is provided by the plug in that validated the license.
This time value should be in Coordinated Universal Time (UTC).
Since: 5.0

Rhino.PlugIns.LicenseData.RequiresOnlineValidation
Set to true if this license requires online validation.
Caller must also pass VerifyOnlineValidationCodeDelegate to GetLicense/AskUserForLicense
Since: 6.0

Rhino.PlugIns.LicenseData.IsUpgradeFromPreviousVersion
Set to true if this license requires a previous version license to be entered.
Caller must also pass VerifyPreviousVersionLicenseDelegate to GetLicense/AskUserForLicense.
Since: 6.0

Rhino.PlugIns.LicenseData.ErrorMessage
Error message set by calls to callback functions
Since: 6.0

Rhino.PlugIns.LicenseData.ProductIcon
The product's icon. This will displayed in the "license"
page in the Options dialog. Note, this can be null.
Note, LicenseData creates it's own copy of the icon.
Since: 5.0

Rhino.PlugIns.LicenseData.LicenseExpires
Since: 6.0

Rhino.PlugIns.LicenseData.IsNotValid(Rhino.PlugIns.LicenseData)
Indicates whether a LicenseData object is either null or invalid.
Since: 5.0

Rhino.PlugIns.LicenseData.IsValid(Rhino.PlugIns.LicenseData)
Indicates whether a LicenseData object is not null and valid.
Since: 5.0