Rhino.Geometry.PointContainment
Defines enumerated values for closed curve/point spatial relationships.
Since: 5.0

Rhino.Geometry.PointContainment.Unset
Relation is meaningless.

Rhino.Geometry.PointContainment.Inside
Point is on the interior of the region implied by the closed curve.

Rhino.Geometry.PointContainment.Outside
Point is on the exterior of the region implied by the closed curve.

Rhino.Geometry.PointContainment.Coincident
Point is coincident with the curve and therefore neither inside not outside.