Rhino.UI.NamedColor
An entry with name and color for the Rhino.UI.NamedColorList

Rhino.UI.NamedColor.Name
Gets the name of this color to show to the user.
Since: 7.0

Rhino.UI.NamedColor.Color
Gets the color for this entry.
Since: 7.0

Rhino.UI.NamedColor.#ctor(System.String,System.Drawing.Color)
Initializes a new instance of the ColorListEntry with the specified name and color.
name: Name of this color
color: Color value
Since: 7.0