Rhino.Geometry.ConicSectionType
Defines enumerated values for types of conic sections.
Since: 6.0

Rhino.Geometry.ConicSectionType.Unknown
The curve shape is unknown.

Rhino.Geometry.ConicSectionType.Circle
The curve has the shape of a circle.

Rhino.Geometry.ConicSectionType.Ellipse
The curve has the shape of an ellipse.

Rhino.Geometry.ConicSectionType.Hyperbola
The curve has the shape of a hyperbola.

Rhino.Geometry.ConicSectionType.Parabola
The curve has the shape of a parabola.