Rhino.FileIO.File3dmNotes
Represents the notes information stored in a 3dm file.

Rhino.FileIO.File3dmNotes.#ctor
Creates empty default notes
Since: 5.0

Rhino.FileIO.File3dmNotes.Notes
Gets or sets the text content of the notes.
Since: 5.0

Rhino.FileIO.File3dmNotes.IsVisible
Gets or sets the notes visibility. If the notes are visible, true; false otherwise.
Since: 5.0

Rhino.FileIO.File3dmNotes.IsHtml
Gets or sets the text format. If the format is HTML, true; false otherwise.
Since: 5.0

Rhino.FileIO.File3dmNotes.WindowRectangle
Gets or sets the position of the Notes when they were saved.
Since: 5.0