Rhino.UI.Controls.ThumbnailUI.IRhRdkContentThumbnailList_Sizes
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.IRhRdkContentThumbnailList_Sizes.Tiny
Tiny thumbnails.

Rhino.UI.Controls.ThumbnailUI.IRhRdkContentThumbnailList_Sizes.Small
Small thumbnails.

Rhino.UI.Controls.ThumbnailUI.IRhRdkContentThumbnailList_Sizes.Medium
Medium thumbnails.

Rhino.UI.Controls.ThumbnailUI.IRhRdkContentThumbnailList_Sizes.Large
Large thumbnails.

Rhino.UI.Controls.ThumbnailUI.IRhRdkContentThumbnailList_Sizes.Custom
Custom-sized thumbnails.