Rhino.Geometry.Squisher
class used to wrap Squish functions

Rhino.Geometry.Squisher.#ctor
constructs a squisher with default parameters
Since: 7.9

Rhino.Geometry.Squisher.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Geometry.Squisher.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 7.9

Rhino.Geometry.Squisher.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.Geometry.Squisher.Is2dPatternSquished(Rhino.Geometry.GeometryBase)
Returns true if the input geometry was the result of a squish operation
geometry:
Returns:
Since: 7.9

Rhino.Geometry.Squisher.SquishMesh(Rhino.Geometry.SquishParameters,Rhino.Geometry.Mesh,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},System.Collections.Generic.List{Rhino.Geometry.GeometryBase})
Squish the given mesh into a flat mesh
sp: The parameters for the squish operation
mesh3d: The mesh to squish
marks: Points, Curves, PoiuntClouds, and TextDots to squish. Can be null.
squished_marks_out: The squished marks. If a mark fails to squish, it will have a
null entry in the list.
Returns: A flattened mesh
Since: 7.9

Rhino.Geometry.Squisher.SquishMesh(Rhino.Geometry.SquishParameters,Rhino.Geometry.Mesh)
Squish the given mesh into a flat mesh
sp: The parameters for the squish operation
mesh3d: The mesh to squish
Returns: A flattened mesh
Since: 7.9

Rhino.Geometry.Squisher.SquishSurface(Rhino.Geometry.SquishParameters,Rhino.Geometry.Surface,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},System.Collections.Generic.List{Rhino.Geometry.GeometryBase})
Squish the surface into a flat brep
sp: The parameters for the squish operation
surface: The surface to be squished
marks: Point, PountCloud, TextDot, and Curve objects to squish. Can be null.
squished_marks_out: A list of the squished marks, with null entries for marks
that fail to squish. Can be null.
Returns: A brep representing the flattened surface
Since: 7.9

Rhino.Geometry.Squisher.SquishSurface(Rhino.Geometry.SquishParameters,Rhino.Geometry.Surface)
Squish the surface into a flat brep
sp: The parameters for the squish operation
surface: The surface to be squished
Returns: A brep representing the flattened surface
Since: 7.9

Rhino.Geometry.Squisher.SquishPoint(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d@)
Maps a point on or near the previously squished 3d surface to the flattened surface
point: The point to squish
squishedPoint: The squished point
Returns: true if successful
Since: 7.9

Rhino.Geometry.Squisher.SquishCurve(Rhino.Geometry.Curve)
Maps a curve on or near a previously squished 3d surface to the resulting 2d surface
curve: The curve to squish
Returns: The squished curve
Since: 7.9

Rhino.Geometry.Squisher.SquishTextDot(Rhino.Geometry.TextDot)
Maps a TextDot on or near a previously squished 3d surface to the resulting 2d surface
textDot: The text dot to squish
Returns: The resulting textDot
Since: 7.9

Rhino.Geometry.Squisher.SquishPointCloud(Rhino.Geometry.PointCloud)
Maps a PointCloud on or near a previously squished 3d surface to the resulting 2d surface
pointCloud: The text dot to squish
Returns: The resulting PointCloud

Rhino.Geometry.Squisher.Get2dMesh
Get the 2d mesh that results from the squish operation
Returns: Returns the squished 2d mesh
Since: 7.9

Rhino.Geometry.Squisher.Get3dMesh
Get the 3d mesh that was used for squish operation
Returns: Returns the squished 2d mesh
Since: 7.9

Rhino.Geometry.Squisher.GetLengthConstrained2dLines
Gets lines at the position of the mesh edges and diagonals that were constrained during the squish, in the 2d mesh.
The line at any index here corresponds to the same line in GetLengthConstrained3dLines.
Returns: An array of lines representing the length constraints
Since: 8.0

Rhino.Geometry.Squisher.GetMesh2dEdges
Gets lines at the position of the mesh edges and diagonals that were constrained during the squish, in the 2d mesh.
The line at any index here corresponds to the same line in GetLengthConstrained3dLines.
Returns: An array of lines representing the length constraints
Since: 7.9
8.0
Remarks: Renamed to GetLengthConstrained2dLines.

Rhino.Geometry.Squisher.GetLengthConstrained3dLines
Gets lines at the position of the mesh edges and diagonals that were constrained during the squish, in the 3d mesh.
The line at any index here corresponds to the same line in GetLengthConstrained2dLines.
Returns: An array of lines representing the length constraints
Since: 8.0

Rhino.Geometry.Squisher.GetMesh3dEdges
Gets lines at the position of the mesh edges and diagonals that were constrained during the squish, in the 3d mesh.
The line at any index here corresponds to the same line in GetLengthConstrained2dLines.
Returns: An array of lines representing the length constraints
Since: 7.9
8.0
Remarks: Renamed to GetLengthConstrained3dLines.

Rhino.Geometry.Squisher.GetAreaConstrainedTrianglesIndices
Gets mesh vertex indices for the triangular faces that were constrained during the squish.
Indices can be used in both the 2d and 3d mesh vertices arrays.
Returns: An array of mesh faces
Since: 8.0

Rhino.Geometry.Squisher.SquishBack2dMarks(Rhino.Geometry.GeometryBase,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})
Maps 2D geometry from the squished surface or mesh back to the original 3D surface or mesh
squishedGeometry: The squished surface or mesh
marks: The input 2D geometry
Returns: An enumeratd list of squished marks. Individual marks that fail to squish
are null in this list. Returns null on complete failure.
Since: 7.9