Rhino.DocObjects.Tables.NamedViewTable
All named views in a rhino document.

Rhino.DocObjects.Tables.NamedViewTable.Document
Document that owns this table.
Since: 5.0

Rhino.DocObjects.Tables.NamedViewTable.Count
Number of named views in the table.
Since: 5.0

Rhino.DocObjects.Tables.NamedViewTable.Item(System.Int32)
Conceptually, the named view table is an array of ViewInfo and their associated names.
The indexing operator ([] in C#) can be used to get individual ViewInfo items.
index: Zero based array index.
Returns: The view that was found.

Rhino.DocObjects.Tables.NamedViewTable.FindByName(System.String)
Finds a named view.
name: name to search for.
Returns:
>=0 index of the found named view
-1 no named view found.
Since: 5.0

Rhino.DocObjects.Tables.NamedViewTable.Add(System.String,System.Guid)
Adds named view to document which is based on an existing viewport.
name:
If name is empty, a unique name is automatically created.
If there is already a named view with the same name, that view is replaced.
viewportId:
Id of an existing viewport in the document. View information is copied from this viewport.
Returns:
0 based index of named view.
-1 on failure.
Since: 5.0

Rhino.DocObjects.Tables.NamedViewTable.Add(Rhino.DocObjects.ViewInfo)
Since: 5.0

Rhino.DocObjects.Tables.NamedViewTable.Delete(System.Int32)
Remove named view from the document.
index: index of the named view in the named view table.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.NamedViewTable.Delete(System.String)
Remove named view from the document.
name: name of the view.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.NamedViewTable.Rename(System.Int32,System.String)
Renames a named view.
index: Index of the named view in the named view table.
newName: The new name.
Returns: true if successful, false otherwise.
Since: 7.0

Rhino.DocObjects.Tables.NamedViewTable.Rename(System.String,System.String)
Renames a named view.
oldName: The name of a named view in the named view table.
newName: The new name.
Returns: true if successful, false otherwise.
Since: 7.0

Rhino.DocObjects.Tables.NamedViewTable.Restore(System.Int32,Rhino.Display.RhinoViewport)
Sets the MainViewport of a standard RhinoView to a named views settings
index:
viewport:
Returns:
Since: 6.0

Rhino.DocObjects.Tables.NamedViewTable.RestoreWithAspectRatio(System.Int32,Rhino.Display.RhinoViewport)
Since: 6.0

Rhino.DocObjects.Tables.NamedViewTable.RestoreAnimatedConstantSpeed(System.Int32,Rhino.Display.RhinoViewport,System.Double,System.Int32)
Since: 6.0

Rhino.DocObjects.Tables.NamedViewTable.RestoreAnimatedConstantTime(System.Int32,Rhino.Display.RhinoViewport,System.Int32,System.Int32)
Since: 6.0

Rhino.DocObjects.Tables.NamedViewTable.Restore(System.Int32,Rhino.Display.RhinoView,System.Boolean)
Since: 5.0
6.0

Rhino.DocObjects.Tables.NamedViewTable.Restore(System.Int32,Rhino.Display.RhinoViewport,System.Boolean)
Since: 5.9
6.0

Rhino.DocObjects.Tables.NamedViewTable.RestoreAnimated(System.Int32,Rhino.Display.RhinoView,System.Boolean)
Since: 5.0
6.0

Rhino.DocObjects.Tables.NamedViewTable.RestoreAnimated(System.Int32,Rhino.Display.RhinoView,System.Boolean,System.Int32,System.Int32)
Since: 5.0
6.0

Rhino.DocObjects.Tables.NamedViewTable.RestoreAnimated(System.Int32,Rhino.Display.RhinoViewport,System.Boolean)
Since: 5.9
6.0

Rhino.DocObjects.Tables.NamedViewTable.RestoreAnimated(System.Int32,Rhino.Display.RhinoViewport,System.Boolean,System.Int32,System.Int32)
Since: 5.9
6.0

Rhino.DocObjects.Tables.NamedViewTable.Selection
Returns the current selection in the Named Views panel. If more than one such panel is open,
it will return the selection in the most recently opened panel.
Since: 8.5

Rhino.DocObjects.Tables.NamedViewTable.GetEnumerator
Since: 5.0

Rhino.DocObjects.Tables.NamedViewTable.System#Collections#IEnumerable#GetEnumerator
Since: 5.0