Rhino.FileIO.FileGHS
Support for reading eps file format

Rhino.FileIO.FileGHS.Read(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileGHSReadOptions)
Read a Ghs file into a RhinoDoc
path: path to read a file from
doc: document to import geometry into
options: options used for importing the Ai file
Returns: true on success
Since: 8.0