Rhino.Display.VisualAnalysisMode.EdgeContinuityMode
Continuity mode to report

Rhino.Display.VisualAnalysisMode.EdgeContinuityMode.Distance
G0 Continuity

Rhino.Display.VisualAnalysisMode.EdgeContinuityMode.Tangency
G1 Continuity

Rhino.Display.VisualAnalysisMode.EdgeContinuityMode.Curvature
G2 Continuity