Rhino.UI.IDialogService.ShowMultiListBox(System.String,System.String,System.Collections.Generic.IList{System.String},System.Collections.Generic.IList{System.String})
Since: 6.0

Rhino.UI.IDialogService.WrapAsIWin32Window(System.IntPtr)
Since: 6.0

Rhino.UI.IDialogService.ObjectToWindowHandle(System.Object,System.Boolean)
Since: 6.0

Rhino.UI.IDialogService.ShowColorDialog(System.Object,Rhino.Display.Color4f@,System.Boolean,Rhino.UI.Dialogs.OnColorChangedEvent)
Since: 7.0