Rhino.UI.Gumball.GumballAppearanceSettings.#ctor
Since: 5.0

Rhino.UI.Gumball.GumballAppearanceSettings.RelocateEnabled
When RelocateEnabled is true, the user can reposition the gumball by
tapping the control key while dragging.  Once the repostion drag is
terminated by releasing the/ mouse button, ordinary editing resumes.
The default setting is true.
Since: 5.0

Rhino.UI.Gumball.GumballAppearanceSettings.MenuEnabled
When MenuEnabled is true, the menu "button" is drawn on the gumball.
The default setting is true.
Since: 5.0

Rhino.UI.Gumball.GumballAppearanceSettings.TranslateXEnabled
TranslateXEnabled is true, the X axis translation control is available.
The default setting is true.
Since: 5.0

Rhino.UI.Gumball.GumballAppearanceSettings.TranslateYEnabled
TranslateYEnabled is true, the Y axis translation control is available.
The default setting is true.
Since: 5.0

Rhino.UI.Gumball.GumballAppearanceSettings.TranslateZEnabled
TranslateZEnabled is true, the Z axis translation control is available.
The default setting is true.
Since: 5.0

Rhino.UI.Gumball.GumballAppearanceSettings.TranslateXYEnabled
When TranslateXY is true, the XY plane translation control is available
in appropriate views. The default setting is true.
Since: 5.0

Rhino.UI.Gumball.GumballAppearanceSettings.TranslateYZEnabled
When TranslateYZ is true, the YZ plane translation control is available
in appropriate views. The default setting is true.
Since: 5.0

Rhino.UI.Gumball.GumballAppearanceSettings.TranslateZXEnabled
When TranslateZX is true, the ZX plane translation control is available
in appropriate views. The default setting is true.
Since: 5.0

Rhino.UI.Gumball.GumballAppearanceSettings.RotateXEnabled
When RotateX is true, the X rotation control is available. The default
setting is true.
Since: 5.0

Rhino.UI.Gumball.GumballAppearanceSettings.RotateYEnabled
When RotateY is true, the Y rotation control is available. The default
setting is true.
Since: 5.0

Rhino.UI.Gumball.GumballAppearanceSettings.RotateZEnabled
When RotateZ is true, the Z rotation control is available. The default
setting is true.
Since: 5.0

Rhino.UI.Gumball.GumballAppearanceSettings.ScaleXEnabled
When ScaleXEnabled is true, the X scale control is available. The
default setting is true.
Since: 5.0

Rhino.UI.Gumball.GumballAppearanceSettings.ScaleYEnabled
When ScaleYEnabled is true, the Y scale control is available. The
default setting is true.
Since: 5.0

Rhino.UI.Gumball.GumballAppearanceSettings.ScaleZEnabled
When ScaleZEnabled is true, the Z scale control is available. The
default setting is true.
Since: 5.0

Rhino.UI.Gumball.GumballAppearanceSettings.FreeTranslate
When FreeTranslate is 1, the center translation control can be dragged
in any direction and moves the object the gumball controls. When
FreeTranslate is 2, the center translation control can be dragged in any
direction and moves the object the gumball itself. The default value is 2.
Since: 5.0

Rhino.UI.Gumball.GumballAppearanceSettings.ColorX
Default is Red.
Since: 5.0

Rhino.UI.Gumball.GumballAppearanceSettings.ColorY
Default is Green.
Since: 5.0

Rhino.UI.Gumball.GumballAppearanceSettings.ColorZ
Default is Blue.
Since: 5.0

Rhino.UI.Gumball.GumballAppearanceSettings.ColorMenuButton
Since: 5.0

Rhino.UI.Gumball.GumballAppearanceSettings.Radius
in pixels.
Since: 5.0

Rhino.UI.Gumball.GumballAppearanceSettings.ArrowHeadLength
in pixels.
Since: 5.0

Rhino.UI.Gumball.GumballAppearanceSettings.ArrowHeadWidth
in pixels.
Since: 5.0

Rhino.UI.Gumball.GumballAppearanceSettings.ScaleGripSize
in pixels.
Since: 5.0

Rhino.UI.Gumball.GumballAppearanceSettings.PlanarTranslationGripCorner
in pixels.
Since: 5.0

Rhino.UI.Gumball.GumballAppearanceSettings.PlanarTranslationGripSize
in pixels.
Since: 5.0

Rhino.UI.Gumball.GumballAppearanceSettings.AxisThickness
in pixels.
Since: 5.0

Rhino.UI.Gumball.GumballAppearanceSettings.ArcThickness
in pixels.
Since: 5.0

Rhino.UI.Gumball.GumballAppearanceSettings.MenuDistance
Distance of menu ball from center.
Since: 5.0

Rhino.UI.Gumball.GumballAppearanceSettings.MenuSize
Radius of menu circle.
Since: 5.0