Rhino.Runtime.InteropWrappers.StringHolder
This class is used to pass strings back and forth between managed
and unmanaged code.  This should not be needed by plug-ins.
If you are just dealing with an ON_wString*,
use Rhino.Runtime.InteropWrappers.StringWrapper

Rhino.Runtime.InteropWrappers.StringHolder.ConstPointer
C++ pointer used to access the ON_wString, managed plug-ins should
never need this.
Returns:
Since: 5.8

Rhino.Runtime.InteropWrappers.StringHolder.NonConstPointer
C++ pointer used to access the ON_wString, managed plug-ins should
never need this.
Returns:
Since: 5.8

Rhino.Runtime.InteropWrappers.StringHolder.#ctor
Constructor
Since: 5.8

Rhino.Runtime.InteropWrappers.StringHolder.Finalize
Destructor

Rhino.Runtime.InteropWrappers.StringHolder.Dispose
IDispose implementation
Since: 5.8

Rhino.Runtime.InteropWrappers.StringHolder.Dispose(System.Boolean)
Called by Dispose and finalizer
disposing:

Rhino.Runtime.InteropWrappers.StringHolder.ToString
Marshals unmanaged ON_wString to a managed .NET string
Returns:

Rhino.Runtime.InteropWrappers.StringHolder.ToStringSafe
Marshals unmanaged ON_wString to a managed .NET string and never returns null.
Returns:
Since: 8.0

Rhino.Runtime.InteropWrappers.StringHolder.GetString(System.IntPtr)
Gets managed string from unmanaged ON_wString pointer.
pStringHolder:
Returns: Null if pStringHolder has no reference, otherwise, the string. This may be an empty string, if setting an empty string is possible.
Since: 5.8