Rhino.Runtime.ISettingsWriteErrorService.LogSuccess(System.String)
If there is a entry for this settings file then increment the settings
file successfully saved counter otherwise; do nothing.
fileName:
Used to generate registry key unique to this file name
Since: 6.3

Rhino.Runtime.ISettingsWriteErrorService.LogFailure(System.String,System.Exception)
If there is a entry for this settings file increment the failure counter
otherwise create a new entry and set the failure count to one.
fileName:
Used to generate registry key unique to this file name
exception:
The exception causing this event
Since: 6.3

Rhino.Runtime.ISettingsWriteErrorService.GeErrorInfo(System.String,System.Int32@,System.Int32@)
Gets the number of failed write attempts as well as successful writes
since the first reported failure.
fileName:
Used to generate registry key unique to this file name
successCount:
Successful write events since first failure
failureCount:
Number
Returns:
Since: 6.3