Rhino.FileIO.FileEpsReadOptions
Options for reading a AI file (old ai files, ps not pdf)

Rhino.FileIO.FileEpsReadOptions.PreserveModelScale
Since: 8.0

Rhino.FileIO.FileEpsReadOptions.RhinoScale
Since: 8.0

Rhino.FileIO.FileEpsReadOptions.EpsUnits
Since: 8.0

Rhino.FileIO.FileEpsReadOptions.EpsScale
Since: 8.0

Rhino.FileIO.FileEpsReadOptions.ToDictionary
Since: 8.0