Rhino.Render.ImageFileEventArgs.Event
Since: 5.11

Rhino.Render.ImageFileEventArgs.FileName
Since: 5.11

Rhino.Render.ImageFileEventArgs.RenderEngine
Since: 5.11

Rhino.Render.ImageFileEventArgs.RenderEngineId
Since: 5.11

Rhino.Render.ImageFileEventArgs.SessionId
Since: 5.11

Rhino.Render.ImageFileEventArgs.EllapsedTime
Since: 5.11