Rhino.Render.RenderContent.ParameterTypes
Change a content's child by allowing the user to choose the new content type from a
content browser dialog. The child is created if it does not exist, otherwise the old
child is deleted and replaced by the new child.
\param parentContent is the content whose child is to be manipulated. This must be an
RDK-owned content that is in the persistent content list (either top-level or child).
\param wszChildSlotName is the child-slot name of the child to be manipulated.
\param allowedKinds determines which content kinds are allowed to be chosen from the content browser dialog.
\param uFlags is a set of flags for controlling the content browser dialog.
\return \e true if successful, \e false if it fails or if the user cancels.