Rhino.DocObjects.ObjectSectionFillRule
For sectioning an object; the decision of when to generate hatches and fills.
Since: 8.0

Rhino.DocObjects.ObjectSectionFillRule.ClosedCurves
If a the section results in a closed curve, then generate a fill

Rhino.DocObjects.ObjectSectionFillRule.SolidObjects
Only generate a fill for objects that are considered Solid