Rhino.Render.SimulatedEnvironment.#ctor
Since: 5.1

Rhino.Render.SimulatedEnvironment.BackgroundColor
Since: 5.1

Rhino.Render.SimulatedEnvironment.BackgroundImage
Since: 5.1

Rhino.Render.SimulatedEnvironment.BackgroundProjection
Since: 5.1

Rhino.Render.SimulatedEnvironment.ProjectionFromString(System.String)
Since: 5.1

Rhino.Render.SimulatedEnvironment.StringFromProjection(Rhino.Render.SimulatedEnvironment.BackgroundProjections)
Since: 5.1

Rhino.Render.SimulatedEnvironment.Dispose
Since: 5.1

Rhino.Render.SimulatedEnvironment.ConstPointer
Since: 5.1