Rhino.DocObjects.ObjectSectionAttributesSource
The source of sectioning attributes on an object.
Since: 8.0

Rhino.DocObjects.ObjectSectionAttributesSource.FromLayer
Section attributes defined by object's layer

Rhino.DocObjects.ObjectSectionAttributesSource.FromObject
Section attributes are specific to the object

Rhino.DocObjects.ObjectSectionAttributesSource.FromParent
Section attributes defined by object's parent

Rhino.DocObjects.ObjectSectionAttributesSource.FromSectioner
Section attributes defined by the cutting object