Rhino.Runtime.ZooClientParameters
ZooClientParameters is a read-only set of parameters that control
the flow of licensing inside ZooClient. Because this class flows through a number of
other classes, functions, and UI, it is read-only so that inadvertent changes are not
made to the data as it propagates from the caller.

Rhino.Runtime.ZooClientParameters.#ctor(System.Guid,System.Guid,System.String,System.Int32,Rhino.PlugIns.LicenseCapabilities,System.String,System.String,System.Object,Rhino.Runtime.LicenseTypes,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate,Rhino.PlugIns.VerifyLicenseKeyDelegate,Rhino.PlugIns.VerifyPreviousVersionLicenseDelegate)
ZooClientParameters Constructor
productGuid: Guid used by ZooClient to identify the plug-in requesting a license from ZooClient. This Guid may be used by different versions of the
plug-in. If different licenses are used by different versions of the plug-in, the plug-in must also specify a LicenseGuid.
licenseGuid: Guid used by ZooClient to identify the license saved by ZooClient. This differs from ProductGuid because different versions of a plug-in
with the same Plug-in ID may need different licenses.
productTitle: Title of product displayed in user interface
productBuildType:
capabilities: Enum that declares whether this product supports evalation, licensing, purchasing, and cloud zoo
licenseEntryTextMask: Text mask used to limit input. EG: RH50-AAAA-AAAA-AAAA-AAAA-AAAA
productPath: Full path to DLL implementing product
parentWindow: Object used to parent UI DLLs
selectedLicenseType: Type of license currently used by this product
validateProductKey: Delegate called to validate the structure of a license key
onLeaseChangedDelegate: Delegate called when a cloud zoo lease changes
verifyLicenseKeyDelegate: Delegate called to verify the structure of a license key
verifyPreviousVersionLicenseKeyDelegate: Delegate called to verify the structure of an upgrade license key
Since: 6.0

Rhino.Runtime.ZooClientParameters.ProductGuid
Guid used by ZooClient to identify the plug-in requesting a license from ZooClient. This Guid may be used by different versions of the
plug-in. If different licenses are used by different versions of the plug-in, the plug-in must also specify a LicenseGuid.
Since: 6.0

Rhino.Runtime.ZooClientParameters.LicenseGuid
Guid used by ZooClient to identify the license saved by ZooClient. This differs from ProductGuid because different versions of a plug-in
with the same Plug-in ID may need different licenses.
Since: 6.0

Rhino.Runtime.ZooClientParameters.ProductTitle
Title of the product, "Rhinoceros 6" for example.
Since: 6.0

Rhino.Runtime.ZooClientParameters.ProductBuildType
Product build type. Must be one of LicenseBuildType values.
Since: 6.0

Rhino.Runtime.ZooClientParameters.Capabilities
LicenseCapabilities flags that set options for how licenses can be obtained for this product
Since: 6.0

Rhino.Runtime.ZooClientParameters.LicenseEntryTextMask
Text mask in the form @"RH4A-AAAA-AAAA-AAAA-AAAA-AAAA" that informs the user what numbers they are looking for
Since: 6.0

Rhino.Runtime.ZooClientParameters.ProductPath
Path to the application calling ZooClient
Since: 6.0

Rhino.Runtime.ZooClientParameters.ParentWindow
Parent window assigned to any licensing dialogs that appear. If null, the Rhino main window is used.
Since: 6.0

Rhino.Runtime.ZooClientParameters.SelectedLicenseType
License type selected by default when user is prompted to enter a license key
Since: 6.0

Rhino.Runtime.ZooClientParameters.ValidateProductKeyDelegate
Delegate called by ZooClient to validate a product key string

Rhino.Runtime.ZooClientParameters.VerifyLicenseKeyDelegate
Called during GetLicense to verify that the license key is legitimate and can be used by this user.

Rhino.Runtime.ZooClientParameters.OnLeaseChanged
Delegate called by ZooClient when a cloud zoo lease is changed
Since: 6.0

Rhino.Runtime.ZooClientParameters.m_verifyPreviousVersionLicenseDelegate
Callback function called during GetLicense when a user enters a license key that requires a previous version license.
A previous call to VerifyLicenseKey resulted in LicenseData.IsUpgradeFromPreviousVersion being set to true.

Rhino.Runtime.ZooClientParameters.VerifyPreviousVersionLicense(System.String,System.String,System.String@)
When a caller calls GetLicense, ZooClient may call VerifyPreviousVersionLicense to ensure
previousVersionLicense is legitimate and can be used to upgrade license.
license: License key for current product. This was returned by a previous call to VerifyLicenseKey or ValidateProductKey.
previousVersionLicense: License key entered by user to show upgrade eligibility for license.
errorMessage: Error message to be displayed to user if something isn't correct.
Returns:
Since: 6.0

Rhino.Runtime.ZooClientParameters.VerifyLicenseKey(System.String,System.String,System.DateTime,System.Boolean,Rhino.PlugIns.LicenseData@)
Called by GetLicense to ensure that the license key entered by the user is legitimate and can be used.
licenseKey: License key string entered by user
validationCode: Validation code entered by user (only if a previous call to VerifyLicenseKey set LicenseData.RequiresOnlineValidation to true).
validationCodeInstallDate: Date that validation code was entered by user (only if a previous call to VerifyLicenseKey set LicenseData.RequiresOnlineValidation to true).
gracePeriodExpired: Date by which license validation must complete successfully.
licenseData: Output parameter where return data about the license is set.
Returns:
Since: 6.0