Rhino.Geometry.PolyCurve
Represents a curve that is the result of joining several (possibly different)
types of curves.

Rhino.Geometry.PolyCurve.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor for internal use.
info: Serialization data.
context: Serialization stream.

Rhino.Geometry.PolyCurve.#ctor
Initializes a new, empty polycurve.
Since: 5.0

Rhino.Geometry.PolyCurve.Duplicate
Duplicates this polycurve.
When not overridden in a derived class, this calls Rhino.Geometry.PolyCurve.DuplicatePolyCurve.
Returns: An exact duplicate of this curve.
Since: 5.0

Rhino.Geometry.PolyCurve.DuplicatePolyCurve
Duplicates this polycurve.
This is the same as Rhino.Geometry.PolyCurve.Duplicate.
Returns: An exact duplicate of this curve.
Since: 5.0

Rhino.Geometry.PolyCurve.SegmentCount
Gets the number of segments that make up this Polycurve.
Since: 5.0

Rhino.Geometry.PolyCurve.SegmentCurve(System.Int32)
Gets the segment curve at the given index.
index: Index of segment to retrieve.
Returns: The segment at the given index or null on failure.
Since: 5.0

Rhino.Geometry.PolyCurve.IsNested
Gets a value indicating whether or not a PolyCurve contains nested PolyCurves.
Rhino.Geometry.PolyCurve.RemoveNesting
Since: 5.0

Rhino.Geometry.PolyCurve.HasGap
This is a quick way to see if the curve has gaps between the sub curve segments.
Since: 5.0

Rhino.Geometry.PolyCurve.RemoveNesting
Explodes nested polycurve segments and reconstructs this curve from the shattered remains.
The result will have not have any PolyCurves as segments but it will have identical
locus and parameterization.
Returns:
true if any nested PolyCurve was found and absorbed, false if no PolyCurve segments could be found.
Rhino.Geometry.PolyCurve.IsNested
Since: 5.0

Rhino.Geometry.PolyCurve.Explode
Explodes this PolyCurve into a list of Curve segments. This will not explode nested polycurves.
Call Rhino.Geometry.PolyCurve.RemoveNesting first if you need all individual segments.
Returns: An array of polycurve segments.
Since: 5.0

Rhino.Geometry.PolyCurve.Append(Rhino.Geometry.Line)
Appends and matches the start of the line to the end of polycurve.
This function will fail if the polycurve is closed.
line: Line segment to append.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.PolyCurve.Append(Rhino.Geometry.Arc)
Appends and matches the start of the arc to the end of polycurve.
This function will fail if the polycurve is closed or if SegmentCount > 0 and the arc is closed.
arc: Arc segment to append.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.PolyCurve.Append(Rhino.Geometry.Curve)
Appends and matches the start of the curve to the end of polycurve.
This function will fail if the PolyCurve is closed or if SegmentCount > 0 and the new segment is closed.
curve: Segment to append.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.PolyCurve.AppendSegment(Rhino.Geometry.Curve)
Appends the curve to the polycurve without changing the new segment's geometry.
This function will fail if the PolyCurve is closed or if SegmentCount > 0 and the new segment is closed.
curve: Segment to append.
Returns: true on success, false on failure.
Since: 6.0

Rhino.Geometry.PolyCurve.SegmentCurveParameter(System.Double)
Converts a polycurve parameter to a segment curve parameter.
polycurveParameter: Parameter on PolyCurve to convert.
Returns:
Segment curve evaluation parameter or UnsetValue if the
segment curve parameter could not be computed.
Since: 5.0

Rhino.Geometry.PolyCurve.PolyCurveParameter(System.Int32,System.Double)
Converts a segment curve parameter to a polycurve parameter.
segmentIndex: Index of segment.
segmentCurveParameter: Parameter on segment.
Returns:
Polycurve evaluation parameter or UnsetValue if the polycurve curve parameter could not be computed.
Since: 5.0

Rhino.Geometry.PolyCurve.SegmentDomain(System.Int32)
Returns the polycurve sub-domain assigned to a segment curve.
segmentIndex: Index of segment.
Returns:
The polycurve sub-domain assigned to a segment curve.
Returns Interval.Unset if segment_index < 0 or segment_index >= Count().
Since: 5.0

Rhino.Geometry.PolyCurve.SegmentIndex(System.Double)
Finds the segment used for evaluation at polycurve_parameter.
polycurveParameter: Parameter on polycurve for segment lookup.
Returns:
Index of the segment used for evaluation at polycurve_parameter.
If polycurve_parameter < Domain.Min(), then 0 is returned.
If polycurve_parameter > Domain.Max(), then Count()-1 is returned.
Since: 5.0

Rhino.Geometry.PolyCurve.SegmentIndexes(Rhino.Geometry.Interval,System.Int32@,System.Int32@)
Finds the segments that overlap the Polycurve sub domain.
subdomain: Domain on this PolyCurve.
segmentIndex0:
Index of first segment that overlaps the sub-domain.
segmentIndex1:
Index of last segment that overlaps the sub-domain. Note that segmentIndex0 <= i < segmentIndex1.
Returns: Number of segments that overlap the sub-domain.
Since: 5.0

Rhino.Geometry.PolyCurve.CleanUp
Removes any nesting of polycurves. If this polycurve has just a single segment, the segment is returned.
If, after nest removal, there are adjacent segments which are polylines, they are combined into a single polyline.
The new curve may have a different domain from this polycurve. If the start and end segments of a closed input are polylines,
the result may have a different seam location since the start and end segments will be combined.
Returns: A new curve that is not necessarily a polycurve if successful, null otherwise.
Rhino.Geometry.PolyCurve.RemoveNesting
Since: 7.0