Rhino.Collections.Point3dList.ZAccess
Utility class for easy-access of z-components of points inside an ON_3dPointList.

Rhino.Collections.Point3dList.ZAccess.#ctor(Rhino.Collections.Point3dList)
XAccess constructor.

Rhino.Collections.Point3dList.ZAccess.Item(System.Int32)
Gets or sets the z-coordinate of the specified point.
index: Index of point.