Rhino.Display.RhinoViewport
Displays geometry with a given projection. In standard modeling views there
is a one to one relationship between RhinoView and RhinoViewports. In a page
layout, there may be multiple RhinoViewports for a single layout.

Rhino.Display.RhinoViewport.#ctor
Since: 5.0

Rhino.Display.RhinoViewport.#ctor(Rhino.Display.RhinoViewport)
Since: 5.0

Rhino.Display.RhinoViewport.Dispose
Since: 5.0

Rhino.Display.RhinoViewport.FromId(System.Guid)
Call this method to get the viewport with the specified Id.
id:
Id to search for.
Returns:
Returns a RhinoViewport if the Id is found otherwise null.
Since: 6.0

Rhino.Display.RhinoViewport.ParentView
Gets the parent view, if there is one
Every RhinoView has an associated RhinoViewport that does all the 3d display work.
Those associated viewports return the RhinoView as their parent view. However,
RhinoViewports are used in other image creating contexts that do not have a parent
RhinoView.  If you call ParentView, you MUST check for NULL return values.
Since: 5.0

Rhino.Display.RhinoViewport.Id
Unique id for this viewport.
Since: 5.0

Rhino.Display.RhinoViewport.ChangeCounter
The value of change counter is incremented every time the view projection
or construction plane changes. The user can the mouse and nestable view
manipulation commands to change a view at any time. The value of change
counter can be used to detect these changes in code that is sensitive to
the view projection.
Since: 5.0

Rhino.Display.RhinoViewport.IsVisible(Rhino.Geometry.BoundingBox)
Returns true if some portion of a world coordinate bounding box is
potentially visible in the viewing frustum.
bbox: A bounding box that is tested for visibility.
Returns: true if the box is potentially visible; otherwise false.
Since: 5.0

Rhino.Display.RhinoViewport.IsVisible(Rhino.Geometry.Point3d)
Determines if a world coordinate point is visible in the viewing frustum.
point: A point that is tested for visibility.
Returns: true if the point is visible; otherwise false.
Since: 5.0

Rhino.Display.RhinoViewport.Size
Get or set the height and width of the viewport (in pixels)
Since: 5.0

Rhino.Display.RhinoViewport.LockedProjection
If true, the camera location, camera direction, and lens angle should not be changed.
Since: 8.0

Rhino.Display.RhinoViewport.SetClippingPlanes(Rhino.Geometry.BoundingBox)
Sets optimal clipping planes to view objects in a world coordinate 3d bounding box.
box: The bounding box
Since: 5.0

Rhino.Display.RhinoViewport.Name
Name associated with this viewport.
Since: 5.0

Rhino.Display.RhinoViewport.CameraTarget
Viewport target point.
Since: 5.0

Rhino.Display.RhinoViewport.SetCameraTarget(Rhino.Geometry.Point3d,System.Boolean)
Set viewport target point. By default the camera location
is translated so that the camera direction vector is parallel
to the vector from the camera location to the target location.
targetLocation: new target location.
updateCameraLocation:
if true, the camera location is translated so that the camera direction
vector is parallel to the vector from the camera location to the target
location.
If false, the camera location is not changed.
Remarks:
In general, Rhino users expect to have the camera direction vector and
the vector from the camera location to the target location to be parallel.
If you use the RhinoViewport functions to set the camera location, camera
direction, and target point, then the relationship between these three
points and vectors is automatically maintained.  If you directly manipulate
the camera properties, then you should carefully set the target by calling
SetTarget() with updateCameraLocation=false.
Since: 5.0

Rhino.Display.RhinoViewport.SetCameraLocations(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Set viewport camera location and target location. The camera direction vector is
changed so that it is parallel to the vector from the camera location to
the target location.
targetLocation: new target location.
cameraLocation: new camera location.
Since: 5.0

Rhino.Display.RhinoViewport.SetCameraLocation(Rhino.Geometry.Point3d,System.Boolean)
Set viewport camera location. By default the target location is changed so that
the vector from the camera location to the target is parallel to the camera direction
vector.
cameraLocation: new camera location.
updateTargetLocation:
if true, the target location is changed so that the vector from the camera
location to the target is parallel to the camera direction vector.
If false, the target location is not changed. See the remarks section of
RhinoViewport.SetTarget for important details.
Since: 5.0

Rhino.Display.RhinoViewport.SetCameraDirection(Rhino.Geometry.Vector3d,System.Boolean)
Set viewport camera direction. By default the target location is changed so that
the vector from the camera location to the target is parallel to the camera direction.
cameraDirection: new camera direction.
updateTargetLocation:
if true, the target location is changed so that the vector from the camera
location to the target is parallel to the camera direction.
If false, the target location is not changed.
See the remarks section of RhinoViewport.SetTarget for important details.
Since: 5.0

Rhino.Display.RhinoViewport.GetCameraExtents(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Since: 5.0

Rhino.Display.RhinoViewport.ConstructionPlane
Simple plane information for this viewport's construction plane. If you want
detailed construction plane information, use GetConstructionPlane.
Since: 5.0

Rhino.Display.RhinoViewport.GetConstructionPlane
Since: 5.0

Rhino.Display.RhinoViewport.SetConstructionPlane(Rhino.Geometry.Plane)
Since: 5.0

Rhino.Display.RhinoViewport.SetConstructionPlane(Rhino.DocObjects.ConstructionPlane)
Sets the construction plane to cplane.
cplane: The construction plane to set.
Since: 5.0

Rhino.Display.RhinoViewport.PushConstructionPlane(Rhino.DocObjects.ConstructionPlane)
Pushes the current construction plane on the viewport's
construction plane stack and sets the construction plane
to cplane.
cplane: The construction plane to push.
Since: 5.0

Rhino.Display.RhinoViewport.PopConstructionPlane
Sets the construction plane to the plane that was
active before the last call to PushConstructionPlane.
Returns: true if a construction plane was popped.
Since: 5.0

Rhino.Display.RhinoViewport.NextConstructionPlane
Sets the construction plane to the plane that was
active before the last call to PreviousConstructionPlane.
Returns: true if successful.
Since: 5.0

Rhino.Display.RhinoViewport.PreviousConstructionPlane
Sets the construction plane to the plane that was
active before the last call to NextConstructionPlane
or SetConstructionPlane.
Returns: true if successful.
Since: 5.0

Rhino.Display.RhinoViewport.ConstructionGridVisible
Since: 5.0

Rhino.Display.RhinoViewport.ConstructionAxesVisible
Since: 5.0

Rhino.Display.RhinoViewport.WorldAxesVisible
Since: 5.0

Rhino.Display.RhinoViewport.SetToPlanView(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,System.Boolean)
Since: 5.0

Rhino.Display.RhinoViewport.SetProjection(Rhino.Display.DefinedViewportProjection,System.String,System.Boolean)
Set viewport to a defined projection.
projection: The "standard" projection type.
viewName: If not null or empty, the name is set.
updateConstructionPlane: If true, the construction plane is set to the viewport plane.
Returns: true if successful.
Since: 5.0

Rhino.Display.RhinoViewport.PushViewProjection
Appends the current view projection and target to the viewport's view stack.
Since: 5.0

Rhino.Display.RhinoViewport.SetViewProjection(Rhino.DocObjects.ViewportInfo,System.Boolean)
Sets the viewport camera projection.
projection: The "standard" projection type.
updateTargetLocation:
if true, the target location is changed so that the vector from the camera location to the target
is parallel to the camera direction vector.  If false, the target location is not changed.
Returns: true on success.
Since: 5.0

Rhino.Display.RhinoViewport.PopViewProjection
Sets the view projection and target to the settings at the top of
the view stack and removes those settings from the view stack.
Returns: true if there were settings that could be popped from the stack.
Since: 5.0

Rhino.Display.RhinoViewport.PushViewInfo(Rhino.DocObjects.ViewInfo,System.Boolean)
Since: 5.0

Rhino.Display.RhinoViewport.NextViewProjection
Sets the view projection and target to the settings that
were active before the last call to PrevView.
Returns: true if the view stack was popped.
Since: 5.0

Rhino.Display.RhinoViewport.PreviousViewProjection
Sets the view projection and target to the settings that
were active before the last call to NextViewProjection.
Returns: true if the view stack was popped.
Since: 5.0

Rhino.Display.RhinoViewport.IsPlanView
true if construction plane z axis is parallel to camera direction.
Since: 5.0

Rhino.Display.RhinoViewport.ZoomExtents
Dollies the camera location and so that the view frustum contains all of the
selected document objects that can be seen in view. If the projection is
perspective, the camera angle is not changed.
Returns: true if successful.
Since: 5.0

Rhino.Display.RhinoViewport.ZoomExtentsSelected
Dollies the camera location and so that the view frustum contains all of the
selected document objects that can be seen in view. If the projection is
perspective, the camera angle is not changed.
Returns: true if successful.
Since: 5.0

Rhino.Display.RhinoViewport.ZoomBoundingBox(Rhino.Geometry.BoundingBox)
Zooms the viewport to the given bounding box.
box: The bounding box to zoom.
Returns: true if operation succeeded; otherwise false.
Since: 5.0

Rhino.Display.RhinoViewport.ZoomWindow(System.Drawing.Rectangle)
Zooms the viewport to the given rectangle.
rect:
A 2d screen rectangle in client coordinates of the parent Rhino view,
where 0,0 is the upper left corner of the view window.
Returns: true if operation succeeded; otherwise false.
Since: 7.33

Rhino.Display.RhinoViewport.MouseRotateAroundTarget(System.Drawing.Point,System.Drawing.Point)
Rotates the viewport around target.
mousePreviousPoint: The mouse previous point.
mouseCurrentPoint: The mouse current point.
Since: 5.0

Rhino.Display.RhinoViewport.MouseRotateCamera(System.Drawing.Point,System.Drawing.Point)
Rotates the view around the camera location.
mousePreviousPoint: The mouse previous point.
mouseCurrentPoint: The mouse current point.
Since: 5.0

Rhino.Display.RhinoViewport.MouseInOutDolly(System.Drawing.Point,System.Drawing.Point)
Moves the camera towards or away from the view maintaining focus on the view.
mousePreviousPoint: The mouse previous point.
mouseCurrentPoint: The mouse current point.
Since: 5.0

Rhino.Display.RhinoViewport.MouseMagnify(System.Drawing.Point,System.Drawing.Point)
Moves the camera towards or away from the view.
mousePreviousPoint: The mouse previous point.
mouseCurrentPoint: The mouse current point.
Since: 5.0

Rhino.Display.RhinoViewport.MouseTilt(System.Drawing.Point,System.Drawing.Point)
Tilts the camera view.
mousePreviousPoint: The mouse previous point.
mouseCurrentPoint: The mouse current point.
Since: 5.0

Rhino.Display.RhinoViewport.MouseAdjustLensLength(System.Drawing.Point,System.Drawing.Point,System.Boolean)
Adjusts the camera lens length.
mousePreviousPoint: The mouse previous point.
mouseCurrentPoint: The mouse current point.
moveTarget: Should this operation move the target?
Since: 6.0

Rhino.Display.RhinoViewport.MouseDollyZoom(System.Drawing.Point,System.Drawing.Point)
Zooms lens (thus adjusting the field of view) while moving the camera.
mousePreviousPoint: The mouse previous point.
mouseCurrentPoint: The mouse current point.
Since: 5.0

Rhino.Display.RhinoViewport.MouseLateralDolly(System.Drawing.Point,System.Drawing.Point)
Pans the camera
mousePreviousPoint: The mouse previous point.
mouseCurrentPoint: The mouse current point.
Since: 6.0

Rhino.Display.RhinoViewport.KeyboardRotate(System.Boolean,System.Double)
Emulates the keyboard arrow key in terms of interaction.
leftRight: left/right rotate if true, up/down rotate if false.
angleRadians:
If less than 0, rotation is to left or down.
If greater than 0, rotation is to right or up.
Returns: true if operation succeeded; otherwise false.
Since: 5.0

Rhino.Display.RhinoViewport.KeyboardDolly(System.Boolean,System.Double)
Emulates the keyboard arrow key in terms of interaction.
leftRight: left/right dolly if true, up/down dolly if false.
amount: The dolly amount.
Returns: true if operation succeeded; otherwise false.
Since: 5.0

Rhino.Display.RhinoViewport.KeyboardDollyInOut(System.Double)
Emulates the keyboard arrow key in terms of interaction.
amount: The dolly amount.
Returns: true if operation succeeded; otherwise false.
Since: 5.0

Rhino.Display.RhinoViewport.Magnify(System.Double,System.Boolean)
Zooms or dollies in order to scale the viewport projection of observed objects.
magnificationFactor: The scale factor.
mode:
false = perform a "dolly" magnification by moving the camera towards/away from
the target so that the amount of the screen subtended by an object changes.
true = perform a "zoom" magnification by adjusting the "lens" angle
Returns: true if operation succeeded; otherwise false.
Since: 5.0

Rhino.Display.RhinoViewport.Magnify(System.Double,System.Boolean,System.Drawing.Point)
Zooms or dollies in order to scale the viewport projection of observed objects.
magnificationFactor: The scale factor.
mode:
false = perform a "dolly" magnification by moving the camera towards/away from
the target so that the amount of the screen subtended by an object changes.
true = perform a "zoom" magnification by adjusting the "lens" angle
fixedScreenPoint: A point in the screen that should remain fixed.
Returns: true if operation succeeded; otherwise false.
Since: 5.0

Rhino.Display.RhinoViewport.GetPickTransform(System.Int32,System.Int32)
Takes a rectangle in screen coordinates and returns a transformation
that maps the 3d frustum defined by the rectangle to a -1/+1 clipping
coordinate box. This takes a single point and inflates it by
Rhino.ApplicationSettings.ModelAidSettings.MousePickBoxRadius to define
the screen rectangle.
clientX: The client point X coordinate.
clientY: The client point Y coordinate.
Returns: A transformation matrix.
Since: 5.0

Rhino.Display.RhinoViewport.GetPickTransform(System.Drawing.Point)
Takes a rectangle in screen coordinates and returns a transformation
that maps the 3d frustum defined by the rectangle to a -1/+1 clipping
coordinate box. This takes a single point and inflates it by
Rhino.ApplicationSettings.ModelAidSettings.MousePickBoxRadius to define
the screen rectangle.
clientPoint: The client point.
Returns: A transformation matrix.
Since: 5.0

Rhino.Display.RhinoViewport.GetPickTransform(System.Drawing.Rectangle)
Takes a rectangle in screen coordinates and returns a transformation
that maps the 3d frustum defined by the rectangle to a -1/+1 clipping
coordinate box.
clientRectangle: The client rectangle.
Returns: A transformation matrix.
Since: 5.0

Rhino.Display.RhinoViewport.SetUserStrings(System.Collections.Generic.IEnumerable{System.Collections.Generic.KeyValuePair{System.String,System.String}},System.Boolean)
Attach a user string (key,value combination) to this viewport.
items: collection of key-value pairs to set.
replace: If True, the previous user string will be removed
Returns: true on success.
Since: 8.18

Rhino.Display.RhinoViewport.SetUserString(System.String,System.String)
Attach a user string (key,value combination) to this geometry.
key: id used to retrieve this string.
value: string associated with key. If null, the key will be removed
Returns: true on success.
Since: 6.18

Rhino.Display.RhinoViewport.GetUserString(System.String)
Gets a user string.
key: id used to retrieve the string.
Returns: string associated with the key if successful. null if no key was found.
Since: 6.18

Rhino.Display.RhinoViewport.UserStringCount
Since: 6.18

Rhino.Display.RhinoViewport.GetUserStrings
Gets an independent copy of the collection of (user text key, user text value) pairs attached to this object.
Returns: A collection of key strings and values strings. This
Since: 6.18

Rhino.Display.RhinoViewport.DeleteUserString(System.String)
Since: 6.18

Rhino.Display.RhinoViewport.DeleteAllUserStrings
Since: 6.18

Rhino.Display.RhinoViewport.GetFrustumBoundingBox
Since: 5.0

Rhino.Display.RhinoViewport.Rotate(System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Rotates about the specified axis. A positive rotation angle results
in a counter-clockwise rotation about the axis (right hand rule).
angleRadians: angle of rotation in radians.
rotationAxis: direction of the axis of rotation.
rotationCenter: point on the axis of rotation.
Returns: true if geometry successfully rotated.
Since: 5.0

Rhino.Display.RhinoViewport.IsValidCamera
Since: 5.0

Rhino.Display.RhinoViewport.IsValidFrustum
Since: 5.0

Rhino.Display.RhinoViewport.IsPerspectiveProjection
Since: 5.0

Rhino.Display.RhinoViewport.IsTwoPointPerspectiveProjection
Since: 5.0

Rhino.Display.RhinoViewport.IsParallelProjection
Since: 5.0

Rhino.Display.RhinoViewport.GetViewScale
Get Scale transform applied to the viewport
Returns:
Since: 8.0

Rhino.Display.RhinoViewport.ChangeToParallelProjection(System.Boolean)
Use this function to change projections of valid viewports from perspective to parallel.
It will make common additional adjustments to the frustum so the resulting views are
similar. The camera location and direction will not be changed.
symmetricFrustum: true if you want the resulting frustum to be symmetric.
Returns:
If the current projection is parallel and bSymmetricFrustum, FrustumIsLeftRightSymmetric()
and FrustumIsTopBottomSymmetric() are all equal, then no changes are made and true is returned.
Since: 5.0

Rhino.Display.RhinoViewport.ChangeToPerspectiveProjection(System.Boolean,System.Double)
Use this function to change projections of valid viewports from parallel to perspective.
It will make common additional adjustments to the frustum and camera location so the
resulting views are similar. The camera direction and target point are not be changed.
symmetricFrustum: true if you want the resulting frustum to be symmetric.
lensLength:
(pass 50.0 when in doubt) 35 mm lens length to use when changing from parallel to perspective
projections. If the current projection is perspective or lens_length is <= 0.0, then
this parameter is ignored.
Returns:
If the current projection is perspective and bSymmetricFrustum, FrustumIsLeftRightSymmetric()
and FrustumIsTopBottomSymmetric() are all equal, then no changes are made and true is returned.
Since: 5.0

Rhino.Display.RhinoViewport.ChangeToPerspectiveProjection(System.Double,System.Boolean,System.Double)
Use this function to change projections of valid viewports from parallel to perspective.
It will make common additional adjustments to the frustum and camera location so the
resulting views are similar. The camera direction and target point are not be changed.
targetDistance:
If RhinoMath.UnsetValue this parameter is ignored. Otherwise it must be > 0 and indicates
which plane in the current view frustum should be preserved.
symmetricFrustum: true if you want the resulting frustum to be symmetric.
lensLength:
(pass 50.0 when in doubt) 35 mm lens length to use when changing from parallel to perspective
projections. If the current projection is perspective or lens_length is <= 0.0, then
this parameter is ignored.
Returns:
If the current projection is perspective and bSymmetricFrustum, FrustumIsLeftRightSymmetric()
and FrustumIsTopBottomSymmetric() are all equal, then no changes are made and true is returned.
Since: 5.0

Rhino.Display.RhinoViewport.ChangeToTwoPointPerspectiveProjection(System.Double)
Use this function to change projections of valid viewports
to a two point perspective.  It will make common additional
adjustments to the frustum and camera location and direction
so the resulting views are similar.
lensLength:
(pass 50.0 when in doubt) 35 mm lens length to use when changing from parallel to perspective
projections. If the current projection is perspective or lens_length is <= 0.0, then
this parameter is ignored.
Returns:
If the current projection is perspective and bSymmetricFrustum, FrustumIsLeftRightSymmetric()
and FrustumIsTopBottomSymmetric() are all equal, then no changes are made and true is returned.
Since: 6.0

Rhino.Display.RhinoViewport.ChangeToTwoPointPerspectiveProjection(System.Double,Rhino.Geometry.Vector3d,System.Double)
Use this function to change projections of valid viewports
to a two point perspective.  It will make common additional
adjustments to the frustum and camera location and direction
so the resulting views are similar.
targetDistance:
If RhinoMath.UnsetValue this parameter is ignored. Otherwise it must be > 0 and indicates
which plane in the current view frustum should be preserved.
up:
This direction will be the locked up direction.  Pass
ON_3dVector::ZeroVector if you want to use the world axis
direction that is closest to the current up direction.
Pass CameraY() if you want to preserve the current up direction.
lensLength:
(pass 50.0 when in doubt) 35 mm lens length to use when changing from parallel to perspective
projections. If the current projection is perspective or lens_length is <= 0.0, then
this parameter is ignored.
Returns:
If the current projection is perspective and bSymmetricFrustum, FrustumIsLeftRightSymmetric()
and FrustumIsTopBottomSymmetric() are all equal, then no changes are made and true is returned.
Since: 6.0

Rhino.Display.RhinoViewport.ChangeToParallelReflectedProjection
When a viewport is set to Parallel Reflected projection, the geometry on the ceiling is shown as if it is mirrored to the floor below.
Returns:
Since: 8.14

Rhino.Display.RhinoViewport.CameraLocation
Since: 5.0

Rhino.Display.RhinoViewport.CameraDirection
Since: 5.0

Rhino.Display.RhinoViewport.CameraUp
Since: 5.0

Rhino.Display.RhinoViewport.GetCameraFrame(Rhino.Geometry.Plane@)
Gets the camera plane.
frame: A plane is assigned to this out parameter during the call, if the operation succeeded.
Returns: true if current camera orientation is valid.
Since: 5.0

Rhino.Display.RhinoViewport.CameraX
Gets the "unit to the right" vector.
Since: 5.0

Rhino.Display.RhinoViewport.CameraY
Gets the "unit up" vector.
Since: 5.0

Rhino.Display.RhinoViewport.CameraZ
Gets the unit vector in CameraDirection.
Since: 5.0

Rhino.Display.RhinoViewport.GetFrustum(System.Double@,System.Double@,System.Double@,System.Double@,System.Double@,System.Double@)
Gets the view frustum.
left: left < right.
right: left < right.
bottom: bottom < top.
top: bottom < top.
nearDistance: 0 < nearDistance < farDistance.
farDistance: 0 < nearDistance < farDistance.
Returns: true if operation succeeded.
Since: 5.0

Rhino.Display.RhinoViewport.FrustumAspect
Gets the width/height ratio of the frustum.
Since: 5.0

Rhino.Display.RhinoViewport.GetFrustumCenter(Rhino.Geometry.Point3d@)
Returns world coordinates of frustum's center.
center: The center coordinate is assigned to this out parameter if this call succeeds.
Returns: true if the center was successfully computed.
Since: 5.0

Rhino.Display.RhinoViewport.GetDepth(Rhino.Geometry.Point3d,System.Double@)
Gets clipping distance of a point.
point: A 3D point.
distance: A computed distance is assigned to this out parameter if this call succeeds.
Returns:
true if the point is in the view frustum and near_dist/far_dist were set.
false if the bounding box does not intersect the view frustum.
Since: 5.0

Rhino.Display.RhinoViewport.GetDepth(Rhino.Geometry.BoundingBox,System.Double@,System.Double@)
Gets near and far clipping distances of a bounding box.
bbox: The bounding box.
nearDistance: The near distance is assigned to this out parameter during this call.
farDistance: The far distance is assigned to this out parameter during this call.
Returns:
true if the bounding box intersects the view frustum and near_dist/far_dist were set.
false if the bounding box does not intersect the view frustum.
Since: 5.0

Rhino.Display.RhinoViewport.GetDepth(Rhino.Geometry.Sphere,System.Double@,System.Double@)
Gets near and far clipping distances of a sphere.
sphere: The sphere.
nearDistance: The near distance is assigned to this out parameter during this call.
farDistance: The far distance is assigned to this out parameter during this call.
Returns:
true if the sphere intersects the view frustum and near_dist/far_dist were set.
false if the sphere does not intersect the view frustum.
Since: 5.0

Rhino.Display.RhinoViewport.GetFrustumNearPlane(Rhino.Geometry.Plane@)
Get near clipping plane.
plane:
near clipping plane if camera and frustum are valid. The plane's
frame is the same as the camera's frame. The origin is located at
the intersection of the camera direction ray and the near clipping
plane.
Returns:
true if camera and frustum are valid.
Since: 5.0

Rhino.Display.RhinoViewport.GetFrustumFarPlane(Rhino.Geometry.Plane@)
Get far clipping plane.
plane:
far clipping plane if camera and frustum are valid. The plane's
frame is the same as the camera's frame. The origin is located at
the intersection of the camera direction ray and the far clipping
plane.
Returns:
true if camera and frustum are valid.
Since: 5.0

Rhino.Display.RhinoViewport.GetFrustumLeftPlane(Rhino.Geometry.Plane@)
Get left world frustum clipping plane.
plane:
frustum left side clipping plane. The normal points into the visible
region of the frustum. If the projection is perspective, the origin
is at the camera location, otherwise the origin is the point on the
plane that is closest to the camera location.
Returns: true if camera and frustum are valid and plane was set.
Since: 5.0

Rhino.Display.RhinoViewport.GetFrustumRightPlane(Rhino.Geometry.Plane@)
Get right world frustum clipping plane.
plane:
frustum right side clipping plane. The normal points into the visible
region of the frustum. If the projection is perspective, the origin
is at the camera location, otherwise the origin is the point on the
plane that is closest to the camera location.
Returns: true if camera and frustum are valid and plane was set.
Since: 5.0

Rhino.Display.RhinoViewport.GetFrustumBottomPlane(Rhino.Geometry.Plane@)
Get bottom world frustum clipping plane.
plane:
frustum bottom side clipping plane. The normal points into the visible
region of the frustum. If the projection is perspective, the origin
is at the camera location, otherwise the origin is the point on the
plane that is closest to the camera location.
Returns: true if camera and frustum are valid and plane was set.
Since: 5.0

Rhino.Display.RhinoViewport.GetFrustumTopPlane(Rhino.Geometry.Plane@)
Get top world frustum clipping plane.
plane:
frustum top side clipping plane. The normal points into the visible
region of the frustum. If the projection is perspective, the origin
is at the camera location, otherwise the origin is the point on the
plane that is closest to the camera location.
Returns: true if camera and frustum are valid and plane was set.
Since: 5.0

Rhino.Display.RhinoViewport.GetNearRect
Get corners of near clipping plane rectangle.
Returns:
[left_bottom, right_bottom, left_top, right_top] points on success
null on failure.
Since: 5.0

Rhino.Display.RhinoViewport.GetFarRect
Get corners of far clipping plane rectangle.
Returns:
[left_bottom, right_bottom, left_top, right_top] points on success
null on failure.
Since: 5.0

Rhino.Display.RhinoViewport.GetScreenPort(System.Int32@,System.Int32@,System.Int32@,System.Int32@,System.Int32@,System.Int32@)
Location of viewport in pixels.  These are provided so you can set the port you are using
and get the appropriate transformations to and from screen space.
portLeft: portLeft != portRight.
portRight: portLeft != portRight.
portBottom: portTop != portBottom.
portTop: portTop != portBottom.
portNear: The viewport near value.
portFar: The viewport far value.
Returns: true if the operation is successful.
Since: 5.0

Rhino.Display.RhinoViewport.Bounds
Gets the size and location of the viewport, in pixels, relative to the parent view.
Since: 5.0

Rhino.Display.RhinoViewport.ScreenPortAspect
screen port's width/height.
Since: 5.0

Rhino.Display.RhinoViewport.GetCameraAngle(System.Double@,System.Double@,System.Double@)
Since: 5.0

Rhino.Display.RhinoViewport.Camera35mmLensLength
Since: 5.0

Rhino.Display.RhinoViewport.GetTransform(Rhino.DocObjects.CoordinateSystem,Rhino.DocObjects.CoordinateSystem)
Gets a transform from origin coordinate system to a target coordinate system.
sourceSystem: The origin coordinate system.
destinationSystem: The target coordinate system.
Returns:
4x4 transformation matrix (acts on the left)
Identity matrix is returned if this function fails.
Since: 5.0

Rhino.Display.RhinoViewport.GetFrustumLine(System.Double,System.Double,Rhino.Geometry.Line@)
Gets the world coordinate line in the view frustum that projects to a point on the screen.
screenX: (screenx,screeny) = screen location.
screenY: (screenx,screeny) = screen location.
worldLine:
3d world coordinate line segment starting on the near clipping
plane and ending on the far clipping plane.
Returns:
true if successful.
false if view projection or frustum is invalid.
Since: 5.0

Rhino.Display.RhinoViewport.GetWorldToScreenScale(Rhino.Geometry.Point3d,System.Double@)
Gets the world to screen size scaling factor at a point in frustum.
pointInFrustum: A point in frustum.
pixelsPerUnit:
scale = number of pixels per world unit at the 3d point.
This out parameter is assigned during this call.
Returns: true if the operation is successful.
Since: 5.0

Rhino.Display.RhinoViewport.WorldToClient(Rhino.Geometry.Point3d)
Convert a point from world coordinates in the viewport to a 2d screen
point in the local coordinates of the viewport (X/Y of point is relative
to top left corner of viewport on screen)
worldPoint: The 3D point in world coordinates.
Returns: The 2D point on the screen.
Since: 5.0

Rhino.Display.RhinoViewport.ClientToScreen(Rhino.Geometry.Point2d)
Since: 5.0

Rhino.Display.RhinoViewport.ClientToScreen(System.Drawing.Point)
Since: 5.0

Rhino.Display.RhinoViewport.ScreenToClient(System.Drawing.Point)
Since: 5.0

Rhino.Display.RhinoViewport.ClientToWorld(System.Drawing.Point)
Since: 5.0

Rhino.Display.RhinoViewport.ClientToWorld(Rhino.Geometry.Point2d)
Since: 5.0

Rhino.Display.RhinoViewport.WallpaperFilename
Since: 5.0

Rhino.Display.RhinoViewport.WallpaperGrayscale
Since: 5.0

Rhino.Display.RhinoViewport.WallpaperVisible
Since: 5.0

Rhino.Display.RhinoViewport.SetWallpaper(System.String,System.Boolean)
Since: 5.0

Rhino.Display.RhinoViewport.SetWallpaper(System.String,System.Boolean,System.Boolean)
Since: 5.0

Rhino.Display.RhinoViewport.ClearTraceImage
Remove trace image (background bitmap) for this viewport if one exists.
Since: 5.0

Rhino.Display.RhinoViewport.SetTraceImage(System.String,Rhino.Geometry.Plane,System.Double,System.Double,System.Boolean,System.Boolean)
Set trace image (background bitmap) for this viewport.
bitmapFileName: The bitmap file name.
plane: A picture plane.
width: The picture width.
height: The picture height.
grayscale: true if the picture should be in grayscale.
filtered: true if image should be filtered (bilinear) before displayed.
Returns: true if successful.
Since: 5.0

Rhino.Display.RhinoViewport.ViewportType
Since: 5.0

Rhino.Display.RhinoViewport.DisplayMode
Since: 5.0