Rhino.Runtime.InProcess.WindowStyle
Specifies how a new window should appear when Rhino starts.
Since: 7.0

Rhino.Runtime.InProcess.WindowStyle.NoWindow
The no window style.

Rhino.Runtime.InProcess.WindowStyle.Normal
The normal, visible window style.

Rhino.Runtime.InProcess.WindowStyle.Hidden
The hidden window style.

Rhino.Runtime.InProcess.WindowStyle.Minimized
The minimized window style.

Rhino.Runtime.InProcess.WindowStyle.Maximized
The maximized window style.