Rhino.Runtime.ICloudHost
Interface for cloud-provider entitlement and metering services.
Platform implementations register themselves via the platform ServiceLocator
(e.g. WindowsAwsCloudHost in RhinoWindows for AWS Marketplace metering).
Remarks:
Result of Rhino.Runtime.ICloudHost.CheckEntitlement is tri-state across IsEntitled + DenyReason:
IsEntitled=true,  DenyReason=null — entitled (allow).
IsEntitled=false, DenyReason!=null — actively denied (e.g. stolen AMI, CustomerNotEntitledException).
IsEntitled=false, DenyReason=null — gate doesn't apply to this instance (e.g. classic non-Marketplace EC2). NOT a denial.
Callers that act on the result (e.g. license/run-gate enforcement) MUST distinguish
"actively denied" from "not applicable" so they don't refuse classic users.

Rhino.Runtime.ICloudHost.CheckEntitlement
Performs the entitlement check (and on AMI-based Marketplace products, also submits
a metering record). Re-callable: each call is independent and re-runs the gate.
Long-running hosts (e.g. compute.geometry processes) can invoke this periodically
to refresh entitlement and post recurring metering. Implementations make no claim
of idempotency — callers that want once-only semantics should cache externally.