Rhino.DocObjects.Tables.RestoreLayerProperties
Layer State restoration flags
Since: 6.14

Rhino.DocObjects.Tables.RestoreLayerProperties.None
Restore nothing
Since: 6.14

Rhino.DocObjects.Tables.RestoreLayerProperties.Current
Restore current layer
Since: 6.14

Rhino.DocObjects.Tables.RestoreLayerProperties.Visible
Restore layer visibility
Since: 6.14

Rhino.DocObjects.Tables.RestoreLayerProperties.Locked
Restore layer locked status
Since: 6.14

Rhino.DocObjects.Tables.RestoreLayerProperties.Color
Restore layer color
Since: 6.14

Rhino.DocObjects.Tables.RestoreLayerProperties.Linetype
Restore layer linetype
Since: 6.14

Rhino.DocObjects.Tables.RestoreLayerProperties.PrintColor
Restore layer print color
Since: 6.14

Rhino.DocObjects.Tables.RestoreLayerProperties.PrintWidth
Restore layer print width
Since: 6.14

Rhino.DocObjects.Tables.RestoreLayerProperties.ViewportVisible
Restore per-viewport layer visibility
Since: 6.14

Rhino.DocObjects.Tables.RestoreLayerProperties.ViewportColor
Restore per-viewport layer color
Since: 6.14

Rhino.DocObjects.Tables.RestoreLayerProperties.ViewportPrintColor
Restore per-viewport layer print color
Since: 6.14

Rhino.DocObjects.Tables.RestoreLayerProperties.ViewportPrintWidth
Restore per-viewport layer print width
Since: 6.14

Rhino.DocObjects.Tables.RestoreLayerProperties.RenderMaterial
Restore render material
Since: 6.14

Rhino.DocObjects.Tables.RestoreLayerProperties.SectionStyle
Section style
Since: 8.0

Rhino.DocObjects.Tables.RestoreLayerProperties.NewDetailOn
New Detail On
Since: 8.0

Rhino.DocObjects.Tables.RestoreLayerProperties.Expanded
Expanded/Collapsed state
Since: 8.12

Rhino.DocObjects.Tables.RestoreLayerProperties.All
Restore all layer properties
Since: 6.14