Rhino.Render.RenderContentEventArgs
Event args for RenderContent

Rhino.Render.RenderContentEventArgs.Content
Since: 5.7

Rhino.Render.RenderContentEventArgs.Document
Since: 6.0

Rhino.Render.RenderContentEventArgs.Reason
Not when used in CurrentEnvironmentChanged (defaults to None).
Since: 6.0

Rhino.Render.RenderContentEventArgs.EnvironmentUsage
Meaningful for CurrentEnvironmentChanged event. Will be one of Background, ReflectionAndRefraction or Skylighting.
Since: 6.11

Rhino.Render.RenderContentEventArgs.EnvironmentUsageEx
Meaningful for CurrentEnvironmentChanged event. Will be one of Background, Reflection or Skylighting.
Since: 8.0