Rhino.UI.RuiUpdateUi.IsValid
Return true if initialize correctly
Returns:  true if initialize correctly

Rhino.UI.RuiUpdateUi.Enabled
Set to true to enable menu item or false to disable menu item
Since: 5.11

Rhino.UI.RuiUpdateUi.Checked
Set to true to enable menu item or false to check menu item
Since: 5.11

Rhino.UI.RuiUpdateUi.RadioChecked
Set to true to enable menu item or false to check menu item
Since: 5.11

Rhino.UI.RuiUpdateUi.Text
Menu item text
Since: 5.11

Rhino.UI.RuiUpdateUi.FileId
Id of the RUI file that owns this menu item
Since: 5.11

Rhino.UI.RuiUpdateUi.MenuId
Id of the menu that owns this menu item
Since: 5.11

Rhino.UI.RuiUpdateUi.MenuItemId
Id of the menu item that owns this menu item
Since: 5.11

Rhino.UI.RuiUpdateUi.MenuHandle
Windows menu handle of menu that contains this item
Since: 5.11

Rhino.UI.RuiUpdateUi.MenuIndex
Zero based index of item in the Windows menu
Since: 5.11

Rhino.UI.RuiUpdateUi.WindowsMenuItemId
Windows menu item ID
Since: 5.11

Rhino.UI.RuiUpdateUi.RegisterMenuItem(System.Guid,System.Guid,System.Guid,Rhino.UI.RuiUpdateUi.UpdateMenuItemEventHandler)
Register menu item update delegate
file: Menu file Id
menu: Menu Id
item: Menu item Id
callBack:
Returns: true if Registered otherwise false
Since: 5.11

Rhino.UI.RuiUpdateUi.RegisterMenuItem(System.String,System.String,System.String,Rhino.UI.RuiUpdateUi.UpdateMenuItemEventHandler)
Register menu item update delegate
fileId: Menu file Id
menuId: Menu Id
itemId: Menu item Id
callBack:
Returns: true if Registered otherwise false
Since: 5.11