Rhino.Display.DisplayPipelineAttributes.WorldAxesIconColorUse
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.WorldAxesIconColorUse.UseApplicationSettings
Use default setting

Rhino.Display.DisplayPipelineAttributes.WorldAxesIconColorUse.SameAsGridAxesColors
Set colors for grid axes in Appearance: Colors Options

Rhino.Display.DisplayPipelineAttributes.WorldAxesIconColorUse.Custom
Use specified custom colors