Rhino.Runtime.InteropWrappers.SimpleArrayUint
Wrapper for ON_SimpleArray<unsigned int>. If you are not writing C++ code
then this class is not for you.

Rhino.Runtime.InteropWrappers.SimpleArrayUint.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayUint.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayUint.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayInt class.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayUint.#ctor(System.Collections.Generic.IEnumerable{System.UInt32})
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayInt class.
values: A list, an array or any collection of unsigned integers that implements the enumerable interface.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayUint.Count
Gets the number of elements in this array.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayUint.UnsignedCount
Gets the number of elements in this array.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayUint.ToArray
Returns the managed counterpart of the unmanaged array.
Returns: The managed array.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayUint.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.SimpleArrayUint.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 6.0