Rhino.FileIO.FileDwgReadOptions
Options for reading a DWG file

Rhino.FileIO.FileDwgReadOptions.ImportUnreferencedLayers
Since: 8.0

Rhino.FileIO.FileDwgReadOptions.ImportUnreferencedBlocks
Since: 8.0

Rhino.FileIO.FileDwgReadOptions.ImportUnreferencedLinetypes
Since: 8.0

Rhino.FileIO.FileDwgReadOptions.ConvertWidePolylinesToSurfaces
Since: 8.0

Rhino.FileIO.FileDwgReadOptions.IgnoreThickness
Since: 8.0

Rhino.FileIO.FileDwgReadOptions.ConvertRegionsToCurves
Since: 8.0

Rhino.FileIO.FileDwgReadOptions.MeshPrecision
Since: 8.0

Rhino.FileIO.FileDwgReadOptions.ModelUnits
Since: 8.0

Rhino.FileIO.FileDwgReadOptions.LayoutUnits
Since: 8.0

Rhino.FileIO.FileDwgReadOptions.SetLayerMaterialToLayerColor
Since: 8.0

Rhino.FileIO.FileDwgReadOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0