Rhino.FileIO.FileXamlWriteOptions
Options for writing a Xaml file

Rhino.FileIO.FileXamlWriteOptions.UseExistingRenderMeshes
Since: 8.0
If render meshes exist they will be used.
Otherwise they are created on the fly using the current render
settings of the document.

Rhino.FileIO.FileXamlWriteOptions.AddRotationScrollbars
Since: 8.0

Rhino.FileIO.FileXamlWriteOptions.UseOriginForRotationCenter
Since: 8.0

Rhino.FileIO.FileXamlWriteOptions.AddRotationAnimation
Since: 8.0

Rhino.FileIO.FileXamlWriteOptions.AnimationAxis
Since: 8.0

Rhino.FileIO.FileXamlWriteOptions.MeshingParameters
Since: 8.0
Remarks:  This is not currently being used but may be in the future.
See UseExistingRenderMeshes.

Rhino.FileIO.FileXamlWriteOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0