Rhino.Render.RenderContent.EmbedFilesChoice
Used by SaveToFile
Since: 8.6

Rhino.Render.RenderContent.EmbedFilesChoice.NeverEmbed
Never embed support files in the content file

Rhino.Render.RenderContent.EmbedFilesChoice.AlwaysEmbed
Always embed support files in the content file

Rhino.Render.RenderContent.EmbedFilesChoice.AskUser
Show a UI