Rhino.Geometry.Curve
Represents a base class that is common to most RhinoCommon curve types.
A curve represents an entity that can be all visited by providing
a single parameter, usually called t.

Rhino.Geometry.Curve.GetConicSectionType
Returns the type of conic section based on the curve's shape.
Returns:
Since: 6.0

Rhino.Geometry.Curve.GetConicSectionType(Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)
Returns the type of conic section based on the curve's shape.
focus1: The first focus point, if applicable.
focus2: The second focus point, if applicable.
center: The center point, if applicable.
Returns:
Since: 6.0

Rhino.Geometry.Curve.CreateInterpolatedCurve(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32)
Interpolates a sequence of points. Used by InterpCurve Command
This routine works best when degree=3.
degree: The degree of the curve >=1.  Degree must be odd.
points:
Points to interpolate (Count must be >= 2)
Returns: interpolated curve on success. null on failure.
Since: 5.0

Rhino.Geometry.Curve.CreateInterpolatedCurve(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32,Rhino.Geometry.CurveKnotStyle)
Interpolates a sequence of points. Used by InterpCurve Command
This routine works best when degree=3.
degree: The degree of the curve >=1. Note: Even degree > 3 periodic interpolation
results in a non-periodic closed curve.
points:
Points to interpolate. For periodic curves if the final point is a
duplicate of the initial point it is  ignored. (Count must be >=2)
knots:
Knot-style to use  and specifies if the curve should be periodic.
Returns: interpolated curve on success. null on failure.
Since: 5.0

Rhino.Geometry.Curve.CreateInterpolatedCurve(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32,Rhino.Geometry.CurveKnotStyle,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Interpolates a sequence of points. Used by InterpCurve Command
This routine works best when degree=3.
degree: The degree of the curve >=1. Note: Even degree > 3 periodic interpolation
results in a non-periodic closed curve.
points:
Points to interpolate. For periodic curves if the final point is a
duplicate of the initial point it is  ignored. (Count must be >=2)
knots:
Knot-style to use  and specifies if the curve should be periodic.
startTangent: A starting tangent.
endTangent: An ending tangent.
Returns: interpolated curve on success. null on failure.
Since: 5.0

Rhino.Geometry.Curve.CreateSoftEditCurve(Rhino.Geometry.Curve,System.Double,Rhino.Geometry.Vector3d,System.Double,System.Boolean)
Creates a soft edited curve from an existing curve using a smooth field of influence.
curve: The curve to soft edit.
t:
A parameter on the curve to move from. This location on the curve is moved, and the move
is smoothly tapered off with increasing distance along the curve from this parameter.
delta: The direction and magnitude, or maximum distance, of the move.
length:
The distance along the curve from the editing point over which the strength
of the editing falls off smoothly.
fixEnds:
Returns: The soft edited curve if successful. null on failure.
Since: 6.0

Rhino.Geometry.Curve.CreateFilletCornersCurve(Rhino.Geometry.Curve,System.Double,System.Double,System.Double)
Rounds the corners of a kinked curve with arcs of a single, specified radius.
curve: The curve to fillet.
radius: The fillet radius.
tolerance: The tolerance. When in doubt, use the document's model space absolute tolerance.
angleTolerance: The angle tolerance in radians. When in doubt, use the document's model space angle tolerance.
Returns: The filleted curve if successful. null on failure.
Since: 6.0

Rhino.Geometry.Curve.CreateArcCornerRectangle(Rhino.Geometry.Rectangle3d,System.Double)
Creates an arc-cornered (rounded) rectangular curve.
rectangle: The rectangle.
radius: The arc radius at each corner.
Returns: Aa arc-cornered rectangular curve if successful, null otherwise.
Since: 8.9

Rhino.Geometry.Curve.CreateConicCornerRectangle(Rhino.Geometry.Rectangle3d,System.Double)
Creates a conic-corned (rounded) rectangular curve.
rectangle: The rectangle.
rho: The rho value at each corner, in the exclusive range (0.0, 1.0).
Returns: A conic-cornered rectangular curve if successful, null otherwise.
Since: 8.9

Rhino.Geometry.Curve.CreateControlPointCurve(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32)
Constructs a curve from a set of control-point locations.
points: Control points.
degree: Degree of curve. The number of control points must be at least degree+1.
Since: 5.0

Rhino.Geometry.Curve.CreateControlPointCurve(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Constructs a control-point of degree=3 (or less).
points: Control points of curve.
Since: 5.0

Rhino.Geometry.Curve.JoinCurves(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})
Joins a collection of curve segments together.
inputCurves: Curve segments to join.
Returns: An array of joined curves. This array can be empty.
Since: 5.0

Rhino.Geometry.Curve.JoinCurves(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Double)
Joins a collection of curve segments together.
inputCurves: An array, a list or any enumerable set of curve segments to join.
joinTolerance: Joining tolerance,
i.e. the distance between segment end-points that is allowed.
Returns: An array of joined curves. This array can be empty.
Throws System.ArgumentNullException: If inputCurves is null.
Since: 5.0

Rhino.Geometry.Curve.JoinCurves(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Double,System.Boolean,System.Int32[]@)
Joins a collection of curve segments together.
inputCurves: An array, a list or any enumerable set of curve segments to join.
joinTolerance: Joining tolerance,
i.e. the distance between segment end-points that is allowed.
preserveDirection:
If true, curve endpoints will be compared to curve start points.
If false, all start and endpoints will be compared and copies of input curves may be reversed in output.
key: inputCurves[i] is part of returnValue[key[i]]
Returns: An array of joined curves. This array can be empty.
Throws System.ArgumentNullException: If inputCurves is null.
Since: 8.4

Rhino.Geometry.Curve.JoinCurves(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Double,System.Boolean,System.Boolean,System.Int32[]@)
Joins a collection of curve segments together.
inputCurves: An array, a list or any enumerable set of curve segments to join.
joinTolerance: Joining tolerance,
i.e. the distance between segment end-points that is allowed.
preserveDirection:
If true, curve endpoints will be compared to curve start points.
If false, all start and endpoints will be compared and copies of input curves may be reversed in output.
key: inputCurves[i] is part of returnValue[key[i]]
simpleJoin: Set true to use the simple joining method. In general, set this parameter to false.
Returns: An array of joined curves. This array can be empty.
Throws System.ArgumentNullException: If inputCurves is null.
Since: 8.12

Rhino.Geometry.Curve.JoinCurves(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Double,System.Boolean)
Joins a collection of curve segments together.
inputCurves: An array, a list or any enumerable set of curve segments to join.
joinTolerance: Joining tolerance,
i.e. the distance between segment end-points that is allowed.
preserveDirection:
If true, curve endpoints will be compared to curve start points.
If false, all start and endpoints will be compared and copies of input curves may be reversed in output.
Returns: An array of joined curves. This array can be empty.
Throws System.ArgumentNullException: If inputCurves is null.
Since: 5.0

Rhino.Geometry.Curve.CreateArcLineArcBlend(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Double)
Creates an arc-line-arc blend curve between two curves.
The output is generally a PolyCurve with three segments: arc, line, arc.
In some cases, one or more of those segments will be absent because they would have 0 length.
If there is only a single segment, the result will either be an ArcCurve or a LineCurve.
startPt: Start of the blend curve.
startDir: Start direction of the blend curve.
endPt: End of the blend curve.
endDir: End direction of the arc blend curve.
radius: The radius of the arc segments.
Returns: The blend curve if successful, false otherwise.
Remarks:
The first arc segment will start at startPt, with starting tangent startDir.
The second arc segment will end at endPt with end tangent endDir.
The line segment will start from the end of the first arc segment and end at start of the second arc segment,
and it will be tangent to both arcs at those points.
Since: 7.9

Rhino.Geometry.Curve.CreateArcBlend(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Double)
Creates a polycurve consisting of two tangent arc segments that connect two points and two directions.
startPt: Start of the arc blend curve.
startDir: Start direction of the arc blend curve.
endPt: End of the arc blend curve.
endDir: End direction of the arc blend curve.
controlPointLengthRatio:
The ratio of the control polygon lengths of the two arcs. Note, a value of 1.0
means the control polygon lengths for both arcs will be the same.
Returns: The arc blend curve, or null on error.
Since: 6.1

Rhino.Geometry.Curve.CreateMeanCurve(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double)
Constructs a mean, or average, curve from two curves.
curveA: A first curve.
curveB: A second curve.
angleToleranceRadians:
The angle tolerance, in radians, used to match kinks between curves.
If you are unsure how to set this parameter, then either use the
document's angle tolerance RhinoDoc.AngleToleranceRadians,
or the default value (RhinoMath.UnsetValue)
Returns: The average curve, or null on error.
Throws System.ArgumentNullException: If curveA or curveB are null.
Since: 5.0

Rhino.Geometry.Curve.CreateMeanCurve(Rhino.Geometry.Curve,Rhino.Geometry.Curve)
Constructs a mean, or average, curve from two curves.
curveA: A first curve.
curveB: A second curve.
Returns: The average curve, or null on error.
Throws System.ArgumentNullException: If curveA or curveB are null.
Since: 5.0

Rhino.Geometry.Curve.CreateBlendCurve(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.BlendContinuity)
Create a Blend curve between two existing curves.
curveA: Curve to blend from (blending will occur at curve end point).
curveB: Curve to blend to (blending will occur at curve start point).
continuity: Continuity of blend.
Returns: A curve representing the blend between A and B or null on failure.
Since: 5.0

Rhino.Geometry.Curve.CreateBlendCurve(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.BlendContinuity,System.Double,System.Double)
Create a Blend curve between two existing curves.
curveA: Curve to blend from (blending will occur at curve end point).
curveB: Curve to blend to (blending will occur at curve start point).
continuity: Continuity of blend.
bulgeA: Bulge factor at curveA end of blend. Values near 1.0 work best.
bulgeB: Bulge factor at curveB end of blend. Values near 1.0 work best.
Returns: A curve representing the blend between A and B or null on failure.
Since: 5.0

Rhino.Geometry.Curve.CreateBlendCurve(Rhino.Geometry.Curve,System.Double,System.Boolean,Rhino.Geometry.BlendContinuity,Rhino.Geometry.Curve,System.Double,System.Boolean,Rhino.Geometry.BlendContinuity)
Makes a curve blend between 2 curves at the parameters specified
with the directions and continuities specified
curve0: First curve to blend from
t0: Parameter on first curve for blend endpoint
reverse0:
If false, the blend will go in the natural direction of the curve.
If true, the blend will go in the opposite direction to the curve
continuity0: Continuity for the blend at the start
curve1: Second curve to blend from
t1: Parameter on second curve for blend endpoint
reverse1:
If false, the blend will go in the natural direction of the curve.
If true, the blend will go in the opposite direction to the curve
continuity1: Continuity for the blend at the end
Returns: The blend curve on success. null on failure
Since: 5.0

Rhino.Geometry.Curve.CreateMatchCurve(Rhino.Geometry.Curve,System.Boolean,Rhino.Geometry.BlendContinuity,Rhino.Geometry.Curve,System.Boolean,Rhino.Geometry.PreserveEnd,System.Boolean)
Changes a curve end to meet a specified curve with a specified continuity.
curve0: The open curve to change.
reverse0: Reverse the direction of the curve to change before matching.
continuity: The continuity at the curve end.
curve1: The open curve to match.
reverse1: Reverse the direction of the curve to match before matching.
preserve: Prevent modification of the curvature at the end opposite the match for curves with fewer than six control points.
average: Adjust both curves to match each other.
Returns: The results of the curve matching, if successful, otherwise an empty array.
Since: 7.6

Rhino.Geometry.Curve.CreateTweenCurves(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Int32)
Creates curves between two open or closed input curves. Uses the control points of the curves for finding tween curves.
That means the first control point of first curve is matched to first control point of the second curve and so on.
There is no matching of curves direction. Caller must match input curves direction before calling the function.
curve0: The first, or starting, curve.
curve1: The second, or ending, curve.
numCurves: Number of tween curves to create.
Returns: An array of tween curves. This array can be empty.
Since: 5.2
6.0

Rhino.Geometry.Curve.CreateTweenCurves(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Int32,System.Double)
Creates curves between two open or closed input curves. Uses the control points of the curves for finding tween curves.
That means the first control point of first curve is matched to first control point of the second curve and so on.
There is no matching of curves direction. Caller must match input curves direction before calling the function.
curve0: The first, or starting, curve.
curve1: The second, or ending, curve.
numCurves: Number of tween curves to create.
tolerance:
Returns: An array of tween curves. This array can be empty.
Since: 6.0

Rhino.Geometry.Curve.CreateTweenCurvesWithMatching(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Int32)
Creates curves between two open or closed input curves. Make the structure of input curves compatible if needed.
Refits the input curves to have the same structure. The resulting curves are usually more complex than input unless
input curves are compatible and no refit is needed. There is no matching of curves direction.
Caller must match input curves direction before calling the function.
curve0: The first, or starting, curve.
curve1: The second, or ending, curve.
numCurves: Number of tween curves to create.
Returns: An array of tween curves. This array can be empty.
Since: 5.2
6.0

Rhino.Geometry.Curve.CreateTweenCurvesWithMatching(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Int32,System.Double)
Creates curves between two open or closed input curves. Make the structure of input curves compatible if needed.
Refits the input curves to have the same structure. The resulting curves are usually more complex than input unless
input curves are compatible and no refit is needed. There is no matching of curves direction.
Caller must match input curves direction before calling the function.
curve0: The first, or starting, curve.
curve1: The second, or ending, curve.
numCurves: Number of tween curves to create.
tolerance:
Returns: An array of tween curves. This array can be empty.
Since: 6.0

Rhino.Geometry.Curve.CreateTweenCurvesWithSampling(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Int32,System.Int32)
Creates curves between two open or closed input curves. Use sample points method to make curves compatible.
This is how the algorithm works: Divides the two curves into an equal number of points, finds the midpoint between the
corresponding points on the curves and interpolates the tween curve through those points. There is no matching of curves
direction. Caller must match input curves direction before calling the function.
curve0: The first, or starting, curve.
curve1: The second, or ending, curve.
numCurves: Number of tween curves to create.
numSamples: Number of sample points along input curves.
Returns: >An array of tween curves. This array can be empty.
Since: 5.2
6.0

Rhino.Geometry.Curve.CreateTweenCurvesWithSampling(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Int32,System.Int32,System.Double)
Creates curves between two open or closed input curves. Use sample points method to make curves compatible.
This is how the algorithm works: Divides the two curves into an equal number of points, finds the midpoint between the
corresponding points on the curves and interpolates the tween curve through those points. There is no matching of curves
direction. Caller must match input curves direction before calling the function.
curve0: The first, or starting, curve.
curve1: The second, or ending, curve.
numCurves: Number of tween curves to create.
numSamples: Number of sample points along input curves.
tolerance: The tolerance. When in doubt, use the document's model absolute tolerance.
Returns: >An array of tween curves. This array can be empty.
Since: 6.0

Rhino.Geometry.Curve.MakeEndsMeet(Rhino.Geometry.Curve,System.Boolean,Rhino.Geometry.Curve,System.Boolean)
Makes adjustments to the ends of one or both input curves so that they meet at a point.
curveA: 1st curve to adjust.
adjustStartCurveA:
Which end of the 1st curve to adjust: true is start, false is end.
curveB: 2nd curve to adjust.
adjustStartCurveB:
which end of the 2nd curve to adjust true==start, false==end.
Returns: true on success.
Since: 5.0

Rhino.Geometry.Curve.GetFilletPoints(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double,System.Double,System.Double@,System.Double@,Rhino.Geometry.Plane@)
Finds points at which to cut a pair of curves so that a fillet of given radius can be inserted.
curve0: First curve to fillet.
curve1: Second curve to fillet.
radius: Fillet radius.
t0Base: Parameter value for base point on curve0.
t1Base: Parameter value for base point on curve1.
t0: Parameter value of fillet point on curve 0.
t1: Parameter value of fillet point on curve 1.
filletPlane:
The fillet is contained in this plane with the fillet center at the plane origin.
Returns: true on success, false on failure.
Remarks:
A fillet point is a pair of curve parameters (t0,t1) such that there is a circle
of radius point3 tangent to curve c0 at t0 and tangent to curve c1 at t1. Of all possible
fillet points this function returns the one which is the closest to the base point
t0Base, t1Base. Distance from the base point is measured by the sum of arc lengths
along the two curves.
Since: 5.0

Rhino.Geometry.Curve.CreateFillet(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double,System.Double)
Computes the fillet arc for a curve filleting operation.
curve0: First curve to fillet.
curve1: Second curve to fillet.
radius: Fillet radius.
t0Base: Parameter on curve0 where the fillet ought to start (approximately).
t1Base: Parameter on curve1 where the fillet ought to end (approximately).
Returns: The fillet arc on success, or Arc.Unset on failure.
Since: 5.0

Rhino.Geometry.Curve.CreateFilletCurves(Rhino.Geometry.Curve,Rhino.Geometry.Point3d,Rhino.Geometry.Curve,Rhino.Geometry.Point3d,System.Double,System.Boolean,System.Boolean,System.Boolean,System.Double,System.Double)
Creates a tangent arc between two curves and trims or extends the curves to the arc.
curve0: The first curve to fillet.
point0:
A point on the first curve that is near the end where the fillet will
be created.
curve1: The second curve to fillet.
point1:
A point on the second curve that is near the end where the fillet will
be created.
radius: The radius of the fillet.
join: Join the output curves.
trim:
Trim copies of the input curves to the output fillet curve.
arcExtension:
Applies when arcs are filleted but need to be extended to meet the
fillet curve or chamfer line. If true, then the arc is extended
maintaining its validity. If false, then the arc is extended with a
line segment, which is joined to the arc converting it to a polycurve.
tolerance:
The tolerance, generally the document's absolute tolerance.
angleTolerance:
Returns:
The results of the fillet operation. The number of output curves depends
on the input curves and the values of the parameters that were used
during the fillet operation. In most cases, the output array will contain
either one or three curves, although two curves can be returned if the
radius is zero and join = false.
For example, if both join and trim = true, then the output curve
will be a polycurve containing the fillet curve joined with trimmed copies
of the input curves. If join = false and trim = true, then three curves,
the fillet curve and trimmed copies of the input curves, will be returned.
If both join and trim = false, then just the fillet curve is returned.
Since: 5.10

Rhino.Geometry.Curve.CreateBooleanUnion(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})
Calculates the boolean union of two or more closed, planar curves.
Note, curves must be co-planar.
curves: The co-planar curves to union.
Returns: Result curves on success, empty array if no union could be calculated.
Since: 5.0
6.0

Rhino.Geometry.Curve.CreateBooleanUnion(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Double)
Calculates the boolean union of two or more closed, planar curves.
Note, curves must be co-planar.
curves: The co-planar curves to union.
tolerance:
Returns: Result curves on success, empty array if no union could be calculated.
Since: 6.0

Rhino.Geometry.Curve.CreateBooleanIntersection(Rhino.Geometry.Curve,Rhino.Geometry.Curve)
Calculates the boolean intersection of two closed, planar curves.
Note, curves must be co-planar.
curveA: The first closed, planar curve.
curveB: The second closed, planar curve.
Returns: Result curves on success, empty array if no intersection could be calculated.
Since: 5.0
6.0

Rhino.Geometry.Curve.CreateBooleanIntersection(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double)
Calculates the boolean intersection of two closed, planar curves.
Note, curves must be co-planar.
curveA: The first closed, planar curve.
curveB: The second closed, planar curve.
tolerance:
Returns: Result curves on success, empty array if no intersection could be calculated.
Since: 6.0

Rhino.Geometry.Curve.CreateBooleanDifference(Rhino.Geometry.Curve,Rhino.Geometry.Curve)
Calculates the boolean difference between two closed, planar curves.
Note, curves must be co-planar.
curveA: The first closed, planar curve.
curveB: The second closed, planar curve.
Returns: Result curves on success, empty array if no difference could be calculated.
Since: 5.0
6.0

Rhino.Geometry.Curve.CreateBooleanDifference(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double)
Calculates the boolean difference between two closed, planar curves.
Note, curves must be co-planar.
curveA: The first closed, planar curve.
curveB: The second closed, planar curve.
tolerance:
Returns: Result curves on success, empty array if no difference could be calculated.
Since: 6.0

Rhino.Geometry.Curve.CreateBooleanDifference(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})
Calculates the boolean difference between a closed planar curve, and a list of closed planar curves.
Note, curves must be co-planar.
curveA: The first closed, planar curve.
subtractors: curves to subtract from the first closed curve.
Returns: Result curves on success, empty array if no difference could be calculated.
Since: 5.0
6.0

Rhino.Geometry.Curve.CreateBooleanDifference(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Double)
Calculates the boolean difference between a closed planar curve, and a list of closed planar curves.
Note, curves must be co-planar.
curveA: The first closed, planar curve.
subtractors: curves to subtract from the first closed curve.
tolerance:
Returns: Result curves on success, empty array if no difference could be calculated.
Since: 6.0

Rhino.Geometry.Curve.CreateBooleanRegions(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},Rhino.Geometry.Plane,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Boolean,System.Double)
Curve Boolean method, which trims and splits curves based on their overlapping regions.
curves: The input curves.
plane: Regions will be found in the projection of the curves to this plane.
points: These points will be projected to plane. All regions that contain at least one of these points will be found.
combineRegions: If true, then adjacent regions will be combined.
tolerance: Function tolerance. When in doubt, use the document's model absolute tolerance.
Returns: The curve Boolean regions if successful, null of no successful.
Since: 7.0

Rhino.Geometry.Curve.CreateBooleanRegions(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},Rhino.Geometry.Plane,System.Boolean,System.Double)
Calculates curve Boolean regions, which trims and splits curves based on their overlapping regions.
curves: The input curves.
plane: Regions will be found in the projection of the curves to this plane.
combineRegions: If true, then adjacent regions will be combined.
tolerance: Function tolerance. When in doubt, use the document's model absolute tolerance.
Returns: The curve Boolean regions if successful, null of no successful.
Since: 7.0

Rhino.Geometry.Curve.CreateTextOutlines(System.String,System.String,System.Double,System.Int32,System.Boolean,Rhino.Geometry.Plane,System.Double,System.Double)
Creates outline curves created from a text string. The functionality is similar to what you find in Rhino's TextObject command or TextEntity.Explode() in RhinoCommon.
text: The text from which to create outline curves.
font: The text font. If the font does not exist on the system. Rhino will use a substitute with similar properties.
textHeight: The text height.
textStyle: The font style. The font style can be any number of the following: 0 - Normal, 1 - Bold, 2 - Italic
closeLoops: Set this value to True when dealing with normal fonts and when you expect closed loops. You may want to set this to False when specifying a single-stroke font where you don't want closed loops.
plane: The plane on which the outline curves will lie.
smallCapsScale: Displays lower-case letters as small caps. Set the relative text size to a percentage of the normal text.
tolerance: The tolerance for the operation.
Returns: An array containing one or more curves if successful.
Since: 6.0

Rhino.Geometry.Curve.CreateCurve2View(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,System.Double,System.Double)
Creates a third curve from two curves that are planar in different construction planes.
The new curve looks the same as each of the original curves when viewed in each plane.
curveA: The first curve.
curveB: The second curve.
vectorA: A vector defining the normal direction of the plane which the first curve is drawn upon.
vectorB: A vector defining the normal direction of the plane which the second curve is drawn upon.
tolerance: The tolerance for the operation.
angleTolerance: The angle tolerance for the operation.
Returns: An array containing one or more curves if successful.
Since: 6.0

Rhino.Geometry.Curve.CreateRevisionCloud(Rhino.Geometry.Curve,System.Int32,System.Double,System.Boolean)
Creates a revision cloud curve from a planar curve.
curve: The input planar curve.
segmentCount:
The number of segments in the output revision cloud curve.
If zero, the number of segments in the output revision cloud curve is based on the NURB form of the input curve.
angle:
The angle in radians, between PI/2.0 and PI radians (90 and 180 degrees).
This angle indicates the amount of bulge in the segments.
flip: The arc segments in output revision cloud curve will be in the opposite direction to the input curve.
Returns: A revision cloud curve is successful, false otherwise.
Since: 8.4

Rhino.Geometry.Curve.CreateRevisionCloud(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Double,System.Boolean)
Creates a revision cloud curve from points that make up a planar polyline.
points: The input points.
angle:
The angle in radians, between PI/2.0 and PI radians (90 and 180 degrees).
This angle indicates the amount of bulge in the segments.
flip: The arc segments in output revision cloud curve will be in the opposite direction to the input curve.
Returns: A revision cloud curve is successful, false otherwise.
Since: 8.4

Rhino.Geometry.Curve.DoDirectionsMatch(Rhino.Geometry.Curve,Rhino.Geometry.Curve)
Determines whether two curves travel more or less in the same direction.
curveA: First curve to test.
curveB: Second curve to test.
Returns: true if both curves more or less point in the same direction,
false if they point in the opposite directions.
Since: 5.0

Rhino.Geometry.Curve.ProjectToMesh(Rhino.Geometry.Curve,Rhino.Geometry.Mesh,Rhino.Geometry.Vector3d,System.Double)
Projects a curve to a mesh using a direction and tolerance.
curve: A curve.
mesh: A mesh.
direction: A direction vector.
tolerance: A tolerance value.
Returns: An array of curves if successful, an empty array otherwise.
Since: 5.0

Rhino.Geometry.Curve.ProjectToMesh(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Geometry.Vector3d,System.Double)
Projects a curve to a set of meshes using a direction and tolerance.
curve: A curve.
meshes: A list, an array, or any enumerable of meshes.
direction: A direction vector.
tolerance: A tolerance value.
Returns: An array of curves if successful, an empty array otherwise.
Since: 5.0

Rhino.Geometry.Curve.ProjectToMesh(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Geometry.Vector3d,System.Double)
Projects a curve to a set of meshes using a direction and tolerance.
curves: A list, an array, or any enumerable of curves.
meshes: A list, an array, or any enumerable of meshes.
direction: A direction vector.
tolerance: A tolerance value.
Returns: An array of curves if successful, an empty array otherwise.
Since: 5.0

Rhino.Geometry.Curve.ProjectToMesh(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Geometry.Vector3d,System.Double,System.Boolean)
Projects a curve to a set of meshes using a direction and tolerance.
curves: A list, an array, or any enumerable of curves.
meshes: A list, an array, or any enumerable of meshes.
direction: A direction vector.
tolerance: A tolerance value.
loose: If true, then project curve edit points onto meshes.
Returns: An array of curves if successful, an empty array otherwise.
Since: 8.17

Rhino.Geometry.Curve.ProjectToBrep(Rhino.Geometry.Curve,Rhino.Geometry.Brep,Rhino.Geometry.Vector3d,System.Double)
Projects a Curve onto a Brep along a given direction.
curve: Curve to project.
brep: Brep to project onto.
direction: Direction of projection.
tolerance: Tolerance to use for projection.
Returns: An array of projected curves or empty array if the projection set is empty.
Since: 5.0

Rhino.Geometry.Curve.ProjectToBrep(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},Rhino.Geometry.Vector3d,System.Double)
Projects a Curve onto a collection of Breps along a given direction.
curve: Curve to project.
breps: Breps to project onto.
direction: Direction of projection.
tolerance: Tolerance to use for projection.
Returns: An array of projected curves or empty array if the projection set is empty.
Since: 5.0

Rhino.Geometry.Curve.ProjectToBrep(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},Rhino.Geometry.Vector3d,System.Double,System.Int32[]@)
Projects a Curve onto a collection of Breps along a given direction.
curve: Curve to project.
breps: Breps to project onto.
direction: Direction of projection.
tolerance: Tolerance to use for projection.
brepIndices: (out) Integers that identify for each resulting curve which Brep it was projected onto.
Returns: An array of projected curves or null if the projection set is empty.
Since: 5.0

Rhino.Geometry.Curve.ProjectToBrep(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},Rhino.Geometry.Vector3d,System.Double)
Projects a collection of Curves onto a collection of Breps along a given direction.
curves: Curves to project.
breps: Breps to project onto.
direction: Direction of projection.
tolerance: Tolerance to use for projection.
Returns: An array of projected curves or empty array if the projection set is empty.
Since: 5.0

Rhino.Geometry.Curve.ProjectToBrep(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},Rhino.Geometry.Vector3d,System.Double,System.Int32[]@,System.Int32[]@)
Projects a collection of Curves onto a collection of Breps along a given direction.
curves: Curves to project.
breps: Breps to project onto.
direction: Direction of projection.
tolerance: Tolerance to use for projection.
curveIndices: Index of which curve in the input list was the source for a curve in the return array.
brepIndices: Index of which brep was used to generate a curve in the return array.
Returns: An array of projected curves. Array is empty if the projection set is empty.
Since: 5.0

Rhino.Geometry.Curve.ProjectToBrep(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{Rhino.Geometry.Brep},Rhino.Geometry.Vector3d,System.Double,System.Boolean,System.Int32[]@,System.Int32[]@)
Projects a collection of Curves onto a collection of Breps along a given direction.
curves: Curves to project.
breps: Breps to project onto.
direction: Direction of projection.
tolerance: Tolerance to use for projection.
loose:
If true, then project curve edit points onto Brep surfaces.
curveIndices: Index of which curve in the input list was the source for a curve in the return array.
brepIndices: Index of which brep was used to generate a curve in the return array.
Returns: An array of projected curves. Array is empty if the projection set is empty.
Since: 8.17

Rhino.Geometry.Curve.ProjectToPlane(Rhino.Geometry.Curve,Rhino.Geometry.Plane)
Constructs a curve by projecting an existing curve to a plane.
curve: A curve.
plane: A plane.
Returns: The projected curve on success; null on failure.
Since: 5.0

Rhino.Geometry.Curve.PullToBrepFace(Rhino.Geometry.Curve,Rhino.Geometry.BrepFace,System.Double)
Pull a curve to a BrepFace using closest point projection.
curve: Curve to pull.
face: Brep face that pulls.
tolerance: Tolerance to use for pulling.
Returns: An array of pulled curves, or an empty array on failure.
Since: 5.0

Rhino.Geometry.Curve.PullToBrepFace(Rhino.Geometry.Curve,Rhino.Geometry.BrepFace,System.Double,System.Boolean)
Pull a curve to a BrepFace using closest point projection.
curve: Curve to pull.
face: Brep face that pulls.
tolerance: Tolerance to use for pulling.
loose:
If true, the curve's edit points are pulled back to the Brep face's underlying surface.
If any edit point misses the surface, the curve will not be created.
Returns: An array of pulled curves, or an empty array on failure.
Since: 8.17

Rhino.Geometry.Curve.GetDistancesBetweenCurves(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double@,System.Double@,System.Double@,System.Double@,System.Double@,System.Double@)
Calculates the minimum and maximum distances between two curves.
This function is useful for computing curve deviation.
If you are not computing curve deviation, use Rhino.Geometry.Curve.ClosestPoints(Rhino.Geometry.Curve,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@).
curveA: A curve.
curveB: Another curve.
tolerance: A tolerance value.
maxDistance: The maximum distance value. This is an out reference argument.
maxDistanceParameterA: The maximum distance parameter on curve A. This is an out reference argument.
maxDistanceParameterB: The maximum distance parameter on curve B. This is an out reference argument.
minDistance: The minimum distance value. This is an out reference argument.
minDistanceParameterA: The minimum distance parameter on curve A. This is an out reference argument.
minDistanceParameterB: The minimum distance parameter on curve B. This is an out reference argument.
Returns: true if the operation succeeded; otherwise false.
Since: 5.0

Rhino.Geometry.Curve.PlanarClosedCurveRelationship(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Plane,System.Double)
Determines whether two coplanar simple closed curves are disjoint or intersect;
otherwise, if the regions have a containment relationship, discovers
which curve encloses the other.
curveA: A first curve.
curveB: A second curve.
testPlane: A plane.
tolerance: A tolerance value.
Returns:
A value indicating the relationship between the first and the second curve.
Since: 5.0

Rhino.Geometry.Curve.PlanarCurveCollision(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Plane,System.Double)
Determines if two coplanar curves collide (intersect).
curveA: A curve.
curveB: Another curve.
testPlane: A valid plane containing the curves.
tolerance: A tolerance value for intersection.
Returns: true if the curves intersect, otherwise false
Since: 5.0

Rhino.Geometry.Curve.#ctor
Protected constructor for internal use.

Rhino.Geometry.Curve.Duplicate
Constructs an exact duplicate of this Curve.
Rhino.Geometry.Curve.DuplicateCurve
Since: 5.0

Rhino.Geometry.Curve.DuplicateCurve
Constructs an exact duplicate of this curve.
Returns: An exact copy of this curve.
Since: 5.0

Rhino.Geometry.Curve.Repair(System.Double)
Repairs a curve.
tolerance: The repair tolerance.
Returns: true if successful, false otherwise.
Since: 8.12

Rhino.Geometry.Curve.FindLocalInflection(Rhino.Geometry.Vector3d,Rhino.Geometry.Interval,System.Double,System.Double@,System.Double@)
Local minimization for point on a curve with tangent perpendicular to N.
N:
This vector and the curve tangent define a plane. In this plane, there is a vector V perpendicular to the tangent.
subDomain:
Subdomain of curve to evaluate. This must not be empty.
seed:
A seed parameter, which must be included in the subdomain.
curveParameter: The parameter on the curve if successful, RhinoMath.UnsetValue if unsuccessful.
angleError:
The measure, in radians, of the angle between N and V. The angle will be zero when the result is an inflection.
Returns: true if the minimization succeeds, regardless of angle_error, false if unsuccessful.
Remarks:
The algorithm minimizes the square of the dot product of N with the curve tangent.
It is possible that the result will not be close to zero.
Since: 8.0

Rhino.Geometry.Curve.DuplicateSegments
Duplicates curve segments.
Explodes polylines, polycurves and G1 discontinuous NURBS curves.
Single segment curves, such as lines, arcs, unkinked NURBS curves, are duplicated.
Returns:
An array of all the segments that make up this curve.
Since: 5.0
Remarks:
Unlike Rhino.Geometry.Curve.GetSubCurves, this method produces results based on the curve's data structure.

Rhino.Geometry.Curve.GetSubCurves
Gets subcurves from a curve.
The results will be similar to what is produced by Rhino's Explode command.
Returns:
An array of subcurves that make up this curve.
Since: 8.0
Remarks:
Unlike Rhino.Geometry.Curve.DuplicateSegments, this method produces results based on the curve's geometry.

Rhino.Geometry.Curve.Smooth(System.Double,System.Boolean,System.Boolean,System.Boolean,System.Boolean,Rhino.Geometry.SmoothingCoordinateSystem)
Smooths a curve by averaging the positions of control points in a specified region.
smoothFactor:
The smoothing factor, which controls how much control
points move towards the average of the neighboring control points.
Note that this smoothFactor is equivalent to twice the smooth factor used in
the Smooth command: on a polyline, Rhino _Smooth with a factor of 0.2 is the
same as Rhino.Geometry.Polyline.Smooth(System.Double) with a factor of 0.4.
bXSmooth: When true control points move in X axis direction.
bYSmooth: When true control points move in Y axis direction.
bZSmooth: When true control points move in Z axis direction.
bFixBoundaries: When true the curve ends don't move.
coordinateSystem: The coordinates to determine the direction of the smoothing.
Returns: The smoothed curve if successful, null otherwise.
Since: 6.0

Rhino.Geometry.Curve.Smooth(System.Double,System.Boolean,System.Boolean,System.Boolean,System.Boolean,Rhino.Geometry.SmoothingCoordinateSystem,Rhino.Geometry.Plane)
Smooths a curve by averaging the positions of control points in a specified region.
smoothFactor:
The smoothing factor, which controls how much control
points move towards the average of the neighboring control points.
Note that this smoothFactor is equivalent to twice the smooth factor used in
the Smooth command: on a polyline, Rhino _Smooth with a factor of 0.2 is the
same as Rhino.Geometry.Polyline.Smooth(System.Double) with a factor of 0.4.
bXSmooth: When true control points move in X axis direction.
bYSmooth: When true control points move in Y axis direction.
bZSmooth: When true control points move in Z axis direction.
bFixBoundaries: When true the curve ends don't move.
coordinateSystem: The coordinates to determine the direction of the smoothing.
plane: If SmoothingCoordinateSystem.CPlane specified, then the construction plane.
Returns: The smoothed curve if successful, null otherwise.
Since: 6.0

Rhino.Geometry.Curve.GetLocalPerpPoint(Rhino.Geometry.Point3d,System.Double,System.Double@)
Search for a location on the curve, near seedParmameter, that is perpendicular to a test point.
testPoint: The test point.
seedParmameter: A "seed" parameter on the curve.
curveParameter: The parameter value at the perpendicular point
Returns: True if a solution is found, false otherwise.
Since: 6.0

Rhino.Geometry.Curve.GetLocalPerpPoint(Rhino.Geometry.Point3d,System.Double,Rhino.Geometry.Interval,System.Double@)
Search for a location on the curve, near seedParmameter, that is perpendicular to a test point.
testPoint: The test point.
seedParmameter: A "seed" parameter on the curve.
subDomain: The sub-domain of the curve to search.
curveParameter: The parameter value at the perpendicular point
Returns: True if a solution is found, false otherwise.
Since: 6.0

Rhino.Geometry.Curve.GetLocalTangentPoint(Rhino.Geometry.Point3d,System.Double,System.Double@)
Search for a location on the curve, near seedParmameter, that is tangent to a test point.
testPoint: The test point.
seedParmameter: A "seed" parameter on the curve.
curveParameter: The parameter value at the tangent point
Returns: True if a solution is found, false otherwise.
Since: 6.0

Rhino.Geometry.Curve.GetLocalTangentPoint(Rhino.Geometry.Point3d,System.Double,Rhino.Geometry.Interval,System.Double@)
Search for a location on the curve, near seedParmameter, that is tangent to a test point.
testPoint: The test point.
seedParmameter: A "seed" parameter on the curve.
subDomain: The sub-domain of the curve to search.
curveParameter: The parameter value at the tangent point
Returns: True if a solution is found, false otherwise.
Since: 6.0

Rhino.Geometry.Curve.IsSubDFriendly
Returns true if the curve is a cubic, non-rational, uniform NURBS curve that is either periodic or has natural end conditions.
Otherwise, false is returned.
Remarks:
A "natural" spline has zero 2nd derivatives (and hence zero curvature) at the start and end.
A "periodic" spline has unclampled periodic knots and periodic control points.
Since: 7.0

Rhino.Geometry.Curve.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.Geometry.Curve.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected serialization constructor for internal use.
info: Serialization data.
context: Serialization stream.

Rhino.Geometry.Curve.NonConstOperation
For derived classes implementers.
Defines the necessary implementation to free the instance from being constant.

Rhino.Geometry.Curve.Domain
Gets or sets the domain of the curve.
Since: 5.0

Rhino.Geometry.Curve.Dimension
Gets the dimension of the object.
The dimension is typically three. For parameter space trimming
curves the dimension is two. In rare cases the dimension can
be one or greater than three.
Since: 5.0

Rhino.Geometry.Curve.ChangeDimension(System.Int32)
Changes the dimension of a curve.
desiredDimension: The desired dimension.
Returns:
true if the curve's dimension was already desiredDimension
or if the curve's dimension was successfully changed to desiredDimension;
otherwise false.
Since: 5.0

Rhino.Geometry.Curve.SpanCount
Gets the number of non-empty smooth (c-infinity) spans in the curve.
Since: 5.0

Rhino.Geometry.Curve.Degree
Gets the maximum algebraic degree of any span
or a good estimate if curve spans are not algebraic.
Since: 5.0

Rhino.Geometry.Curve.IsLinear
Test a curve to see if it is linear to within RhinoMath.ZeroTolerance units (1e-12).
Returns: true if the curve is linear.
Since: 5.0

Rhino.Geometry.Curve.IsLinear(System.Double)
Test a curve to see if it is linear to within the custom tolerance.
tolerance: Tolerance to use when checking linearity.
Returns:
true if the ends of the curve are farther than tolerance apart
and the maximum distance from any point on the curve to
the line segment connecting the curve ends is <= tolerance.
Since: 5.0

Rhino.Geometry.Curve.IsPolyline
Several types of Curve can have the form of a polyline
including a degree 1 NurbsCurve, a PolylineCurve,
and a PolyCurve all of whose segments are some form of
polyline. IsPolyline tests a curve to see if it can be
represented as a polyline.
Returns: true if this curve can be represented as a polyline; otherwise, false.
Since: 5.0

Rhino.Geometry.Curve.TryGetPolyline(Rhino.Geometry.Polyline@)
Several types of Curve can have the form of a polyline
including a degree 1 NurbsCurve, a PolylineCurve,
and a PolyCurve all of whose segments are some form of
polyline. IsPolyline tests a curve to see if it can be
represented as a polyline.
polyline:
If true is returned, then the polyline form is returned here.
Returns: true if this curve can be represented as a polyline; otherwise, false.
Since: 5.0

Rhino.Geometry.Curve.TryGetPolyline(Rhino.Geometry.Polyline@,System.Double[]@)
Several types of Curve can have the form of a polyline
including a degree 1 NurbsCurve, a PolylineCurve,
and a PolyCurve all of whose segments are some form of
polyline. IsPolyline tests a curve to see if it can be
represented as a polyline.
polyline:
If true is returned, then the polyline form is returned here.
parameters:
if true is returned, then the parameters of the polyline
points are returned here.
Returns: true if this curve can be represented as a polyline; otherwise, false.
Since: 5.0

Rhino.Geometry.Curve.IsArc
Test a curve to see if it can be represented by an arc or circle within RhinoMath.ZeroTolerance.
Returns:
true if the curve can be represented by an arc or a circle within tolerance.
Since: 5.0

Rhino.Geometry.Curve.IsArc(System.Double)
Test a curve to see if it can be represented by an arc or circle within the given tolerance.
tolerance: Tolerance to use when checking.
Returns:
true if the curve can be represented by an arc or a circle within tolerance.
Since: 5.0

Rhino.Geometry.Curve.TryGetArc(Rhino.Geometry.Arc@)
Try to convert this curve into an Arc using RhinoMath.ZeroTolerance.
arc: On success, the Arc will be filled in.
Returns: true if the curve could be converted into an arc.
Since: 5.0

Rhino.Geometry.Curve.TryGetArc(Rhino.Geometry.Arc@,System.Double)
Try to convert this curve into an Arc using a custom tolerance.
arc: On success, the Arc will be filled in.
tolerance: Tolerance to use when checking.
Returns: true if the curve could be converted into an arc.
Since: 5.0

Rhino.Geometry.Curve.TryGetArc(Rhino.Geometry.Plane,Rhino.Geometry.Arc@)
Try to convert this curve into an Arc using RhinoMath.ZeroTolerance.
plane: Plane in which the comparison is performed.
arc: On success, the Arc will be filled in.
Returns: true if the curve could be converted into an arc within the given plane.
Since: 5.0

Rhino.Geometry.Curve.TryGetArc(Rhino.Geometry.Plane,Rhino.Geometry.Arc@,System.Double)
Try to convert this curve into an Arc using a custom tolerance.
plane: Plane in which the comparison is performed.
arc: On success, the Arc will be filled in.
tolerance: Tolerance to use when checking.
Returns: true if the curve could be converted into an arc within the given plane.
Since: 5.0

Rhino.Geometry.Curve.IsCircle
Test a curve to see if it can be represented by a circle within RhinoMath.ZeroTolerance.
Returns:
true if the Curve can be represented by a circle within tolerance.
Since: 5.0

Rhino.Geometry.Curve.IsCircle(System.Double)
Test a curve to see if it can be represented by a circle within the given tolerance.
tolerance: Tolerance to use when checking.
Returns:
true if the curve can be represented by a circle to within tolerance.
Since: 5.0

Rhino.Geometry.Curve.TryGetCircle(Rhino.Geometry.Circle@)
Try to convert this curve into a circle using RhinoMath.ZeroTolerance.
circle: On success, the Circle will be filled in.
Returns: true if the curve could be converted into a Circle.
Since: 5.0

Rhino.Geometry.Curve.TryGetCircle(Rhino.Geometry.Circle@,System.Double)
Try to convert this curve into a Circle using a custom tolerance.
circle: On success, the Circle will be filled in.
tolerance: Tolerance to use when checking.
Returns: true if the curve could be converted into a Circle within tolerance.
Since: 5.0

Rhino.Geometry.Curve.IsEllipse
Test a curve to see if it can be represented by an ellipse within RhinoMath.ZeroTolerance.
Returns:
true if the Curve can be represented by an ellipse within tolerance.
Since: 5.0

Rhino.Geometry.Curve.IsEllipse(System.Double)
Test a curve to see if it can be represented by an ellipse within a given tolerance.
tolerance: Tolerance to use for checking.
Returns:
true if the Curve can be represented by an ellipse within tolerance.
Since: 5.0

Rhino.Geometry.Curve.TryGetEllipse(Rhino.Geometry.Ellipse@)
Try to convert this curve into an Ellipse within RhinoMath.ZeroTolerance.
ellipse: On success, the Ellipse will be filled in.
Returns: true if the curve could be converted into an Ellipse.
Since: 5.0

Rhino.Geometry.Curve.TryGetEllipse(Rhino.Geometry.Ellipse@,System.Double)
Try to convert this curve into an Ellipse using a custom tolerance.
ellipse: On success, the Ellipse will be filled in.
tolerance: Tolerance to use when checking.
Returns: true if the curve could be converted into an Ellipse.
Since: 5.0

Rhino.Geometry.Curve.TryGetEllipse(Rhino.Geometry.Plane,Rhino.Geometry.Ellipse@)
Try to convert this curve into an Ellipse within RhinoMath.ZeroTolerance.
plane: Plane in which the comparison is performed.
ellipse: On success, the Ellipse will be filled in.
Returns: true if the curve could be converted into an Ellipse within the given plane.
Since: 5.0

Rhino.Geometry.Curve.TryGetEllipse(Rhino.Geometry.Plane,Rhino.Geometry.Ellipse@,System.Double)
Try to convert this curve into an Ellipse using a custom tolerance.
plane: Plane in which the comparison is performed.
ellipse: On success, the Ellipse will be filled in.
tolerance: Tolerance to use when checking.
Returns: true if the curve could be converted into an Ellipse within the given plane.
Since: 5.0

Rhino.Geometry.Curve.IsPlanar
Test a curve for planarity.
Returns:
true if the curve is planar (flat) to within RhinoMath.ZeroTolerance units (1e-12).
Since: 5.0

Rhino.Geometry.Curve.IsPlanar(System.Double)
Test a curve for planarity.
tolerance: Tolerance to use when checking.
Returns:
true if there is a plane such that the maximum distance from the curve to the plane is <= tolerance.
Since: 5.0

Rhino.Geometry.Curve.TryGetPlane(Rhino.Geometry.Plane@)
Test a curve for planarity and return the plane.
plane: On success, the plane parameters are filled in.
Returns:
true if there is a plane such that the maximum distance from the curve to the plane is <= RhinoMath.ZeroTolerance.
Since: 5.0

Rhino.Geometry.Curve.TryGetPlane(Rhino.Geometry.Plane@,System.Double)
Test a curve for planarity and return the plane.
plane: On success, the plane parameters are filled in.
tolerance: Tolerance to use when checking.
Returns:
true if there is a plane such that the maximum distance from the curve to the plane is <= tolerance.
Since: 5.0

Rhino.Geometry.Curve.IsInPlane(Rhino.Geometry.Plane)
Test a curve to see if it lies in a specific plane.
testPlane: Plane to test for.
Returns:
true if the maximum distance from the curve to the testPlane is <= RhinoMath.ZeroTolerance.
Since: 5.0

Rhino.Geometry.Curve.IsInPlane(Rhino.Geometry.Plane,System.Double)
Test a curve to see if it lies in a specific plane.
testPlane: Plane to test for.
tolerance: Tolerance to use when checking.
Returns:
true if the maximum distance from the curve to the testPlane is <= tolerance.
Since: 5.0

Rhino.Geometry.Curve.ChangeClosedCurveSeam(System.Double)
If this curve is closed, then modify it so that the start/end point is at curve parameter t.
t:
Curve parameter of new start/end point. The returned curves domain will start at t.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Curve.IsClosed
Gets a value indicating whether or not this curve is a closed curve.
Since: 5.0

Rhino.Geometry.Curve.IsPeriodic
Gets a value indicating whether or not this curve is considered to be Periodic.
Since: 5.0

Rhino.Geometry.Curve.IsClosable(System.Double)
Decide if it makes sense to close off this curve by moving the endpoint
to the start based on start-end gap size and length of curve as
approximated by chord defined by 6 points.
tolerance:
Maximum allowable distance between start and end.
If start - end gap is greater than tolerance, this function will return false.
Returns: true if start and end points are close enough based on above conditions.
Since: 5.0

Rhino.Geometry.Curve.IsClosable(System.Double,System.Double,System.Double)
Decide if it makes sense to close off this curve by moving the endpoint
to the start based on start-end gap size and length of curve as
approximated by chord defined by 6 points.
tolerance:
Maximum allowable distance between start and end.
If start - end gap is greater than tolerance, this function will return false.
minimumAbsoluteSize:
If greater than 0.0 and none of the interior sampled points are at
least minimumAbsoluteSize from start, this function will return false.
minimumRelativeSize:
If greater than 1.0 and chord length is less than
minimumRelativeSize*gap, this function will return false.
Returns: true if start and end points are close enough based on above conditions.
Since: 5.0

Rhino.Geometry.Curve.InflectionPoints
Returns a curve's inflection points. An inflection point is a location on
a curve at which the sign of the curvature (i.e., the concavity) changes.
The curvature at these locations is always 0.
Returns: An array of points if successful, null if not successful or on error.
Since: 7.0

Rhino.Geometry.Curve.InflectionPoints(System.Double[]@)
Returns a curve's inflection points. An inflection point is a location on
a curve at which the sign of the curvature (i.e., the concavity) changes.
The curvature at these locations is always 0.
curveParameters: An array of curve parameters at the inflection points.
Returns: An array of points if successful, null if not successful or on error.
Since: 8.4

Rhino.Geometry.Curve.MaxCurvaturePoints
Returns a curve's maximum curvature points. The maximum curvature points identify
where the curvature starts to decrease in both directions from the points.
Returns: An array of points if successful, null if not successful or on error.
Since: 7.0

Rhino.Geometry.Curve.MaxCurvaturePoints(System.Double[]@)
Returns a curve's maximum curvature points. The maximum curvature points identify
where the curvature starts to decrease in both directions from the points.
curveParameters: An array of curve parameters at the maximum curvature points.
Returns: An array of points if successful, null if not successful or on error.
Since: 8.4

Rhino.Geometry.Curve.MakeClosed(System.Double)
If IsClosed, just return true. Otherwise, decide if curve can be closed as
follows: Linear curves polylinear curves with 2 segments, NURBS with 3 or less
control points cannot be made closed. Also, if tolerance > 0 and the gap between
start and end is larger than tolerance, curve cannot be made closed.
Adjust the curve's endpoint to match its start point.
tolerance:
If nonzero, and the gap is more than tolerance, curve cannot be made closed.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Curve.CombineShortSegments(System.Double)
Looks for segments that are shorter than tolerance that can be combined.
For NURBS of degree greater than 1, spans are combined by removing
knots. Similarly for NURBS segments of polycurves. Otherwise,
RemoveShortSegments() is called. Does not change the domain, but it will
change the relative parameterization.
tolerance:
Returns:
True if short segments were combined or removed. False otherwise.
Since: 7.8

Rhino.Geometry.Curve.ClosedCurveOrientation
Determines the orientation (counterclockwise or clockwise) of a closed, planar curve in the world XY plane.
Only works with simple (no self intersections) closed, planar curves.
Returns: The orientation of this curve with respect to world XY plane.
Since: 6.0

Rhino.Geometry.Curve.ClosedCurveOrientation(Rhino.Geometry.Vector3d)
Determines the orientation (counterclockwise or clockwise) of a closed, planar curve in a given plane.
Only works with simple (no self intersections) closed, planar curves.
upDirection: A vector that is considered "up".
Returns: The orientation of this curve with respect to a defined up direction.
Since: 5.0

Rhino.Geometry.Curve.ClosedCurveOrientation(Rhino.Geometry.Plane)
Determines the orientation (counterclockwise or clockwise) of a closed, planar curve in a given plane.
Only works with simple (no self intersections) closed, planar curves.
plane:
The plane in which to solve the orientation.
Returns: The orientation of this curve in the given plane.
Since: 5.0

Rhino.Geometry.Curve.ClosedCurveOrientation(Rhino.Geometry.Transform)
Determines the orientation (counterclockwise or clockwise) of a closed, planar curve.
Only works with simple (no self intersections) closed, planar curves.
xform:
Transformation to map the curve to the world XY plane.
Returns: The orientation of this curve in the world XY-plane.
Since: 5.0

Rhino.Geometry.Curve.Reverse
Reverses the direction of the curve.
Returns: true on success, false on failure.
Remarks: If reversed, the domain changes from [a,b] to [-b,-a]
Since: 5.0

Rhino.Geometry.Curve.LcoalClosestPoint(Rhino.Geometry.Point3d,System.Double,System.Double@)
Find parameter of the point on a curve that is locally closest to
the testPoint.  The search for a local close point starts at
a seed parameter.
testPoint: A point to test against.
seed: The seed parameter.
t: >Parameter of the curve that is closest to testPoint.
Returns: true if the search is successful, false if the search fails.
Since: 6.3
6.18

Rhino.Geometry.Curve.LocalClosestPoint(Rhino.Geometry.Point3d,System.Double,System.Double@)
Find parameter of the point on a curve that is locally closest to
the testPoint.  The search for a local close point starts at
a seed parameter.
testPoint: A point to test against.
seed: The seed parameter.
t: >Parameter of the curve that is closest to testPoint.
Returns: true if the search is successful, false if the search fails.
Since: 6.18

Rhino.Geometry.Curve.ClosestPoint(Rhino.Geometry.Point3d,System.Double@)
Finds parameter of the point on a curve that is closest to testPoint.
If the maximumDistance parameter is > 0, then only points whose distance
to the given point is <= maximumDistance will be returned.  Using a
positive value of maximumDistance can substantially speed up the search.
testPoint: Point to search from.
t: Parameter of local closest point.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Curve.ClosestPoint(Rhino.Geometry.Point3d,System.Double@,System.Double)
Finds the parameter of the point on a curve that is closest to testPoint.
If the maximumDistance parameter is > 0, then only points whose distance
to the given point is <= maximumDistance will be returned.  Using a
positive value of maximumDistance can substantially speed up the search.
testPoint: Point to project.
t: parameter of local closest point returned here.
maximumDistance: The maximum allowed distance.
Past this distance, the search is given up and false is returned.
Use 0 to turn off this parameter.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Curve.ClosestPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,System.Int32@,System.Double)
Finds the object (and the closest point in that object) that is closest to
this curve. Breps, surfaces,
curves and point clouds are examples of
objects that can be passed to this function.
geometry: A list, an array or any enumerable set of geometry to search.
pointOnCurve: The point on curve. This out parameter is assigned during this call.
pointOnObject: The point on geometry. This out parameter is assigned during this call.
whichGeometry: The index of the geometry. This out parameter is assigned during this call.
maximumDistance: Maximum allowable distance. Past this distance, the research is given up and false is returned.
Returns: true on success; false if no object was found or selected.
Throws System.ArgumentNullException: If geometry is null.
Since: 5.0

Rhino.Geometry.Curve.ClosestPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,System.Int32@)
Finds the object (and the closest point in that object) that is closest to
this curve. Breps, surfaces,
curves and point clouds are examples of
objects that can be passed to this function.
geometry: A list, an array or any enumerable set of geometry to search.
pointOnCurve: The point on curve. This out parameter is assigned during this call.
pointOnObject: The point on geometry. This out parameter is assigned during this call.
whichGeometry: The index of the geometry. This out parameter is assigned during this call.
Returns: true on success; false if no object was found or selected.
Throws System.ArgumentNullException: If geometry is null.
Since: 5.0

Rhino.Geometry.Curve.ClosestPoints(Rhino.Geometry.Curve,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)
Gets closest points between this and another curves.
otherCurve: The other curve.
pointOnThisCurve: The point on this curve. This out parameter is assigned during this call.
pointOnOtherCurve: The point on other curve. This out parameter is assigned during this call.
Returns: true on success; false on error.
Since: 5.0

Rhino.Geometry.Curve.Contains(Rhino.Geometry.Point3d)
Computes the relationship between a point and a closed curve region.
This curve must be closed or the return value will be Unset.
Both curve and point are projected to the World XY plane.
testPoint: Point to test.
Returns: Relationship between point and curve region.
Since: 5.0
6.0

Rhino.Geometry.Curve.Contains(Rhino.Geometry.Point3d,Rhino.Geometry.Plane)
Computes the relationship between a point and a closed curve region.
This curve must be closed or the return value will be Unset.
testPoint: Point to test.
plane: Plane in which to compare point and region.
Returns: Relationship between point and curve region.
Since: 5.0
6.0

Rhino.Geometry.Curve.Contains(Rhino.Geometry.Point3d,Rhino.Geometry.Plane,System.Double)
Computes the relationship between a point and a closed curve region.
This curve must be closed or the return value will be Unset.
testPoint: Point to test.
plane: Plane in which to compare point and region.
tolerance: Tolerance to use during comparison.
Returns: Relationship between point and curve region.
Since: 5.0

Rhino.Geometry.Curve.ExtremeParameters(Rhino.Geometry.Vector3d)
Returns the parameter values of all local extrema.
Parameter values are in increasing order so consecutive extrema
define an interval on which each component of the curve is monotone.
Note, non-periodic curves always return the end points.
direction: The direction in which to perform the calculation.
Returns: The parameter values of all local extrema.
Since: 6.0

Rhino.Geometry.Curve.CreatePeriodicCurve(Rhino.Geometry.Curve)
Removes kinks from a curve. Periodic curves deform smoothly without kinks.
curve: The curve to make periodic. Curve must have degree >= 2.
Returns: The resulting curve if successful, null otherwise.
Since: 6.0

Rhino.Geometry.Curve.CreatePeriodicCurve(Rhino.Geometry.Curve,System.Boolean)
Removes kinks from a curve. Periodic curves deform smoothly without kinks.
curve: The curve to make periodic. Curve must have degree >= 2.
smooth:
If true, smooths any kinks in the curve and moves control points to make a smooth curve.
If false, control point locations are not changed or changed minimally (only one point may move) and only the knot vector is altered.
Returns: The resulting curve if successful, null otherwise.
Since: 6.0

Rhino.Geometry.Curve.PointAt(System.Double)
Evaluates point at a curve parameter.
t: Evaluation parameter.
Returns: Point (location of curve at the parameter t).
Remarks: No error handling.
Since: 5.0

Rhino.Geometry.Curve.PointAtStart
Evaluates point at the start of the curve.
Since: 5.0

Rhino.Geometry.Curve.PointAtEnd
Evaluates point at the end of the curve.
Since: 5.0

Rhino.Geometry.Curve.PointAtMid
Evaluates point at the middle, or mid, of the curve.
Since: 8.14

Rhino.Geometry.Curve.Reparameterize
Reparameterizes a curve using automatic parameterization.
Returns: The reparameterized curve if successful, null otherwise.
Remarks:
Poorly parameterized objects may not intersect and trim properly when combined with other objects.
"Poorly parameterized" means the curve's domain or the surface's u or v spaces are tiny or huge compared to the size of the object.
When curves are parameterized with a [0,1] domain, both the accuracy and the precision of geometric calculations like intersections and closest points are reduced, sometimes dramatically.
Ideally the domain of a curve is close to it's length.
Since: 8.14

Rhino.Geometry.Curve.PointAtLength(System.Double)
Gets a point at a certain length along the curve. The length must be
non-negative and less than or equal to the length of the curve.
Lengths will not be wrapped when the curve is closed or periodic.
length: Length along the curve between the start point and the returned point.
Returns: Point on the curve at the specified length from the start point or Poin3d.Unset on failure.
Since: 5.0

Rhino.Geometry.Curve.PointAtNormalizedLength(System.Double)
Gets a point at a certain normalized length along the curve. The length must be
between or including 0.0 and 1.0, where 0.0 equals the start of the curve and
1.0 equals the end of the curve.
length: Normalized length along the curve between the start point and the returned point.
Returns: Point on the curve at the specified normalized length from the start point or Poin3d.Unset on failure.
Since: 5.0

Rhino.Geometry.Curve.SetStartPoint(Rhino.Geometry.Point3d)
Forces the curve to start at a specified point.
Not all curve types support this operation.
point: New start point of curve.
Returns: true on success, false on failure.
Remarks: Some start points cannot be moved. Be sure to check return code.
Since: 5.0

Rhino.Geometry.Curve.SetEndPoint(Rhino.Geometry.Point3d)
Forces the curve to end at a specified point.
Not all curve types support this operation.
point: New end point of curve.
Returns: true on success, false on failure.
Remarks: Some end points cannot be moved. Be sure to check return code
Since: 5.0

Rhino.Geometry.Curve.TangentAt(System.Double)
Evaluates the unit tangent vector at a curve parameter.
t: Evaluation parameter.
Returns: Unit tangent vector of the curve at the parameter t.
Remarks: No error handling.
Since: 5.0

Rhino.Geometry.Curve.TangentAtStart
Evaluates the unit tangent vector at the start of the curve.
Returns: Unit tangent vector of the curve at the start point.
Remarks: No error handling.
Since: 5.0

Rhino.Geometry.Curve.TangentAtEnd
Evaluate unit tangent vector at the end of the curve.
Returns: Unit tangent vector of the curve at the end point.
Remarks: No error handling.
Since: 5.0

Rhino.Geometry.Curve.FrameAt(System.Double,Rhino.Geometry.Plane@)
Returns a 3d frame at a parameter.
t: Evaluation parameter.
plane: The frame is returned here.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Curve.DerivativeAt(System.Double,System.Int32)
Evaluate the derivatives at the specified curve parameter.
t: Curve parameter to evaluate.
derivativeCount: Number of derivatives to evaluate, must be at least 0.
Returns: An array of vectors that represents all the derivatives starting at zero.
Since: 5.0

Rhino.Geometry.Curve.DerivativeAt(System.Double,System.Int32,Rhino.Geometry.CurveEvaluationSide)
Evaluate the derivatives at the specified curve parameter.
t: Curve parameter to evaluate.
derivativeCount: Number of derivatives to evaluate, must be at least 0.
side: Side of parameter to evaluate. If the parameter is at a kink,
it makes a big difference whether the evaluation is from below or above.
Returns: An array of vectors that represents all the derivatives starting at zero.
Since: 5.0

Rhino.Geometry.Curve.CurvatureAt(System.Double)
Evaluate the curvature vector at a curve parameter.
t: Evaluation parameter.
Returns: Curvature vector of the curve at the parameter t.
Remarks: No error handling.
Since: 5.0

Rhino.Geometry.Curve.PerpendicularFrameAt(System.Double,Rhino.Geometry.Plane@)
Return a 3d frame at a parameter. This is slightly different than FrameAt in
that the frame is computed in a way so there is minimal rotation from one
frame to the next.
t: Evaluation parameter.
plane: The frame is returned here.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Curve.GetPerpendicularFrames(System.Collections.Generic.IEnumerable{System.Double})
Gets a collection of perpendicular frames along the curve. Perpendicular frames
are also known as 'Zero-twisting frames' and they minimize rotation from one frame to the next.
parameters: A collection of strictly increasing curve parameters to place perpendicular frames on.
Returns: An array of perpendicular frames on success or null on failure.
Throws System.InvalidOperationException: Thrown when the curve parameters are not increasing.
Since: 5.0

Rhino.Geometry.Curve.IsContinuous(Rhino.Geometry.Continuity,System.Double)
Test continuity at a curve parameter value.
continuityType: Type of continuity to test for.
t: Parameter to test.
Returns:
true if the curve has at least the c type continuity at the parameter t.
Since: 5.0

Rhino.Geometry.Curve.TorsionAt(System.Double)
Evaluate the torsion of a curve at a parameter. Sometimes also called the "second curvature",
torsion is the rate of change of a curve's osculating plane.
t: The evaluation parameter.
Returns: The torsion if successful.
Remarks: See Barrett O'Neill, Elementary Differential Geometry, page 69.
Since: 7.10

Rhino.Geometry.Curve.GetNextDiscontinuity(Rhino.Geometry.Continuity,System.Double,System.Double,System.Double@)
Searches for a derivative, tangent, or curvature discontinuity.
continuityType: Type of continuity to search for.
t0:
Search begins at t0. If there is a discontinuity at t0, it will be ignored. This makes it
possible to repeatedly call GetNextDiscontinuity() and step through the discontinuities.
t1:
(t0 != t1)  If there is a discontinuity at t1 it will be ignored unless continuityType is
a locus discontinuity type and t1 is at the start or end of the curve.
t: If a discontinuity is found, then t reports the parameter at the discontinuity.
Returns:
Parametric continuity tests c = (C0_continuous, ..., G2_continuous):
true if a parametric discontinuity was found strictly between t0 and t1. Note well that
all curves are parametrically continuous at the ends of their domains.
Locus continuity tests c = (C0_locus_continuous, ...,G2_locus_continuous):
true if a locus discontinuity was found strictly between t0 and t1 or at t1 is the at the end
of a curve. Note well that all open curves (IsClosed()=false) are locus discontinuous at the
ends of their domains.  All closed curves (IsClosed()=true) are at least C0_locus_continuous at
the ends of their domains.
Since: 5.0

Rhino.Geometry.Curve.GetNextDiscontinuity(Rhino.Geometry.Continuity,System.Double,System.Double,System.Double,System.Double,System.Double@)
Searches for a derivative, tangent, or curvature discontinuity.
continuityType: Type of continuity to search for.
t0:
Search begins at t0. If there is a discontinuity at t0, it will be ignored. This makes it
possible to repeatedly call GetNextDiscontinuity() and step through the discontinuities.
cosAngleTolerance:
default = cos(1 degree) Used only when continuity is G1_continuous or G2_continuous.
If the  cosine of the angle between two tangent vectors is <= cos_angle_tolerance,
then a G1 discontinuity is reported.
curvatureTolerance:
(default = ON_SQRT_EPSILON) Used only when continuity is G2_continuous. If K0 and K1
are curvatures evaluated from above and below and |K0 - K1| > curvature_tolerance,
then a curvature discontinuity is reported.
t1:
(t0 != t1)  If there is a discontinuity at t1 it will be ignored unless continuityType is
a locus discontinuity type and t1 is at the start or end of the curve.
t: If a discontinuity is found, then t reports the parameter at the discontinuity.
Returns:
Parametric continuity tests c = (C0_continuous, ..., G2_continuous):
true if a parametric discontinuity was found strictly between t0 and t1. Note well that
all curves are parametrically continuous at the ends of their domains.
Locus continuity tests c = (C0_locus_continuous, ...,G2_locus_continuous):
true if a locus discontinuity was found strictly between t0 and t1 or at t1 is the at the end
of a curve. Note well that all open curves (IsClosed()=false) are locus discontinuous at the
ends of their domains.  All closed curves (IsClosed()=true) are at least C0_locus_continuous at
the ends of their domains.
Since: 7.4

Rhino.Geometry.Curve.GetLength
Gets the length of the curve with a fractional tolerance of 1.0e-8.
Returns: The length of the curve on success, or zero on failure.
Since: 5.0

Rhino.Geometry.Curve.GetLength(System.Double)
Get the length of the curve.
fractionalTolerance:
Desired fractional precision.
fabs(("exact" length from start to t) - arc_length)/arc_length <= fractionalTolerance.
Returns: The length of the curve on success, or zero on failure.
Since: 5.0

Rhino.Geometry.Curve.GetLength(Rhino.Geometry.Interval)
Get the length of a sub-section of the curve with a fractional tolerance of 1e-8.
subdomain:
The calculation is performed on the specified sub-domain of the curve (must be non-decreasing).
Returns: The length of the sub-curve on success, or zero on failure.
Since: 5.0

Rhino.Geometry.Curve.GetLength(System.Double,Rhino.Geometry.Interval)
Get the length of a sub-section of the curve.
fractionalTolerance:
Desired fractional precision.
fabs(("exact" length from start to t) - arc_length)/arc_length <= fractionalTolerance.
subdomain:
The calculation is performed on the specified sub-domain of the curve (must be non-decreasing).
Returns: The length of the sub-curve on success, or zero on failure.
Since: 5.0

Rhino.Geometry.Curve.IsShort(System.Double)
Used to quickly find short curves.
tolerance: Length threshold value for "shortness".
Returns: true if the length of the curve is <= tolerance.
Remarks: Faster than calling Length() and testing the result.
Since: 5.0

Rhino.Geometry.Curve.IsShort(System.Double,Rhino.Geometry.Interval)
Used to quickly find short curves.
tolerance: Length threshold value for "shortness".
subdomain:
The test is performed on the interval that is the intersection of sub-domain with Domain()
Returns: true if the length of the curve is <= tolerance.
Remarks: Faster than calling Length() and testing the result.
Since: 5.0

Rhino.Geometry.Curve.RemoveShortSegments(System.Double)
Looks for segments that are shorter than tolerance that can be removed.
Does not change the domain, but it will change the relative parameterization.
tolerance: Tolerance which defines "short" segments.
Returns:
true if removable short segments were found.
false if no removable short segments were found.
Since: 5.0

Rhino.Geometry.Curve.LengthParameter(System.Double,System.Double@)
Gets the parameter along the curve which coincides with a given length along the curve.
A fractional tolerance of 1e-8 is used in this version of the function.
segmentLength:
Length of segment to measure. Must be less than or equal to the length of the curve.
t:
Parameter such that the length of the curve from the curve start point to t equals length.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Curve.LengthParameter(System.Double,System.Double@,System.Double)
Gets the parameter along the curve which coincides with a given length along the curve.
segmentLength:
Length of segment to measure. Must be less than or equal to the length of the curve.
t:
Parameter such that the length of the curve from the curve start point to t equals s.
fractionalTolerance:
Desired fractional precision.
fabs(("exact" length from start to t) - arc_length)/arc_length <= fractionalTolerance.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Curve.LengthParameter(System.Double,System.Double@,Rhino.Geometry.Interval)
Gets the parameter along the curve which coincides with a given length along the curve.
A fractional tolerance of 1e-8 is used in this version of the function.
segmentLength:
Length of segment to measure. Must be less than or equal to the length of the sub-domain.
t:
Parameter such that the length of the curve from the start of the sub-domain to t is s.
subdomain:
The calculation is performed on the specified sub-domain of the curve rather than the whole curve.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Curve.LengthParameter(System.Double,System.Double@,System.Double,Rhino.Geometry.Interval)
Gets the parameter along the curve which coincides with a given length along the curve.
segmentLength:
Length of segment to measure. Must be less than or equal to the length of the sub-domain.
t:
Parameter such that the length of the curve from the start of the sub-domain to t is s.
fractionalTolerance:
Desired fractional precision.
fabs(("exact" length from start to t) - arc_length)/arc_length <= fractionalTolerance.
subdomain:
The calculation is performed on the specified sub-domain of the curve rather than the whole curve.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Curve.NormalizedLengthParameter(System.Double,System.Double@)
Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve.
A fractional tolerance of 1e-8 is used in this version of the function.
s:
Normalized arc length parameter.
E.g., 0 = start of curve, 1/2 = midpoint of curve, 1 = end of curve.
t:
Parameter such that the length of the curve from its start to t is arc_length.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Curve.NormalizedLengthParameter(System.Double,System.Double@,System.Double)
Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve.
s:
Normalized arc length parameter.
E.g., 0 = start of curve, 1/2 = midpoint of curve, 1 = end of curve.
t:
Parameter such that the length of the curve from its start to t is arc_length.
fractionalTolerance:
Desired fractional precision.
fabs(("exact" length from start to t) - arc_length)/arc_length <= fractionalTolerance.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Curve.NormalizedLengthParameter(System.Double,System.Double@,Rhino.Geometry.Interval)
Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve.
A fractional tolerance of 1e-8 is used in this version of the function.
s:
Normalized arc length parameter.
E.g., 0 = start of curve, 1/2 = midpoint of curve, 1 = end of curve.
t:
Parameter such that the length of the curve from its start to t is arc_length.
subdomain:
The calculation is performed on the specified sub-domain of the curve.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Curve.NormalizedLengthParameter(System.Double,System.Double@,System.Double,Rhino.Geometry.Interval)
Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve.
s:
Normalized arc length parameter.
E.g., 0 = start of curve, 1/2 = midpoint of curve, 1 = end of curve.
t:
Parameter such that the length of the curve from its start to t is arc_length.
fractionalTolerance:
Desired fractional precision.
fabs(("exact" length from start to t) - arc_length)/arc_length <= fractionalTolerance.
subdomain:
The calculation is performed on the specified sub-domain of the curve.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Curve.NormalizedLengthParameters(System.Double[],System.Double)
Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve.
A fractional tolerance of 1e-8 is used in this version of the function.
s:
Array of normalized arc length parameters.
E.g., 0 = start of curve, 1/2 = midpoint of curve, 1 = end of curve.
absoluteTolerance:
If absoluteTolerance > 0, then the difference between (s[i+1]-s[i])*curve_length
and the length of the curve segment from t[i] to t[i+1] will be <= absoluteTolerance.
Returns:
If successful, array of curve parameters such that the length of the curve from its start to t[i] is s[i]*curve_length.
Null on failure.
Since: 5.0

Rhino.Geometry.Curve.NormalizedLengthParameters(System.Double[],System.Double,System.Double)
Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve.
s:
Array of normalized arc length parameters.
E.g., 0 = start of curve, 1/2 = midpoint of curve, 1 = end of curve.
absoluteTolerance:
If absoluteTolerance > 0, then the difference between (s[i+1]-s[i])*curve_length
and the length of the curve segment from t[i] to t[i+1] will be <= absoluteTolerance.
fractionalTolerance:
Desired fractional precision for each segment.
fabs("true" length - actual length)/(actual length) <= fractionalTolerance.
Returns:
If successful, array of curve parameters such that the length of the curve from its start to t[i] is s[i]*curve_length.
Null on failure.
Since: 5.0

Rhino.Geometry.Curve.NormalizedLengthParameters(System.Double[],System.Double,Rhino.Geometry.Interval)
Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve.
A fractional tolerance of 1e-8 is used in this version of the function.
s:
Array of normalized arc length parameters.
E.g., 0 = start of curve, 1/2 = midpoint of curve, 1 = end of curve.
absoluteTolerance:
If absoluteTolerance > 0, then the difference between (s[i+1]-s[i])*curve_length
and the length of the curve segment from t[i] to t[i+1] will be <= absoluteTolerance.
subdomain:
The calculation is performed on the specified sub-domain of the curve.
A 0.0 s value corresponds to sub-domain->Min() and a 1.0 s value corresponds to sub-domain->Max().
Returns:
If successful, array of curve parameters such that the length of the curve from its start to t[i] is s[i]*curve_length.
Null on failure.
Since: 5.0

Rhino.Geometry.Curve.NormalizedLengthParameters(System.Double[],System.Double,System.Double,Rhino.Geometry.Interval)
Input the parameter of the point on the curve that is a prescribed arc length from the start of the curve.
s:
Array of normalized arc length parameters.
E.g., 0 = start of curve, 1/2 = midpoint of curve, 1 = end of curve.
absoluteTolerance:
If absoluteTolerance > 0, then the difference between (s[i+1]-s[i])*curve_length
and the length of the curve segment from t[i] to t[i+1] will be <= absoluteTolerance.
fractionalTolerance:
Desired fractional precision for each segment.
fabs("true" length - actual length)/(actual length) <= fractionalTolerance.
subdomain:
The calculation is performed on the specified sub-domain of the curve.
A 0.0 s value corresponds to sub-domain->Min() and a 1.0 s value corresponds to sub-domain->Max().
Returns:
If successful, array of curve parameters such that the length of the curve from its start to t[i] is s[i]*curve_length.
Null on failure.
Since: 5.0

Rhino.Geometry.Curve.DivideByCount(System.Int32,System.Boolean)
Divide the curve into a number of equal-length segments.
segmentCount: Segment count. Note that the number of division points may differ from the segment count.
includeEnds: If true, then the point at the start of the first division segment is returned.
Returns:
List of curve parameters at the division points on success, null on failure.
Since: 5.0

Rhino.Geometry.Curve.DivideByCount(System.Int32,System.Boolean,Rhino.Geometry.Point3d[]@)
Divide the curve into a number of equal-length segments.
segmentCount: Segment count. Note that the number of division points may differ from the segment count.
includeEnds: If true, then the point at the start of the first division segment is returned.
points: A list of division points. If the function returns successfully, this point-array will be filled in.
Returns: Array containing division curve parameters on success, null on failure.
Since: 5.0

Rhino.Geometry.Curve.DivideByLength(System.Double,System.Boolean)
Divide the curve into specific length segments.
segmentLength: The length of each and every segment (except potentially the last one).
includeEnds: If true, then the point at the start of the first division segment is returned.
Returns: Array containing division curve parameters if successful, null on failure.
Since: 5.0

Rhino.Geometry.Curve.DivideByLength(System.Double,System.Boolean,System.Boolean)
Divide the curve into specific length segments.
segmentLength: The length of each and every segment (except potentially the last one).
includeEnds: If true, then the point at the start of the first division segment is returned.
reverse: If true, then the divisions start from the end of the curve.
Returns: Array containing division curve parameters if successful, null on failure.
Since: 6.0

Rhino.Geometry.Curve.DivideByLength(System.Double,System.Boolean,Rhino.Geometry.Point3d[]@)
Divide the curve into specific length segments.
segmentLength: The length of each and every segment (except potentially the last one).
includeEnds: If true, then the point at the start of the first division segment is returned.
points: If function is successful, points at each parameter value are returned in points.
Returns: Array containing division curve parameters if successful, null on failure.
Since: 5.0

Rhino.Geometry.Curve.DivideByLength(System.Double,System.Boolean,System.Boolean,Rhino.Geometry.Point3d[]@)
Divide the curve into specific length segments.
segmentLength: The length of each and every segment (except potentially the last one).
includeEnds: If true, then the point at the start of the first division segment is returned.
reverse: If true, then the divisions start from the end of the curve.
points: If function is successful, points at each parameter value are returned in points.
Returns: Array containing division curve parameters if successful, null on failure.
Since: 6.0

Rhino.Geometry.Curve.DivideEquidistant(System.Double)
Calculates 3d points on a curve where the linear distance between the points is equal.
distance: The distance between division points.
Returns: An array of equidistant points, or null on error.
Remarks:
Unlike the other divide methods, which divides a curve based on arc length,
or the distance along the curve between two points, this function divides a curve
based on the linear distance between points.
Since: 5.0

Rhino.Geometry.Curve.DivideEquidistant(System.Double,System.Double[]@)
Calculates 3d points on a curve where the linear distance between the points is equal.
distance: The distance between division points.
curveParameters: If successful, an array of curve parameters at the point locations.
Returns: An array of equidistant points, or null on error.
Remarks:
Unlike the other divide methods, which divides a curve based on arc length,
or the distance along the curve between two points, this function divides a curve
based on the linear distance between points.
Since: 8.14

Rhino.Geometry.Curve.DivideAsContour(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
Divides this curve at fixed steps along a defined contour line.
contourStart: The start of the contouring line.
contourEnd: The end of the contouring line.
interval: A distance to measure on the contouring axis.
Returns: An array of points; or null on error.
Since: 5.0

Rhino.Geometry.Curve.GetCurveParameterFromNurbsFormParameter(System.Double,System.Double@)
Convert a NURBS curve parameter to a curve parameter.
nurbsParameter: NURBS form parameter.
curveParameter: Curve parameter.
Returns: true on success, false on failure.
Remarks:
If HasNurbForm returns 2, this function converts the curve parameter to the NURBS curve parameter.
Since: 5.0

Rhino.Geometry.Curve.GetNurbsFormParameterFromCurveParameter(System.Double,System.Double@)
Convert a curve parameter to a NURBS curve parameter.
curveParameter: Curve parameter.
nurbsParameter: NURBS form parameter.
Returns: true on success, false on failure.
Remarks:
If GetNurbForm returns 2, this function converts the curve parameter to the NURBS curve parameter.
Since: 5.0

Rhino.Geometry.Curve.Trim(System.Double,System.Double)
Removes portions of the curve outside the specified interval.
t0: Start of the trimming interval.
t1: End of the trimming interval.
Returns: Trimmed portion of this curve is successful, null on failure.
Remarks:
If curve is open, then trimming interval must be an increasing interval.
If curve is closed, and trimming interval is a decreasing interval, then the portion of the curve across the start/end is returned.
Since: 5.0

Rhino.Geometry.Curve.Trim(Rhino.Geometry.Interval)
Removes portions of the curve outside the specified interval.
domain:
Trimming interval.
Returns: Trimmed curve if successful, null on failure.
Remarks:
If curve is open, then trimming interval must be an increasing interval.
If curve is closed, and trimming interval is a decreasing interval, then the portion of the curve across the start/end is returned.
Since: 5.0

Rhino.Geometry.Curve.TrimInterval(System.Double,System.Double)
Trims the curve in-place by removing portions of the curve outside the specified interval.
t0: Start of the trimming interval.
t1: End of the trimming interval.
Returns: True if successful, false otherwise.
Remarks:
Portions of the curve before curve(domain[0]) and after curve(domain[1]) are removed.
Since: 8.25

Rhino.Geometry.Curve.TrimInterval(Rhino.Geometry.Interval)
Trims the curve in-place by removing portions of the curve outside the specified interval.
domain: Trimming interval.
Returns: True if successful, false otherwise.
Remarks:
Portions of the curve before curve(domain[0]) and after curve(domain[1]) are removed.
Since: 8.25

Rhino.Geometry.Curve.Trim(Rhino.Geometry.CurveEnd,System.Double)
Shortens a curve by a given length
side:
length:
Returns: Trimmed curve if successful, null on failure.
Since: 5.1

Rhino.Geometry.Curve.Split(System.Double)
Splits (divides) the curve at the specified parameter.
The parameter must be in the interior of the curve's domain.
t:
Parameter to split the curve at in the interval returned by Domain().
Returns:
Two curves on success, null on failure.
Since: 5.0

Rhino.Geometry.Curve.Split(System.Collections.Generic.IEnumerable{System.Double})
Splits (divides) the curve at a series of specified parameters.
The parameter must be in the interior of the curve domain.
t:
Parameters to split the curve at in the interval returned by Domain().
Returns: Multiple curves on success, null on failure.
Since: 5.0

Rhino.Geometry.Curve.Split(Rhino.Geometry.Brep,System.Double)
Splits a curve into pieces using a polysurface.
cutter: A cutting surface or polysurface.
tolerance: A tolerance for computing intersections.
Returns: An array of curves. This array can be empty.
Since: 5.0
6.0

Rhino.Geometry.Curve.Split(Rhino.Geometry.Brep,System.Double,System.Double)
Splits a curve into pieces using a polysurface.
cutter: A cutting surface or polysurface.
tolerance: Tolerance for computing intersections.
angleToleranceRadians: Angle tolerance in radians.
Returns: An array of curves. This array can be empty.
Since: 6.0

Rhino.Geometry.Curve.Split(Rhino.Geometry.Surface,System.Double)
Splits a curve into pieces using a surface.
cutter: A cutting surface or polysurface.
tolerance: Tolerance for computing intersections.
Returns: An array of curves. This array can be empty.
Since: 5.0
6.0

Rhino.Geometry.Curve.Split(Rhino.Geometry.Surface,System.Double,System.Double)
Splits a curve into pieces using a surface.
cutter: A cutting surface or polysurface.
tolerance: Tolerance for computing intersections.
angleToleranceRadians: Angle tolerance in radians.
Returns: An array of curves. This array can be empty.
Since: 6.0

Rhino.Geometry.Curve.Split(Rhino.Geometry.Plane,System.Double,System.Double)
Splits a curve into pieces using a surface.
plane: A cutting plane.
tolerance: Tolerance for computing intersections.
angleToleranceRadians: Angle tolerance in radians.
Returns: An array of curves. This array can be empty.
Since: 9.0

Rhino.Geometry.Curve.Extend(System.Double,System.Double)
Where possible, analytically extends curve to include the given domain.
This will not work on closed curves. The original curve will be identical to the
restriction of the resulting curve to the original curve domain.
t0: Start of extension domain, if the start is not inside the
Domain of this curve, an attempt will be made to extend the curve.
t1: End of extension domain, if the end is not inside the
Domain of this curve, an attempt will be made to extend the curve.
Returns: Extended curve on success, null on failure.
Since: 5.0

Rhino.Geometry.Curve.Extend(Rhino.Geometry.Interval)
Where possible, analytically extends curve to include the given domain.
This will not work on closed curves. The original curve will be identical to the
restriction of the resulting curve to the original curve domain.
domain: Extension domain.
Returns: Extended curve on success, null on failure.
Since: 5.0

Rhino.Geometry.Curve.Extend(Rhino.Geometry.CurveEnd,System.Double,Rhino.Geometry.CurveExtensionStyle)
Extends a curve by a specific length.
side: Curve end to extend.
length: Length to add to the curve end.
style: Extension style.
Returns: A curve with extended ends or null on failure.
Since: 5.0

Rhino.Geometry.Curve.Extend(Rhino.Geometry.CurveEnd,Rhino.Geometry.CurveExtensionStyle,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})
Extends a curve until it intersects a collection of objects.
side: The end of the curve to extend.
style: The style or type of extension to use.
geometry: A collection of objects. Allowable object types are Curve, Surface, Brep.
Returns: New extended curve result on success, null on failure.
Since: 5.0

Rhino.Geometry.Curve.Extend(Rhino.Geometry.CurveEnd,Rhino.Geometry.CurveExtensionStyle,Rhino.Geometry.Point3d)
Extends a curve to a point.
side: The end of the curve to extend.
style: The style or type of extension to use.
endPoint: A new end point.
Returns: New extended curve result on success, null on failure.
Since: 5.0

Rhino.Geometry.Curve.ExtendOnSurface(Rhino.Geometry.CurveEnd,Rhino.Geometry.Surface)
Extends a curve on a surface.
side: The end of the curve to extend.
surface: Surface that contains the curve.
Returns: New extended curve result on success, null on failure.
Since: 5.0

Rhino.Geometry.Curve.ExtendOnSurface(Rhino.Geometry.CurveEnd,Rhino.Geometry.BrepFace)
Extends a curve on a surface.
side: The end of the curve to extend.
face: BrepFace that contains the curve.
Returns: New extended curve result on success, null on failure.
Since: 5.0

Rhino.Geometry.Curve.ExtendByLine(Rhino.Geometry.CurveEnd,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})
Extends a curve by a line until it intersects a collection of objects.
side: The end of the curve to extend.
geometry: A collection of objects. Allowable object types are Curve, Surface, Brep.
Returns: New extended curve result on success, null on failure.
Since: 5.0

Rhino.Geometry.Curve.ExtendByArc(Rhino.Geometry.CurveEnd,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})
Extends a curve by an Arc until it intersects a collection of objects.
side: The end of the curve to extend.
geometry: A collection of objects. Allowable object types are Curve, Surface, Brep.
Returns: New extended curve result on success, null on failure.
Since: 5.0

Rhino.Geometry.Curve.Simplify(Rhino.Geometry.CurveSimplifyOptions,System.Double,System.Double)
Returns a geometrically equivalent PolyCurve.
The PolyCurve has the following properties
1. All the PolyCurve segments are LineCurve, PolylineCurve, ArcCurve, or NurbsCurve.
2. The NURBS Curves segments do not have fully multiple interior knots.
3. Rational NURBS curves do not have constant weights.
4. Any segment for which IsLinear() or IsArc() is true is a Line,
Polyline segment, or an Arc.
5. Adjacent co-linear or co-circular segments are combined.
6. Segments that meet with G1-continuity have there ends tuned up so
that they meet with G1-continuity to within machine precision.
options: Simplification options.
distanceTolerance: A distance tolerance for the simplification.
angleToleranceRadians: An angle tolerance for the simplification.
Returns: New simplified curve on success, null on failure.
Since: 5.0

Rhino.Geometry.Curve.SimplifyEnd(Rhino.Geometry.CurveEnd,Rhino.Geometry.CurveSimplifyOptions,System.Double,System.Double)
Same as SimplifyCurve, but simplifies only the last two segments at "side" end.
end: If CurveEnd.Start the function simplifies the last two start
side segments, otherwise if CurveEnd.End the last two end side segments are simplified.
options: Simplification options.
distanceTolerance: A distance tolerance for the simplification.
angleToleranceRadians: An angle tolerance for the simplification.
Returns: New simplified curve on success, null on failure.
Since: 5.0

Rhino.Geometry.Curve.Fair(System.Double,System.Double,System.Int32,System.Int32,System.Int32)
Fairs a curve object. Fair works best on degree 3 (cubic) curves. Attempts to
remove large curvature variations while limiting the geometry changes to be no
more than the specified tolerance.
distanceTolerance: Maximum allowed distance the faired curve is allowed to deviate from the input.
angleTolerance: (in radians) kinks with angles <= angleTolerance are smoothed out 0.05 is a good default.
clampStart: The number of (control vertices-1) to preserve at start.
0 = preserve start point
1 = preserve start point and 1st derivative
2 = preserve start point, 1st and 2nd derivative
clampEnd: Same as clampStart.
iterations: The number of iterations to use in adjusting the curve.
Returns: Returns new faired Curve on success, null on failure.
Since: 5.0

Rhino.Geometry.Curve.Fit(System.Int32,System.Double,System.Double)
Fits a new curve through an existing curve.
degree: The degree of the returned Curve. Must be bigger than 1.
fitTolerance: The fitting tolerance. If fitTolerance is RhinoMath.UnsetValue or <=0.0,
the document absolute tolerance is used.
angleTolerance: The kink smoothing tolerance in radians.
If angleTolerance is 0.0, all kinks are smoothed
If angleTolerance is >0.0, kinks smaller than angleTolerance are smoothed
If angleTolerance is RhinoMath.UnsetValue or <0.0, the document angle tolerance is used for the kink smoothing
Returns: Returns a new fitted Curve if successful, null on failure.
Since: 5.0

Rhino.Geometry.Curve.Rebuild(System.Int32,System.Int32,System.Boolean)
Rebuild a curve with a specific point count.
pointCount: Number of control points in the rebuild curve.
degree: Degree of curve. Valid values are between and including 1 and 11.
preserveTangents: If true, the end tangents of the input curve will be preserved.
Returns: A NURBS curve on success or null on failure.
Since: 5.0

Rhino.Geometry.Curve.HasNurbsForm
Does a NURBS curve representation of this curve exist?
Returns:
0   unable to create NURBS representation with desired accuracy.
1   success - NURBS parameterization matches the curve's to the desired accuracy
2   success - NURBS point locus matches the curve's and the domain of the NURBS
curve is correct. However, This curve's parameterization and the
NURBS curve parameterization may not match. This situation happens
when getting NURBS representations of curves that have a
transcendental parameterization like circles.
Since: 5.0

Rhino.Geometry.Curve.ToNurbsCurve
Constructs a NURBS curve representation of this curve.
Returns: NURBS representation of the curve on success, null on failure.
Since: 5.0

Rhino.Geometry.Curve.ToNurbsCurve(Rhino.Geometry.Interval)
Constructs a NURBS curve representation of this curve.
subdomain: The NURBS representation for this portion of the curve is returned.
Returns: NURBS representation of the curve on success, null on failure.
Since: 5.0

Rhino.Geometry.Curve.SpanDomain(System.Int32)
Get the domain of the curve span with the given index.
Use the SpanCount property to test how many spans there are.
spanIndex: Index of span.
Returns: Interval of the span with the given index.
Since: 5.0

Rhino.Geometry.Curve.ToPolyline(System.Int32,System.Int32,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Boolean)
Gets a polyline approximation of a curve.
mainSegmentCount:
If mainSegmentCount <= 0, then both subSegmentCount and mainSegmentCount are ignored.
If mainSegmentCount > 0, then subSegmentCount must be >= 1. In this
case the NURBS will be broken into mainSegmentCount equally spaced
chords. If needed, each of these chords can be split into as many
subSegmentCount sub-parts if the subdivision is necessary for the
mesh to meet the other meshing constraints. In particular, if
subSegmentCount = 0, then the curve is broken into mainSegmentCount
pieces and no further testing is performed.
subSegmentCount: An amount of subsegments.
maxAngleRadians:
( 0 to pi ) Maximum angle (in radians) between unit tangents at
adjacent vertices.
maxChordLengthRatio: Maximum permitted value of
(distance chord midpoint to curve) / (length of chord).
maxAspectRatio: If maxAspectRatio < 1.0, the parameter is ignored.
If 1 <= maxAspectRatio < sqrt(2), it is treated as if maxAspectRatio = sqrt(2).
This parameter controls the maximum permitted value of
(length of longest chord) / (length of shortest chord).
tolerance: If tolerance = 0, the parameter is ignored.
This parameter controls the maximum permitted value of the
distance from the curve to the polyline.
minEdgeLength: The minimum permitted edge length.
maxEdgeLength: If maxEdgeLength = 0, the parameter
is ignored. This parameter controls the maximum permitted edge length.
keepStartPoint: If true the starting point of the curve
is added to the polyline. If false the starting point of the curve is
not added to the polyline.
Returns: PolylineCurve on success, null on error.
Since: 5.0

Rhino.Geometry.Curve.ToPolyline(System.Int32,System.Int32,System.Double,System.Double,System.Double,System.Double,System.Double,System.Double,System.Boolean,Rhino.Geometry.Interval)
Gets a polyline approximation of a curve.
mainSegmentCount:
If mainSegmentCount <= 0, then both subSegmentCount and mainSegmentCount are ignored.
If mainSegmentCount > 0, then subSegmentCount must be >= 1. In this
case the NURBS will be broken into mainSegmentCount equally spaced
chords. If needed, each of these chords can be split into as many
subSegmentCount sub-parts if the subdivision is necessary for the
mesh to meet the other meshing constraints. In particular, if
subSegmentCount = 0, then the curve is broken into mainSegmentCount
pieces and no further testing is performed.
subSegmentCount: An amount of subsegments.
maxAngleRadians:
( 0 to pi ) Maximum angle (in radians) between unit tangents at
adjacent vertices.
maxChordLengthRatio: Maximum permitted value of
(distance chord midpoint to curve) / (length of chord).
maxAspectRatio: If maxAspectRatio < 1.0, the parameter is ignored.
If 1 <= maxAspectRatio < sqrt(2), it is treated as if maxAspectRatio = sqrt(2).
This parameter controls the maximum permitted value of
(length of longest chord) / (length of shortest chord).
tolerance: If tolerance = 0, the parameter is ignored.
This parameter controls the maximum permitted value of the
distance from the curve to the polyline.
minEdgeLength: The minimum permitted edge length.
maxEdgeLength: If maxEdgeLength = 0, the parameter
is ignored. This parameter controls the maximum permitted edge length.
keepStartPoint: If true the starting point of the curve
is added to the polyline. If false the starting point of the curve is
not added to the polyline.
curveDomain: This sub-domain of the NURBS curve is approximated.
Returns: PolylineCurve on success, null on error.
Since: 5.0

Rhino.Geometry.Curve.ToPolyline(System.Double,System.Double,System.Double,System.Double)
Gets a polyline approximation of a curve.
tolerance: The tolerance. This is the maximum deviation from line midpoints to the curve. When in doubt, use the document's model space absolute tolerance.
angleTolerance: The angle tolerance in radians. This is the maximum deviation of the line directions. When in doubt, use the document's model space angle tolerance.
minimumLength: The minimum segment length.
maximumLength: The maximum segment length.
Returns: PolyCurve on success, null on error.
Since: 6.0

Rhino.Geometry.Curve.ToArcsAndLines(System.Double,System.Double,System.Double,System.Double)
Converts a curve into polycurve consisting of arc segments. Sections of the input curves that are nearly straight are converted to straight-line segments.
tolerance: The tolerance. This is the maximum deviation from arc midpoints to the curve. When in doubt, use the document's model space absolute tolerance.
angleTolerance: The angle tolerance in radians. This is the maximum deviation of the arc end directions from the curve direction. When in doubt, use the document's model space angle tolerance.
minimumLength: The minimum segment length.
maximumLength: The maximum segment length.
Returns: PolyCurve on success, null on error.
Since: 6.0

Rhino.Geometry.Curve.PullToMesh(Rhino.Geometry.Mesh,System.Double)
Makes a polyline approximation of the curve and gets the closest point on the mesh for each point on the curve.
Then it "connects the points" so that you have a polyline on the mesh.
mesh: Mesh to project onto.
tolerance: Input tolerance. When in doubt, the document's model absolute tolerance.
Returns: A curve if success, or null on failure.
Since: 5.0

Rhino.Geometry.Curve.PullToMesh(Rhino.Geometry.Mesh,System.Double,System.Boolean)
Projects this curve onto a mesh.
mesh: Mesh to project onto.
tolerance: Input tolerance. When in doubt, the document's model absolute tolerance.
loose:
If true, the curve's edit points are pulled back to the mesh.
If any edit point misses the mesh, the curve will not be created.
Returns: A curve if success, or null on failure.
Since: 8.17

Rhino.Geometry.Curve.Offset(Rhino.Geometry.Plane,System.Double,System.Double,Rhino.Geometry.CurveOffsetCornerStyle)
Offsets this curve. If you have a nice offset, then there will be one entry in
the array. If the original curve had kinks or the offset curve had self
intersections, you will get multiple segments in the output array.
plane: Offset solution plane.
distance: The positive or negative distance to offset.
tolerance: The offset or fitting tolerance.
cornerStyle: Corner style for offset kinks.
Returns: Offset curves on success, null on failure.
Since: 5.0

Rhino.Geometry.Curve.Offset(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Double,System.Double,Rhino.Geometry.CurveOffsetCornerStyle)
Offsets this curve. If you have a nice offset, then there will be one entry in
the array. If the original curve had kinks or the offset curve had self
intersections, you will get multiple segments in the output array.
directionPoint: A point that indicates the direction of the offset.
normal: The normal to the offset plane.
distance: The positive or negative distance to offset.
tolerance: The offset or fitting tolerance.
cornerStyle: Corner style for offset kinks.
Returns: Offset curves on success, null on failure.
Since: 5.0

Rhino.Geometry.Curve.Offset(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Double,System.Double,System.Double,System.Boolean,Rhino.Geometry.CurveOffsetCornerStyle,Rhino.Geometry.CurveOffsetEndStyle)
Offsets this curve. If you have a nice offset, then there will be one entry in
the array. If the original curve had kinks or the offset curve had self
intersections, you will get multiple segments in the output array.
directionPoint: A point that indicates the direction of the offset.
normal: The normal to the offset plane.
distance: The positive or negative distance to offset.
tolerance: The offset or fitting tolerance.
angleTolerance: The angle tolerance, in radians, used to decide whether to split at kinks.
loose: If false, offset within tolerance. If true, offset by moving edit points.
cornerStyle: Corner style for offset kinks.
endStyle: End style for non-loose, non-closed curve offsets.
Returns: Offset curves on success, null on failure.
Since: 7.0

Rhino.Geometry.Curve.RibbonOffset(System.Double,System.Double,Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Double)
Offsets a closed curve in the following way: pProject the curve to a plane with given normal.
Then, loose Offset the projection by distance + blend_radius and trim off self-intersection.
THen, Offset the remaining curve back in the opposite direction by blend_radius, filling gaps with blends.
Finally, use the elevations of the input curve to get the correct elevations of the result.
distance: The positive distance to offset the curve.
blendRadius:
Positive, typically the same as distance. When the offset results in a self-intersection
that gets trimmed off at a kink, the kink will be blended out using this radius.
directionPoint:
A point that indicates the direction of the offset. If the offset is inward,
the point's projection to the plane should be well within the curve.
It will be used to decide which part of the offset to keep if there are self-intersections.
normal: A vector that indicates the normal of the plane in which the offset will occur.
tolerance: Used to determine self-intersections, not offset error.
Returns: The offset curve if successful.
Since: 7.0

Rhino.Geometry.Curve.RibbonOffset(System.Double,System.Double,Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Double,Rhino.Geometry.Curve[]@,Rhino.Geometry.Surface[]@)
Offsets a closed curve in the following way: pProject the curve to a plane with given normal.
Then, loose Offset the projection by distance + blend_radius and trim off self-intersection.
THen, Offset the remaining curve back in the opposite direction by blend_radius, filling gaps with blends.
Finally, use the elevations of the input curve to get the correct elevations of the result.
distance: The positive distance to offset the curve.
blendRadius:
Positive, typically the same as distance. When the offset results in a self-intersection
that gets trimmed off at a kink, the kink will be blended out using this radius.
directionPoint:
A point that indicates the direction of the offset. If the offset is inward,
the point's projection to the plane should be well within the curve.
It will be used to decide which part of the offset to keep if there are self-intersections.
normal: A vector that indicates the normal of the plane in which the offset will occur.
tolerance: Used to determine self-intersections, not offset error.
crossSections:
Contains lines between input and the offset that might be useful
as input to Brep.CreateFromSweep or some other surface creation tool.
ruledSurfaces:
Contain ruled surfaces between the input and the parts of the offset that correspond exactly.
Note, there will be gaps between these at blends.
Returns: The offset curve if successful.
Since: 7.0

Rhino.Geometry.Curve.RibbonOffset(System.Double,System.Double,Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Double,System.Double[]@,System.Double[]@)
Offsets a closed curve in the following way: pProject the curve to a plane with given normal.
Then, loose Offset the projection by distance + blend_radius and trim off self-intersection.
THen, Offset the remaining curve back in the opposite direction by blend_radius, filling gaps with blends.
Finally, use the elevations of the input curve to get the correct elevations of the result.
distance: The positive distance to offset the curve.
blendRadius:
Positive, typically the same as distance. When the offset results in a self-intersection
that gets trimmed off at a kink, the kink will be blended out using this radius.
directionPoint:
A point that indicates the direction of the offset. If the offset is inward,
the point's projection to the plane should be well within the curve.
It will be used to decide which part of the offset to keep if there are self-intersections.
normal: A vector that indicates the normal of the plane in which the offset will occur.
tolerance: Used to determine self-intersections, not offset error.
outputParameters: A list of parameter, paired with curveParameters, from the output curve for creating cross sections.
curveParameters: A list of parameter, paired with outputParameters, from the input curve for creating cross sections.
Returns: The offset curve if successful.
Since: 7.0

Rhino.Geometry.Curve.RibbonOffset(Rhino.Geometry.RibbonOffsetParameters,Rhino.Geometry.Curve[]@,Rhino.Geometry.Curve[]@,Rhino.Geometry.Brep[]@)
Ribbon offset method to mimic RibbonOffset command
ribbonParameters: The ribbon offset parameters
railCurves: on success an array of split curves representing the sweep rail segments, null on failure
crossSectionCurves: on success an array of cross section curves used during brep creation, null on failure
brepSurfaces: on success and array of breps representing the ribbon surfaces, null on failure
Returns: return an offset curve on success, null on failure
Since: 8.9

Rhino.Geometry.Curve.OffsetOnSurface(Rhino.Geometry.BrepFace,System.Double,System.Double)
Offset this curve on a brep face surface. This curve must lie on the surface.
face: The brep face on which to offset.
distance: A distance to offset (+)left, (-)right.
fittingTolerance: A fitting tolerance.
Returns: Offset curves on success, or null on failure.
Throws System.ArgumentNullException: If face is null.
Since: 5.0

Rhino.Geometry.Curve.OffsetOnSurface(Rhino.Geometry.BrepFace,Rhino.Geometry.Point2d,System.Double)
Offset a curve on a brep face surface. This curve must lie on the surface.
This overload allows to specify a surface point at which the offset will pass.
face: The brep face on which to offset.
throughPoint: 2d point on the brep face to offset through.
fittingTolerance: A fitting tolerance.
Returns: Offset curves on success, or null on failure.
Throws System.ArgumentNullException: If face is null.
Since: 5.0

Rhino.Geometry.Curve.OffsetOnSurface(Rhino.Geometry.BrepFace,System.Double[],System.Double[],System.Double)
Offset a curve on a brep face surface. This curve must lie on the surface.
This overload allows to specify different offsets for different curve parameters.
face: The brep face on which to offset.
curveParameters: Curve parameters corresponding to the offset distances.
offsetDistances: distances to offset (+)left, (-)right.
fittingTolerance: A fitting tolerance.
Returns: Offset curves on success, or null on failure.
Throws System.ArgumentNullException: If face, curveParameters or offsetDistances are null.
Since: 5.0

Rhino.Geometry.Curve.OffsetOnSurface(Rhino.Geometry.Surface,System.Double,System.Double)
Offset a curve on a surface. This curve must lie on the surface.
surface: A surface on which to offset.
distance: A distance to offset (+)left, (-)right.
fittingTolerance: A fitting tolerance.
Returns: Offset curves on success, or null on failure.
Throws System.ArgumentNullException: If surface is null.
Since: 5.0

Rhino.Geometry.Curve.FilletSurfaceToRail(Rhino.Geometry.BrepFace,Rhino.Geometry.BrepFace,System.Double,System.Double,System.Int32,System.Int32,System.Collections.Generic.IEnumerable{System.Double},System.Int32,System.Boolean,Rhino.Geometry.FilletSurfaceSplitType,System.Double,System.Collections.Generic.List{Rhino.Geometry.Brep},System.Collections.Generic.List{Rhino.Geometry.Brep},System.Collections.Generic.List{Rhino.Geometry.Brep},System.Double[]@)
Creates a surface between two surfaces, with a fixed rail curve on the first surface.
faceWithCurve: The first face on which the curve exists
secondFace: The second face
u1: A parameter in the u direction of the second face at the side you want to keep after filleting.
v1: A parameter in the v direction of the second face at the side you want to keep after filleting.
railDegree: Desired fillet degree (3 or 5) in the u-direction, along the rails
arcDegree: esired fillet degree (2, 3, 4, or 5) in the v-direction, along the fillet arcs.If 2, then the surface is rational in v
arcSliders: Array of 2 sliders to shape the fillet in the arc direction, used for arcDegree = 3, 4, or 5; input { 0.0, 0.0 } to ignore
[0] (-1 to 1) slides tangent arms from base (-1) to theoretical(1)
[1] (-1 to 1) slides inner CV(s) from base (-1) to theoretical(1)
numBezierSrfs: If >0, this indicates the number of equally-spaced fillet surfaces to be output in the rail direction, each surface Bézier in u.
extend: If true, then when one input surface is longer than the other, the fillet surface is extended to the input surface edges.
split_type: The split type
tolerance: The tolerance. In in doubt, the document's absolute tolerance.
out_fillets: The results of the fillet calculation.
out_breps0: The trim or split results of the Brep owned by faceWithCurve.
out_breps1: The trim or split results of the Brep owned by pFace1.
fitResults: array of doubles indicating fitting results:
[0] max 3d point deviation along surface 0
[1] max 3d point deviation along surface 1
[2] max angle deviation along surface 0 (in degrees)
[3] max angle deviation along surface 1 (in degrees)
[4] max angle deviation between Bézier surfaces(in degrees)
[5] max curvature difference between Bézier surfaces
Returns:  true if successful, false otherwise.
Remarks: The trim or split input Breps are in OutBreps0, and OutBreps1. If the input faces are
from the same Brep, nothing will be added to OutBreps1.If you specified a split type
of RhinoFilletSurfaceSplitType::Nothing, then nothing will be added to either OutBreps0
or OutBreps1.
Since: 8.0

Rhino.Geometry.Curve.FilletSurfaceToCurve(Rhino.Geometry.BrepFace,System.Double,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Collections.Generic.IEnumerable{System.Double},System.Int32,System.Double,System.Collections.Generic.List{Rhino.Geometry.Brep},System.Double[]@)
Creates a constant-radius fillet surface between a surface and the curve.
face: the face being filleted.
t: A parameter on the curve, indicating region of fillet.
u: A parameter in the u direction of the face indicating which side of the curve to fillet.
v: A parameter in the v direction of the face indicating which side of the curve to fillet.
radius: The radius of the constant-radius fillet desired. NOTE: using arcSliders will change the shape of the arcs themselves
alignToCurve: Does the user want the fillet to align to the curve?
0 - No, ignore the curve's b-spline structure
1 - Yes, match the curves's degree, spans, CVs as much as possible
2 - Same as 1, but iterate to fit to tolerance
Note that a value of 1 or 2 will cause nBezierSrfs to be ignored
railDegree: Desired fillet degree (3 or 5) in the u-direction, along the curve
arcDegree: Desired fillet degree (2, 3, 4, or 5) in the v-direction, along the fillet arcs.If 2, then the surface is rational in v
arcSliders: Array of 2 sliders to shape the fillet in the arc direction, used for arcDegree = 3, 4, or 5; input { 0.0, 0.0 } to ignore
[0] (-1 to 1) slides tangent arms from base (-1) to theoretical(1)
[1] (-1 to 1) slides inner CV(s) from base (-1) to theoretical(1)
numBezierSrfs: If >0, this indicates the number of equally-spaced fillet surfaces to be output in the rail direction, each surface Bézier in u.
tolerance: The tolerance. In in doubt, the document's absolute tolerance.
out_fillets: he results of the fillet calculation.
fitResults: array of doubles indicating fitting results:
[0] max 3d point deviation along curve
[1] max 3d point deviation along face
[2] max angle deviation along face(in degrees)
[3] max angle deviation between Bézier surfaces(in degrees)
[4] max curvature difference between Bézier surfaces
Returns: true if successful, false otherwise.
Since: 8.0

Rhino.Geometry.Curve.OffsetOnSurface(Rhino.Geometry.Surface,Rhino.Geometry.Point2d,System.Double)
Offset a curve on a surface. This curve must lie on the surface.
This overload allows to specify a surface point at which the offset will pass.
surface: A surface on which to offset.
throughPoint: 2d point on the brep face to offset through.
fittingTolerance: A fitting tolerance.
Returns: Offset curves on success, or null on failure.
Throws System.ArgumentNullException: If surface is null.
Since: 5.0

Rhino.Geometry.Curve.OffsetOnSurface(Rhino.Geometry.Surface,System.Double[],System.Double[],System.Double)
Offset this curve on a surface. This curve must lie on the surface.
This overload allows to specify different offsets for different curve parameters.
surface: A surface on which to offset.
curveParameters: Curve parameters corresponding to the offset distances.
offsetDistances: Distances to offset (+)left, (-)right.
fittingTolerance: A fitting tolerance.
Returns: Offset curves on success, or null on failure.
Throws System.ArgumentNullException: If surface, curveParameters or offsetDistances are null.
Since: 5.0

Rhino.Geometry.Curve.PullToBrepFace(Rhino.Geometry.BrepFace,System.Double)
Pulls this curve to a brep face and returns the result of that operation.
face: A brep face.
tolerance: A tolerance value.
Returns: An array containing the resulting curves after pulling. This array could be empty.
Throws System.ArgumentNullException: If face is null.
Since: 5.0

Rhino.Geometry.Curve.OffsetNormalToSurface(Rhino.Geometry.Surface,System.Double)
Finds a curve by offsetting an existing curve normal to a surface.
The caller is responsible for ensuring that the curve lies on the input surface.
surface: Surface from which normals are calculated.
height: Offset distance.
Returns:
Curve offset normal to the surface, if successful, null otherwise.
The offset curve is interpolated through a small number of points so if the
surface is irregular or complicated, the result will not be a very accurate offset.
Since: 5.0

Rhino.Geometry.Curve.OffsetTangentToSurface(Rhino.Geometry.Surface,System.Double)
Finds a curve by offsetting an existing curve tangent to a surface.
The caller is responsible for ensuring that the curve lies on the input surface.
surface: Surface from which tangents are calculated.
height: Offset distance.
Returns:
Curve offset tangent to the surface, if successful, null otherwise.
The offset curve is interpolated through a small number of points so if the
surface is irregular or complicated, the result will not be a very accurate offset.
Since: 8.3

Rhino.Geometry.Curve.ControlPolygon
Gets the curve's control polygon.
Returns: The control polygon as a polyline if successful, null otherwise.
Since: 8.11

Rhino.Geometry.Curve.SpanVector
Returns the vector of span division parameters for this curve.
Returns:
An array of parameter values that mark the boundaries between spans of the curve.
Since: 8.13