Rhino.Runtime.InteropWrappers.SimpleArrayGeometryPointer
Wrapper for a C++ ON_SimpleArray<ON_Geometry*>* or ON_SimpleArray<constant ON_Geometry*>.
If you are not writing C++ code, then this class is not for you.

Rhino.Runtime.InteropWrappers.SimpleArrayGeometryPointer.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayGeometryPointer.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayGeometryPointer.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayGeometryPointer instance.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayGeometryPointer.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})
Create an ON_SimpleArray<ON_Geometry*> filled with items in geometry
geometry:
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayGeometryPointer.#ctor(System.Collections.IEnumerable)
Expects all of the items in the IEnumerable to be GeometryBase types
geometry:
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayGeometryPointer.ToNonConstArray
Copies the unmanaged array to a managed counterpart.
Returns: The managed array.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayGeometryPointer.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.SimpleArrayGeometryPointer.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayGeometryPointer.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.