Rhino.Input.Custom.GetPolyline
Use to interactively get a polyline.

Rhino.Input.Custom.GetPolyline.#ctor
Since: 6.0

Rhino.Input.Custom.GetPolyline.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Input.Custom.GetPolyline.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 6.0

Rhino.Input.Custom.GetPolyline.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.Input.Custom.GetPolyline.Get(Rhino.Geometry.Polyline@)
Perform the 'get' operation.
polyline:
Returns:
Since: 6.0

Rhino.Input.Custom.GetPolyline.FirstPointPrompt
Prompt when getting first point
Since: 6.0

Rhino.Input.Custom.GetPolyline.SecondPointPrompt
Prompt when getting second point
Since: 6.0

Rhino.Input.Custom.GetPolyline.ThirdPointPrompt
Prompt when getting third point
Since: 6.0

Rhino.Input.Custom.GetPolyline.FourthPointPrompt
Prompt when getting fourth point
Since: 6.0

Rhino.Input.Custom.GetPolyline.MinPointCount
Since: 6.0

Rhino.Input.Custom.GetPolyline.MaxPointCount
Since: 6.0

Rhino.Input.Custom.GetPolyline.SetFirstPoint(Rhino.Geometry.Point3d)
Use SetFirstPoint to specify the line's starting point and skip
the start point interactive picking
point:
Since: 6.0