Rhino.Geometry.TransformSimilarityType
Lists all possible outcomes for transform similarity.
Since: 5.0

Rhino.Geometry.TransformSimilarityType.OrientationReversing
Similarity is preserved, but orientation is flipped.

Rhino.Geometry.TransformSimilarityType.NotSimilarity
Similarity is not preserved. Geometry needs to be deformable for this Transform to operate correctly.

Rhino.Geometry.TransformSimilarityType.OrientationPreserving
Similarity and orientation are preserved.