Rhino.FileIO.FilePov
Support for writing POV file format

Rhino.FileIO.FilePov.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FilePovWriteOptions)
Write a POV file based on the contents of a RhinoDoc
path: path to write a file to
doc: document to get geometry from
options: options used for generating the POV file
Returns: true on success
Since: 8.0