Rhino.UI.PanelSystem.CreatePanelCallback
Used by Interop.UnsafeNativeMethods.RHC_RegisterTabbedDockBar to define
call back signature
panelTypeGuid:
hostId:
documentSerialNumber:
hParent:
minimumWidth:
minimumHeight:
Returns: