Rhino.DocObjects.Tables.MaterialTableEventArgs.Document
Since: 5.0

Rhino.DocObjects.Tables.MaterialTableEventArgs.EventType
Since: 5.0

Rhino.DocObjects.Tables.MaterialTableEventArgs.Index
Since: 5.0

Rhino.DocObjects.Tables.MaterialTableEventArgs.OldSettings
Since: 5.0