Rhino.Render.RenderContent.ChangeContexts
Context of a change to content parameters.
Since: 5.1

Rhino.Render.RenderContent.ChangeContexts.UI
Change occurred as a result of user activity in the content's UI.

Rhino.Render.RenderContent.ChangeContexts.Drop
Change occurred as a result of drag and drop.

Rhino.Render.RenderContent.ChangeContexts.Program
Change occurred as a result of internal program activity.

Rhino.Render.RenderContent.ChangeContexts.Ignore
Change can be disregarded.

Rhino.Render.RenderContent.ChangeContexts.Tree
Change occurred within the content tree (e.g., nodes reordered).

Rhino.Render.RenderContent.ChangeContexts.Undo
Change occurred as a result of an undo.

Rhino.Render.RenderContent.ChangeContexts.FieldInit
OBSOLETE.

Rhino.Render.RenderContent.ChangeContexts.Serialize
Change occurred during serialization (loading).

Rhino.Render.RenderContent.ChangeContexts.RealTimeUI
Change occurred as a result of 'real-time' user activity in the (content) UI.
The content's preview, UI, group members and registerable properties are not updated.

Rhino.Render.RenderContent.ChangeContexts.Script
Change occurred as a result of executing a script.