Rhino.Display.CalculateBoundingBoxEventArgs.BoundingBox
Gets the current bounding box.
Since: 5.0

Rhino.Display.CalculateBoundingBoxEventArgs.IncludeBoundingBox(Rhino.Geometry.BoundingBox)
Unites a bounding box with the current display bounding box in order to ensure
dynamic objects in "box" are drawn.
box: The box to unite.
Since: 5.0