Rhino.DocObjects.DetailViewObject
A detail view object is a nested Rhino viewport placed on a page view
with a 2D closed curve boundary. It can be any type of modeling view.

Rhino.DocObjects.DetailViewObject.DetailGeometry
Returns the detail view geometry.
Since: 5.0

Rhino.DocObjects.DetailViewObject.IsActive
Gets or sets the active state of the detail view.
Note, setting this property will trigger a Rhino.Display.RhinoPageView.PageViewSpaceChange event.
Since: 5.0

Rhino.DocObjects.DetailViewObject.Viewport
Gets the detail view's viewport.
Since: 5.0

Rhino.DocObjects.DetailViewObject.CommitViewportChanges
Since: 5.0

Rhino.DocObjects.DetailViewObject.DescriptiveTitle
Detail objects have two strings that can be used to describe the detail:
1. The name string that is part of the object's attributes
2. The viewport projection title that is part of the viewport
This function combines these two strings to create a single "description" string in the form of attribute_name - projection_title.
Since: 7.0

Rhino.DocObjects.DetailViewObject.WorldToPageTransform
Gets the world coordinate to page coordinate transformation.
Since: 6.0

Rhino.DocObjects.DetailViewObject.PageToWorldTransform
Returns the page coordinate to world coordinate transformation.
Since: 6.0

Rhino.DocObjects.DetailViewObject.TryGetModelLength(System.Double,System.Double@)
Converts a paper length into a model length.
paper:
model:
Returns:
Since: 8.17

Rhino.DocObjects.DetailViewObject.TryGetPaperLength(System.Double,System.Double@)
Converts a paper length into a model length.
model:
paper:
Returns:
Since: 8.17

Rhino.DocObjects.DetailViewObject.GetFormattedScale(Rhino.DocObjects.DetailViewObject.ScaleFormat,System.String@)
Returns the detail view object's scale as a formatted string.
The detail view object's viewport must be to parallel projection.
format: The scale format.
value: The formatted string
Returns: true if successful, false otherwise
Since: 7.0