Rhino.FileIO.FileCsvWriteOptions
Options for writing a Csv file.
Set any value you want included in the output to true.
With the exception of Header and CumulativeMassProperties,
all checked items apply to each and every object exported.

Rhino.FileIO.FileCsvWriteOptions.Header
General
Since: 8.0

Rhino.FileIO.FileCsvWriteOptions.LayerName
Layer information
Since: 8.0

Rhino.FileIO.FileCsvWriteOptions.LayerIndex
Since: 8.0

Rhino.FileIO.FileCsvWriteOptions.LayerColor
Since: 8.0

Rhino.FileIO.FileCsvWriteOptions.LayerHierarchy
Since: 8.0

Rhino.FileIO.FileCsvWriteOptions.GroupName
Group information
Since: 8.0

Rhino.FileIO.FileCsvWriteOptions.GroupIndexes
Since: 8.0

Rhino.FileIO.FileCsvWriteOptions.ObjectName
Object information
Since: 8.0

Rhino.FileIO.FileCsvWriteOptions.ObjectColor
Since: 8.0

Rhino.FileIO.FileCsvWriteOptions.ObjectID
Since: 8.0

Rhino.FileIO.FileCsvWriteOptions.ObjectMaterial
Since: 8.0

Rhino.FileIO.FileCsvWriteOptions.ObjectDescription
Since: 8.0

Rhino.FileIO.FileCsvWriteOptions.SurroundPointsWithDoubleQuotes
Since: 8.0

Rhino.FileIO.FileCsvWriteOptions.Length
Mass properties
Since: 8.0

Rhino.FileIO.FileCsvWriteOptions.Perimeter
Since: 8.0

Rhino.FileIO.FileCsvWriteOptions.Area
Since: 8.0

Rhino.FileIO.FileCsvWriteOptions.Volume
Since: 8.0

Rhino.FileIO.FileCsvWriteOptions.AreaCentroid
Since: 8.0

Rhino.FileIO.FileCsvWriteOptions.VolumeCentroid
Since: 8.0

Rhino.FileIO.FileCsvWriteOptions.AreaMoments
Since: 8.0

Rhino.FileIO.FileCsvWriteOptions.VolumeMoments
Since: 8.0

Rhino.FileIO.FileCsvWriteOptions.CumulativeMassProperties
Since: 8.0

Rhino.FileIO.FileCsvWriteOptions.AttributesKeys
User text
Since: 8.0

Rhino.FileIO.FileCsvWriteOptions.AttributesTexts
Since: 8.0

Rhino.FileIO.FileCsvWriteOptions.ObjectKeys
Since: 8.0

Rhino.FileIO.FileCsvWriteOptions.ObjectsTexts
Since: 8.0

Rhino.FileIO.FileCsvWriteOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0