Rhino.Runtime.RhinoAccounts.ProgressState
Describes the state of progress.
Since: 7.0

Rhino.Runtime.RhinoAccounts.ProgressState.AwaitingLogin
The task is awaiting for the user to login.

Rhino.Runtime.RhinoAccounts.ProgressState.RetrievingTokens
The task is now negotiating with the remote server for auth tokens.

Rhino.Runtime.RhinoAccounts.ProgressState.AwaitingRedirect
The task is now waiting for redirection to occur.

Rhino.Runtime.RhinoAccounts.ProgressState.Other
Other