Rhino.ApplicationSettings.DraftAngleAnalysisSettingsState
Represents a snapshot of Rhino.ApplicationSettings.DraftAngleAnalysisSettings

Rhino.ApplicationSettings.DraftAngleAnalysisSettingsState.AngleRange
The angle range.
Since: 7.0

Rhino.ApplicationSettings.DraftAngleAnalysisSettingsState.ShowIsoCurves
Show isoparametric curves.
Since: 7.0

Rhino.ApplicationSettings.DraftAngleAnalysisSettingsState.UpDirection
The up direction.
Since: 7.0