Rhino.Render.Utilities.ContentChooserFlags
Since: 7.9

Rhino.Render.Utilities.ContentChooserFlags.None
No flags; normal usage.

Rhino.Render.Utilities.ContentChooserFlags.HideNewTab
Hides the 'New' tab.

Rhino.Render.Utilities.ContentChooserFlags.HideExistingTab
Hides the 'Existing' tab.

Rhino.Render.Utilities.ContentChooserFlags.MultipleSelection
Enables multiple selection.

Rhino.Render.Utilities.ContentChooserFlags.DisableImportButton
Disables the import button.