Rhino.PrivateMeshCommands.MeshTypes.NodeAddress
A node, or the location where edges are attached to eachother.
A NodeAddress does not store any Node index, it merely
bookmarks the positions where to look for Node indices

Rhino.PrivateMeshCommands.MeshTypes.NodeAddress.#ctor(System.Int32,System.Int32)
Constructs a node from start location inside a topology and count
edgeStart:
edgeCount:

Rhino.PrivateMeshCommands.MeshTypes.NodeAddress.EdgeCount
The number of edges at this Node

Rhino.PrivateMeshCommands.MeshTypes.NodeAddress.EdgeAt(System.Int32,Rhino.PrivateMeshCommands.MeshTypes.Graph)
Retrieves the Topology edge of the Edge at position i at this Node
i: An edge index smaller than EdgeCount and larger than 0
top: The reference topology
Returns: The Topology edge

Rhino.PrivateMeshCommands.MeshTypes.NodeAddress.EdgeIndexAt(System.Int32,Rhino.PrivateMeshCommands.MeshTypes.Graph)
Retrieves the Topology edge index of the Edge at position i at this Node
i: An index smaller than EdgeCount and larger than 0
top: The reference topology
Returns: The Topology edge index

Rhino.PrivateMeshCommands.MeshTypes.NodeAddress.RevAt(System.Int32,Rhino.PrivateMeshCommands.MeshTypes.Graph)
Retrieves the direction of the Edge at position i at this Node
i: An edge index smaller than EdgeCount and larger than 0
top: The reference topology
Returns: A boolean indicating if the edge is oriented frontal or backwards

Rhino.PrivateMeshCommands.MeshTypes.NodeAddress.ToString
The string representation of this edge
Returns: A string with the amount of vertices at this node