Rhino.UI.Controls.CollapsibleSectionViewModel
Derive from this class to implement your own view model that wraps around a built
in implementation of IRdkViewModel.  Use GetData etc to implement your properties.

Rhino.UI.Controls.CollapsibleSectionViewModel.#ctor(Rhino.UI.Controls.ICollapsibleSection)
Construct from your section - the view model should be a member of the section
section:
Since: 6.0

Rhino.UI.Controls.CollapsibleSectionViewModel.GetData(System.Guid,System.Boolean,System.Boolean)
Call for an interface to data
uuidDataType:
bForWrite:
bAutoChangeBracket:
Returns:
Since: 6.0

Rhino.UI.Controls.CollapsibleSectionViewModel.Commit(System.Guid)
uuidDataType:
Since: 6.0

Rhino.UI.Controls.CollapsibleSectionViewModel.Discard(System.Guid)
uuidDataType:
Since: 6.0

Rhino.UI.Controls.CollapsibleSectionViewModel.UndoHelper(System.String)
Helper function to ease the use of undo records
description:
Returns: Return the undo record
Since: 6.0

Rhino.UI.Controls.CollapsibleSectionViewModel.CppPointer
Since: 6.0