Rhino.DocObjects.AnimationProperties.CaptureTypes
Constants that define the mode of the animation tools.
Since: 6.11

Rhino.DocObjects.AnimationProperties.CaptureTypes.Path
Camera and target movement along separate path curves

Rhino.DocObjects.AnimationProperties.CaptureTypes.Turntable
Rotate a view around the target.

Rhino.DocObjects.AnimationProperties.CaptureTypes.Flythrough
Camera and target movement along a path curve

Rhino.DocObjects.AnimationProperties.CaptureTypes.DaySunStudy
Sun movement through a specified calendar day

Rhino.DocObjects.AnimationProperties.CaptureTypes.SeasonalSunStudy
Sun movement through a specified week, month, or year

Rhino.DocObjects.AnimationProperties.CaptureTypes.None
No capture type specified