Rhino.Geometry.Collections.MeshTopologyEdgeList
Represents an entry point to the list of edges in a mesh topology.

Rhino.Geometry.Collections.MeshTopologyEdgeList.Count
Gets the amount of edges in this list.
Since: 5.0

Rhino.Geometry.Collections.MeshTopologyEdgeList.GetTopologyVertices(System.Int32)
Gets the two topology vertices for a given topology edge.
topologyEdgeIndex: An index of a topology edge.
Returns: The pair of vertex indices the edge connects.
Since: 5.0

Rhino.Geometry.Collections.MeshTopologyEdgeList.GetConnectedFaces(System.Int32)
Gets indices of faces connected to an edge.
topologyEdgeIndex: An index of a topology edge that is queried.
Returns: An array of face indices the edge borders. This might be empty on error.
Since: 5.0

Rhino.Geometry.Collections.MeshTopologyEdgeList.GetConnectedFaces(System.Int32,System.Boolean[]@)
Gets indices of faces connected to an edge.
topologyEdgeIndex: An index of a topology edge that is queried.
faceOrientationMatchesEdgeDirection: An array of Boolean values that explains whether each face direction matches the direction of the specified edge.
Returns: An array of face indices the edge borders. This might be empty on error.
Since: 5.0

Rhino.Geometry.Collections.MeshTopologyEdgeList.GetEdgesForFace(System.Int32)
Gets indices of edges that surround a given face.
faceIndex: A face index.
Returns: A new array of indices to the topological edges that are connected with the specified face.
Since: 5.0

Rhino.Geometry.Collections.MeshTopologyEdgeList.GetEdgesForFace(System.Int32,System.Boolean[]@)
Gets indices of edges that surround a given face.
faceIndex: A face index.
sameOrientation:
Same length as returned edge index array. For each edge, the sameOrientation value
tells you if the edge orientation matches the face orientation (true), or is
reversed (false) compared to it.
Returns: A new array of indices to the topological edges that are connected with the specified face.
Since: 5.0

Rhino.Geometry.Collections.MeshTopologyEdgeList.GetEdgeIndex(System.Int32,System.Int32)
Returns index of edge that connects topological vertices.
returns -1 if no edge is found.
topologyVertex1: The first topology vertex index.
topologyVertex2: The second topology vertex index.
Returns: The edge index.
Since: 5.0

Rhino.Geometry.Collections.MeshTopologyEdgeList.EdgeLine(System.Int32)
Gets the 3d line along an edge.
topologyEdgeIndex: The topology edge index.
Returns:
Line along edge. If input is not valid, an Invalid Line is returned.
Since: 5.0

Rhino.Geometry.Collections.MeshTopologyEdgeList.CollapseEdge(System.Int32)
Replaces a mesh edge with a vertex at its center and update adjacent faces as needed.
topologyEdgeIndex: An index of a topology edge in Rhino.Geometry.Mesh.TopologyEdges.
Returns: true if successful.
Since: 5.0

Rhino.Geometry.Collections.MeshTopologyEdgeList.SplitEdge(System.Int32,System.Double)
Divides a mesh edge to create two or more triangles
topologyEdgeIndex: Edge to divide
t:
Parameter along edge. This is the same as getting an EdgeLine and calling PointAt(t) on that line
Returns: true if successful
Since: 5.0

Rhino.Geometry.Collections.MeshTopologyEdgeList.SplitEdge(System.Int32,Rhino.Geometry.Point3d)
Divides a mesh edge to create two or more triangles
topologyEdgeIndex: Edge to divide
point:
Location to perform the split
Returns: true if successful
Since: 5.0

Rhino.Geometry.Collections.MeshTopologyEdgeList.IsEdgeUnwelded(System.Int32)
Determines if the mesh edge is unwelded, or if the mesh faces that share the edge have unique vertex indices.
topologyEdgeIndex: An index of a topology edge in Rhino.Geometry.Mesh.TopologyEdges.
Returns: true if the edge is unwelded, false if the edge is welded.
Since: 6.13

Rhino.Geometry.Collections.MeshTopologyEdgeList.IsSwappableEdge(System.Int32)
Determines if a mesh edge index is valid input for Rhino.Geometry.Collections.MeshTopologyEdgeList.SwapEdge(System.Int32).
topologyEdgeIndex: An index of a topology edge in Rhino.Geometry.Mesh.TopologyEdges.
Returns: true if edge can be swapped.
Since: 5.0

Rhino.Geometry.Collections.MeshTopologyEdgeList.SwapEdge(System.Int32)
If the edge is shared by two triangular face, then the edge is swapped.
topologyEdgeIndex: An index of a topology edge in Rhino.Geometry.Mesh.TopologyEdges.
Returns: true if successful.
Since: 5.0

Rhino.Geometry.Collections.MeshTopologyEdgeList.IsHidden(System.Int32)
Returns true if the topological edge is hidden. The mesh topology
edge is hidden only if either of its mesh topology vertices is hidden.
topologyEdgeIndex: An index of a topology edge in Rhino.Geometry.Mesh.TopologyEdges.
Returns: true if mesh topology edge is hidden.
Since: 5.0

Rhino.Geometry.Collections.MeshTopologyEdgeList.IsNgonInterior(System.Int32)
Returns true if the topological edge is an interior ngon edge
topologyEdgeIndex: An index of a topology edge in Rhino.Geometry.Mesh.TopologyEdges.
Returns: true if mesh topology edge is an interior ngon edge.
Since: 6.0