Rhino.DocObjects.DetailViewObject.ScaleFormat
Detail view object scale formats.
Since: 7.0

Rhino.DocObjects.DetailViewObject.ScaleFormat.None
No formatting

Rhino.DocObjects.DetailViewObject.ScaleFormat.PageLengthToOne
#:1

Rhino.DocObjects.DetailViewObject.ScaleFormat.OneToModelLength
1:#

Rhino.DocObjects.DetailViewObject.ScaleFormat.OneInchToModelLengthFeet
1" = #'

Rhino.DocObjects.DetailViewObject.ScaleFormat.ModelLengthInchToOneFoot
#" = 1'

Rhino.DocObjects.DetailViewObject.ScaleFormat.ModelLengthInchToOneFootInch
#' = 1'-0"