Rhino.FileIO.FileCdWriteOptions
Options for writing a CD file

Rhino.FileIO.FileCdWriteOptions.MeshingParameters
Since: 8.0

Rhino.FileIO.FileCdWriteOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0