Rhino.UI.PanelDefinition
Panel definition created when a panel is registered.

Rhino.UI.PanelDefinition.#ctor(System.Guid,System.Type,System.String,System.String,System.Drawing.Icon,System.Reflection.Assembly,System.String,Rhino.UI.PanelType)
Constructor
plugInId:
type:
englishCaption:
localCaption:
icon:
iconAssembly:
iconResourceId:
panelType:

Rhino.UI.PanelDefinition.Containers(System.UInt32)
Gets the PanelContainers manager for the specified document runtime
serial number.
docSerialNumber:
Returns:

Rhino.UI.PanelDefinition.IconAssembly
Assembly to load the IconResrouceId from, if null the Rhino.UI assembly
is assumed.

Rhino.UI.PanelDefinition.IconResourceId
Embedded resource Id string, resource is loaded from IconAssembly

Rhino.UI.PanelDefinition.m_system_containers
Will be null if PanelType is equal to PanelType.PerDoc otherwise will
be used to manage the container specific instances of a panel

Rhino.UI.PanelDefinition.m_document_containers
Will be null if PanelType is equal to PanelType.System otherwise will
be used to manage document specific container specific instances of a
panel.