Rhino.Render.ContentUuids
Content Guids of RenderContent provided by the RDK SDK.
These Guids can be used to check against RenderContent.TypeId.

Rhino.Render.ContentUuids.BasicMaterialType
Since: 6.0

Rhino.Render.ContentUuids.BlendMaterialType
Since: 6.0

Rhino.Render.ContentUuids.CompositeMaterialType
Since: 6.0

Rhino.Render.ContentUuids.PlasterMaterialType
Since: 6.0

Rhino.Render.ContentUuids.MetalMaterialType
Since: 6.0

Rhino.Render.ContentUuids.PaintMaterialType
Since: 6.0

Rhino.Render.ContentUuids.PlasticMaterialType
Since: 6.0

Rhino.Render.ContentUuids.GemMaterialType
Since: 6.0

Rhino.Render.ContentUuids.GlassMaterialType
Since: 6.0

Rhino.Render.ContentUuids.PictureMaterialType
Since: 6.0

Rhino.Render.ContentUuids.DefaultMaterialInstance
Since: 6.0

Rhino.Render.ContentUuids.V8BlendMaterialType
Rhino V8 Blend material type Guid
Since: 8.0

Rhino.Render.ContentUuids.PhysicallyBasedMaterialType
Since: 7.0

Rhino.Render.ContentUuids.DoubleSidedMaterialType
Since: 7.0

Rhino.Render.ContentUuids.EmissionMaterialType
Since: 7.0

Rhino.Render.ContentUuids.DisplayAttributeMaterialType
Since: 7.5

Rhino.Render.ContentUuids.RealtimeDisplayMaterialType
Since: 6.0

Rhino.Render.ContentUuids.BasicEnvironmentType
Since: 6.0

Rhino.Render.ContentUuids.DefaultEnvironmentInstance
Since: 6.0

Rhino.Render.ContentUuids.Texture2DCheckerTextureType
Since: 6.0

Rhino.Render.ContentUuids.Texture3DCheckerTextureType
Since: 6.0

Rhino.Render.ContentUuids.AdvancedDotTextureType
Since: 6.0

Rhino.Render.ContentUuids.BitmapTextureType
Since: 6.0

Rhino.Render.ContentUuids.BlendTextureType
Since: 6.0

Rhino.Render.ContentUuids.CubeMapTextureType
Since: 6.0

Rhino.Render.ContentUuids.ExposureTextureType
Since: 6.0

Rhino.Render.ContentUuids.FBmTextureType
Since: 6.0

Rhino.Render.ContentUuids.GradientTextureType
Since: 6.0

Rhino.Render.ContentUuids.GraniteTextureType
Since: 6.0

Rhino.Render.ContentUuids.GridTextureType
Since: 6.0

Rhino.Render.ContentUuids.HDRTextureType
Since: 6.0

Rhino.Render.ContentUuids.EXRTextureType
Since: 6.0

Rhino.Render.ContentUuids.MarbleTextureType
Since: 6.0

Rhino.Render.ContentUuids.MaskTextureType
Since: 6.0

Rhino.Render.ContentUuids.NoiseTextureType
Since: 6.0

Rhino.Render.ContentUuids.PerlinMarbleTextureType
Since: 6.0

Rhino.Render.ContentUuids.PerturbingTextureType
Since: 6.0

Rhino.Render.ContentUuids.ProjectionChangerTextureType
Since: 6.0

Rhino.Render.ContentUuids.ResampleTextureType
Since: 6.0

Rhino.Render.ContentUuids.SingleColorTextureType
Since: 6.0

Rhino.Render.ContentUuids.SimpleBitmapTextureType
Since: 6.0

Rhino.Render.ContentUuids.StuccoTextureType
Since: 6.0

Rhino.Render.ContentUuids.TextureAdjustmentTextureType
Since: 6.0

Rhino.Render.ContentUuids.TileTextureType
Since: 6.0

Rhino.Render.ContentUuids.TurbulenceTextureType
Since: 6.0

Rhino.Render.ContentUuids.WavesTextureType
Since: 6.0

Rhino.Render.ContentUuids.WoodTextureType
Since: 6.0

Rhino.Render.ContentUuids.AddTextureType
Since: 8.0

Rhino.Render.ContentUuids.MultiplyTextureType
Since: 8.0

Rhino.Render.ContentUuids.PhysicalSkyTextureType
Since: 8.0

Rhino.Render.ContentUuids.HatchBumpTexture
Since: 6.0

Rhino.Render.ContentUuids.CrossHatchBumpTexture
Since: 6.0

Rhino.Render.ContentUuids.LeatherBumpTexture
Since: 6.0

Rhino.Render.ContentUuids.WoodBumpTexture
Since: 6.0

Rhino.Render.ContentUuids.SpeckleBumpTexture
Since: 6.0

Rhino.Render.ContentUuids.GritBumpTexture
Since: 6.0

Rhino.Render.ContentUuids.DotBumpTexture
Since: 6.0

Rhino.Render.ContentUuids.BasicMaterialCCI
Since: 6.0

Rhino.Render.ContentUuids.BlendMaterialCCI
Since: 6.0

Rhino.Render.ContentUuids.CompositeMaterialCCI
Since: 6.0

Rhino.Render.ContentUuids.BasicEnvironmentCCI
Since: 6.0