Rhino.Display.ColorLAB
Represents a LAB (Lightness, A, B) color with double precision floating point channels.
LAB colors are based on nonlinearly compressed CIE XYZ color space coordinates.
The A and B parameters of a LAB color represent the opponents.

Rhino.Display.ColorLAB.m_alpha
Alpha values are inverted internally! 0 = opaque; 1 = transparent!

Rhino.Display.ColorLAB.#ctor(System.Drawing.Color)
Constructs a new instance of ColorLAB that is equivalent to an ARGB color.
rgb: ARGB color to mimic.
Remarks: Exact conversions between color spaces are often not possible.
Since: 5.0

Rhino.Display.ColorLAB.#ctor(System.Double,System.Double,System.Double)
Constructs a new instance of ColorLAB with custom channel values.
Since: 5.0

Rhino.Display.ColorLAB.#ctor(System.Double,System.Double,System.Double,System.Double)
Constructs a new instance of ColorLAB with custom channel values.
Since: 5.0

Rhino.Display.ColorLAB.CreateFromRGBA(Rhino.Display.ColorRGBA)
Create the nearest LAB equivalent of an RGBA color.
rgb: Target color in RGBA space.
Returns: The LAB equivalent of the RGBA color.
Since: 7.1

Rhino.Display.ColorLAB.CreateFromHSL(Rhino.Display.ColorHSL)
Create the nearest LAB equivalent of an HSL color.
hsl: Target color in HSL space.
Returns: The LAB equivalent of the HSL color.
Since: 5.0

Rhino.Display.ColorLAB.CreateFromCMYK(Rhino.Display.ColorCMYK)
Create the nearest LAB equivalent of a CMYK color.
cmyk: Target color in CMYK space.
Returns: The LAB equivalent of the CMYK color.
Since: 5.0

Rhino.Display.ColorLAB.CreateFromXYZ(Rhino.Display.ColorXYZ)
Create the nearest LAB equivalent of an XYZ color.
xyz: Target color in XYZ space.
Returns: The LAB equivalent of the XYZ color.
Since: 5.0

Rhino.Display.ColorLAB.CreateFromLCH(Rhino.Display.ColorLCH)
Create the nearest LAB equivalent of an LCH color.
lch: Target color in LCH space.
Returns: The LAB equivalent of the LCH color.
Since: 5.0

Rhino.Display.ColorLAB.CreateFromHSV(Rhino.Display.ColorHSV)
Constructs the nearest LAB equivalent of an HSV color.
hsv: Target color in HSV space.
Returns: The LAB equivalent of the HSV color.
Since: 6.0

Rhino.Display.ColorLAB.op_Implicit(Rhino.Display.ColorLAB)~System.Drawing.Color
Implicitly converts a LAB color into a .Net library color.
lab: A LAB color.
Returns: A ARGB .Net library color.

Rhino.Display.ColorLAB.L
Gets or sets the lightness channel. The channel is limited to 0~1.
Since: 5.0

Rhino.Display.ColorLAB.A
Gets or sets the Base channel. The channel is limited to -1~+1.
Since: 5.0

Rhino.Display.ColorLAB.B
Gets or sets the Opponent channel. The channel is limited to -1~+1.
Since: 5.0

Rhino.Display.ColorLAB.Alpha
Gets or sets the Alpha channel. The channel is limited to 0~1.
Since: 5.0