Rhino.Geometry.SubDCreationOptions.InteriorCreaseOption
Specifies the test used to determine when an interior mesh edge generates an interior SubD creased edge.

Rhino.Geometry.SubDCreationOptions.InteriorCreaseOption.Unset
The interior crease test is not defined.

Rhino.Geometry.SubDCreationOptions.InteriorCreaseOption.None
No interior creases.

Rhino.Geometry.SubDCreationOptions.InteriorCreaseOption.AtMeshDoubleEdge
An interior mesh double edge will create an interior SubD creased edge.
An interior mesh double edge occurs when the sides of two mesh faces have
have distinct vertex indices and identical vertex locations.