Rhino.DocObjects.DimensionStyle.LengthDisplay
Dimension display length unit system and style

Rhino.DocObjects.DimensionStyle.LengthDisplay.ModelUnits
Decimal current model units

Rhino.DocObjects.DimensionStyle.LengthDisplay.Millmeters
Decimal Millimeters

Rhino.DocObjects.DimensionStyle.LengthDisplay.Centimeters
Decimal Centimeters

Rhino.DocObjects.DimensionStyle.LengthDisplay.Meters
Decimal Meters

Rhino.DocObjects.DimensionStyle.LengthDisplay.Kilometers
Decimal Kilometers

Rhino.DocObjects.DimensionStyle.LengthDisplay.InchesDecimal
Decimal Inches

Rhino.DocObjects.DimensionStyle.LengthDisplay.InchesFractional
Fractional Inches ( 1.75 inches displays as 1-3/4 )

Rhino.DocObjects.DimensionStyle.LengthDisplay.FeetDecimal
Decimal Feet

Rhino.DocObjects.DimensionStyle.LengthDisplay.FeetAndInches
Feet and Inches ( 14.75 inches displays as 1'-2-3/4" )

Rhino.DocObjects.DimensionStyle.LengthDisplay.Miles
Decimal Miles