Rhino.Geometry.LinearDimension
Represents a linear dimension

Rhino.Geometry.LinearDimension.#ctor
Since: 5.0

Rhino.Geometry.LinearDimension.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.Point2d,Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)
Since: 5.0

Rhino.Geometry.LinearDimension.FromPoints(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Initializes a new instance of the Rhino.Geometry.LinearDimension class, based on three points.
Since: 5.0

Rhino.Geometry.LinearDimension.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor used in serialization.

Rhino.Geometry.LinearDimension.DistanceBetweenArrowTips
Gets the distance between arrow tips.
Since: 5.0

Rhino.Geometry.LinearDimension.SetLocations(Rhino.Geometry.Point2d,Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)
Sets the three locations of the point, using two-dimensional points
that refer to the plane of the annotation.
Since: 5.0

Rhino.Geometry.LinearDimension.Aligned
Gets or sets a value indicating whether this annotation is aligned.
Since: 5.0

Rhino.Geometry.LinearDimension.AnnotationType
Since: 6.0

Rhino.Geometry.LinearDimension.Create(Rhino.Geometry.AnnotationType,Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
Initialize Dimension parameters
dimtype: AnnotationType.Rotated or AnnotationType.Aligned
dimStyle: Dimension's DimensionStyle
plane: Dimension's plane
horizontal: Horizontal reference direction
defpoint1: First definition point
defpoint2: Second definition point
dimlinepoint: Point on dimension line
rotationInPlane: For Rotated style
Returns:
Since: 6.0

Rhino.Geometry.LinearDimension.Get3dPoints(Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)
Get locations of dimension's 3d points
extensionLine1End: First definition point
extensionLine2End: Second definition point
arrowhead1End: First arrowhead point
arrowhead2End: Second Arrowhead point
dimlinepoint: Point on dimension line
textpoint: Text location
Returns: true = success
Since: 6.0

Rhino.Geometry.LinearDimension.ExtensionLine1End
End of the first extension line.
Since: 5.0

Rhino.Geometry.LinearDimension.ExtensionLine2End
End of the second extension line.
Since: 5.0

Rhino.Geometry.LinearDimension.Arrowhead1End
Gets the arrow head end of the first extension line.
Since: 5.0

Rhino.Geometry.LinearDimension.Arrowhead2End
Gets the arrow head end of the second extension line.
Since: 5.0

Rhino.Geometry.LinearDimension.DimensionLinePoint
Point on annotation plane where dimension line starts
Since: 6.0

Rhino.Geometry.LinearDimension.GetTextRectangle(Rhino.Geometry.Point3d[]@)
Since: 6.0

Rhino.Geometry.LinearDimension.GetDistanceDisplayText(Rhino.UnitSystem,Rhino.DocObjects.DimensionStyle)
Since: 6.0