Rhino.DocObjects.DimensionStyle.TextLocation
The location of text in linear, angular, radial, and ordinate dimensions.

Rhino.DocObjects.DimensionStyle.TextLocation.AboveDimLine
Text is above dimension line.

Rhino.DocObjects.DimensionStyle.TextLocation.InDimLine
Text is centered in dimension line.

Rhino.DocObjects.DimensionStyle.TextLocation.BelowDimLine
Text is below dimension line.