Rhino.Geometry.Collections.MeshFaceList
Provides access to the faces and Face related functionality of a Mesh.

Rhino.Geometry.Collections.MeshFaceList.Count
Gets or sets the number of mesh faces. When getting this can includes invalid faces.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceList.QuadCount
Gets the number of faces that are valid quads (4 corners).
Since: 5.0

Rhino.Geometry.Collections.MeshFaceList.TriangleCount
Gets the number of faces that are valid triangles (3 corners).
Since: 5.0

Rhino.Geometry.Collections.MeshFaceList.VertexCount
Gets the number of vertices in the mesh of this face list

Rhino.Geometry.Collections.MeshFaceList.Capacity
Gets or sets the total number of mesh triangles and quads the internal data structure can hold without resizing.
Since: 6.0

Rhino.Geometry.Collections.MeshFaceList.Clear
Clears the Face list on the mesh.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceList.Destroy
Releases all memory allocated to store faces. The list capacity will be 0 after this call.
Subsequent calls can add new items.
Since: 6.0

Rhino.Geometry.Collections.MeshFaceList.AddFace(Rhino.Geometry.MeshFace)
Appends a new mesh face to the end of the mesh face list.
face: Face to add.
Returns: The index of the newly added face.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceList.AddFace(System.Int32,System.Int32,System.Int32)
Appends a new triangular face to the end of the mesh face list.
vertex1: Index of first face corner.
vertex2: Index of second face corner.
vertex3: Index of third face corner.
Returns: The index of the newly added triangle.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceList.AddFace(System.Int32,System.Int32,System.Int32,System.Int32)
Appends a new quadrangular face to the end of the mesh face list.
vertex1: Index of first face corner.
vertex2: Index of second face corner.
vertex3: Index of third face corner.
vertex4: Index of fourth face corner.
Returns: The index of the newly added quad.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceList.AddFaces(System.Collections.Generic.IEnumerable{Rhino.Geometry.MeshFace})
Appends a list of faces to the end of the mesh face list.
faces: Faces to add.
Returns: Indices of the newly created faces
Since: 5.0

Rhino.Geometry.Collections.MeshFaceList.Insert(System.Int32,Rhino.Geometry.MeshFace)
Inserts a mesh face at a defined index in this list.
index: An index.
face: A face.
Throws System.ArgumentOutOfRangeException: If index is negative or >= Count.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceList.SetFace(System.Int32,Rhino.Geometry.MeshFace)
Sets a face at a specific index of the mesh.
index: A position in the list.
face: A face.
Returns: true if the operation succeeded, otherwise false.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceList.SetFace(System.Int32,System.Int32,System.Int32,System.Int32)
Sets a triangular face at a specific index of the mesh.
index: A position in the list.
vertex1: The first vertex index.
vertex2: The second vertex index.
vertex3: The third vertex index.
Returns: true if the operation succeeded, otherwise false.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceList.SetFace(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32)
Sets a quadrangular face at a specific index of the mesh.
index: A position in the list.
vertex1: The first vertex index.
vertex2: The second vertex index.
vertex3: The third vertex index.
vertex4: The fourth vertex index.
Returns: true if the operation succeeded, otherwise false.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceList.GetFace(System.Int32)
Returns the mesh face at the given index.
index: Index of face to get. Must be larger than or equal to zero and
smaller than the Face Count of the mesh.
Returns: The mesh face at the given index on success or MeshFace.Unset if the index is out of range.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceList.MergeAdjacentFaces(System.Int32)
Merges two triangular mesh faces that share an edge into one quadrangular face.
edgeIndex: The common topological edge index.
Returns: true if successful, false otherwise.
Since: 7.6

Rhino.Geometry.Collections.MeshFaceList.GetFaceAspectRatio(System.Int32)
Returns the mesh face at the given index.
index: Index of face to get. Must be larger than or equal to zero and
smaller than the Face Count of the mesh.
Returns: The mesh face at the given index on success or MeshFace.Unset if the index is out of range.
Since: 6.0

Rhino.Geometry.Collections.MeshFaceList.Item(System.Int32)
Returns the mesh face at the given index.
index: Index of face to get. Must be larger than or equal to zero and
smaller than the Face Count of the mesh.

Rhino.Geometry.Collections.MeshFaceList.GetFaceVertices(System.Int32,Rhino.Geometry.Point3f@,Rhino.Geometry.Point3f@,Rhino.Geometry.Point3f@,Rhino.Geometry.Point3f@)
Gets the 3D location of the vertices forming a face.
faceIndex: A face index.
a: A first point. This out argument is assigned during the call.
b: A second point. This out argument is assigned during the call.
c: A third point. This out argument is assigned during the call.
d: A fourth point. This out argument is assigned during the call.
Returns: true if the operation succeeded, otherwise false.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceList.GetFaceBoundingBox(System.Int32)
Gets the bounding box of a face.
faceIndex: A face index.
Returns: A new bounding box, or Rhino.Geometry.BoundingBox.Empty on error.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceList.GetFaceCenter(System.Int32)
Gets the center point of a face.
For a triangular face, this is the centroid or barycenter.
For a quad, this is the average of four comer points.
faceIndex: A face index.
Returns: The center point.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceList.AdjacentFaces(System.Int32)
Gets all faces that share a topological edge with a given face.
faceIndex: A face index.
Returns: All indices that share an edge.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceList.ToIntArray(System.Boolean)
Copies all of the face indices to a linear array of indices per face.
Note that this includes indices from invalid faces too.
Returns: The int array. This method never returns null.
asTriangles: If set to true as triangles.
Since: 5.9

Rhino.Geometry.Collections.MeshFaceList.ToIntArray(System.Boolean,System.Collections.Generic.List{System.Int32}@)
Copies all of the faces to a linear array of indices.
Clean-up of vertex indices if replacedIndices is a valid List<int>
///
Returns: The int array. This method never returns null.
asTriangles: If set to true as triangles.
replacedIndices: List is populated with vertex indices that were replaced with 0. If replacedIndices is null there will be no cleanup

Rhino.Geometry.Collections.MeshFaceList.DeleteFaces(System.Collections.Generic.IEnumerable{System.Int32})
Removes a collection of faces from the mesh without affecting the remaining geometry.
faceIndexes: An array containing all the face indices to be removed.
Returns: The number of faces deleted on success.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceList.DeleteFaces(System.Collections.Generic.IEnumerable{System.Int32},System.Boolean)
Removes a collection of faces from the mesh without affecting the remaining geometry.
faceIndexes: An array containing all the face indices to be removed.
compact: If true, removes vertices that are no longer referenced.
Returns: The number of faces deleted on success.
Since: 6.6

Rhino.Geometry.Collections.MeshFaceList.RemoveAt(System.Int32)
Removes a face from the mesh.
index: The index of the face that will be removed.
Throws System.ArgumentOutOfRangeException: If index is < 0 or >= Count.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceList.RemoveAt(System.Int32,System.Boolean)
Removes a face from the mesh.
index: The index of the face that will be removed.
compact: If true, removes vertices that are no longer referenced.
Throws System.ArgumentOutOfRangeException: If index is < 0 or >= Count.
Since: 6.6

Rhino.Geometry.Collections.MeshFaceList.ConvertQuadsToTriangles
Splits all quads along the short diagonal.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceList.ConvertNonPlanarQuadsToTriangles(System.Double,System.Double,System.Int32)
Splits non-planar quads into two triangles based on given parameters.
planarTolerance:
If planarTolerance >= 0, then a quad is split if its vertices
are not coplanar.
If both planarTolerance = Rhino.RhinoMath.UnsetValue and
angleToleranceRadians >= 0.0, then the planarity test is skipped.
angleToleranceRadians:
If angleToleranceRadians >= 0.0, then a quad is split if the
angle between opposite corner normals is > angleToleranceRadians.
The corner normal is the normal to the triangle formed by two
adjacent edges and the diagonal connecting their endpoints.
A quad has four corner normals.
If both angleToleranceRadians = Rhino.RhinoMath.UnsetValue and planarTolerance >= 0.0,
then the corner normal angle test is skipped.
splitMethod:
0 default
Currently divides along the short diagonal. This may be
changed as better methods are found or preferences change.
By passing zero, you let the developers of this code
decide what's best for you over time.
1 divide along the short diagonal
2 divide along the long diagonal
3 minimize resulting area
4 maximize resulting area
5 minimize angle between triangle normals
6 maximize angle between triangle normals
Returns: Number of quads that were converted to triangles.
Remarks:
If both planarTolerance = Rhino.RhinoMath.UnsetValue and angleToleranceRadians = Rhino.RhinoMath.UnsetValue,
then all quads are split.
Since: 6.0

Rhino.Geometry.Collections.MeshFaceList.ConvertTrianglesToQuads(System.Double,System.Double)
Joins adjacent triangles into quads if the resulting quad is 'nice'.
angleToleranceRadians:
Used to compare adjacent triangles' face normals. For two triangles
to be considered, the angle between their face normals has to
be <= angleToleranceRadians. When in doubt use RhinoMath.PI/90.0 (2 degrees).
minimumDiagonalLengthRatio:
( <= 1.0) For two triangles to be considered the ratio of the
resulting quad's diagonals
(length of the shortest diagonal)/(length of longest diagonal).
has to be >= minimumDiagonalLengthRatio. When in doubt us .875.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceList.CullDegenerateFaces
Attempts to removes degenerate faces from the mesh.
Degenerate faces are faces that contains such a combination of indices,
that their final shape collapsed in a line or point.
Before returning, this method also attempts to repair faces by juggling
vertex indices.
Returns: The number of degenerate faces that were removed.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceList.IsHidden(System.Int32)
Gets a value indicating whether a face is hidden.
A face is hidden if, and only if, at least one of its vertices is hidden.
faceIndex: A face index.
Returns: true if hidden, false if fully visible.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceList.HasNakedEdges(System.Int32)
Returns true if at least one of the face edges are not topologically
connected to any other faces.
faceIndex: A face index.
Returns: true if that face makes the mesh open, otherwise false.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceList.GetTopologicalVertices(System.Int32)
Gets the topology vertex indices of a face.
faceIndex: A face index.
Returns: An array of integers.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceList.GetClashingFacePairs(System.Int32)
Gets an array of pairs of mesh faces that clash.
maxPairCount:
If >0, then at most this many pairs will be added to the output array.
If <=0, then all clashing pairs will be added to the output array.
Returns: Array of pairs of mesh face indices.
Since: 6.0

Rhino.Geometry.Collections.MeshFaceList.GetConnectedFaces(System.Int32,System.Double,System.Boolean)
Find all connected face indices where adjacent face normals meet
the criteria of angleRadians and greaterThanAngle
faceIndex: face index to start from
angleRadians: angle to use for comparison of what is connected
greaterThanAngle:
If true angles greater than or equal to are considered connected.
If false, angles less than or equal to are considered connected.
Returns: list of connected face indices
Since: 5.6

Rhino.Geometry.Collections.MeshFaceList.GetConnectedFaces(System.Int32)
Find all connected face indices
faceIndex: face index to start from
Returns: list of connected face indices
Since: 7.1

Rhino.Geometry.Collections.MeshFaceList.GetConnectedFacesToEdges(System.Int32,System.Boolean)
Uses startFaceIndex and finds all connected face indexes up to unwelded
or naked edges. If treatNonmanifoldLikeUnwelded is true then non-manifold
edges will be considered as unwelded or naked
startFaceIndex: Initial face index
treatNonmanifoldLikeUnwelded:
True means non-manifold edges will be handled like unwelded edges,
False means they aren't considered
Returns: Array of connected face indexes
Since: 5.6

Rhino.Geometry.Collections.MeshFaceList.GetZeroAreaFaces(System.Int32[]@,System.Int32[]@)
Examines and adds face indexes to whollyDegenerateFaces if the face is a triangle with zero area or a quad both triangles have zero area.
Face indexes are added to partiallyDegenerateFaces when a quad has one triangle with zero area.
whollyDegenerateFaces: Array of indexes for faces, both triangles and quads, that have zero area.
partiallyDegenerateFaces: Array of indexes for quad faces, that have one triangle with zero area.
Returns: Returns true if the mesh has wholly or partially degenerate faces, false otherwise.
Since: 6.0

Rhino.Geometry.Collections.MeshFaceList.RemoveZeroAreaFaces(System.Int32@)
Deletes or fixes mesh faces that have zero area.
fixedFaceCount: Number of fixed partially degenerate faces.
Returns: Number of removed wholly degenerate faces.
Since: 6.0

Rhino.Geometry.Collections.MeshFaceList.GetDuplicateFaces
Finds all of the duplicate faces.
Returns:
The indexes that are duplicates of other indexes if successful.
If there are no duplicate, then an empty array is returned.
Since: 6.0

Rhino.Geometry.Collections.MeshFaceList.ExtractDuplicateFaces
Extracts, or removes, duplicate faces.
Returns: A mesh containing the extracted duplicate faces if successful, null otherwise.
Since: 6.0

Rhino.Geometry.Collections.MeshFaceList.ExtractFaces(System.Collections.Generic.IEnumerable{System.Int32})
Extracts, or removes, faces.
faceIndices: The face indices to be extracted.
Returns: A mesh containing the extracted faces if successful, null otherwise.
Since: 6.0

Rhino.Geometry.Collections.MeshFaceList.System#Collections#Generic#IList{Rhino#Geometry#MeshFace}#Insert(System.Int32,Rhino.Geometry.MeshFace)
Since: 5.0

Rhino.Geometry.Collections.MeshFaceList.System#Collections#Generic#IList{Rhino#Geometry#MeshFace}#RemoveAt(System.Int32)
Since: 5.0

Rhino.Geometry.Collections.MeshFaceList.System#Collections#IList#RemoveAt(System.Int32)
Since: 5.0

Rhino.Geometry.Collections.MeshFaceList.GetEnumerator
Gets an enumerator that yields all faces in this collection.
Returns: The enumerator.
Since: 5.0

Rhino.Geometry.Collections.MeshFaceList.System#Collections#IEnumerable#GetEnumerator
Since: 5.0