Rhino.PlugIns.ValidateResult
ValidateProductKeyDelegate result code.
Since: 5.0

Rhino.PlugIns.ValidateResult.Success
The product key or license is validated successfully.

Rhino.PlugIns.ValidateResult.ErrorShowMessage
There was an error validating the product key or license, the license
manager show an error message.

Rhino.PlugIns.ValidateResult.ErrorHideMessage
There was an error validating the product key or license. The validating
delegate will show an error message, not the license manager.