Rhino.Geometry.Vector2d
Represents the two components of a vector in two-dimensional space,
using System.Double-precision floating point numbers.

Rhino.Geometry.Vector2d.#ctor(System.Double,System.Double)
Initializes a new instance of the vector based on two, X and Y, components.
x: The X (first) component.
y: The Y (second) component.
Since: 5.0

Rhino.Geometry.Vector2d.X
Gets or sets the X (first) component of this vector.
Since: 5.0

Rhino.Geometry.Vector2d.Y
Gets or sets the Y (second) component of this vector.
Since: 5.0

Rhino.Geometry.Vector2d.Length
Computes the length (or magnitude, or size) of this vector.
This is an application of Pythagoras' theorem.
Since: 5.0

Rhino.Geometry.Vector2d.op_Multiply(Rhino.Geometry.Vector2d,System.Double)
Multiplies a vector by a number, having the effect of scaling it.
vector: A vector.
t: A number.
Returns: A new vector that is the original vector coordinate-wise multiplied by t.
Since: 6.0

Rhino.Geometry.Vector2d.op_Multiply(System.Double,Rhino.Geometry.Vector2d)
Multiplies a vector by a number, having the effect of scaling it.
vector: A vector.
t: A number.
Returns: A new vector that is the original vector coordinate-wise multiplied by t.
Since: 6.0

Rhino.Geometry.Vector2d.Multiply(Rhino.Geometry.Vector2d,System.Double)
Multiplies a vector by a number, having the effect of scaling it.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
vector: A vector.
t: A number.
Returns: A new vector that is the original vector coordinate-wise multiplied by t.
Since: 6.0

Rhino.Geometry.Vector2d.Multiply(System.Double,Rhino.Geometry.Vector2d)
Multiplies a vector by a number, having the effect of scaling it.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
vector: A vector.
t: A number.
Returns: A new vector that is the original vector coordinate-wise multiplied by t.
Since: 6.0

Rhino.Geometry.Vector2d.op_Division(Rhino.Geometry.Vector2d,System.Double)
Divides a Rhino.Geometry.Vector2d by a number, having the effect of shrinking it.
vector: A vector.
t: A number.
Returns: A new vector that is component-wise divided by t.
Since: 6.0

Rhino.Geometry.Vector2d.Divide(Rhino.Geometry.Vector2d,System.Double)
Divides a Rhino.Geometry.Vector2d by a number, having the effect of shrinking it.
(Provided for languages that do not support operator overloading. You can use the / operator otherwise)
vector: A vector.
t: A number.
Returns: A new vector that is component-wise divided by t.
Since: 6.0

Rhino.Geometry.Vector2d.op_Addition(Rhino.Geometry.Vector2d,Rhino.Geometry.Vector2d)
Sums up two vectors.
vector1: A vector.
vector2: A second vector.
Returns: A new vector that results from the component-wise addition of the two vectors.

Rhino.Geometry.Vector2d.Add(Rhino.Geometry.Vector2d,Rhino.Geometry.Vector2d)
Sums up two vectors.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
vector1: A vector.
vector2: A second vector.
Returns: A new vector that results from the component-wise addition of the two vectors.
Since: 6.0

Rhino.Geometry.Vector2d.op_Subtraction(Rhino.Geometry.Vector2d,Rhino.Geometry.Vector2d)
Subtracts the second vector from the first one.
vector1: A vector.
vector2: A second vector.
Returns: A new vector that results from the component-wise difference of vector1 - vector2.
Since: 6.0

Rhino.Geometry.Vector2d.Subtract(Rhino.Geometry.Vector2d,Rhino.Geometry.Vector2d)
Subtracts the second vector from the first one.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
vector1: A vector.
vector2: A second vector.
Returns: A new vector that results from the component-wise difference of vector1 - vector2.
Since: 6.0

Rhino.Geometry.Vector2d.op_Multiply(Rhino.Geometry.Vector2d,Rhino.Geometry.Vector2d)
Multiplies two vectors together, returning the dot product (or inner product).
vector1: A vector.
vector2: A second vector.
Returns:
A value that results from the evaluation of v1.X*v2.X + v1.Y*v2.Y.
This value equals v1.Length * v2.Length * cos(alpha), where alpha is the angle between vectors.
Since: 6.0

Rhino.Geometry.Vector2d.Multiply(Rhino.Geometry.Vector2d,Rhino.Geometry.Vector2d)
Multiplies two vectors together, returning the dot product (or inner product).
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
vector1: A vector.
vector2: A second vector.
Returns:
A value that results from the evaluation of v1.X*v2.X + v1.Y*v2.Y.
This value equals v1.Length * v2.Length * cos(alpha), where alpha is the angle between vectors.
Since: 6.0

Rhino.Geometry.Vector2d.op_UnaryNegation(Rhino.Geometry.Vector2d)
Computes the opposite vector.
vector: A vector to negate.
Returns: A new vector where all components were multiplied by -1.
Since: 6.0

Rhino.Geometry.Vector2d.Negate(Rhino.Geometry.Vector2d)
Computes the reversed vector.
(Provided for languages that do not support operator overloading. You can use the - unary operator otherwise)
vector: A vector to negate.
Returns: A new vector where all components were multiplied by -1.
Since: 6.0

Rhino.Geometry.Vector2d.op_Equality(Rhino.Geometry.Vector2d,Rhino.Geometry.Vector2d)
Determines whether two vectors have equal values.
a: The first vector.
b: The second vector.
Returns: true if components of the two vectors are pairwise equal; otherwise false.
Since: 5.0

Rhino.Geometry.Vector2d.op_Inequality(Rhino.Geometry.Vector2d,Rhino.Geometry.Vector2d)
Determines whether two vectors have different values.
a: The first vector.
b: The second vector.
Returns: true if any component of the two vectors is pairwise different; otherwise false.
Since: 5.0

Rhino.Geometry.Vector2d.op_LessThan(Rhino.Geometry.Vector2d,Rhino.Geometry.Vector2d)
Determines whether the first specified vector comes before
(has inferior sorting value than) the second vector.
Components have decreasing evaluation priority: first X, then Y.
a: First vector.
b: Second vector.
Returns: true if a.X is smaller than b.X, or a.X == b.X and a.Y is smaller than b.Y; otherwise, false.
Since: 5.0

Rhino.Geometry.Vector2d.op_LessThanOrEqual(Rhino.Geometry.Vector2d,Rhino.Geometry.Vector2d)
Determines whether the first specified vector comes before
(has inferior sorting value than) the second vector, or it is equal to it.
Components have decreasing evaluation priority: first X, then Y.
a: First vector.
b: Second vector.
Returns: true if a.X is smaller than b.X, or a.X == b.X and a.Y <= b.Y; otherwise, false.
Since: 5.0

Rhino.Geometry.Vector2d.op_GreaterThan(Rhino.Geometry.Vector2d,Rhino.Geometry.Vector2d)
Determines whether the first specified vector comes after
(has superior sorting value than) the second vector.
Components have decreasing evaluation priority: first X, then Y.
a: First vector.
b: Second vector.
Returns: true if a.X is larger than b.X, or a.X == b.X and a.Y is larger than b.Y; otherwise, false.
Since: 5.0

Rhino.Geometry.Vector2d.op_GreaterThanOrEqual(Rhino.Geometry.Vector2d,Rhino.Geometry.Vector2d)
Determines whether the first specified vector comes after
(has superior sorting value than) the second vector, or it is equal to it.
Components have decreasing evaluation priority: first X, then Y.
a: First vector.
b: Second vector.
Returns: true if a.X is larger than b.X, or a.X == b.X and a.Y >= b.Y; otherwise, false.
Since: 5.0

Rhino.Geometry.Vector2d.Equals(System.Object)
Determines whether the specified System.Object is a Vector2d and has the same value as the present vector.
obj: The specified object.
Returns: true if obj is Vector2d and has the same components as this; otherwise false.

Rhino.Geometry.Vector2d.Equals(Rhino.Geometry.Vector2d)
Determines whether the specified vector has the same value as the present vector.
vector: The specified vector.
Returns: true if vector has the same components as this; otherwise false.
Since: 5.0

Rhino.Geometry.Vector2d.EpsilonEquals(Rhino.Geometry.Vector2d,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:
Since: 5.4

Rhino.Geometry.Vector2d.CompareTo(Rhino.Geometry.Vector2d)
Compares this Rhino.Geometry.Vector2d with another Rhino.Geometry.Vector2d.
Components evaluation priority is first X, then Y.
other: The other Rhino.Geometry.Vector2d to use in comparison.
Returns:
0: if this is identical to other
-1: if this.X < other.X
-1: if this.X == other.X and this.Y < other.Y
+1: otherwise.
Since: 5.0

Rhino.Geometry.Vector2d.GetHashCode
Provides a hashing value for the present vector.
Returns: A non-unique number based on vector components.

Rhino.Geometry.Vector2d.ToString
Constructs a string representation of the current vector.
Returns: A string in the form X,Y.

Rhino.Geometry.Vector2d.ToString(System.String,System.IFormatProvider)
Since: 7.0

Rhino.Geometry.Vector2d.Zero
Gets the value of the vector with components 0,0.
Since: 5.0

Rhino.Geometry.Vector2d.Unset
Gets the value of the vector with components set as RhinoMath.UnsetValue,RhinoMath.UnsetValue.
Since: 5.0

Rhino.Geometry.Vector2d.IsValid
Gets a value indicating whether this vector is valid.
A valid vector must be formed of valid component values for x, y and z.
Since: 5.7

Rhino.Geometry.Vector2d.SquareLength
Returns the square of the length of the vector.
Since: 6.0

Rhino.Geometry.Vector2d.IsTiny(System.Double)
Determines whether a vector is very short.
tolerance:
A nonzero value used as the coordinate zero tolerance.
.
Returns: (Math.Abs(X) <= tiny_tol) AND (Math.Abs(Y) <= tiny_tol) AND (Math.Abs(Z) <= tiny_tol).
Since: 6.0

Rhino.Geometry.Vector2d.IsTiny
Uses RhinoMath.ZeroTolerance for IsTiny calculation.
Returns: true if vector is very small, otherwise false.
Since: 6.0

Rhino.Geometry.Vector2d.Unitize
Unitizes the vector in place. A unit vector has length 1 unit.
An invalid or zero length vector cannot be unitized.
Returns: true on success or false on failure.
Since: 5.7

Rhino.Geometry.Vector2d.Rotate(System.Double)
Rotates this vector.
angleRadians: Angle of rotation (in radians).
Returns: true on success, false on failure.
Since: 6.0