Rhino.FileIO.TextLog
Used for collecting text data

Rhino.FileIO.TextLog.#ctor
Creates a text log that stores all text in memory.  Use ToString on this
version of the TextLog to get the text that we written
Since: 5.1

Rhino.FileIO.TextLog.#ctor(System.String)
Creates a text log that writes all text to a file. If no filename is
provided, then text is written to StdOut
filename:
Name of file to create and write to. If null, then text output
is sent to StdOut
Since: 5.1

Rhino.FileIO.TextLog.#ctor(System.IntPtr)
Create a TextLog from a pointer owned elsewhere. Need
to ensure that pointer isn't deleted on Disposal of this array
Since: 6.0

Rhino.FileIO.TextLog.ToString
If the TextLog was constructed using the empty constructor, then the text
information is stored in a runtime string.  The contents of this string
is retrieved using ToString for this case
Returns:

Rhino.FileIO.TextLog.PushIndent
Increase the indentation level
Since: 5.1

Rhino.FileIO.TextLog.PopIndent
Decrease the indentation level
Since: 5.1

Rhino.FileIO.TextLog.IndentSize
0: one tab per indent. >0: number of spaces per indent
Since: 5.1

Rhino.FileIO.TextLog.PrintWrappedText(System.String,System.Int32)
Send text wrapped at a set line length
text:
lineLength:
Since: 5.1

Rhino.FileIO.TextLog.Print(System.String)
Send text to the text log
text:
Since: 5.1

Rhino.FileIO.TextLog.Print(System.String,System.Object)
Send formatted text to the text log
format:
arg0:
Since: 5.1

Rhino.FileIO.TextLog.Print(System.String,System.Object,System.Object)
Send formatted text to the text log
format:
arg0:
arg1:
Since: 5.1

Rhino.FileIO.TextLog.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.FileIO.TextLog.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.1

Rhino.FileIO.TextLog.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.FileIO.TextLog.NewCommandLine
Returns a reference to a TextLog that prints to the Rhino command line.
Each new command line reference holds its own indents.
Remarks: All Print methods of this instance are guaranteed to be thread safe.
Other methods are not guaranteed to be thread safe.
Since: 7.0