Rhino.DocObjects.ViewInfoFocalBlurModes
The different focal blur modes of the ViewInfo
Since: 6.0

Rhino.DocObjects.ViewInfoFocalBlurModes.None
No focal blur

Rhino.DocObjects.ViewInfoFocalBlurModes.Automatic
Auto-focus on selected objects

Rhino.DocObjects.ViewInfoFocalBlurModes.Manual
Fully manual focus