Rhino.UI.LocalizeStringPair
Pair of strings used for localization.

Rhino.UI.LocalizeStringPair.#ctor(System.String,System.String)
Since: 5.0

Rhino.UI.LocalizeStringPair.English
Since: 5.0

Rhino.UI.LocalizeStringPair.Local
Since: 5.0