Rhino.FileIO.FileObjWriteOptions.ActualFilePathOnMac
Remarks:
The path passed to FileExportPlugIn::WriteFile on the Mac
is a temporary path.  The calling function takes care of moving
the temp (.obj) file to it's appropriate location.  We can't use
that to write that path to construct the .mat file because the calling
function doesn't know anything about it.  ActualFilePathOnMac is the path
of the obj file's ultimate destination.  It's only meaningful on the
Mac platform.
Since: 6.3

Rhino.FileIO.FileObjWriteOptions.EolType
Remarks:
Alias/Wavefront OBJ files are ASCII files.
Generally they should have a LF (UNIX)
as the end-of-line marker.
Since: 6.0

Rhino.FileIO.FileObjWriteOptions.AngleTolRadians
If trim is TL_OBJ_FILE_TRIM_POLYLINE,
angle_tol (in radians) controls the
level of linearization on parameter
space trimming curves.

Rhino.FileIO.FileObjWriteOptions.TrimCurveType
trimming curve option
Since: 6.0

Rhino.FileIO.FileObjWriteOptions.ObjectType
Since: 6.0

Rhino.FileIO.FileObjWriteOptions.ExportObjectNames
Setting to determine what object names in Rhino
will become in the OBJ output file
Since: 6.0

Rhino.FileIO.FileObjWriteOptions.ExportGroupNameLayerNames
Setting to determine whether object, group or layer names
will become "g"s in the OBJ output file
Since: 6.0

Rhino.FileIO.FileObjWriteOptions.ExportMaterialDefinitions
Setting to write an .mtl file and "usemtl"s in the obj file
Since: 6.0

Rhino.FileIO.FileObjWriteOptions.UseDisplayColorForMaterial
Setting to display color as material when material index for object is -1.
Since: 7.0

Rhino.FileIO.FileObjWriteOptions.MapZtoY
Setting to transform Rhino's Z axis to OBJ's Y axis
Since: 6.0

Rhino.FileIO.FileObjWriteOptions.SignificantDigits
Number of significant digits to write out for floating point numbers
Since: 6.0

Rhino.FileIO.FileObjWriteOptions.WrapLongLines
Setting to enable/disable line wrapping with "\"s
Since: 6.0

Rhino.FileIO.FileObjWriteOptions.MergeNestedGroupingNames
Setting to merge nested layer or group names into a single OBJ group name
Remarks:
Setting this to true will take a layer setup like this in Rhino
Grandparent
Parent
Child
and make a group name of Grandparent__Parent__Child in obj.
If false it will be 3 separate group names in obj and will look like this
in the file.
g Grandparent Parent Child
Since: 6.7

Rhino.FileIO.FileObjWriteOptions.SortObjGroups
Setting to enable/disable sorting of OBJ groups
Remarks:
This is mainly for the sake of making an obj file more human readable,
however, it is important that it happens when a user has opted to write
Rhino groups as OBJ "g"s since it is not necessary for every object in Rhino
to be part of a group.
Since: 6.0

Rhino.FileIO.FileObjWriteOptions.PolylineType
Since: 8.0

Rhino.FileIO.FileObjWriteOptions.MeshType
Since: 6.0

Rhino.FileIO.FileObjWriteOptions.SubDMeshType
Since: 7.0

Rhino.FileIO.FileObjWriteOptions.CreateNgons
Setting to enable/disable the creation of ngons for the output
Since: 6.0

Rhino.FileIO.FileObjWriteOptions.NgonMode
Since: 7.0

Rhino.FileIO.FileObjWriteOptions.IncludeUnweldedEdgesInNgons
Setting to determine whether unwelded edges are ignored in the
creation of an ngon.
Remarks:
Imagine a plane that has been split and then rejoined.  This
setting determines if you will get one or two ngons in the output.
TODO This is not hooked up yet, Dale hasn't made this available yet.
See RH-30673.
Since: 6.0

Rhino.FileIO.FileObjWriteOptions.CullUnnecessaryVertexesInNgons
Setting to determine whether interior collinear vertexes are part of the
ngon.
Remarks:
Imagine a plane that has been split and then rejoined.  If IncludeUnweldedEdgesInNgons
is set to true then you would get an ngon with 6 vertexes, the corners and one on each edge
that was split.  Setting this to true would remove those 2 vertexes from the interior of the edge.
TODO This is not hooked up yet, Dale hasn't made this available yet.
See RH-30673.
Since: 6.0

Rhino.FileIO.FileObjWriteOptions.MinNgonFaceCount
Minimum number of faces to consider creation of ngon
Since: 6.0

Rhino.FileIO.FileObjWriteOptions.ExportTcs
Enable/disable export of texture coordinates, if they exist.
Since: 6.0

Rhino.FileIO.FileObjWriteOptions.ExportNormals
Enable/disable export of vertex normals, if they exist.
Since: 6.0

Rhino.FileIO.FileObjWriteOptions.ExportAsTriangles
Enable/disable export of faces as triangles.
Since: 7.4

Rhino.FileIO.FileObjWriteOptions.ExportVcs
Enable/disable export of vertex colors, if they exist.
Since: 6.0

Rhino.FileIO.FileObjWriteOptions.VcsFormat
Export vertex colors as 0 == floats (0.0-1.0) or 1 == ints (0-255)
Since: 8.0

Rhino.FileIO.FileObjWriteOptions.ExportOpenMeshes
Enable/Disable bailing when an open mesh is encountered.
Since: 6.0

Rhino.FileIO.FileObjWriteOptions.UseRenderMeshes
Use existing or generate render meshes instead of calling RhinoObject.MeshObjects.
Since: 7.0

Rhino.FileIO.FileObjWriteOptions.UnderbarMaterialNames
Enable/disable replacing white space with under-bars in material names.
Since: 6.0

Rhino.FileIO.FileObjWriteOptions.UseSimpleDialog
Determines whether to use the simple or detailed meshing dialog.
Since: 6.0

Rhino.FileIO.FileObjWriteOptions.MeshParameters
Mesh parameters to use when meshing geometry that is not already a mesh.
Since: 6.0

Rhino.FileIO.FileObjWriteOptions.UseRelativeIndexing
Determines whether to use relative indexing.
TRUE = use relative (negative) indexing
FALSE = use absolute (positive) indexing
Remarks:
This only has an impact on non-mesh output.  There is also
no interface in the OBJ export plug-in so code executed when set to
true has not been thoroughly tested.  It has been there forever and migrated
with each successive revision of OBJ export code.
Since: 6.0

Rhino.FileIO.FileObjWriteOptions.SubDSurfaceMeshingDensity
Determines how coarse the mesh output
will be when surface meshing subd objects
See comments for ON_SubDDisplayParameters in opennurbs_mesh.h
for details regarding numbers used.
Since: 7.0

Rhino.FileIO.FileObjWriteOptions.#ctor(Rhino.FileIO.FileWriteOptions)
writeOptions:
Since: 6.0

Rhino.FileIO.FileObjWriteOptions.GetTransform
Calculates the transform combination of ZToY and
any the translation that might occur in a SavewithOrigin.
Since: 6.0