Rhino.Geometry.SubDEdgeType
ON_SubDEdgeType describes a subdivision edge.
ON_SubDEdgeType is typically used when generating text descriptions
or filtering edges during selection processes.
Do not confuse ON_SubDEdgeType and ON_SubDEdgeTag.
The unique types are single bits and suitable for use in bitwise logic.

Rhino.Geometry.SubDEdgeType.Unset
Type is unset or the edge is not valid.

Rhino.Geometry.SubDEdgeType.Wire
The edge has zero faces and the tag is ON_SubDEdgeTag::Crease.

Rhino.Geometry.SubDEdgeType.Boundary
The edge has one face and the tag is ON_SubDEdgeTag::Crease.

Rhino.Geometry.SubDEdgeType.InteriorSmooth
The edge has two faces,
the tag is ON_SubDEdgeTag::Smooth or ON_SubDEdgeTag::SmoothX,
and the edge sharpness is zero.
Note that ON_SubEdge::IsSmoothNotSharp() returns true if and only if ON_SubEdge::EdgeType() is InteriorSmooth.

Rhino.Geometry.SubDEdgeType.InteriorSharp
The edge has two faces,
the tag is ON_SubDEdgeTag::Smooth or ON_SubDEdgeTag::SmoothX,
and the edge sharpness is nonzero.
Note that ON_SubEdge::IsSharp() returns true if and only if ON_SubEdge::EdgeType() is InteriorSharp.

Rhino.Geometry.SubDEdgeType.InteriorCrease
The edge has two faces and the tag is ON_SubDEdgeTag::Crease.

Rhino.Geometry.SubDEdgeType.Nonmanifold
The edge has three or more faces and the tag is ON_SubDEdgeTag::Crease.

Rhino.Geometry.SubDEdgeType.Invalid
The edge has an invalid combination of face count, tag, and sharpness properties.

Rhino.Geometry.SubDEdgeType.InteriorMask
A mask for all interior edge types. Interior edges have 2 faces.

Rhino.Geometry.SubDEdgeType.ValidTypesMask
A mask for all valid edge types.