Rhino.Geometry.Morphs.TaperSpaceMorph
Deforms objects toward or away from a specified axis.

Rhino.Geometry.Morphs.TaperSpaceMorph.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double,System.Boolean,System.Boolean)
Constructs a taper space morph.
start: Start of the taper axis.
end: End of the taper axis.
startRadius: Radius at start point.
endRadius: Radius at end point.
bFlat: If true, then a one-directional, one-dimensional taper is created.
infiniteTaper: If false, the deformation takes place only the length of the axis. If true, the deformation happens throughout the object, even if the axis is shorter.
Since: 5.9

Rhino.Geometry.Morphs.TaperSpaceMorph.IsValid
Returns true if the space morph definition is valid, false otherwise.
Since: 5.9

Rhino.Geometry.Morphs.TaperSpaceMorph.MorphPoint(Rhino.Geometry.Point3d)
Morphs an Euclidean point.
point: A point that will be morphed by this object.
Returns: Resulting morphed point.
Since: 5.9

Rhino.Geometry.Morphs.TaperSpaceMorph.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Geometry.Morphs.TaperSpaceMorph.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.9

Rhino.Geometry.Morphs.TaperSpaceMorph.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.