Rhino.FileIO.FileObjWriteOptions.SubDMeshing
Determines whether the surface or control net of a SubD object is used to generate a mesh
Since: 7.0

Rhino.FileIO.FileObjWriteOptions.SubDMeshing.Surface
The SubD surface is used

Rhino.FileIO.FileObjWriteOptions.SubDMeshing.ControlNet
The SubD control net is used