Rhino.Geometry.MeshExtruder
Extrudes a mesh and provides preview

Rhino.Geometry.MeshExtruder.#ctor(Rhino.Geometry.Mesh,System.Collections.Generic.IEnumerable{Rhino.Geometry.ComponentIndex})
Construct object to extrude given mesh faces, edges and ngons.
inputMesh: Mesh to use as starting point. Will not be modified.
componentIndices: Mesh faces, edges and ngons to extrude.
Since: 6.3

Rhino.Geometry.MeshExtruder.Finalize
Destructor

Rhino.Geometry.MeshExtruder.Dispose
Dispose of this object and any unmanaged memory associated with it.
Since: 6.3

Rhino.Geometry.MeshExtruder.PreviewLines
Gets Line objects to preview extruded mesh.
Since: 6.3

Rhino.Geometry.MeshExtruder.ExtrudedMesh(Rhino.Geometry.Mesh@)
Creates new extruded mesh. Returns true if any edges or faces were extruded.
extrudedMeshOut: Extruded mesh
Since: 6.3

Rhino.Geometry.MeshExtruder.ExtrudedMesh(Rhino.Geometry.Mesh@,System.Collections.Generic.List{Rhino.Geometry.ComponentIndex}@)
Creates new extruded mesh. Returns true if any edges or faces were extruded.
extrudedMeshOut: Extruded mesh
componentIndicesOut: Component indices of extruded faces and vertices

Rhino.Geometry.MeshExtruder.GetWallFaces
Return list of faces that were added to connect transformed edges/faces to non-transformed edges/faces.
Returns: List of wall faces
Since: 6.16

Rhino.Geometry.MeshExtruder.Transform
Transform of extrusion
Since: 6.3

Rhino.Geometry.MeshExtruder.UVN
Whether or not to perform extrude in UVN basis.
Since: 6.3

Rhino.Geometry.MeshExtruder.EdgeBasedUVN
Edge based UVN defines UVN directions according to boundary edge directions
Since: 6.4

Rhino.Geometry.MeshExtruder.KeepOriginalFaces
Whether or not to keep original faces.
Since: 6.3

Rhino.Geometry.MeshExtruder.TextureCoordinateMode
Mode for creating texture coordinates for extruded areas
Since: 6.3

Rhino.Geometry.MeshExtruder.SurfaceParameterMode
Mode for creating surface parameters for extruded areas
Since: 6.3

Rhino.Geometry.MeshExtruder.FaceDirectionMode
Face direction mode determines how faces are oriented
Since: 6.3