Rhino.Geometry.SubD.FragmentBispanType
ON_SubDSurfaceNurbsFragment::BispanAccuracy specifies if a bispan surface is an exact or approximate.

Rhino.Geometry.SubD.FragmentBispanType.None
No bispan.

Rhino.Geometry.SubD.FragmentBispanType.Exact
Entire region identified by m_face_region is an exact bicubic patch.

Rhino.Geometry.SubD.FragmentBispanType.Approximate
Entire region identified by m_face_region is approximately a bicubic patch.