Rhino.Render.RenderPipeline
Provides facilities to a render plug-in for integrating with the standard
Rhino render window. Also adds helper functions for processing a render
scene. This is the suggested class to use when integrating a renderer with
Rhino and maintaining a "standard" user interface that users will expect.

Rhino.Render.RenderPipeline.#ctor(Rhino.RhinoDoc,Rhino.Commands.RunMode,Rhino.PlugIns.PlugIn,System.Drawing.Size,System.String,Rhino.Render.RenderWindow.StandardChannels,System.Boolean,System.Boolean)
Constructs a subclass of this object on the stack in your Rhino plug-in's Render() or RenderWindow() implementation.
doc: A Rhino document.
mode: A command running mode, such as scripted or interactive.
plugin: A plug-in.
sizeRendering: The width and height of the rendering.
caption: The caption to display in the frame window.
channels: The color channel or channels.
reuseRenderWindow: This parameter is obsolete.
clearLastRendering:
true If the last rendering should be removed. Indicates that this
render is being done using RenderQuiet(). It specifically makes sure
the render mesh iterator does not display any progress user interface.

Rhino.Render.RenderPipeline.#ctor(Rhino.RhinoDoc,Rhino.Commands.RunMode,Rhino.PlugIns.PlugIn,System.Drawing.Size,System.String,Rhino.Render.RenderWindow.StandardChannels,System.Boolean,System.Boolean,Rhino.Render.AsyncRenderContext@)
Constructs a subclass of this object on the stack in your Rhino plug-in's Render() or RenderWindow() implementation.
This constructor should be used when a non-blocking RenderWindow is required.
Note that the asynchronous render context will not be used when mode is Scripted.
doc: A Rhino document.
mode: A command running mode, such as scripted or interactive.
plugin: A plug-in.
sizeRendering: The width and height of the rendering.
caption: The caption to display in the frame window.
channels: The color channel or channels.
reuseRenderWindow: This parameter is obsolete.
clearLastRendering:
true if the last rendering should be removed. Indicates that this
render is being done using RenderQuiet(). It specifically makes sure
the render mesh iterator does not display any progress user interface.
aRC: The asynchronous render context to set

Rhino.Render.RenderPipeline.SaveImage(System.String,System.Boolean)
Saves the rendered image to a file. Does not prompt the user in any way.
fileName:
Full path to the file name to save to.
saveAlpha:
Determines if alpha will be saved in files that support it (e.g., PNG).
Returns:
Since: 5.14

Rhino.Render.RenderPipeline.CloseWindow
Closes the render window associated with this render instance.
Returns:
Return true if successful or false if not.
Since: 5.11

Rhino.Render.RenderPipeline.LocalizeRenderReturnCode(Rhino.Render.RenderPipeline.RenderReturnCode)
Since: 7.1

Rhino.Render.RenderPipeline.CommandResult
Since: 5.0

Rhino.Render.RenderPipeline.CommandResultFromReturnCode(Rhino.Render.RenderPipeline.RenderReturnCode)
Convert RenderReturnCode to
code:
Returns:

Rhino.Render.RenderPipeline.Render
Call this function to render the scene normally. The function returns when rendering is complete (or cancelled).
Returns: A code that explains how rendering completed.
Since: 5.0

Rhino.Render.RenderPipeline.RenderSessionId
Get the Id associated with this render session, this is useful when
looking up Rhino.Render.RenderPanels.
Since: 5.11

Rhino.Render.RenderPipeline.RenderWindow(Rhino.Display.RhinoView,System.Drawing.Rectangle,System.Boolean)
Call this function to render the scene in a view window. The function returns when rendering is complete (or cancelled).
view: the view that the user selected a rectangle in.
rect: rectangle that the user selected.
inWindow: true to render directly into the view window.
Returns: A code that explains how rendering completed.
//TODO - ViewInfo is wrong here
Since: 5.0

Rhino.Render.RenderPipeline.RenderSize
Since: 5.0
6.4

Rhino.Render.RenderPipeline.RenderSize(Rhino.RhinoDoc)
Get the render size as specified in the ON_3dmRenderSettings. Will automatically return the correct size based on the ActiveView or custom settings.
Returns: The render size.
Since: 6.0

Rhino.Render.RenderPipeline.RenderSize(Rhino.RhinoDoc,System.Boolean)
Get the render size as specified in the ON_3dmRenderSettings, and from RenderSources when
fromRenderSources is true.
Returns: The render size.
Since: 6.0

Rhino.Render.RenderPipeline.SetAsyncRenderContext(Rhino.Render.AsyncRenderContext@)
Since: 6.0

Rhino.Render.RenderPipeline.GetRenderWindow(System.Boolean)
As GetRenderWindow(), but if withWireframeChannel is true
the returned RenderWindow will have the channel added.
withWireframeChannel:
Returns: RenderWindow with wireframe channel enabled, or null
if no RenderWindow can be found (i.e. rendering has completed
already)
Since: 6.0

Rhino.Render.RenderPipeline.GetRenderWindow(System.Boolean,System.Boolean)
As GetRenderWindow().
The parameter withWireframeChannel controls whether
the returned RenderWindow will have the channel added.
The parameter fromRenderViewSource controls from where
the RenderSize is queried.
withWireframeChannel: true if the RenderWindow needs to have a wireframe channel.
fromRenderViewSource: true if the RenderWindow size needs to be set from RenderViewSource size. false will
use the active view.
Returns: RenderWindow if one exists, null otherwise (i.e. rendering
has already completed).
Since: 6.0

Rhino.Render.RenderPipeline.GetRenderWindow(Rhino.DocObjects.ViewportInfo,System.Boolean)
As GetRenderWindow().
The parameter withWireframeChannel controls whether
the returned RenderWindow will have the channel added.
The parameter fromRenderViewSource controls from where
the RenderSize is queried.
The viewportInfo instance will be used to set up wireframe channel. This is necessary for rendering different
view than is currently active in the viewport
viewportInfo: ViewportInfo used to generate the wireframe channel for
fromRenderViewSource: true if the RenderWindow size needs to be set from RenderViewSource size. false will
use the active view.
Returns: RenderWindow if one exists, null otherwise (i.e. rendering
has already completed).
Since: 7.11

Rhino.Render.RenderPipeline.GetRenderWindow(Rhino.DocObjects.ViewportInfo,System.Boolean,System.Drawing.Rectangle)
As GetRenderWindow().
The parameter withWireframeChannel controls whether
the returned RenderWindow will have the channel added.
The parameter fromRenderViewSource controls from where
the RenderSize is queried.
The viewportInfo instance will be used to set up wireframe channel. This is necessary for rendering different
view than is currently active in the viewport
viewportInfo: ViewportInfo used to generate the wireframe channel
fromRenderViewSource: true if the RenderWindow size needs to be set from RenderViewSource size. false will
use the active view.
region: The region to render. Usually the same as the full render window but in the case of
RenderWindow and RenderInWindow, it is the region the user selected in the viewport.
Returns: RenderWindow if one exists, null otherwise (i.e. rendering
has already completed).
Since: 7.19

Rhino.Render.RenderPipeline.GetRenderWindow
Get the RenderWindow associated with this RenderPipeline instance.  This is virtual rather than abstract for V5 compat
Returns: RenderWindow if one exists, null otherwise (i.e. rendering
has already completed).
Since: 5.0

Rhino.Render.RenderPipeline.GetRenderWindowFromRenderViewSource(System.Boolean)
Like GetRenderWindow(), but with the size for RenderWindow
set from RenderViewSources if fromRenderViewSource is set to true
fromRenderViewSource: true if
Returns: RenderWindow if one exists, null otherwise (i.e. rendering
has already completed).
Since: 6.0

Rhino.Render.RenderPipeline.ConfirmationSeconds
Sets the number of seconds that need to elapse during rendering before
the user is asked if the rendered image should be saved.
Since: 5.0

Rhino.Render.RenderPipeline.OnRenderBegin
Called by the framework when it is time to start rendering, the render
window will be created at this point and it is safe to start
Returns:

Rhino.Render.RenderPipeline.OnRenderBeginQuiet(System.Drawing.Size)
Called by the framework when it is time to start rendering quietly,
there is no user interface when rendering in this mode and the default
post process effects will get applied to the scene when the rendering
is complete.
Returns:

Rhino.Render.RenderPipeline.OnRenderWindowBegin(Rhino.Display.RhinoView,System.Drawing.Rectangle)
view:
rectangle:
Returns:

Rhino.Render.RenderPipeline.PlugIn
Since: 5.0

Rhino.Render.RenderPipeline.OnRenderEnd(Rhino.Render.RenderEndEventArgs)
Called by the framework when the user closes the render window or clicks
on the stop button in the render window.
e:

Rhino.Render.RenderPipeline.ContinueModal
Frequently called during a rendering by the frame work in order to
determine if the rendering should continue.
Returns: Returns true if the rendering should continue.

Rhino.Render.RenderPipeline.SupportsPause
Override and return true if the renderer supports pausing
Returns: true if pausing is supported, false otherwise
Since: 6.0

Rhino.Render.RenderPipeline.PauseRendering
Implement to pause the current render session
Since: 6.0

Rhino.Render.RenderPipeline.ResumeRendering
Implement to resume current render session
Since: 6.0

Rhino.Render.RenderPipeline.Dispose
Since: 5.0