Rhino.Render.UI.IUserInterfaceSection
Implement this interface in your user control to get UserInterfaceSection
event notification.

Rhino.Render.UI.IUserInterfaceSection.UserInterfaceDisplayData(Rhino.Render.UI.UserInterfaceSection,Rhino.Render.RenderContent[])
Called by UserInterfaceSection when the selected content changes or a
content field property value changes.
userInterfaceSection:
The UserInterfaceSection object that called this interface method.
renderContentList:
The currently selected list of content items to edit.
Since: 5.1
6.0

Rhino.Render.UI.IUserInterfaceSection.OnUserInterfaceSectionExpanding(Rhino.Render.UI.UserInterfaceSection,System.Boolean)
The UserInterfaceSection object that called this interface method.
userInterfaceSection:
The UserInterfaceSection object that called this interface method.
expanding:
Will be true if the control has been createExpanded or false if it was
collapsed.
Since: 5.1
6.0

Rhino.Render.UI.IUserInterfaceSection.Hidden
Return true if the section should be hidden, else return false.
Remarks:
This is not to be confused with IsShown(). Hidden tells the holder
whether or not to hide the section. IsShown reports the current
physical state of the control.
Remarks:
This method is called continuously by the holder and should be
implemented to be as fast as possible.  It is recommended that the
state be calculated and cached in Rhino.Render.UI.IUserInterfaceSection.UserInterfaceDisplayData(Rhino.Render.UI.UserInterfaceSection,Rhino.Render.RenderContent[])
and the cached value returned here.
Since: 6.0
6.0