Rhino.DocObjects.Material.#ctor
Since: 5.0

Rhino.DocObjects.Material.#ctor(Rhino.DocObjects.Material)
Since: 6.0

Rhino.DocObjects.Material.CopyFrom(Rhino.DocObjects.Material)
Since: 6.0

Rhino.DocObjects.Material.DefaultMaterial
Since: 5.0

Rhino.DocObjects.Material.RenderMaterialInstanceId
Since: 6.0

Rhino.DocObjects.Material.RenderMaterial
Get the RenderMaterial related to this Material.
Will create a new RenderMaterial if none exists. This can happen for older
documents.
Since: 6.0

Rhino.DocObjects.Material.ComponentType
Returns Rhino.DocObjects.ModelComponentType.RenderMaterial.
Since: 6.0

Rhino.DocObjects.Material.IsDeleted
Deleted materials are kept in the runtime material table so that undo
will work with materials.  Call IsDeleted to determine to determine if
a material is deleted.
Since: 5.0

Rhino.DocObjects.Material.IsReference
Rhino allows multiple files to be viewed simultaneously. Materials in the
document are "normal" or "reference". Reference materials are not saved.
Since: 5.0

Rhino.DocObjects.Material.RenderPlugInId
The Id of the RenderPlugIn that is associated with this material.
Since: 5.0

Rhino.DocObjects.Material.IsDefaultMaterial
By default Rhino layers and objects are assigned the default rendering material.
Since: 5.0

Rhino.DocObjects.Material.MaterialIndex
Since: 5.6

Rhino.DocObjects.Material.UseCount
Number of objects and layers that use this material.
Since: 5.0

Rhino.DocObjects.Material.IsDocumentControlled
If true this object may not be modified. Any properties or functions that attempt
to modify this object when it is set to "IsReadOnly" will throw a NotSupportedException.
Since: 5.6

Rhino.DocObjects.Material.Name
Since: 5.0

Rhino.DocObjects.Material.MaxShine
Since: 5.0

Rhino.DocObjects.Material.Shine
Gets or sets the shine factor of the material.
Since: 5.0

Rhino.DocObjects.Material.Transparency
Gets or sets the transparency of the material (0.0 = opaque to 1.0 = transparent)
Since: 5.0

Rhino.DocObjects.Material.IndexOfRefraction
Gets or sets the index of refraction of the material, generally
>= 1.0 (speed of light in vacuum)/(speed of light in material)
Since: 5.1

Rhino.DocObjects.Material.FresnelIndexOfRefraction
Gets or sets the Fresnel index of refraction of the material,
default is 1.56
Since: 6.0

Rhino.DocObjects.Material.RefractionGlossiness
Gets or sets the refraction glossiness.
Since: 6.0

Rhino.DocObjects.Material.ReflectionGlossiness
Gets or sets the reflection glossiness.
Since: 6.0

Rhino.DocObjects.Material.FresnelReflections
Gets or sets if Fresnel reflections are used.
Since: 6.0

Rhino.DocObjects.Material.DisableLighting
Since: 6.0

Rhino.DocObjects.Material.AlphaTransparency
Since: 6.0

Rhino.DocObjects.Material.IsPhysicallyBased
Since: 7.0

Rhino.DocObjects.Material.PhysicallyBased
Since: 7.0

Rhino.DocObjects.Material.ToPhysicallyBased
Since: 7.0

Rhino.DocObjects.Material.Reflectivity
Gets or sets how reflective a material is, 0f is no reflection
1f is 100% reflective.
Since: 5.7

Rhino.DocObjects.Material.PreviewColor
Very simple preview color function for GUIs.
Since: 6.6

Rhino.DocObjects.Material.RDKMaterialID
Gets the RDK material ID.
Remarks:
Multiple Rhino materials ( with unique component IDs)
can have the same RDK material ID.
Since: 8.6

Rhino.DocObjects.Material.DiffuseColor
Since: 5.0

Rhino.DocObjects.Material.AmbientColor
Since: 5.0

Rhino.DocObjects.Material.EmissionColor
Since: 5.0

Rhino.DocObjects.Material.SpecularColor
Since: 5.0

Rhino.DocObjects.Material.ReflectionColor
Since: 5.0

Rhino.DocObjects.Material.TransparentColor
Since: 5.0

Rhino.DocObjects.Material.Default
Set material to default settings.
Since: 5.0

Rhino.DocObjects.Material.SetTexture(Rhino.DocObjects.Texture,Rhino.DocObjects.TextureType)
Set the texture that corresponds with the specified texture type for this material.
texture: An instance of Rhino.DocObjects.Texture
which: Use Rhino.DocObjects.TextureType
Returns:
Since: 7.0

Rhino.DocObjects.Material.GetTexture(Rhino.DocObjects.TextureType)
Get the texture that corresponds with the specified texture type for this material.
which:
Returns:
Since: 7.0

Rhino.DocObjects.Material.GetTextures
Get array of textures that this material uses
Returns:
Since: 5.7

Rhino.DocObjects.Material.GetBitmapTexture
Since: 5.0
Rhino.DocObjects.Material.GetTexture(Rhino.DocObjects.TextureType)

Rhino.DocObjects.Material.SetBitmapTexture(System.String)
Since: 5.0
Rhino.DocObjects.Material.SetTexture(Rhino.DocObjects.Texture,Rhino.DocObjects.TextureType)

Rhino.DocObjects.Material.SetBitmapTexture(Rhino.DocObjects.Texture)
Since: 5.0
Rhino.DocObjects.Material.SetTexture(Rhino.DocObjects.Texture,Rhino.DocObjects.TextureType)

Rhino.DocObjects.Material.GetBumpTexture
Gets the bump texture of this material.
Returns: A texture; or null if no bump texture has been added to this material.
Since: 5.0
Rhino.DocObjects.Material.GetTexture(Rhino.DocObjects.TextureType)

Rhino.DocObjects.Material.SetBumpTexture(System.String)
Since: 5.0
Rhino.DocObjects.Material.SetTexture(Rhino.DocObjects.Texture,Rhino.DocObjects.TextureType)

Rhino.DocObjects.Material.SetBumpTexture(Rhino.DocObjects.Texture)
Since: 5.0
Rhino.DocObjects.Material.SetTexture(Rhino.DocObjects.Texture,Rhino.DocObjects.TextureType)

Rhino.DocObjects.Material.GetEnvironmentTexture
Since: 5.0
Rhino.DocObjects.Material.GetTexture(Rhino.DocObjects.TextureType)

Rhino.DocObjects.Material.SetEnvironmentTexture(System.String)
Since: 5.0
Rhino.DocObjects.Material.SetTexture(Rhino.DocObjects.Texture,Rhino.DocObjects.TextureType)

Rhino.DocObjects.Material.SetEnvironmentTexture(Rhino.DocObjects.Texture)
Since: 5.0
Rhino.DocObjects.Material.SetTexture(Rhino.DocObjects.Texture,Rhino.DocObjects.TextureType)

Rhino.DocObjects.Material.GetTransparencyTexture
Since: 5.0
Rhino.DocObjects.Material.GetTexture(Rhino.DocObjects.TextureType)

Rhino.DocObjects.Material.SetTransparencyTexture(System.String)
Since: 5.0
Rhino.DocObjects.Material.SetTexture(Rhino.DocObjects.Texture,Rhino.DocObjects.TextureType)

Rhino.DocObjects.Material.SetTransparencyTexture(Rhino.DocObjects.Texture)
Since: 5.0
Rhino.DocObjects.Material.SetTexture(Rhino.DocObjects.Texture,Rhino.DocObjects.TextureType)

Rhino.DocObjects.Material.MaterialChannelIdFromIndex(System.Int32)
Finds id of the material channel at given index.
material_channel_index: Index
Returns: Id of the material channel
Since: 6.26

Rhino.DocObjects.Material.MaterialChannelIndexFromId(System.Guid,System.Boolean)
Finds index of the material channel that refers to a material channel with the given id.
Optionally adds channel if one is not found.
material_channel_id: Id
bAddIdIfNotPresent: Controls whether to add channel if none exist
Returns: Index of the material channel
Since: 6.26

Rhino.DocObjects.Material.ClearMaterialChannels
Removes all material channels
Since: 6.26

Rhino.DocObjects.Material.CommitChanges
Since: 5.0

Rhino.DocObjects.Material.SetUserString(System.String,System.String)
Attach a user string (key,value combination) to this geometry.
key: id used to retrieve this string.
value: string associated with key.
Returns: true on success.
Since: 5.0

Rhino.DocObjects.Material.GetUserString(System.String)
Gets a user string.
key: id used to retrieve the string.
Returns: string associated with the key if successful. null if no key was found.
Since: 5.0

Rhino.DocObjects.Material.UserStringCount
Since: 5.0

Rhino.DocObjects.Material.GetUserStrings
Gets an independent copy of the collection of (user text key, user text value) pairs attached to this object.
Returns: A collection of key strings and values strings. This
Since: 5.0