Rhino.Display.CustomDisplay
Provides some basic (indeed, very basic) mechanisms for drawing custom geometry in viewports.

Rhino.Display.CustomDisplay.#ctor(System.Boolean)
Constructs a new CustomDisplay instance. You must call
Dispose() when you are done with this instance, otherwise
the display methods will never be switched off.
enable: If true, the display will be enabled immediately.
Since: 5.0

Rhino.Display.CustomDisplay.Enabled
Gets or sets the Enabled state of this CustomDisplay instance.
If you wish to terminate this CustomDisplay, place a call to Dispose() instead.
Since: 5.0

Rhino.Display.CustomDisplay.IsDisposed
Gets a value indicating whether this CustomDisplay instance has been disposed.
Once a CustomDisplay has been disposed, you can no longer use it.
Since: 5.0

Rhino.Display.CustomDisplay.ClippingBox
Gets the clipping box of this CustomDisplay.
Since: 5.0

Rhino.Display.CustomDisplay.Clear
Clear the drawing lists.
Since: 5.0

Rhino.Display.CustomDisplay.AddPoint(Rhino.Geometry.Point3d)
Adds a new, black point to the display list.
point: Point to add.
Since: 5.0

Rhino.Display.CustomDisplay.AddPoint(Rhino.Geometry.Point3d,System.Drawing.Color)
Adds a new colored point to the display list.
point: Point to add.
color: Color of point.
Since: 5.0

Rhino.Display.CustomDisplay.AddPoint(Rhino.Geometry.Point3d,System.Drawing.Color,Rhino.Display.PointStyle,System.Int32)
Adds a new stylized point to the display list.
point: Point to add.
color: Color of point.
style: Display style of point.
radius: Radius of point widget.
Since: 5.0

Rhino.Display.CustomDisplay.AddPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Adds a collection of black points to the display list.
points: Points to add.
Since: 5.0

Rhino.Display.CustomDisplay.AddPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Drawing.Color)
Adds a collection of colored points to the display list.
points: Points to add.
color: Color of points.
Since: 5.0

Rhino.Display.CustomDisplay.AddPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Drawing.Color,Rhino.Display.PointStyle,System.Int32)
Adds a collection of stylized points to the display list.
points: Points to add.
color: Color of points.
style: Display style of points.
radius: Radius of point widgets.
Since: 5.0

Rhino.Display.CustomDisplay.AddLine(Rhino.Geometry.Line)
Adds a new, black line to the display list.
line: Line to add.
Since: 5.0

Rhino.Display.CustomDisplay.AddLine(Rhino.Geometry.Line,System.Drawing.Color)
Adds a new, colored line to the display list.
line: Line to add.
color: Color of line.
Since: 5.0

Rhino.Display.CustomDisplay.AddLine(Rhino.Geometry.Line,System.Drawing.Color,System.Int32)
Adds a new, colored line to the display list.
line: Line to add.
color: Color of line.
thickness: Thickness of line.
Since: 5.0

Rhino.Display.CustomDisplay.AddVector(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)
Adds a new, black vector to the display list.
anchor: Anchor point of vector.
span: Direction and magnitude of vector.
Since: 5.0

Rhino.Display.CustomDisplay.AddVector(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Color)
Adds a new, colored vector to the display list.
anchor: Anchor point of vector.
span: Direction and magnitude of vector.
color: Color of vector.
Since: 5.0

Rhino.Display.CustomDisplay.AddVector(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Drawing.Color,System.Boolean)
Adds a new, colored vector to the display list.
anchor: Anchor point of vector.
span: Direction and magnitude of vector.
color: Color of vector.
drawAnchor: Include a point at the vector anchor.
Since: 5.0

Rhino.Display.CustomDisplay.AddArc(Rhino.Geometry.Arc)
Adds a new, black arc to the display list.
arc: Arc to add.
Since: 5.0

Rhino.Display.CustomDisplay.AddArc(Rhino.Geometry.Arc,System.Drawing.Color)
Adds a new, colored arc to the display list.
arc: Arc to add.
color: Color of arc.
Since: 5.0

Rhino.Display.CustomDisplay.AddArc(Rhino.Geometry.Arc,System.Drawing.Color,System.Int32)
Adds a new, colored arc to the display list.
arc: Arc to add.
color: Color of arc.
thickness: Thickness of arc.
Since: 5.0

Rhino.Display.CustomDisplay.AddCircle(Rhino.Geometry.Circle)
Adds a new, black circle to the display list.
circle: Circle to add.
Since: 5.0

Rhino.Display.CustomDisplay.AddCircle(Rhino.Geometry.Circle,System.Drawing.Color)
Adds a new, colored arc to the display list.
circle: Circle to add.
color: Color of circle.
Since: 5.0

Rhino.Display.CustomDisplay.AddCircle(Rhino.Geometry.Circle,System.Drawing.Color,System.Int32)
Adds a new, colored circle to the display list.
circle: Circle to add.
color: Color of circle.
thickness: Thickness of circle.
Since: 5.0

Rhino.Display.CustomDisplay.AddCurve(Rhino.Geometry.Curve)
Adds a new, black curve to the display list.
The curve will be duplicated so changes to the
original will not affect the display.
curve: Curve to add.
Since: 5.0

Rhino.Display.CustomDisplay.AddCurve(Rhino.Geometry.Curve,System.Drawing.Color)
Adds a new, colored curve to the display list.
The curve will be duplicated so changes to the
original will not affect the display.
curve: Curve to add.
color: Color of curve.
Since: 5.0

Rhino.Display.CustomDisplay.AddCurve(Rhino.Geometry.Curve,System.Drawing.Color,System.Int32)
Adds a new, colored curve to the display list.
The curve will be duplicated so changes to the
original will not affect the display.
curve: Curve to add.
color: Color of curve.
thickness: Thickness of curve.
Since: 5.0

Rhino.Display.CustomDisplay.AddPolygon(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Drawing.Color,System.Drawing.Color,System.Boolean,System.Boolean)
Adds a polygon to the drawing list. Polygons are not like Hatches, when you supply a concave
polygon, the shading probably won't work.
polygon: Points that define the corners of the polygon.
fillColor: Fill color of polygon.
edgeColor: Edge color of polygon.
drawFill: If true, the polygon contents will be drawn.
drawEdge: If true, the polygon edge will be drawn.
Since: 5.0

Rhino.Display.CustomDisplay.AddText(System.String,Rhino.Geometry.Plane,System.Double)
Adds a new, black 3D text object to the display list.
text: Text to add.
plane: Plane for text orientation.
size: Height (in units) of font.
Since: 5.0

Rhino.Display.CustomDisplay.AddText(System.String,Rhino.Geometry.Plane,System.Double,System.Drawing.Color)
Adds a new, colored 3D text object to the display list.
text: Text to add.
plane: Plane for text orientation.
size: Height (in units) of font.
color: Color of text.
Since: 5.0

Rhino.Display.CustomDisplay.AddText(Rhino.Display.Text3d,System.Drawing.Color)
Adds a new 3D text object to the display list.
text: Text object to add.
color: Color of text object.
Since: 5.0

Rhino.Display.CustomDisplay.Dispose
Dispose this CustomDisplay instance. You must call this function in order to
properly shut down the CustomDisplay.
Since: 5.0