Rhino.FileIO.FileReference
Manages a reference to an existing or non-existing file,
using either or both absolute or relative paths.
Once constructed, this class is immutable.

Rhino.FileIO.FileReference.#ctor(System.String,System.String,Rhino.FileIO.ContentHash,Rhino.FileIO.FileReferenceStatus)
Constructs a new instance of the FileReference class,
given a fullPath, a relativePath a content hash and a status value.
Since: 6.0

Rhino.FileIO.FileReference.ConstructAndOwnFromConstPtr(System.IntPtr)
No need to check for IntPtr.Zero. The resulting FileReference will be subject to garbage collection.

Rhino.FileIO.FileReference.CreateFromFullPath(System.String)
Returns a new file reference. This returns a new instance even if the path does not exist.
fullPath: A full path.
Returns: A file reference to the specified path.
Since: 6.0

Rhino.FileIO.FileReference.CreateFromFullAndRelativePaths(System.String,System.String)
Returns a new file reference. This returns a new instance even if the path does not exist.
fullPath: A full path. This parameter cannot be null.
relativePath: A relative path. This parameter can be null.
Returns: A file reference to the specified paths.
Since: 6.0

Rhino.FileIO.FileReference.FullPath
Gets the absolute path of this file reference.
Since: 6.0

Rhino.FileIO.FileReference.RelativePath
Gets the relative path of this file reference.
Since: 6.0

Rhino.FileIO.FileReference.ContentHash
Gets the content hash.
Since: 6.0

Rhino.FileIO.FileReference.FullPathStatus
Gets the file reference status.
Since: 6.0

Rhino.FileIO.FileReference.IsSet
Returns an indication of the fact that the reference is actually set to a non-null value.
Since: 6.0

Rhino.FileIO.FileReference.Dispose
Reclaims unmanaged resources used by this object.
Since: 6.0

Rhino.FileIO.FileReference.Finalize
