Rhino.FileIO.FileGltfWriteOptions
Options used when writing a glTF file
Since: 8.3

Rhino.FileIO.FileGltfWriteOptions.MapZToY
Setting to transform Rhino's Z axis to glTF's Y axis
Since: 8.3

Rhino.FileIO.FileGltfWriteOptions.ExportMaterials
Setting to determine whether or not materials are written to the glTF file
Since: 8.3

Rhino.FileIO.FileGltfWriteOptions.CullBackfaces
Setting that determines whether or not the meshes in the glTF will be rendered with
or without backface culling.
Known as DoubleSided in the glTF specification.
Since: 8.3

Rhino.FileIO.FileGltfWriteOptions.UseDisplayColorForUnsetMaterials
Setting to display color as material when material index for object is -1.
Since: 8.3

Rhino.FileIO.FileGltfWriteOptions.SubDMeshType
The mesh type for exported SubDs
Since: 8.3

Rhino.FileIO.FileGltfWriteOptions.SubDSurfaceMeshingDensity
Determines how coarse the mesh output
will be when surface meshing subd objects
See comments for ON_SubDDisplayParameters in opennurbs_mesh.h
for details regarding numbers used.
Since: 8.3

Rhino.FileIO.FileGltfWriteOptions.ExportTextureCoordinates
Enable/disable the exporting of texture coordinates
Since: 8.3

Rhino.FileIO.FileGltfWriteOptions.ExportVertexNormals
Enable/disable the exporting of vertex normals
Since: 8.3

Rhino.FileIO.FileGltfWriteOptions.ExportOpenMeshes
Enable/disable the exporting of open meshes
Since: 8.3

Rhino.FileIO.FileGltfWriteOptions.ExportVertexColors
Enable/disable the export of vertex colors
Since: 8.3

Rhino.FileIO.FileGltfWriteOptions.UseDracoCompression
Enable/disable the use of Draco mesh compression in the glTF file
Since: 8.3

Rhino.FileIO.FileGltfWriteOptions.DracoCompressionLevel
The level of compression used by draco in the range of 1 to 10 inclusive.
Since: 8.3

Rhino.FileIO.FileGltfWriteOptions.DracoQuantizationBitsPosition
The number of bits used when quantizing mesh vertex positions in the range of 8 to 32 inclusive
Since: 8.3

Rhino.FileIO.FileGltfWriteOptions.DracoQuantizationBitsNormal
The number of bits used when quantizing mesh normals in the range of 8 to 32 inclusive
Since: 8.3

Rhino.FileIO.FileGltfWriteOptions.DracoQuantizationBitsTextureCoordinate
The number of bits used when quantizing mesh texture coordinates in the range of 8 to 32 inclusive
Since: 8.3

Rhino.FileIO.FileGltfWriteOptions.ExportLayers
glTF uses a scene hierarchy structure where nodes are organized in a parent-child relationship.
This setting enables/disables the writing of empty nodes with the same names as layers and places exported objects
a children of the corresponding layer node.
Since: 8.3

Rhino.FileIO.FileGltfWriteOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.3