Rhino.Runtime.InteropWrappers.SimpleArrayFloat
Wrapper for ON_SimpleArray<float>. If you are not writing C++ code
then this class is not for you.

Rhino.Runtime.InteropWrappers.SimpleArrayFloat.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.
Since: 7.0

Rhino.Runtime.InteropWrappers.SimpleArrayFloat.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.
Since: 7.0

Rhino.Runtime.InteropWrappers.SimpleArrayFloat.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayFloat class.
Since: 7.0

Rhino.Runtime.InteropWrappers.SimpleArrayFloat.#ctor(System.Int32)
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayFloat class.
initialSize: Initial size of the array - all values are set to zero.
Since: 7.0

Rhino.Runtime.InteropWrappers.SimpleArrayFloat.#ctor(Rhino.Runtime.InteropWrappers.SimpleArrayFloat)
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayFloat with the contents of another SimpleArrayFloat.
Since: 7.0

Rhino.Runtime.InteropWrappers.SimpleArrayFloat.CopyTo(Rhino.Runtime.InteropWrappers.SimpleArrayFloat)
Copies the contents of a Rhino.Runtime.InteropWrappers.SimpleArrayFloat into another SimpleArrayFloat.
Since: 7.0

Rhino.Runtime.InteropWrappers.SimpleArrayFloat.#ctor(System.Collections.Generic.IEnumerable{System.Single})
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayFloat class
values: initial set of integers to add to the array
Since: 7.0

Rhino.Runtime.InteropWrappers.SimpleArrayFloat.Count
Gets the amount of elements in this array.
Since: 7.0

Rhino.Runtime.InteropWrappers.SimpleArrayFloat.Array
Return the raw data.
Since: 7.0

Rhino.Runtime.InteropWrappers.SimpleArrayFloat.ToArray
Returns the managed counterpart of the unmanaged array.
Returns: The managed array.
Since: 7.0

Rhino.Runtime.InteropWrappers.SimpleArrayFloat.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.SimpleArrayFloat.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 7.0