Rhino.Geometry.Surface
Represents a base class that is common to most RhinoCommon surface types.
A surface represents an entity that can be all visited by providing
two independent parameters, usually called (u, v), or sometimes (s, t).

Rhino.Geometry.Surface.#ctor
Protected constructor for internal use.

Rhino.Geometry.Surface.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor for internal use.
info: Serialization data.
context: Serialization stream.

Rhino.Geometry.Surface.IsSolid
Gets a values indicating whether a surface is solid.
Since: 5.0

Rhino.Geometry.Surface.Domain(System.Int32)
Gets the domain in a direction.
direction: 0 gets first parameter, 1 gets second parameter.
Returns: An interval value.
Since: 5.0

Rhino.Geometry.Surface.SetDomain(System.Int32,Rhino.Geometry.Interval)
Sets the domain in a direction.
direction:
0 sets first parameter's domain, 1 sets second parameter's domain.
domain: A new domain to be assigned.
Returns: true if setting succeeded, otherwise false.
Since: 5.0

Rhino.Geometry.Surface.Degree(System.Int32)
Returns the maximum algebraic degree of any span
(or a good estimate if curve spans are not algebraic).
direction:
0 gets first parameter's domain, 1 gets second parameter's domain.
Returns: The maximum degree.
Since: 5.0

Rhino.Geometry.Surface.SpanCount(System.Int32)
Gets number of smooth nonempty spans in the parameter direction.
direction:
0 gets first parameter's domain, 1 gets second parameter's domain.
Returns: The span count.
Since: 5.0

Rhino.Geometry.Surface.GetSpanVector(System.Int32)
Gets array of span "knots".
direction:
0 gets first parameter's domain, 1 gets second parameter's domain.
Returns: An array with span vectors; or null on error.
Since: 5.0

Rhino.Geometry.Surface.Reverse(System.Int32)
Reverses parameterization Domain changes from [a,b] to [-b,-a]
direction:
0 for first parameter's domain, 1 for second parameter's domain.
Returns: a new reversed surface on success.
Since: 5.0

Rhino.Geometry.Surface.Reverse(System.Int32,System.Boolean)
Same as Reverse, but if inPlace is set to true this Surface is modified
instead of a new copy being created.
direction:
0 for first parameter's domain, 1 for second parameter's domain.
inPlace:
Returns:
If inPlace is False, a new reversed surface on success. If inPlace is
true, this surface instance is returned on success.
Since: 5.8

Rhino.Geometry.Surface.Transpose
Transposes surface parameterization (swap U and V)
Returns: New transposed surface on success, null on failure.
Since: 5.0

Rhino.Geometry.Surface.Transpose(System.Boolean)
Transposes surface parameterization (swap U and V)
inPlace:
Returns: New transposed surface on success, null on failure.
Since: 5.8

Rhino.Geometry.Surface.PointAt(System.Double,System.Double)
Evaluates a point at a given parameter.
u: evaluation parameters.
v: evaluation parameters.
Returns: Point3d.Unset on failure.
Since: 5.0

Rhino.Geometry.Surface.NormalAt(System.Double,System.Double)
Computes the surface normal at a point.
This is the simple evaluation call - it does not support error handling.
u: A U parameter.
v: A V parameter.
Returns: The normal.
Since: 5.0

Rhino.Geometry.Surface.FrameAt(System.Double,System.Double,Rhino.Geometry.Plane@)
Computes the orient plane on a surface given a U and V parameter.
This is the simple evaluation call with no error handling.
u: A first parameter.
v: A second parameter.
frame: A frame plane that will be computed during this call.
Returns: true if this operation succeeded; otherwise false.
Since: 5.0

Rhino.Geometry.Surface.CurvatureAt(System.Double,System.Double)
Computes the curvature at the given UV coordinate.
u: U parameter for evaluation.
v: V parameter for evaluation.
Returns: Surface Curvature data for the point at UV or null on failure.
Since: 5.0

Rhino.Geometry.Surface.IsIsoparametric(Rhino.Geometry.Curve,Rhino.Geometry.Interval)
Determines if a 2D curve is isoparametric in the parameter space of this surface.
curve: Curve to test.
curveDomain: Sub domain of the curve.
Returns: IsoStatus flag describing the iso-parametric relationship between the surface and the curve.
Since: 5.0

Rhino.Geometry.Surface.IsIsoparametric(Rhino.Geometry.Curve)
Determines if a 2d curve is isoparametric in the parameter space of this surface.
curve: Curve to test.
Returns: IsoStatus flag describing the iso-parametric relationship between the surface and the curve.
Since: 5.0

Rhino.Geometry.Surface.IsIsoparametric(Rhino.Geometry.BoundingBox)
Determines if a 2d bounding box is isoparametric in the parameter space of this surface.
bbox: Bounding box to test.
Returns: IsoStatus flag describing the iso-parametric relationship between the surface and the bounding box.
Since: 5.0

Rhino.Geometry.Surface.IsClosed(System.Int32)
Gets a value indicating if the surface is closed in a direction.
direction: 0 = U, 1 = V.
Returns: The indicating boolean value.
Since: 5.0

Rhino.Geometry.Surface.IsPeriodic(System.Int32)
Gets a value indicating if the surface is periodic in a direction (default is false).
direction: 0 = U, 1 = V.
Returns: The indicating boolean value.
Since: 5.0

Rhino.Geometry.Surface.IsSingular(System.Int32)
true if surface side is collapsed to a point.
side:
side of parameter space to test
0 = south, 1 = east, 2 = north, 3 = west.
Returns: True if this specific side of the surface is singular; otherwise, false.
Since: 5.0

Rhino.Geometry.Surface.IsAtSingularity(System.Double,System.Double,System.Boolean)
Tests if a surface parameter value is at a singularity.
u: Surface u parameter to test.
v: Surface v parameter to test.
exact:
If true, test if (u,v) is exactly at a singularity.
If false, test if close enough to cause numerical problems.
Returns: true if surface is singular at (s,t)
Since: 5.0

Rhino.Geometry.Surface.IsAtSeam(System.Double,System.Double)
Tests if a surface parameter value is at a seam.
u: Surface u parameter to test.
v: Surface v parameter to test.
Returns:
0 if not a seam,
1 if u == Domain(0)[i] and srf(u, v) == srf(Domain(0)[1-i], v)
2 if v == Domain(1)[i] and srf(u, v) == srf(u, Domain(1)[1-i])
3 if 1 and 2 are true.
Since: 5.0

Rhino.Geometry.Surface.IsContinuous(Rhino.Geometry.Continuity,System.Double,System.Double)
Tests continuity at a surface parameter value.
continuityType: The continuity type to sample.
u: Surface u parameter to test.
v: Surface v parameter to test.
Returns: true if the surface has at least the specified continuity at the (u,v) parameter.
Since: 5.0

Rhino.Geometry.Surface.GetNextDiscontinuity(System.Int32,Rhino.Geometry.Continuity,System.Double,System.Double,System.Double@)
Searches for a derivative, tangent, or curvature discontinuity.
direction:
If 0, then "u" parameter is checked. If 1, then the "v" parameter is checked.
continuityType: The desired continuity.
t0:
Search begins at t0. If there is a discontinuity at t0, it will be ignored.
This makes it possible to repeatedly call GetNextDiscontinuity and step through the discontinuities.
t1:
(t0 != t1) If there is a discontinuity at t1 is will be ignored unless c is a locus discontinuity
type and t1 is at the start or end of the curve.
t:
if a discontinuity is found, then t reports the parameter at the discontinuity.
Returns:
Parametric continuity tests c = (C0_continuous, ..., G2_continuous):
TRUE if a parametric discontinuity was found strictly between t0 and t1.
Note well that all curves are parametrically continuous at the ends of their domains.
Locus continuity tests c = (C0_locus_continuous, ...,G2_locus_continuous):
TRUE if a locus discontinuity was found strictly between t0 and t1 or at t1 is the
at the end of a curve. Note well that all open curves (IsClosed()=false) are locus
discontinuous at the ends of their domains.  All closed curves (IsClosed()=true) are
at least C0_locus_continuous at the ends of their domains.
Since: 5.0

Rhino.Geometry.Surface.GetNextDiscontinuity(System.Int32,Rhino.Geometry.Continuity,System.Double,System.Double,System.Double,System.Double,System.Double@)
Searches for a derivative, tangent, or curvature discontinuity.
direction:
If 0, then "u" parameter is checked. If 1, then the "v" parameter is checked.
continuityType: The desired continuity.
t0:
Search begins at t0. If there is a discontinuity at t0, it will be ignored.
This makes it possible to repeatedly call GetNextDiscontinuity and step through the discontinuities.
t1:
(t0 != t1) If there is a discontinuity at t1 is will be ignored unless c is a locus discontinuity
type and t1 is at the start or end of the curve.
cosAngleTolerance:
default = cos(1 degree) Used only  when continuityType is G1_continuous or G2_continuous.
If the cosine of the angle between two tangent vectors is <= cos_angle_tolerance, then
a G1 discontinuity is reported.
curvatureTolerance:
(default = ON_SQRT_EPSILON) Used only when continuityType is G2_continuous. If K0 and K1
are curvatures evaluated from above and below and |K0 - K1| > curvature_tolerance, then
a curvature discontinuity is reported.
t:
if a discontinuity is found, then t reports the parameter at the discontinuity.
Returns:
Parametric continuity tests c = (C0_continuous, ..., G2_continuous):
TRUE if a parametric discontinuity was found strictly between t0 and t1.
Note well that all curves are parametrically continuous at the ends of their domains.
Locus continuity tests c = (C0_locus_continuous, ...,G2_locus_continuous):
TRUE if a locus discontinuity was found strictly between t0 and t1 or at t1 is the
at the end of a curve. Note well that all open curves (IsClosed()=false) are locus
discontinuous at the ends of their domains.  All closed curves (IsClosed()=true) are
at least C0_locus_continuous at the ends of their domains.
Since: 7.4

Rhino.Geometry.Surface.Trim(Rhino.Geometry.Interval,Rhino.Geometry.Interval)
Constructs a sub-surface that covers the specified UV trimming domain.
u: Domain of surface along U direction to include in the subsurface.
v: Domain of surface along V direction to include in the subsurface.
Returns: SubSurface on success, null on failure.
Since: 5.0

Rhino.Geometry.Surface.Evaluate(System.Double,System.Double,System.Int32,Rhino.Geometry.Point3d@,Rhino.Geometry.Vector3d[]@)
Evaluates a surface mathematically.
u: A U parameter.
v: A V parameter.
numberDerivatives: The number of derivatives.
point: A point. This out parameter will be assigned during this call.
derivatives: A vector array. This out parameter will be assigned during this call. This can be null.
Returns: true if the operation succeeded; false otherwise.
Remarks:
The partial derivatives will be in the order {Su, Sv} for numberDerivatives = 1,
{Su, Sv, Suu, Suv, Svv} for 2, {Su, Sv, Suu, Suv, Svv, Suuu, Suuv, Suvv, Svvv} for 3,
and similar for higher counts.
Since: 5.0

Rhino.Geometry.Surface.IsoCurve(System.Int32,System.Double)
Gets isoparametric curve.
direction:
0 first parameter varies and second parameter is constant
e.g., point on IsoCurve(0,c) at t is srf(t,c)
This is a horizontal line from left to right
1 first parameter is constant and second parameter varies
e.g., point on IsoCurve(1,c) at t is srf(c,t
This is a vertical line from bottom to top.
constantParameter: The parameter that was constant on the original surface.
Returns: An isoparametric curve or null on error.
Remarks:
In this function "direction" indicates which direction the resulting curve runs.
0: horizontal, 1: vertical
In the other Surface functions that take a "direction" argument,
"direction" indicates if "constantParameter" is a "u" or "v" parameter.
Since: 5.0

Rhino.Geometry.Surface.Split(System.Int32,System.Double)
Splits (divides) the surface into two parts at the specified parameter
direction:
0 = The surface is split vertically. The "west" side is returned as the first
surface in the array and the "east" side is returned as the second surface in
the array.
1 = The surface is split horizontally. The "south" side is returned as the first surface in the array and the "north"
side is returned as the second surface in the array
parameter:
value of constant parameter in interval returned by Domain(direction)
Returns: Array of two surfaces on success
Since: 5.0

Rhino.Geometry.Surface.Extend(System.Int32,Rhino.Geometry.Interval)
Analytically extends the surface to include the interval.
direction:
If 0, Surface.Domain(0) will include the interval. (the first surface parameter).
If 1, Surface.Domain(1) will include the interval. (the second surface parameter).
interval:
If the interval is not included in surface domain, the surface will be extended so that its domain includes the interval.
Note, this method will fail if the surface is closed in the specified direction.
Returns: True if successful, false otherwise.
Since: 7.4

Rhino.Geometry.Surface.ToBrep
Converts the surface into a Brep.
Returns: A Brep with a similar shape like this surface or null.
Since: 5.0

Rhino.Geometry.Surface.HasNurbsForm
Is there a NURBS surface representation of this surface.
Returns:
0 unable to create NURBS representation with desired accuracy.
1 success - NURBS parameterization matches the surface's
2 success - NURBS point locus matches the surface's and the
domain of the NURBS surface is correct. However, This surface's
parameterization and the NURBS surface parameterization may not
match.  This situation happens when getting NURBS representations
of surfaces that have a transcendental parameterization like spheres,
cylinders, and cones.
Since: 5.0

Rhino.Geometry.Surface.ToNurbsSurface
Gets a NURBS surface representation of this surface. Default
tolerance of 0.0 is used.
Returns: NurbsSurface on success, null on failure.
Since: 5.0

Rhino.Geometry.Surface.ToNurbsSurface(System.Double,System.Int32@)
Gets a NURBS surface representation of this surface.
tolerance: tolerance to use when creating NURBS representation.
accuracy:
0 = unable to create NURBS representation with desired accuracy.
1 = success - returned NURBS parameterization matches the surface's
to the desired accuracy.
2 = success - returned NURBS point locus matches the surface's to the
desired accuracy and the domain of the NURBS surface is correct.
However, this surface's parameterization and the NURBS surface
parameterization may not match to the desired accuracy. This
situation happens when getting NURBS representations of surfaces
that have a transcendental parameterization like spheres, cylinders,
and cones.
Returns: NurbsSurface on success, null on failure.
Since: 5.0

Rhino.Geometry.Surface.IsPlanar
Tests a surface to see if it is planar to zero tolerance.
Returns:
true if the surface is planar (flat) to within RhinoMath.ZeroTolerance units (1e-12).
Since: 5.0

Rhino.Geometry.Surface.IsPlanar(System.Double)
Tests a surface to see if it is planar to a given tolerance.
tolerance: tolerance to use when checking.
Returns:
true if there is a plane such that the maximum distance from
the surface to the plane is <= tolerance.
Since: 5.0

Rhino.Geometry.Surface.TryGetPlane(Rhino.Geometry.Plane@)
Tests a surface for planarity and return the plane.
plane: On success, the plane parameters are filled in.
Returns:
true if there is a plane such that the maximum distance from the surface to the plane is <= RhinoMath.ZeroTolerance.
Since: 5.0

Rhino.Geometry.Surface.TryGetPlane(Rhino.Geometry.Plane@,System.Double)
Tests a surface for planarity and return the plane.
plane: On success, the plane parameters are filled in.
tolerance: tolerance to use when checking.
Returns:
true if there is a plane such that the maximum distance from the surface to the plane is <= tolerance.
Since: 5.0

Rhino.Geometry.Surface.IsSphere
Determines if the surface is a portion of a sphere within RhinoMath.ZeroTolerance.
Returns: true if the surface is a portion of a sphere.
Since: 5.0

Rhino.Geometry.Surface.IsSphere(System.Double)
Determines if the surface is a portion of a sphere within a given tolerance.
tolerance: tolerance to use when checking.
Returns: true if the surface is a portion of a sphere.
Since: 5.0

Rhino.Geometry.Surface.TryGetSphere(Rhino.Geometry.Sphere@)
Test a surface to see if it is a portion of a sphere and return the sphere.
sphere: On success, the sphere parameters are filled in.
Returns: true if the surface is a portion of a sphere.
Since: 5.0

Rhino.Geometry.Surface.TryGetSphere(Rhino.Geometry.Sphere@,System.Double)
Test a surface to see if it is a portion of a sphere and return the sphere.
sphere: On success, the sphere parameters are filled in.
tolerance: tolerance to use when checking.
Returns: true if the surface is a portion of a sphere.
Since: 5.0

Rhino.Geometry.Surface.IsCylinder
Determines if the surface is a portion of a cylinder within RhinoMath.ZeroTolerance.
Returns: true if the surface is a portion of a cylinder.
Since: 5.0

Rhino.Geometry.Surface.IsCylinder(System.Double)
Determines if the surface is a portion of a cylinder within a given tolerance.
tolerance: tolerance to use when checking.
Returns: true if the surface is a portion of a cylinder.
Since: 5.0

Rhino.Geometry.Surface.TryGetCylinder(Rhino.Geometry.Cylinder@)
Tests a surface to see if it is a portion of a cylinder within RhinoMath.ZeroTolerance and return the cylinder.
cylinder: On success, the cylinder parameters are filled in.
Returns: true if the surface is a portion of a cylinder.
Remarks:
If successful, an infinite cylinder is returned. When a surface has a cylindrical shape,
even if its ends are not circles on the cylinder, it returns the axis and radius.
You can detect infinite cylinders using Cylinder.IsFinite.
Since: 5.0

Rhino.Geometry.Surface.TryGetCylinder(Rhino.Geometry.Cylinder@,System.Double)
Tests a surface to see if it is a portion of a cylinder and return the infinite cylinder.
cylinder: On success, the cylinder parameters are filled in.
tolerance: tolerance to use when checking.
Returns: true if the surface is a portion of a cylinder.
Remarks:
If successful, an infinite cylinder is returned. When a surface has a cylindrical shape,
even if its ends are not circles on the cylinder, it returns the axis and radius.
You can detect infinite cylinders using Cylinder.IsFinite.
Since: 5.0

Rhino.Geometry.Surface.TryGetFiniteCylinder(Rhino.Geometry.Cylinder@,System.Double)
Tests a surface with the assumption that it might be a right circular cylinder and returns this geometry.
cylinder: On success, the cylinder parameters are filled in.
tolerance: tolerance to use when checking.
Returns: true if the surface is a portion of a cylinder.
Remarks:
If successful, a finite cylinder is returned.
Since: 6.0

Rhino.Geometry.Surface.IsCone
Determines if the surface is a portion of a cone within RhinoMath.ZeroTolerance.
Returns: true if the surface is a portion of a cone.
Since: 5.0

Rhino.Geometry.Surface.IsCone(System.Double)
Determines if the surface is a portion of a cone within a given tolerance.
tolerance: tolerance to use when checking.
Returns: true if the surface is a portion of a cone.
Since: 5.0

Rhino.Geometry.Surface.TryGetCone(Rhino.Geometry.Cone@)
Tests a surface to see if it is a portion of a cone within RhinoMath.ZeroTolerance and return the cone.
cone: On success, the cone parameters are filled in.
Returns: true if the surface is a portion of a cone.
Since: 5.0

Rhino.Geometry.Surface.TryGetCone(Rhino.Geometry.Cone@,System.Double)
Tests a surface to see if it is a portion of a cone and returns the cone.
cone: On success, the cone parameters are filled in.
tolerance: tolerance to use when checking.
Returns: true if the surface is a portion of a cone.
Since: 5.0

Rhino.Geometry.Surface.IsTorus
Determines if the surface is a portion of a torus within RhinoMath.ZeroTolerance.
Returns: true if the surface is a portion of a torus.
Since: 5.0

Rhino.Geometry.Surface.IsTorus(System.Double)
Determines if the surface is a portion of a torus within a given tolerance.
tolerance: tolerance to use when checking.
Returns: true if the surface is a portion of a torus.
Since: 5.0

Rhino.Geometry.Surface.TryGetTorus(Rhino.Geometry.Torus@)
Tests a surface to see if it is a portion of a torus within RhinoMath.ZeroTolerance and returns the torus.
torus: On success, the torus parameters are filled in.
Returns: true if the surface is a portion of a torus.
Since: 5.0

Rhino.Geometry.Surface.TryGetTorus(Rhino.Geometry.Torus@,System.Double)
Tests a surface to see if it is a portion of a torus and returns the torus.
torus: On success, the torus parameters are filled in.
tolerance: tolerance to use when checking.
Returns: true if the surface is a portion of a torus.
Since: 5.0

Rhino.Geometry.Surface.IsSubDFriendly
Returns true if the surface is a non-rational, uniform, natural or periodic, cubic NURBS surface. Otherwise, false is returned.
Since: 7.0

Rhino.Geometry.Surface.CreateTweenSurfacesWithSampling(Rhino.Geometry.Surface,Rhino.Geometry.Surface,System.Int32,System.Int32,System.Double)
Create tween surfaces that gradually transition between two bounding surfaces using point sampling.
surface0: The first, or starting, surface.
surface1: The second, or ending, curve.
numSurfaces: Number of tween surfaces to create.
numSamples: Number of sample points along input surfaces.
tolerance: The tolerance. When in doubt, use the document's model absolute tolerance.
Returns: >An array of tween surfaces if successful, an empty array on error.
Since: 8.14

Rhino.Geometry.Surface.CreateRollingBallFillet(Rhino.Geometry.Surface,Rhino.Geometry.Surface,System.Double,System.Double)
Constructs a rolling ball fillet between two surfaces.
surfaceA: A first surface.
surfaceB: A second surface.
radius: A radius value.
tolerance: A tolerance value.
Returns: A new array of rolling ball fillet surfaces; this array can be empty on failure.
Throws System.ArgumentNullException: If surfaceA or surfaceB are null.
Since: 5.0

Rhino.Geometry.Surface.CreateRollingBallFillet(Rhino.Geometry.Surface,System.Boolean,Rhino.Geometry.Surface,System.Boolean,System.Double,System.Double)
Constructs a rolling ball fillet between two surfaces.
surfaceA: A first surface.
flipA: A value that indicates whether A should be used in flipped mode.
surfaceB: A second surface.
flipB: A value that indicates whether B should be used in flipped mode.
radius: A radius value.
tolerance: A tolerance value.
Returns: A new array of rolling ball fillet surfaces; this array can be empty on failure.
Throws System.ArgumentNullException: If surfaceA or surfaceB are null.
Since: 5.0

Rhino.Geometry.Surface.CreateRollingBallFillet(Rhino.Geometry.Surface,Rhino.Geometry.Point2d,Rhino.Geometry.Surface,Rhino.Geometry.Point2d,System.Double,System.Double)
Constructs a rolling ball fillet between two surfaces.
surfaceA: A first surface.
uvA: A point in the parameter space of FaceA near where the fillet is expected to hit the surface.
surfaceB: A second surface.
uvB: A point in the parameter space of FaceB near where the fillet is expected to hit the surface.
radius: A radius value.
tolerance: A tolerance value used for approximating and intersecting offset surfaces.
Returns: A new array of rolling ball fillet surfaces; this array can be empty on failure.
Throws System.ArgumentNullException: If surfaceA or surfaceB are null.
Since: 5.0

Rhino.Geometry.Surface.CreateExtrusion(Rhino.Geometry.Curve,Rhino.Geometry.Vector3d)
Constructs a surface by extruding a curve along a vector.
profile: Profile curve to extrude.
direction: Direction and length of extrusion.
Returns: A surface on success or null on failure.
Since: 5.0

Rhino.Geometry.Surface.CreateExtrusionToPoint(Rhino.Geometry.Curve,Rhino.Geometry.Point3d)
Constructs a surface by extruding a curve to a point.
profile: Profile curve to extrude.
apexPoint: Apex point of extrusion.
Returns: A Surface on success or null on failure.
Since: 5.0

Rhino.Geometry.Surface.CreatePeriodicSurface(Rhino.Geometry.Surface,System.Int32)
Constructs a periodic surface from a base surface and a direction.
surface: The surface to make periodic.
direction: The direction to make periodic, either 0 = U, or 1 = V.
Returns: A Surface on success or null on failure.
Since: 5.0

Rhino.Geometry.Surface.CreatePeriodicSurface(Rhino.Geometry.Surface,System.Int32,System.Boolean)
Constructs a periodic surface from a base surface and a direction.
surface: The surface to make periodic.
direction: The direction to make periodic, either 0 = U, or 1 = V.
bSmooth:
Controls kink removal. If true, smooths any kinks in the surface and moves control points
to make a smooth surface. If false, control point locations are not changed or changed minimally
(only one point may move) and only the knot vector is altered.
Returns: A periodic surface if successful, null on failure.
Since: 6.0

Rhino.Geometry.Surface.CreateSoftEditSurface(Rhino.Geometry.Surface,Rhino.Geometry.Point2d,Rhino.Geometry.Vector3d,System.Double,System.Double,System.Double,System.Boolean)
Creates a soft edited surface from an existing surface using a smooth field of influence.
surface: The surface to soft edit.
uv:
A point in the parameter space to move from. This location on the surface is moved,
and the move is smoothly tapered off with increasing distance along the surface from
this parameter.
delta: The direction and magnitude, or maximum distance, of the move.
uLength:
The distance along the surface's u-direction from the editing point over which the
strength of the editing falls off smoothly.
vLength:
The distance along the surface's v-direction from the editing point over which the
strength of the editing falls off smoothly.
tolerance: The active document's model absolute tolerance.
fixEnds: Keeps edge locations fixed.
Returns: The soft edited surface if successful. null on failure.
Since: 6.0

Rhino.Geometry.Surface.Smooth(System.Double,System.Boolean,System.Boolean,System.Boolean,System.Boolean,Rhino.Geometry.SmoothingCoordinateSystem)
Smooths a surface by averaging the positions of control points in a specified region.
smoothFactor: The smoothing factor, which controls how much control points move towards the average of the neighboring control points.
bXSmooth: When true control points move in X axis direction.
bYSmooth: When true control points move in Y axis direction.
bZSmooth: When true control points move in Z axis direction.
bFixBoundaries: When true the surface edges don't move.
coordinateSystem: The coordinates to determine the direction of the smoothing.
Returns: The smoothed surface if successful, null otherwise.
Since: 6.0

Rhino.Geometry.Surface.Smooth(System.Double,System.Boolean,System.Boolean,System.Boolean,System.Boolean,Rhino.Geometry.SmoothingCoordinateSystem,Rhino.Geometry.Plane)
Smooths a surface by averaging the positions of control points in a specified region.
smoothFactor: The smoothing factor, which controls how much control points move towards the average of the neighboring control points.
bXSmooth: When true control points move in X axis direction.
bYSmooth: When true control points move in Y axis direction.
bZSmooth: When true control points move in Z axis direction.
bFixBoundaries: When true the surface edges don't move.
coordinateSystem: The coordinates to determine the direction of the smoothing.
plane: If SmoothingCoordinateSystem.CPlane specified, then the construction plane.
Returns: The smoothed surface if successful, null otherwise.
Since: 6.0

Rhino.Geometry.Surface.VariableOffset(System.Double,System.Double,System.Double,System.Double,System.Double)
Copies a surface so that all locations at the corners of the copied surface are specified distances from the original surface.
uMinvMin: Offset distance at Domain(0).Min, Domain(1).Min.
uMinvMax: Offset distance at Domain(0).Min, Domain(1).Max.
uMaxvMin: Offset distance at Domain(0).Max, Domain(1).Min.
uMaxvMax: Offset distance at Domain(0).Max, Domain(1).Max.
tolerance: The offset tolerance.
Returns: The offset surface if successful, null otherwise.
Since: 6.13

Rhino.Geometry.Surface.VariableOffset(System.Double,System.Double,System.Double,System.Double,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d},System.Collections.Generic.IEnumerable{System.Double},System.Double)
Copies a surface so that all locations at the corners, and from specified interior locations, of the copied surface are specified distances from the original surface.
uMinvMin: Offset distance at Domain(0).Min, Domain(1).Min.
uMinvMax: Offset distance at Domain(0).Min, Domain(1).Max.
uMaxvMin: Offset distance at Domain(0).Max, Domain(1).Min.
uMaxvMax: Offset distance at Domain(0).Max, Domain(1).Max.
interiorParameters: An array of interior UV parameters to offset from.
interiorDistances: >An array of offset distances at the interior UV parameters.
tolerance: The offset tolerance.
Returns: The offset surface if successful, null otherwise.
Since: 6.13

Rhino.Geometry.Surface.GetSurfaceSize(System.Double@,System.Double@)
Gets an estimate of the size of the rectangle that would be created
if the 3d surface where flattened into a rectangle.
width: corresponds to the first surface parameter.
height: corresponds to the second surface parameter.
Returns: true if successful.
Re-parameterize a surface to minimize distortion in the map from parameter space to 3d.
Surface surf = ...;
double width, height;
if ( surf.GetSurfaceSize( out width, out height ) )
{
surf.SetDomain( 0, new ON_Interval( 0.0, width ) );
surf.SetDomain( 1, new ON_Interval( 0.0, height ) );
}
Since: 5.0

Rhino.Geometry.Surface.ClosestSide(System.Double,System.Double)
Gets the side that is closest, in terms of 3D-distance, to a U and V parameter.
u: A u parameter.
v: A v parameter.
Returns: A side.
Since: 5.0

Rhino.Geometry.Surface.Extend(Rhino.Geometry.IsoStatus,System.Double,System.Boolean)
Extends an untrimmed surface along one edge.
edge:
Edge to extend.  Must be North, South, East, or West.
extensionLength: distance to extend.
smooth:
true for smooth (C-infinity) extension.
false for a C1- ruled extension.
Returns: New extended surface on success.
Since: 5.0

Rhino.Geometry.Surface.Rebuild(System.Int32,System.Int32,System.Int32,System.Int32)
Rebuilds an existing surface to a given degree and point count.
uDegree: the output surface u degree.
vDegree: the output surface u degree.
uPointCount:
The number of points in the output surface u direction. Must be bigger
than uDegree (maximum value is 1000)
vPointCount:
The number of points in the output surface v direction. Must be bigger
than vDegree (maximum value is 1000)
Returns: new rebuilt surface on success. null on failure.
Since: 5.0

Rhino.Geometry.Surface.RebuildOneDirection(System.Int32,System.Int32,Rhino.Geometry.LoftType,System.Double)
Rebuilds an existing surface with a new surface to a given point count in either the u or v directions independently.
direction: The direction (0 = U, 1 = V).
pointCount: The number of points in the output surface in the "direction" direction.
loftType: The loft type
refitTolerance: The refit tolerance. When in doubt, use the document's model absolute tolerance.
Returns: new rebuilt surface on success. null on failure.
Since: 6.7

Rhino.Geometry.Surface.ClosestPoint(Rhino.Geometry.Point3d,System.Double@,System.Double@)
Input the parameters of the point on the surface that is closest to testPoint.
testPoint: A point to test against.
u: U parameter of the surface that is closest to testPoint.
v: V parameter of the surface that is closest to testPoint.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Surface.LocalClosestPoint(Rhino.Geometry.Point3d,System.Double,System.Double,System.Double@,System.Double@)
Find parameters of the point on a surface that is locally closest to
the testPoint. The search for a local close point starts at seed parameters.
testPoint: A point to test against.
seedU: The seed parameter in the U direction.
seedV: The seed parameter in the V direction.
u: U parameter of the surface that is closest to testPoint.
v: V parameter of the surface that is closest to testPoint.
Returns: true if the search is successful, false if the search fails.
Since: 6.3

Rhino.Geometry.Surface.Offset(System.Double,System.Double)
Constructs a new surface which is offset from the current surface.
distance: Distance (along surface normal) to offset.
tolerance: Offset accuracy.
Returns: The offset surface or null on failure.
Since: 5.0

Rhino.Geometry.Surface.Fit(System.Int32,System.Int32,System.Double)
Fits a new surface through an existing surface.
uDegree: the output surface U degree. Must be bigger than 1.
vDegree: the output surface V degree. Must be bigger than 1.
fitTolerance: The fitting tolerance.
Returns: A surface, or null on error.
Since: 5.0

Rhino.Geometry.Surface.InterpolatedCurveOnSurfaceUV(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d},System.Double)
Returns a curve that interpolates points on a surface. The interpolant lies on the surface.
points: List of at least two UV parameter locations on the surface.
tolerance: Tolerance used for the fit of the push-up curve. Generally, the resulting interpolating curve will be within tolerance of the surface.
Returns: A new NURBS curve if successful, or null on error.
Since: 5.0

Rhino.Geometry.Surface.InterpolatedCurveOnSurfaceUV(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d},System.Double,System.Boolean,System.Int32)
Returns a curve that interpolates points on a surface. The interpolant lies on the surface.
points: List of at least two UV parameter locations on the surface.
tolerance: Tolerance used for the fit of the push-up curve. Generally, the resulting interpolating curve will be within tolerance of the surface.
closed: If false, the interpolating curve is not closed. If true, the interpolating curve is closed, and the last point and first point should generally not be equal.
closedSurfaceHandling:
If 0, all points must be in the rectangular domain of the surface. If the surface is closed in some direction,
then this routine will interpret each point and place it at an appropriate location in the covering space.
This is the simplest option and should give good results.
If 1, then more options for more control of handling curves going across seams are available.
If the surface is closed in some direction, then the points are taken as points in the covering space.
Example, if srf.IsClosed(0)=true and srf.IsClosed(1)=false and srf.Domain(0)=srf.Domain(1)=Interval(0,1)
then if closedSurfaceHandling=1 a point(u, v) in points can have any value for the u coordinate, but must have 0<=v<=1.
In particular, if points = { (0.0,0.5), (2.0,0.5) } then the interpolating curve will wrap around the surface two times in the closed direction before ending at start of the curve.
If closed=true the last point should equal the first point plus an integer multiple of the period on a closed direction.
Returns: A new NURBS curve if successful, or null on error.
Since: 6.18

Rhino.Geometry.Surface.InterpolatedCurveOnSurface(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Double)
Constructs an interpolated curve on a surface, using 3D points.
points: A list, an array or any enumerable set of points.
tolerance: A tolerance value.
Returns: A new NURBS curve, or null on error.
Since: 5.0

Rhino.Geometry.Surface.ShortPath(Rhino.Geometry.Point2d,Rhino.Geometry.Point2d,System.Double)
Constructs a geodesic between 2 points, used by ShortPath command in Rhino.
start: start point of curve in parameter space. Points must be distinct in the domain of the surface.
end: end point of curve in parameter space. Points must be distinct in the domain of the surface.
tolerance: tolerance used in fitting discrete solution.
Returns: a geodesic curve on the surface on success. null on failure.
Since: 5.0

Rhino.Geometry.Surface.Pushup(Rhino.Geometry.Curve,System.Double,Rhino.Geometry.Interval)
Computes a 3d curve that is the composite of a 2d curve and the surface map.
curve2d: a 2d curve whose image is in the surface's domain.
tolerance:
the maximum acceptable distance from the returned 3d curve to the image of curve_2d on the surface.
curve2dSubdomain: The curve interval (a sub-domain of the original curve) to use.
Returns: 3d curve.
Since: 5.0

Rhino.Geometry.Surface.Pushup(Rhino.Geometry.Curve,System.Double)
Computes a 3d curve that is the composite of a 2d curve and the surface map.
curve2d: a 2d curve whose image is in the surface's domain.
tolerance:
the maximum acceptable distance from the returned 3d curve to the image of curve_2d on the surface.
Returns: 3d curve.
Since: 5.0

Rhino.Geometry.Surface.Pullback(Rhino.Geometry.Curve,System.Double)
Pulls a 3d curve back to the surface's parameter space.
curve3d: The curve to pull.
tolerance:
the maximum acceptable 3d distance between from surface(curve_2d(t))
to the locus of points on the surface that are closest to curve_3d.
Returns: 2d curve.
Since: 5.0

Rhino.Geometry.Surface.Pullback(Rhino.Geometry.Curve,System.Double,Rhino.Geometry.Interval)
Pulls a 3d curve back to the surface's parameter space.
curve3d: A curve.
tolerance:
the maximum acceptable 3d distance between from surface(curve_2d(t))
to the locus of points on the surface that are closest to curve_3d.
curve3dSubdomain: A sub-domain of the curve to sample.
Returns: 2d curve.
Since: 5.0

Rhino.Geometry.Surface.GetSurfaceParameterFromNurbsFormParameter(System.Double,System.Double,System.Double@,System.Double@)
Translates a parameter from a value on the surface returned by Rhino.Geometry.Surface.ToNurbsSurface to the current surface.
nurbsS: The parameter in the S, or sometimes U, direction of the NURBS form surface.
nurbsT: The parameter in the T, or sometimes V, direction of the NURBS form surface.
surfaceS: S on this surface.
surfaceT: T o n this surface.
Returns: True if the operation succeeded; otherwise, false.
Since: 6.0

Rhino.Geometry.Surface.GetNurbsFormParameterFromSurfaceParameter(System.Double,System.Double,System.Double@,System.Double@)
Translates a parameter from the current surface to the parameter space of the surface returned by Rhino.Geometry.Surface.ToNurbsSurface.
surfaceS: The parameter in the S, or sometimes U, direction, of this surface.
surfaceT: The parameter in the T, or sometimes V, direction of this surface.
nurbsS: S on the NURBS form.
nurbsT: T on the NURBS form.
Returns: True if the operation succeeded; otherwise, false.
Since: 6.0

Rhino.Geometry.Surface.RefitSplit(Rhino.Geometry.Curve,Rhino.Geometry.Vector3d,System.Double,System.Collections.Generic.IEnumerable{System.Double},System.Boolean,System.Boolean,System.Collections.Generic.List{Rhino.Geometry.Surface},System.Collections.Generic.List{Rhino.Geometry.Surface},System.Collections.Generic.List{Rhino.Geometry.Curve},Rhino.Geometry.Curve@,Rhino.Geometry.Curve@)
Splits the surface into two and refits the split edge
curve: The curve used to split the surface. It must be a simple division, from one edge of the parametric space
to the opposite edge.
trimProjectionDir: Vector for projection, or zero vector for no projection
tolerance: 3d tolerance for projection, splitting, fitting...
Knots:
bMeetCurve:
divideIntoSections: If true, the surface is divided at each knot
srfLower: Surfaces below trim curve in srf's (u,v) domain
srfUpper: Surfaces below trim curve in srf's (u,v) domain
edgeCurve: Curves (# = nSections) fit to trim curve with srf's u/v parameter
trimCurveOnSurface: the actual trim curve as it is projected on or pulled to the surface
splitCurve: the actual fit curve the split the surface
Returns:
Since: 8.0

Rhino.Geometry.Surface.RefitSimplySplitSurface(Rhino.Geometry.Curve,Rhino.Geometry.Vector3d,System.Double,Rhino.Geometry.RefitTrimKnotMode,System.Int32,System.Collections.Generic.IEnumerable{System.Double},Rhino.Geometry.RefitTrimSectionMode,System.Int32,System.Boolean,System.Boolean,Rhino.Geometry.Point3d,System.Boolean,System.Boolean,System.Int32@,System.Collections.Generic.List{Rhino.Geometry.Surface},System.Collections.Generic.List{Rhino.Geometry.Surface},System.Collections.Generic.List{Rhino.Geometry.Curve},System.Double@,Rhino.Geometry.Curve@,Rhino.Geometry.Curve@)
This routine accepts a 3-d trim curve (trimCrv3d).
The trim curve is assumed to run from one surface edge to the opposite edge;
this is referred to as a "simple" trim curve, roughly parallel to one of the
srf directions (either u or v).  We refer to that parameter as the "trim parameter".
The routine splits the surface via the trim curve, and then refits either side
("upper" = "above the trim", and "lower" = "below the trim") as a set of
untrimmed Nurbs surfaces.  The idea is to retain, as much as possible, the
Nurbs structure of srf, especially in the trim parameter.
trimCurve3d: curve that will trim from one edge to the opposite
trimProjectionDir: Vector for projection, or zero vector for no projection
tolerance: 3d tolerance for projection, splitting, fitting...
knotAdditionMode: 0: no, don't add any
1: Yes, add nKnots knots, spaced regularly over the entire surface
2: Yes, add nKnots knots, spaced regularly PER EXISTING SPAN
3: Yes, add nKnots knots, as provided in the array Knots
numInsertKnots: FOr TrimParamKnots != 3, the number of knots to add
Knots: For TrimParamKnots=3, the custom knots to add
sectionMode: 0: no sections, just output one "upper" and one "lower" surface
1: Yes, divide into sections at each of the input surface's existing knots
2: Yes, divide into sections at each of the "nKnot" added knot values
3: Yes, divide into sections at ALL knot values (i.e. both 1 and 2)
numNonTrimSpans: number of spans in the non-trim parameter
meetCurve: Drag the refit surfaces out to meet the original trim curve
oneSided: Inputting an "active" point means you only want one side of the "split" to be refit -
In other words, you want a "trim refit".  Results will be returned in "srfLower"
PtActive: Active point
outputSurface: if true, output fit surfaces: srfLower and, if !bActivePt, srfUpper
outputCurve: if true, output fit curve:  crvEdge
numSections:
lowerSurface: Surfaces (# = nSections) below trim curve in srf's (u,v) domain
upperSurface: Surfaces (# = nSections) above trim curve in srf's (u,v) domain
edgeCurve: Curves (# = nSections) fit to trim curve with srf's u/v parameter
FitMeasurement: Calculated based on trimParamSections
trimCurveOnSurface: the actual trim curve as it is projected on or pulled to the surface
splitCurve: the actual fit curve the split the surface
Returns: true for zuccess, false for failure
Since: 8.0

Rhino.Geometry.Surface.FitCurveToSurface(Rhino.Geometry.Curve,Rhino.Geometry.Vector3d,System.Double,System.Collections.Generic.IEnumerable{System.Double},System.Boolean,Rhino.Geometry.Curve@,Rhino.Geometry.Curve@)
trimCurve3d: curve that will trim from one edge to the opposite
trimProjectionDir: Vector for projection, or zero vector for no projection
tolerance: 3d tolerance for projection, splitting, fitting...
Knots: For TrimParamKnots=3, the custom knots to add
divideIntoSections: If true, the surface is divided at each knot
trimCurveOnSurface: the actual trim curve as it is projected on or pulled to the surface
splitCurve: the actual fit curve the split the surface
Returns:
Since: 8.0