Rhino.FileIO.FileAiReadOptions.Units
Since: 8.0

Rhino.FileIO.FileAiReadOptions.Units.Inches
inches

Rhino.FileIO.FileAiReadOptions.Units.Centimeters
centimeters

Rhino.FileIO.FileAiReadOptions.Units.Millimeters
millimeters

Rhino.FileIO.FileAiReadOptions.Units.Points
points