Rhino.UI.KeyboardKey
Keyboard key recognized by shortcuts
Since: 8.12

Rhino.UI.KeyboardKey.None
No key

Rhino.UI.KeyboardKey.Tab
Tab key

Rhino.UI.KeyboardKey.PageUp
PageUp key

Rhino.UI.KeyboardKey.PageDown
PageDown key

Rhino.UI.KeyboardKey.End
End key

Rhino.UI.KeyboardKey.Home
Home key

Rhino.UI.KeyboardKey.Num0
0 key

Rhino.UI.KeyboardKey.Num1
1 key

Rhino.UI.KeyboardKey.Num2
2 key

Rhino.UI.KeyboardKey.Num3
3 key

Rhino.UI.KeyboardKey.Num4
4 key

Rhino.UI.KeyboardKey.Num5
5 key

Rhino.UI.KeyboardKey.Num6
6 key

Rhino.UI.KeyboardKey.Num7
7 key

Rhino.UI.KeyboardKey.Num8
8 key

Rhino.UI.KeyboardKey.Num9
9 key

Rhino.UI.KeyboardKey.A
A key

Rhino.UI.KeyboardKey.B
B key

Rhino.UI.KeyboardKey.C
C key

Rhino.UI.KeyboardKey.D
D key

Rhino.UI.KeyboardKey.E
E key

Rhino.UI.KeyboardKey.F
F key

Rhino.UI.KeyboardKey.G
G key

Rhino.UI.KeyboardKey.H
H key

Rhino.UI.KeyboardKey.I
I key

Rhino.UI.KeyboardKey.J
J key

Rhino.UI.KeyboardKey.K
K key

Rhino.UI.KeyboardKey.L
L key

Rhino.UI.KeyboardKey.M
M key

Rhino.UI.KeyboardKey.N
N key

Rhino.UI.KeyboardKey.O
O key

Rhino.UI.KeyboardKey.P
P key

Rhino.UI.KeyboardKey.Q
Q key

Rhino.UI.KeyboardKey.R
R key

Rhino.UI.KeyboardKey.S
S key

Rhino.UI.KeyboardKey.T
T key

Rhino.UI.KeyboardKey.U
U key

Rhino.UI.KeyboardKey.V
V key

Rhino.UI.KeyboardKey.W
W key

Rhino.UI.KeyboardKey.X
X key

Rhino.UI.KeyboardKey.Y
Y key

Rhino.UI.KeyboardKey.Z
Z key

Rhino.UI.KeyboardKey.F1
F1 key

Rhino.UI.KeyboardKey.F2
F2 key

Rhino.UI.KeyboardKey.F3
F3 key

Rhino.UI.KeyboardKey.F4
F4 key

Rhino.UI.KeyboardKey.F5
F5 key

Rhino.UI.KeyboardKey.F6
F6 key

Rhino.UI.KeyboardKey.F7
F7 key

Rhino.UI.KeyboardKey.F8
F8 key

Rhino.UI.KeyboardKey.F9
F9 key

Rhino.UI.KeyboardKey.F10
F10 key

Rhino.UI.KeyboardKey.F11
F11 key

Rhino.UI.KeyboardKey.F12
F12 key

Rhino.UI.KeyboardKey.Semicolon
; key

Rhino.UI.KeyboardKey.Equal
+ key

Rhino.UI.KeyboardKey.Comma
, key

Rhino.UI.KeyboardKey.Minus
- key

Rhino.UI.KeyboardKey.Period
. key

Rhino.UI.KeyboardKey.Slash
/ key

Rhino.UI.KeyboardKey.Grave
Backtick key

Rhino.UI.KeyboardKey.LeftBracket
[ key

Rhino.UI.KeyboardKey.BackSlash
Back slash key

Rhino.UI.KeyboardKey.RightBracket
] key

Rhino.UI.KeyboardKey.Quote
Quote key