Rhino.ApplicationSettings.CursorTooltipSettingsState
Represents a snapshot of Rhino.ApplicationSettings.CursorTooltipSettings.

Rhino.ApplicationSettings.CursorTooltipSettingsState.TooltipsEnabled
Turns on/off cursor tooltips.
Since: 5.0

Rhino.ApplicationSettings.CursorTooltipSettingsState.Offset
The x and y distances in pixels from the cursor location to the tooltip.
Since: 5.0

Rhino.ApplicationSettings.CursorTooltipSettingsState.BackgroundColor
Tooltip background color.
Since: 5.0

Rhino.ApplicationSettings.CursorTooltipSettingsState.TextColor
Tooltip text color.
Since: 5.0

Rhino.ApplicationSettings.CursorTooltipSettingsState.OsnapPane
Displays the current object snap selection.
Since: 5.0

Rhino.ApplicationSettings.CursorTooltipSettingsState.DistancePane
Displays the distance from the last picked point.
Since: 5.0

Rhino.ApplicationSettings.CursorTooltipSettingsState.PointPane
Displays the current construction plane coordinates.
Since: 5.0

Rhino.ApplicationSettings.CursorTooltipSettingsState.RelativePointPane
Displays the relative construction plane coordinates and angle from the last picked point.
Since: 5.0

Rhino.ApplicationSettings.CursorTooltipSettingsState.CommandPromptPane
Displays the current command prompt.
Since: 5.0

Rhino.ApplicationSettings.CursorTooltipSettingsState.AutoSuppress
Attempts to display only the most useful tooltip.
Since: 5.0

Rhino.ApplicationSettings.CursorTooltipSettingsState.EnableGumballToolTips
Turns on/off gumball tooltips
Since: 8.0