Rhino.Runtime.InteropWrappers.RhinoDib.ToBitmap(System.IntPtr,System.Boolean)
Convert unmanaged CRhinoDib pointer to a System.Drawing bitmap.
Returns:
If the pointer to the CRhinoDib is null then null is returned otherwise;
if the CRhinoDib is valid then the DIB is converted to a System.Drawing.Bitmap
otherwise null is returned.
rhinoDibPointer:
Unmanaged CRhinoDib pointer
deletePointer:
If set to true delete the unmanaged pointer otherwise;
don't delete the pointer.

Rhino.Runtime.InteropWrappers.RhinoDib.Attach(System.IntPtr,System.Boolean)
Create a new RhinoDib and attach it to the specified CRhinoDib pointer.
rhinoDibPointer:
Unmanaged CRhinoDib pointer to attach to.
deletePointer:
If set to true delete the unmanaged pointer when the returned RhinoDib
is disposed of otherwise; don't delete the unmanaged pointer.

Rhino.Runtime.InteropWrappers.RhinoDib.#ctor(System.IntPtr,System.Boolean)
Initializes a new instance of the Rhino.Runtime.InteropWrappers.RhinoDib
class and attach it to a unmanaged CRhinoDib pointer.
rhinoDibPointer:
Unmanaged CRhinoDib pointer to attach to.
autoDelete:
If set to true delete the unmanaged pointer when this object
is disposed of otherwise; don't delete the unmanaged pointer.

Rhino.Runtime.InteropWrappers.RhinoDib.m_auto_delete
IF true then Dispose(bool) will delete m_pointer otherwise it will
just set it to IntPtr.Zero.

Rhino.Runtime.InteropWrappers.RhinoDib.#ctor
Initializes a new empty unmanaged DIB.

Rhino.Runtime.InteropWrappers.RhinoDib.ConstPointer
Gets the const pointer (const CRhinoDib*).
Returns: The const pointer.

Rhino.Runtime.InteropWrappers.RhinoDib.NonConstPointer
Gets the non-const pointer (CRhinoDib*).
Returns: The non-const pointer.

Rhino.Runtime.InteropWrappers.RhinoDib.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.RhinoDib.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Runtime.InteropWrappers.RhinoDib.ToBitmap
Create System.Drawing.Bitmap from DIB
Returns: The bitmap.