Rhino.Geometry.SubDTextureCoordinateType
ON_SubDTextureCoordinateType identifies the way ON_SubDMeshFragment texture coordinates are set from an ON_SubDFace.

Rhino.Geometry.SubDTextureCoordinateType.Unset
Texture domains are not set.

Rhino.Geometry.SubDTextureCoordinateType.Unpacked
Each SubDFace uses the unit square in texture space.

Rhino.Geometry.SubDTextureCoordinateType.Packed
The face's pack rect is used to set fragment texture coordinates.
When possible, adjacent quads with the same ON_SubDFace::PackId() value are assigned adjacent
rectangles in texture space.

Rhino.Geometry.SubDTextureCoordinateType.Zero
All ON_SubDMeshFragment texture coordinate values are zero.

Rhino.Geometry.SubDTextureCoordinateType.Nan
All ON_SubDMeshFragment texture coordinate values are ON_DBL_QNAN.

Rhino.Geometry.SubDTextureCoordinateType.FromFaceTexturePoints
All ON_SubDMeshFragment texture coordinate values are set by
barycentric interpolation of ON_SubDFace.TexturePoint() values.

Rhino.Geometry.SubDTextureCoordinateType.FromMapping
Texture coordinates are set from an ON_TextureMapping and transformation specified
by ON_SubD::TextureMappingTag(). In all other cases, ON_SubD::TextureMappingTag()
can be set, but is ignored.