Rhino.Runtime.ShrinkWrap
Internal class used by ShrinkWrap functions to acces the Rhino.Runtime.IShrinkWrapService instance.

Rhino.Runtime.ShrinkWrap.Service
Get the shrinkwrap plugin and pass back the shrinkwrap interface
Returns: