Rhino.FileIO.FileEpsReadOptions.Units
Since: 8.0

Rhino.FileIO.FileEpsReadOptions.Units.Inches
inches

Rhino.FileIO.FileEpsReadOptions.Units.Centimeters
centimeters

Rhino.FileIO.FileEpsReadOptions.Units.Millimeters
millimeters

Rhino.FileIO.FileEpsReadOptions.Units.Points
points