Rhino.Runtime.ViewCaptureWriter.Pen.Color
Since: 6.0

Rhino.Runtime.ViewCaptureWriter.Pen.Width
Since: 6.0

Rhino.Runtime.ViewCaptureWriter.Pen.Cap
Since: 8.0

Rhino.Runtime.ViewCaptureWriter.Pen.Join
Since: 8.0

Rhino.Runtime.ViewCaptureWriter.Pen.Pattern
Since: 8.0