Rhino.PlugIns.VerifyPreviousVersionLicenseDelegate
Called by GetLicense/AskUserForLicense to verify that a previous version license.
license: License being entered in GetLicense
previousVersionLicense: Previous version license entered to verify upgrade eligibility
errorMessage: Output parameter with localized error message to display to user when VerifyPreviousVersionLicenseDelegate returns false
Returns: true when previousVersionLicense is eligible, otherwise false