Rhino.Render.PostEffects.PostEffectJobChannels.CppPointer
Since: 7.0

Rhino.Render.PostEffects.PostEffectJobChannels.#ctor(System.IntPtr)
Since: 7.0

Rhino.Render.PostEffects.PostEffectJobChannels.Dispose
Since: 7.0

Rhino.Render.PostEffects.PostEffectJobChannels.GetChannel(System.Guid)
Since: 7.0