Rhino.FileIO.FileAiWriteOptions
Options for writing a ai file

Rhino.FileIO.FileAiWriteOptions.PreserveModelScale
Since: 8.0

Rhino.FileIO.FileAiWriteOptions.RhinoScale
Since: 8.0

Rhino.FileIO.FileAiWriteOptions.AiUnits
Since: 8.0

Rhino.FileIO.FileAiWriteOptions.AIScale
Since: 8.0

Rhino.FileIO.FileAiWriteOptions.UseCMYK
Since: 8.0

Rhino.FileIO.FileAiWriteOptions.ExportViewBoundary
Since: 8.0

Rhino.FileIO.FileAiWriteOptions.ExportHatchesAsSolidFills
Since: 8.0

Rhino.FileIO.FileAiWriteOptions.OrderLayers
Since: 8.0

Rhino.FileIO.FileAiWriteOptions.ToDictionary
Since: 8.0