Rhino.DocObjects.TextureProjectionModes
Enum describing how texture is projected onto geometry

Rhino.DocObjects.TextureProjectionModes.Undefined
Not valid projection type

Rhino.DocObjects.TextureProjectionModes.MappingChannel
Uses a texture mapping to generate texture coordinates

Rhino.DocObjects.TextureProjectionModes.ScreenBased
Screen based

Rhino.DocObjects.TextureProjectionModes.Wcs
World coordinate system projection

Rhino.DocObjects.TextureProjectionModes.WcsBox
Box type world coordinate system projection

Rhino.DocObjects.TextureProjectionModes.EnvironmentMapBox
Box type environment mapping

Rhino.DocObjects.TextureProjectionModes.EnvironmentMapLightProbe
Light probe type environment mapping

Rhino.DocObjects.TextureProjectionModes.EnvironmentMapSpherical
Spherical environment mapping

Rhino.DocObjects.TextureProjectionModes.EnvironmentMapCube
Cube type environment mapping

Rhino.DocObjects.TextureProjectionModes.EnvironmentMapVCrossCube
Vertical cross cube type environment mapping

Rhino.DocObjects.TextureProjectionModes.EnvironmentMapHCrossCube
Horizontal cross type environment mapping

Rhino.DocObjects.TextureProjectionModes.EnvironmentMapHemispherical
Hemispherical environment mapping

Rhino.DocObjects.TextureProjectionModes.EnvironmentMapEmap
Emap type environment mapping

Rhino.DocObjects.TextureProjectionModes.SurfaceParameterization
Surface parameterization