Rhino.FileIO.File3dmShutLining
Represents the shut-lining attached to file3dm object attributes.

Rhino.FileIO.File3dmShutLining.On
Specifies whether shut-lining is enabled or not.
Since: 8.0

Rhino.FileIO.File3dmShutLining.Faceted
Specifies whether the shut-lining is faceted or not.
Since: 8.0

Rhino.FileIO.File3dmShutLining.AutoUpdate
Specifies whether the shut-lining automatically updates or not.
Since: 8.0

Rhino.FileIO.File3dmShutLining.ForceUpdate
Specifies whether updating is forced or not.
Since: 8.0

Rhino.FileIO.File3dmShutLining.GetCurves
Gets all the curves on the shut-lining. Each curve is identified by a Guid.
If there are no curves present, the array will be empty.
Since: 8.0

Rhino.FileIO.File3dmShutLining.AddCurve
Adds a new curve to the shut-lining. The curve will have an id of Guid.Empty.
After adding a curve, you should set the id to that of a curve in the model
that will be used to calculate the shut-lining.
Since: 8.0

Rhino.FileIO.File3dmShutLining.DeleteAllCurves
Deletes all the curves from the shut-lining.
Since: 8.0

Rhino.FileIO.File3dmShutLining.CurveEnabled(System.Guid)
Return whether shut-line is created for the given curve.
Since: 8.0

Rhino.FileIO.File3dmShutLining.SetCurveEnabled(System.Guid,System.Boolean)
Sets whether shut-line is created for the given curve.
Since: 8.0

Rhino.FileIO.File3dmShutLining.CurveRadius(System.Guid)
Returns the radius of the pipe used to create the shut-line for the given curve.
Since: 8.0

Rhino.FileIO.File3dmShutLining.SetCurveRadius(System.Guid,System.Double)
Sets the radius of the pipe used to create the shut-line for the given curve.
Since: 8.0

Rhino.FileIO.File3dmShutLining.CurveProfile(System.Guid)
Returns the profile of the shut-line for the given curve.
Since: 8.0

Rhino.FileIO.File3dmShutLining.SetCurveProfile(System.Guid,System.Int32)
Sets the profile of the shut-line for the given curve.
Since: 8.0

Rhino.FileIO.File3dmShutLining.CurvePull(System.Guid)
Returns whether the given curve is pulled to the surface before creating the shut-line.
Since: 8.0

Rhino.FileIO.File3dmShutLining.SetCurvePull(System.Guid,System.Boolean)
Sets whether the given curve is pulled to the surface before creating the shut-line.
Since: 8.0

Rhino.FileIO.File3dmShutLining.CurveIsBump(System.Guid)
Returns whether to create a bump instead of a dent for the given curve.
Since: 8.0

Rhino.FileIO.File3dmShutLining.SetCurveIsBump(System.Guid,System.Boolean)
Sets whether to create a bump instead of a dent for the given curve.
Since: 8.0