Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnail.Id
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnail.Label
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnail.IsSelected
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnail.IsHot
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnail.Dib(System.Drawing.Bitmap@)
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnail.GetDisplayRect(System.Drawing.RectangleF@)
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnail.GetDib
Since: 6.0
6.6