Rhino.Geometry.RibbonOffsetSurfaceMethod
Enum for RibbonOffset surface generation
Since: 8.9

Rhino.Geometry.RibbonOffsetSurfaceMethod.None
No Surfaces will be created

Rhino.Geometry.RibbonOffsetSurfaceMethod.Sweep2
Creates surfaces based off of Sweep 2 Rails

Rhino.Geometry.RibbonOffsetSurfaceMethod.Sweep2NetworkSrf
Creates a mix of sweeps and network surfaces.
NetworkSrf will be applied in corners with 3 sides