Rhino.Render.ChangeQueue.Light.Event
Light change type
Since: 6.0

Rhino.Render.ChangeQueue.Light.Event.Added
Light was added

Rhino.Render.ChangeQueue.Light.Event.Deleted
Light was deleted

Rhino.Render.ChangeQueue.Light.Event.Undeleted
Light was undeleted

Rhino.Render.ChangeQueue.Light.Event.Modified
Light was modified

Rhino.Render.ChangeQueue.Light.Event.Sorted
Light was sorted in LightTable