Rhino.DocObjects.RhinoTransformObjectsEventArgs
EventArgs passed to RhinoDoc.BeforeTransform.
Since: 5.10

Rhino.DocObjects.RhinoTransformObjectsEventArgs.TransformEventId
The transformation event id.
Since: 8.15

Rhino.DocObjects.RhinoTransformObjectsEventArgs.Transform
The transformation to be applied.
Since: 5.10

Rhino.DocObjects.RhinoTransformObjectsEventArgs.ObjectsWillBeCopied
True if the objects will be copied.
Since: 5.10

Rhino.DocObjects.RhinoTransformObjectsEventArgs.ObjectCount
The number of Rhino objects that will be transformed.
Since: 5.10

Rhino.DocObjects.RhinoTransformObjectsEventArgs.GripCount
The number of Rhino object grips that will be transformed.
Since: 7.0

Rhino.DocObjects.RhinoTransformObjectsEventArgs.GripOwnerCount
The number of Rhino object grip owners that will be changed when the grips are transformed.
Since: 7.0

Rhino.DocObjects.RhinoTransformObjectsEventArgs.Objects
An array of Rhino objects to be transformed.
WARNING: these objects may be deleted at anytime after the event handler has been notified.
Do not save references to these objects. Use the object's runtime serial number
to safely reference these objects at a later time.
Since: 5.10

Rhino.DocObjects.RhinoTransformObjectsEventArgs.Grips
An array of Rhino object grips that will be transformed.
WARNING: these objects may be deleted at anytime after the event handler has been notified.
Do not save references to these objects. Use the object's runtime serial number
to safely reference these objects at a later time.
Since: 7.0

Rhino.DocObjects.RhinoTransformObjectsEventArgs.GripOwners
An array of Rhino object grip owners that will be changed when the grips are transformed.
WARNING: these objects may be deleted at anytime after the event handler has been notified.
Do not save references to these objects. Use the object's runtime serial number
to safely reference these objects at a later time.
Since: 7.0