Rhino.Geometry.SubD.PatchFragmentTypeXYX
ON_SubDSurfaceNurbsFragment::Type are types bezier bispans covering a portion of a SubD face.

Rhino.Geometry.SubD.PatchFragmentTypeXYX.Unset
Not a valid patch type.

Rhino.Geometry.SubD.PatchFragmentTypeXYX.BicubicSingle
This fragment is a single 4x4 bicubic span covering the entire SubD region identified by m_face_region.

Rhino.Geometry.SubD.PatchFragmentTypeXYX.BicubicQuadrant
The bispans in this fragment are quadrants of the SubD region identified by m_face_region.