Rhino.Runtime.ConstOperationAttribute
Marks a method as const. This attribute is purely informative to help the
developer know that a method on a class does not alter the class itself.

Rhino.Runtime.ConstOperationAttribute.#ctor
Basic constructor to mark a method as const