Rhino.Display.RhinoPageView
A window that contains a single layout 'page'

Rhino.Display.RhinoPageView.Duplicate(System.Boolean)
Copies a page view.
duplicatePageGeometry: Set true if you want the page view geometry copied, along with the view.
Returns: The new page view if successful, null otherwise.
Since: 6.3

Rhino.Display.RhinoPageView.ActiveViewport
Gets the active viewport.
The ActiveViewport is the same as the MainViewport for standard RhinoViews. In
a RhinoPageView, the active viewport may be the RhinoViewport of a child detail object.
Most of the time, you will use ActiveViewport unless you explicitly need to work with
the main viewport.
Since: 5.0

Rhino.Display.RhinoPageView.SetPageAsActive
Deactivates the active details and sets the page view as active.
Since: 5.0

Rhino.Display.RhinoPageView.ActiveDetailId
Returns the id of the active detail.
If no detail is active, or if the page is active, then Guid.Empty is returned.
Since: 7.0

Rhino.Display.RhinoPageView.ActiveDetail
Returns the active detail object.
If no detail is active, or if the page is active, then null is returned.
Since: 7.0

Rhino.Display.RhinoPageView.SetActiveDetail(System.Guid)
Sets the active detail.
detailId: The id of the detail view object to set active.
Returns: true if successful, false otherwise.
Since: 5.0

Rhino.Display.RhinoPageView.SetActiveDetail(System.String,System.Boolean)
Sets the active detail.
detailName: The name, or title, of the detail to set active.
compareCase: Unused.
Returns: true if successful, false otherwise.
Since: 5.0

Rhino.Display.RhinoPageView.PageIsActive
Returns true if the page is active, rather than any detail view.
This occurs when the MainViewport.Id == ActiveViewportID.
Since: 5.0

Rhino.Display.RhinoPageView.AddDetailView(System.String,Rhino.Geometry.Point2d,Rhino.Geometry.Point2d,Rhino.Display.DefinedViewportProjection)
Creates a detail view object that is displayed on this page and adds it to the document.
title: The detail view title.
corner0: Corners of the detail view in world coordinates.
corner1: Corners of the detail view in world coordinates.
initialProjection: The defined initial projection type.
Returns: Newly created detail view on success, null on error.
Since: 5.0

Rhino.Display.RhinoPageView.GetDetailViews
Gets a list of the detail view objects associated with this layout.
Returns: An array of detail view objects if successful, an empty array if the layout has no details.
Since: 5.0

Rhino.Display.RhinoPageView.PageNumber
Gets or sets the runtime page number and updates the page number for all
of the other pages. The first page has a value of 0.
Since: 5.0

Rhino.Display.RhinoPageView.GetPreviewImage(System.Drawing.Size,System.Boolean)
Creates a preview image of the page.
size: The size of the preview image.
grayScale: Set true to produce a grayscale image, false to produce a color image.
Returns: A bitmap if successful, null otherwise.
Since: 7.0

Rhino.Display.RhinoPageView.PageWidth
Width of the page in the document's PageUnitSystem
Since: 5.10

Rhino.Display.RhinoPageView.PageHeight
Height of the page in the document's PageUnitSystem
Since: 5.10

Rhino.Display.RhinoPageView.PageName
Same as the MainViewport.Name.
Since: 5.0

Rhino.Display.RhinoPageView.PrinterName
Returns the name of the layout's destination printer.
Since: 6.15

Rhino.Display.RhinoPageView.PaperName
Returns the name of the layout's media, or paper (e.g. Letter, Legal, A1, etc.),
used to determine the page width and page height.
Since: 6.15

Rhino.Display.RhinoPageView.PageViewSpaceChange
Since: 5.0