Rhino.Runtime.InProcess.StartupOrigin
Specifies how RhinoCore was started.

Rhino.Runtime.InProcess.StartupOrigin.NotStarted
RhinoCore is still not started.

Rhino.Runtime.InProcess.StartupOrigin.Application
RhinoCore was started from Rhino.exe.

Rhino.Runtime.InProcess.StartupOrigin.Library
RhinoCore was started from RhinoLibrary.dll.