Rhino.Geometry.MeshUnwrapper
Unwraps meshes and stores the result in their texture coordinates

Rhino.Geometry.MeshUnwrapper.#ctor(Rhino.Geometry.Mesh)
Creates a mesh unwrapper for a single mesh
mesh: Mesh to unwrap
Since: 7.14

Rhino.Geometry.MeshUnwrapper.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh})
Creates a mesh unwrapper for a set of meshes
meshes: Meshes to unwrap
Since: 7.14

Rhino.Geometry.MeshUnwrapper.Finalize
Destructor

Rhino.Geometry.MeshUnwrapper.Dispose
Dispose of this object and any unmanaged memory associated with it.
Since: 7.14

Rhino.Geometry.MeshUnwrapper.SymmetryPlane
Symmetry plane. Unwrapper tries to keep unwrap result symmetric to this plane.
Since: 7.14

Rhino.Geometry.MeshUnwrapper.Unwrap(Rhino.Geometry.MeshUnwrapMethod)
Unwraps the meshes passed in as constructor arguments and stores the results in texture coordinates.
method: Unwrap method to be used
Returns: True on success
Since: 7.14