Rhino.Runtime.InteropWrappers.StringWrapper
Represents a wrapper to an unmanaged OpenNurbs string.
Wraps a C++ ON_wString*.

Rhino.Runtime.InteropWrappers.StringWrapper.#ctor
Initializes a new empty unmanaged string (ON_wString*).
Since: 5.0

Rhino.Runtime.InteropWrappers.StringWrapper.#ctor(System.String)
Initializes a new unmanaged string with an initial value.
The string s can be null.
s: The initial value, or null.
Since: 5.0

Rhino.Runtime.InteropWrappers.StringWrapper.ConstPointer
Gets the constant pointer (constant ON_wString*).
Returns: The constant pointer.
Since: 5.0

Rhino.Runtime.InteropWrappers.StringWrapper.NonConstPointer
Gets the non-constant pointer (ON_wString*).
Returns: The non-constant pointer.
Since: 5.0

Rhino.Runtime.InteropWrappers.StringWrapper.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.StringWrapper.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0

Rhino.Runtime.InteropWrappers.StringWrapper.ToString
Returns the string contents of this wrapper.
Returns: A managed string.

Rhino.Runtime.InteropWrappers.StringWrapper.SetString(System.String)
Set contents of this string.
s: The new string.
Since: 5.0

Rhino.Runtime.InteropWrappers.StringWrapper.SetStringOnPointer(System.IntPtr,System.String)
Set contents of an ON_wString*
pON_wString:
s:
Since: 5.0

Rhino.Runtime.InteropWrappers.StringWrapper.GetStringFromPointer(System.IntPtr)
Get string from an ON_wString*
pConstON_wString:
Returns:
Since: 5.0