Rhino.Render.RenderContent.NewRenderContentCallbackEvent
Function pointer to pass to the C++ wrapper, there is one of these for
each of RenderMaterail, RenderTexture and RenderEnvironment.
typeId: Class type GUID custom attribute
Returns: Returns a new C++ pointer of the requested content type.