Rhino.FileIO.File3dmCurvePiping.CapTypes
Defines how the pipe is capped at the ends.
Since: 8.0

Rhino.FileIO.File3dmCurvePiping.CapTypes.None
No capping.

Rhino.FileIO.File3dmCurvePiping.CapTypes.Flat
A flat surface will cap the pipe.

Rhino.FileIO.File3dmCurvePiping.CapTypes.Box
A simple construction will cap the pipe.

Rhino.FileIO.File3dmCurvePiping.CapTypes.Dome
A meridians-and-parallels hemisphere construction will cap the pipe.