Rhino.UI.PanelStyles
Panel style modifiers, only used by the new panel system implemented
in Rhino 8.0. This will be used by the IPanelStyles interface when
implemented.

Rhino.UI.PanelStyles.UseDefaults


Rhino.UI.PanelStyles.HideSingleTabWhenDocked
Do not display a tab when the panel is the only item in a container
and the container is docked.

Rhino.UI.PanelStyles.HideGripperTextWhenDockedOnSide
Suppress the text displayed in the gripper control when this is the
only tab in a container and the container is docked on the left or
right side.

Rhino.UI.PanelStyles.HideGripperTextWhenDockedOnTopOrBottom
Suppress the text displayed in the gripper control when this is the
only tab in a container and the container is docked on the top or
bottom.

Rhino.UI.PanelStyles.All
Apply all of the style flags