Rhino.FileIO.File3dmGroupTable
Provides access to groups in the 3dm file.

Rhino.FileIO.File3dmGroupTable.ComponentType
Returns Rhino.DocObjects.ModelComponentType.Group.
Since: 6.5

Rhino.FileIO.File3dmGroupTable.FindName(System.String)
Finds a Group given its name.
name: The name of the Group to be searched.
Returns: A Group, or null on error.
Since: 6.5

Rhino.FileIO.File3dmGroupTable.FindNameHash(Rhino.FileIO.NameHash)
Finds a Group given its name hash.
nameHash: The name hash of the Group to be searched.
Returns: A Group, or null on error.
Since: 6.5

Rhino.FileIO.File3dmGroupTable.FindIndex(System.Int32)
Retrieves a Group object based on an index. This search type of search is discouraged.
We are moving towards using only IDs for all tables.
groupIndex: The index to search for.
Returns: A Group object, or null if none was found.
Since: 6.5

Rhino.FileIO.File3dmGroupTable.GroupMembers(System.Int32)
Gets an array of all of the objects in a group.
groupIndex: The index of the group in this table.
Returns: Array of objects that belong to the specified group or empty array if no objects could be found.
Since: 6.20

Rhino.FileIO.File3dmGroupTable.AddGroup
Adds a new empty group to the group table.
Returns: >=0 index of new group or -1 on error.
Since: 8.4