Rhino.Geometry.MeshPart
Represents a portion of a mesh for partitioning

Rhino.Geometry.MeshPart.StartVertexIndex
Start of subinterval of parent mesh vertex array
Since: 5.6

Rhino.Geometry.MeshPart.EndVertexIndex
End of subinterval of parent mesh vertex array
Since: 5.6

Rhino.Geometry.MeshPart.StartFaceIndex
Start of subinterval of parent mesh face array
Since: 5.6

Rhino.Geometry.MeshPart.EndFaceIndex
End of subinterval of parent mesh face array
Since: 5.6

Rhino.Geometry.MeshPart.VertexCount
EndVertexIndex - StartVertexIndex
Since: 5.6

Rhino.Geometry.MeshPart.TriangleCount
Since: 5.6