Rhino.Geometry.Leader
Leader geometry class

Rhino.Geometry.Leader.#ctor(System.IntPtr,System.Object)
internal constructor
nativePointer:
parent:

Rhino.Geometry.Leader.#ctor
Constructor
Since: 6.0

Rhino.Geometry.Leader.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected serialization constructor for internal use.
info: Serialization data.
context: Serialization stream.

Rhino.Geometry.Leader.Create(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Point3d[])
Creates a Leader geometry object
text:
plane:
dimstyle:
points:
Returns:
Since: 6.0

Rhino.Geometry.Leader.CreateWithRichText(System.String,Rhino.Geometry.Plane,Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Point3d[])
Creates a Leader geometry object
richText:
plane:
dimstyle:
points:
Returns:
Since: 6.0

Rhino.Geometry.Leader.Curve
Gets the curve used by this leader
Since: 6.0

Rhino.Geometry.Leader.Points2D
Get or set the 2d points defining the curve used by this leader
Since: 6.0

Rhino.Geometry.Leader.Points3D
Get or set the 3d points defining the curve used by this leader
Since: 6.0

Rhino.Geometry.Leader.LeaderTextHorizontalAlignment
Gets or sets the horizontal alignment of the leader's text
Since: 6.0

Rhino.Geometry.Leader.LeaderTextVerticalAlignment
Gets or sets the vertical alignment of the leader's text
Since: 6.0

Rhino.Geometry.Leader.LeaderArrowType
The arrowhead type for the leader
Since: 6.0

Rhino.Geometry.Leader.LeaderArrowBlockId
Id of the block used as the arrow for the leader when the arrow type is 'User arrow'
Since: 6.0

Rhino.Geometry.Leader.LeaderArrowSize
The size of the leader arrow
Since: 6.0

Rhino.Geometry.Leader.LeaderCurveStyle
The style of the leader curve: polyline or spline
Since: 6.0

Rhino.Geometry.Leader.LeaderContentAngleStyle
Angle for text of leader text
Since: 6.0

Rhino.Geometry.Leader.LeaderHasLanding
Returns true if the leader has a landing line
Since: 6.0

Rhino.Geometry.Leader.LeaderLandingLength
Gets or sets the length of the landing line
Since: 6.0

Rhino.Geometry.Leader.Explode
Explodes this leader into its geometric components.
Returns:
An array of Curve and TextEntity objects. If the leader is using user-defined arrowheads, InstanceReferenceGeometry objects will be included.
Since: 8.0