QuadRemeshPrivate.QuadRemeshSettings
This class configures the geometry input/output settings used by the quad remesher.

QuadRemeshPrivate.QuadRemeshSettings.TargetEdgeLength
When UseTargetEdgeLength is True the target quad count will be re-computed with
the target goal of an approximated edge length based on the area of the input mesh
e.g TargetQuadCount = Input mesh Area * sqr(TargetEdgeLength)

QuadRemeshPrivate.QuadRemeshSettings.TargetQuadCount
The number of quads to try to achieve in the final remeshed object

QuadRemeshPrivate.QuadRemeshSettings.AdaptiveSize
Larger values results in for quad sizes that adjust to match input curvature.
Smaller values results in more uniform quad sizes at the risk of less feature preservation.
Range [0 -100]

QuadRemeshPrivate.QuadRemeshSettings.AdaptiveQuadCount
Respect the original Target Quad Count value as much as possible.
True returns more quads than TargetQuadCount depending on amount of high-curvature areas.

QuadRemeshPrivate.QuadRemeshSettings.DetectHardEdges
When enabled the hard edges in models will be retained.

QuadRemeshPrivate.QuadRemeshSettings.UseIndexedNormals
When enabled, it will return an edge loop where normals are creased (Un-welded) on the input mesh

QuadRemeshPrivate.QuadRemeshSettings.PreserveMeshArrayEdgesMode
0=off, 1=On(Smart), 2=On(Strict)
if enabled the remesher will follow the Brep's face structure
Smart -  Small or insignificant faces are ignored.
Strict - All faces are used no matter how small or insignificant.
This value is ignored if the input object is a mesh

QuadRemeshPrivate.QuadRemeshSettings.GuideCurveInfluence
0 = Approximate
1 = Interpolate Edge Ring
2 = Interpolate Edge Loop
This value is ignored if Guide Curves are not supplied

QuadRemeshPrivate.QuadRemeshSettings.SymmetryAxis
'', 'X', 'Y' or 'Z' : allows to get a symmetrical remeshing