Rhino.Geometry.SubDCreationOptions.ConvexCornerOption
Defines how convex corners are treated.

Rhino.Geometry.SubDCreationOptions.ConvexCornerOption.Unset
The option is not set.

Rhino.Geometry.SubDCreationOptions.ConvexCornerOption.None
No convex corners. In general,this is the best choice.

Rhino.Geometry.SubDCreationOptions.ConvexCornerOption.AtMeshCorner
A convex subd corner will appear at input mesh boundary vertices
where the corner angle <= MaximumConvexCornerAngleRadians() and
the number of edges the end at the vertex is <= MaximumConvexCornerEdgeCount().