QuadRemeshPrivate.QuadRemeshCurve
Curve structure and settings for Quad Remesher

QuadRemeshPrivate.QuadRemeshCurve.CurvePoints
The Curves control point locations as float array

QuadRemeshPrivate.QuadRemeshCurve.CurveStrength
value in [0, 1] (useful for 'Approx' curves only)

QuadRemeshPrivate.QuadRemeshCurve.CurveType
0=Approx  1=InterpEdgeLoop   2=InterpEdgeRing