Rhino.Render.UndoRedo
This class contains the event for UndoRedoChanged that is fired from RDK .

Rhino.Render.UndoRedo.UndoRedoChanged
Called after undo or redo has occurred for document settings.
Since: 6.0

Rhino.Render.UndoRedo.UndoRedoEndedChanged
This event is raised when undo/redo ends in rdk.
Since: 7.0