Rhino.Geometry.Intersect.RayShootEvent
Represents an element which is part of a ray shoot.
Since: 7.0

Rhino.Geometry.Intersect.RayShootEvent.GeometryIndex
The index of the surface or Brep that was hit.
Since: 7.0

Rhino.Geometry.Intersect.RayShootEvent.BrepFaceIndex
If GeometryIndex references a Brep, then the index of the Brep face that was hit.
If GeometryIndex references a surface, than RhinoMath.UnsetIntIndex.
Since: 7.0

Rhino.Geometry.Intersect.RayShootEvent.Point
The 3d hit point.
Since: 7.0