Rhino.FileIO.Nrbf.RecordType.SerializedStreamHeader
The NRBF header (the first record in NRBF payload).

Rhino.FileIO.Nrbf.RecordType.ClassWithId
Class information that references another class record's metadata.

Rhino.FileIO.Nrbf.RecordType.SystemClassWithMembers
System class information without type info.
Remarks: Not supported by design.

Rhino.FileIO.Nrbf.RecordType.ClassWithMembers
Class information with source library, but without type info.
Remarks: Not supported by design.

Rhino.FileIO.Nrbf.RecordType.SystemClassWithMembersAndTypes
System class information with type info.

Rhino.FileIO.Nrbf.RecordType.ClassWithMembersAndTypes
Class information with type info and the source library.

Rhino.FileIO.Nrbf.RecordType.BinaryObjectString
A string.

Rhino.FileIO.Nrbf.RecordType.BinaryArray
An array of any rank or element type.

Rhino.FileIO.Nrbf.RecordType.MemberPrimitiveTyped
A primitive value other than string.

Rhino.FileIO.Nrbf.RecordType.MemberReference
A record that contains a reference to another record that contains the actual value.

Rhino.FileIO.Nrbf.RecordType.ObjectNull
A single null value.

Rhino.FileIO.Nrbf.RecordType.MessageEnd
The record that marks the end of the binary format stream.

Rhino.FileIO.Nrbf.RecordType.BinaryLibrary
A record that associates a numeric identifier with a named library.

Rhino.FileIO.Nrbf.RecordType.ObjectNullMultiple256
Multiple (less than 256) null values.

Rhino.FileIO.Nrbf.RecordType.ObjectNullMultiple
Multiple null values.

Rhino.FileIO.Nrbf.RecordType.ArraySinglePrimitive
A single-dimensional array of a primitive type.

Rhino.FileIO.Nrbf.RecordType.ArraySingleObject
A single-dimensional array of System.Object values.

Rhino.FileIO.Nrbf.RecordType.ArraySingleString
A single-dimensional array of string values.

Rhino.FileIO.Nrbf.RecordType.MethodCall
A remote method call.
Remarks: Not supported by design.

Rhino.FileIO.Nrbf.RecordType.MethodReturn
Information returned by a remote method.
Remarks: Not supported by design.