Rhino.Geometry.MeshBooleanOptions
Contains a set of data to pass to boolean options.

Rhino.Geometry.MeshBooleanOptions.Tolerance
Gets or sets a tolerance value for intersections and overlaps.
Rhino.Geometry.Intersect.Intersection.MeshIntersectionsTolerancesCoefficient
The default value is Rhino.RhinoMath.ZeroTolerance*10. However, this is
only a reference value for testing and geometry developers should generally use the
document tolerance, multiplied by
Rhino.Geometry.Intersect.Intersection.MeshIntersectionsTolerancesCoefficient.
Since: 8.0

Rhino.Geometry.MeshBooleanOptions.TextLog
Gets or sets a text log to write computed operations into.
Since: 8.0

Rhino.Geometry.MeshBooleanOptions.CancellationToken
A token that allows to request the cancellation of the operation.
Since: 8.0

Rhino.Geometry.MeshBooleanOptions.ProgressReporter
Gets or sets the object that is responsible to keep track of calculation progression.
Since: 8.0