Rhino.Geometry.Hatch
Represents a hatch in planar boundary loop or loops.
This is a 2d entity with a plane defining a local coordinate system.
The loops, patterns, angles, etc are all in this local coordinate system.
The Hatch object manages the plane and loop array
Fill definitions are in the HatchPattern or class derived from HatchPattern
Hatch has an index to get the pattern definition from the pattern table.

Rhino.Geometry.Hatch.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor for internal use.
info: Serialization data.
context: Serialization stream.

Rhino.Geometry.Hatch.CreateFromBrep(Rhino.Geometry.Brep,System.Int32,System.Int32,System.Double,System.Double,Rhino.Geometry.Point3d)
Create a hatch from a planar face of a Brep
brep:
brepFaceIndex:
hatchPatternIndex:
rotationRadians:
scale:
basePoint:
Returns:
Since: 7.18

Rhino.Geometry.Hatch.Create(Rhino.Geometry.Plane,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Int32,System.Double,System.Double)
Create a hatch with a given set of outer and inner loops
hatchPlane:
outerLoop: 2d closed curve representing outer boundary of hatch
innerLoops: 2d closed curves for inner boundaries
hatchPatternIndex:
rotationRadians:
scale:
Returns:
Since: 7.18

Rhino.Geometry.Hatch.Create(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Int32,System.Double,System.Double)
Constructs an array of hatches from a set of curves.
curves: An array, a list or any enumerable set of Rhino.Geometry.Curve.
hatchPatternIndex: The index of the hatch pattern in the document hatch pattern table.
rotationRadians: The relative rotation of the pattern.
scale: A scaling factor.
Returns: An array of hatches. The array might be empty on error.
Throws System.ArgumentNullException: If curves is null.
Since: 5.0
6.0

Rhino.Geometry.Hatch.Create(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Int32,System.Double,System.Double,System.Double)
Constructs an array of hatches from a set of curves.
curves: An array, a list or any enumerable set of Rhino.Geometry.Curve.
hatchPatternIndex: The index of the hatch pattern in the document hatch pattern table.
rotationRadians: The relative rotation of the pattern.
scale: A scaling factor.
tolerance:
Returns: An array of hatches. The array might be empty on error.
Throws System.ArgumentNullException: If curves is null.
Since: 6.0

Rhino.Geometry.Hatch.Create(Rhino.Geometry.Curve,System.Int32,System.Double,System.Double)
Constructs an array of hatches from one curve.
curve: A Rhino.Geometry.Curve.
hatchPatternIndex: The index of the hatch pattern in the document hatch pattern table.
rotationRadians: The relative rotation of the pattern.
scale: A scaling factor.
Returns: An array of hatches. The array might be empty on error.
Since: 5.0
6.0

Rhino.Geometry.Hatch.Create(Rhino.Geometry.Curve,System.Int32,System.Double,System.Double,System.Double)
Constructs an array of hatches from one curve.
curve: A Rhino.Geometry.Curve.
hatchPatternIndex: The index of the hatch pattern in the document hatch pattern table.
rotationRadians: The relative rotation of the pattern.
scale: A scaling factor.
tolerance:
Returns: An array of hatches. The array might be empty on error.
Since: 6.0

Rhino.Geometry.Hatch.CreateDisplayGeometry(Rhino.DocObjects.HatchPattern,System.Double,Rhino.Geometry.Curve[]@,Rhino.Geometry.Line[]@,Rhino.Geometry.Brep@)
Generate geometry that would be used to draw the hatch with a given hatch pattern
pattern:
patternScale:
bounds:
lines:
solidBrep:
Since: 5.6

Rhino.Geometry.Hatch.Explode
Decomposes the hatch pattern into an array of geometry.
Returns: An array of geometry that formed the appearance of the original elements.
Since: 5.0

Rhino.Geometry.Hatch.Get2dCurves(System.Boolean)
Gets 2d curves that define the boundaries of the hatch
outer: true to get the outer curves, false to get the inner curves
Returns:
Since: 8.18

Rhino.Geometry.Hatch.Get3dCurves(System.Boolean)
Gets 3d curves that define the boundaries of the hatch
outer: true to get the outer curves, false to get the inner curves
Returns:
Since: 5.0

Rhino.Geometry.Hatch.PatternIndex
Gets or sets the index of the pattern in the document hatch pattern table.
Since: 5.0

Rhino.Geometry.Hatch.PatternRotation
Gets or sets the relative rotation of the pattern.
Since: 5.0

Rhino.Geometry.Hatch.BasePoint
Gets or sets the hatch pattern base point
Since: 6.11

Rhino.Geometry.Hatch.Plane
Gets or sets the hatch plane
Since: 6.11

Rhino.Geometry.Hatch.PatternScale
Gets or sets the scaling factor of the pattern.
Since: 5.0

Rhino.Geometry.Hatch.ScalePattern(Rhino.Geometry.Transform)
Scale the hatch's pattern
xform:
Since: 6.11

Rhino.Geometry.Hatch.GetGradientFill
Get gradient fill information for this hatch. If the "GradientType" for
the fill is None, then this hatch doesn't have any gradient fill.
Returns:
Since: 7.0

Rhino.Geometry.Hatch.SetGradientFill(Rhino.Display.ColorGradient)
fill:
Since: 7.0

Rhino.Geometry.Hatch.ToBrep
Constructs a Brep representation of this hatch.
Returns: A Brep representation of this hatch if successful, null otherwise.
Since: 8.9