Rhino.FileIO.FileFbxWriteOptions
Options for writing a Fbx file

Rhino.FileIO.FileFbxWriteOptions.SaveObjectsAs
Since: 8.0

Rhino.FileIO.FileFbxWriteOptions.SaveMaterialsAs
Since: 8.0

Rhino.FileIO.FileFbxWriteOptions.SaveViews
Since: 8.0

Rhino.FileIO.FileFbxWriteOptions.SaveLights
Since: 8.0

Rhino.FileIO.FileFbxWriteOptions.SaveVertexNormals
Since: 8.0

Rhino.FileIO.FileFbxWriteOptions.MapRhinoZtoFbxY
Since: 8.0

Rhino.FileIO.FileFbxWriteOptions.SaveFileAs
Since: 8.0

Rhino.FileIO.FileFbxWriteOptions.MeshingParameters
Since: 8.0

Rhino.FileIO.FileFbxWriteOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0