Rhino.ApplicationSettings.PointDisplayMode
Defines enumerated constant values for world coordinates and CPlane point display modes.
Since: 5.0

Rhino.ApplicationSettings.PointDisplayMode.WorldPoint
Points are displayed in world coordinates.

Rhino.ApplicationSettings.PointDisplayMode.CplanePoint
Points are displayed in CPlane coordinates.