Rhino.Display.GradientType
Style of color gradient
Since: 7.0

Rhino.Display.GradientType.None
No gradient

Rhino.Display.GradientType.Linear
Linear (or axial) gradient between two points

Rhino.Display.GradientType.Radial
Radial (or spherical) gradient using a center point and a radius

Rhino.Display.GradientType.LinearDisabled
Disabled linear gradient. Useful for keeping gradient information around, but not having it displayed

Rhino.Display.GradientType.RadialDisabled
Disabled radial gradient. Useful for keeping gradient information around, but not having it displayed