Rhino.Render.UICommands.NativeUICommand.Id
Returns the Guid of the UICommand
Returns: Returns the Guid of the UICommand

Rhino.Render.UICommands.NativeUICommand.MenuString(Rhino.Render.UICommands.UICommandOrigin,Rhino.Render.RenderContentKind)
Returns the title of the UICommand
origin: The UICommand origin.
kind: kind as a string. E.g environment, material, texture ...
Returns: Returns the UICommand title string

Rhino.Render.UICommands.NativeUICommand.RenderEngineId
Returns the render engine Guid of the UICommand
Returns: Returns the render engine Guid of the UICommand

Rhino.Render.UICommands.NativeUICommand.IsEnabled(Rhino.Render.UICommands.UICommandOrigin)
Returns true if the UICommand item is enabled and false if the UICommand item is disabled
origin: The UICommand origin.
Returns: Returns true if the UICommand item is enabled and false if the UICommand item is disabled

Rhino.Render.UICommands.NativeUICommand.Query(Rhino.Render.UICommands.UICommandOrigin,System.Boolean)
Query if the UICommand should be displayed to the user in a menu etc.
The default implementation returns the result of calling origin.SupportsUICommand()
origin: origin represents the UI that the menu was invoked in.
onItem: True if the user right-clicked on one or more items (thumbnail, tree node etc).
Returns: \e true if a UI element (e.g., a menu item) should be created for the UICommand, else \e false.

Rhino.Render.UICommands.NativeUICommand.MenuOrder(Rhino.Render.UICommands.UICommandOrigin)
Return the order of the UICommand
origin: The UICommand origin.
Returns: Return the order of the UICommand, 0 = first item, 1 = second item and so on

Rhino.Render.UICommands.NativeUICommand.IsForTopLevelContent
Return true if the UICommand is associated with the toplevel content and false if not
Returns: Return true if the UICommand is associated with the toplevel content and false if not

Rhino.Render.UICommands.NativeUICommand.IconOut(Rhino.Render.RenderContentKind,System.Int32,System.Int32)
Returns the associated out icon for the UICommand item.
Out icon is the icon displayed if the menu UICommand is not selected.
kind: kind as a string. E.g environment, material, texture ...
width: Icon width ...
height: Icon height ...
Returns: Returns a bitmap representing the icon

Rhino.Render.UICommands.NativeUICommand.IconIn(Rhino.Render.RenderContentKind,System.Int32,System.Int32)
Returns the associated in icon for the UICommand item.
Out icon is the icon displayed if the UICommand is not selected and the in icon is
represents that the UICommand is selected. If the UICommand does not contain two states
then the IconIn will return the same icon as IconOut
kind: kind as a string. E.g environment, material, texture ...
width: Icon width ...
height: Icon height ...
Returns: Returns a bitmap representing the icon

Rhino.Render.UICommands.NativeUICommand.UserExecute(Rhino.Render.UICommands.UICommandOrigin)
Called to execute the function associated with the UICommand
origin: The UICommand origin.
Returns:  Returns Result{ Success, Failure, Cancel };

Rhino.Render.UICommands.NativeUICommand.SubMenu
Returns the SubMenu value of the UICommand
Returns:  Returns SubMenu value