Rhino.Render.UICommands.UICommandUpdate.#ctor(Rhino.Render.UICommands.UICommandOrigin)
Constructor
origin:  The UICommand origin that creates the UICommand update

Rhino.Render.UICommands.UICommandUpdate.#ctor(System.IntPtr)
Constructor
pUICommandUpdate:  The native pointer to the UICommand update implementation

Rhino.Render.UICommands.UICommandUpdate.Finalize
Destructor

Rhino.Render.UICommands.UICommandUpdate.Dispose
Dispose

Rhino.Render.UICommands.UICommandUpdate.Dispose(System.Boolean)
Dispose

Rhino.Render.UICommands.UICommandUpdate.IsEnabled
Get the UICommand's 'enabled' state.

Rhino.Render.UICommands.UICommandUpdate.IsChecked
Get the UICommand's 'checked' state.