Rhino.Geometry.ParticleSystem.DrawRequiresDepthSorting
Since: 5.0

Rhino.Geometry.ParticleSystem.DisplaySizesInWorldUnits
Since: 5.0

Rhino.Geometry.ParticleSystem.BoundingBox
Since: 5.0

Rhino.Geometry.ParticleSystem.Add(Rhino.Geometry.Particle)
Adds a particle to this ParticleSystem. A Particle can only be in one system
at a time.  If the Particle already exists in a different system, this function
will return false. You should remove the particle from the other system first
before adding it.
particle: A particle to be added.
Returns:
true if this particle was added to the system or if is already in the system.
false if the particle already exists in a different system.
Since: 5.0

Rhino.Geometry.ParticleSystem.Remove(Rhino.Geometry.Particle)
Removes a single particle from this system.
particle: The particle to be removed.
Since: 5.0

Rhino.Geometry.ParticleSystem.Clear
Remove all Particles from this system.
Since: 5.0

Rhino.Geometry.ParticleSystem.Update
Calls Update on every particle in the system.
Since: 5.0

Rhino.Geometry.ParticleSystem.GetEnumerator
Since: 5.0

Rhino.Geometry.ParticleSystem.System#Collections#IEnumerable#GetEnumerator
Since: 5.0