Rhino.Collections.GenericIListImplementation.IndexOf``1(System.Collections.Generic.IList{``0},``0)
Provides a generic way to find an index in a Rhino table. O(n) where n is length of table.
table needs to provide Count and indexer as backing accessors.
This is to provide a full and reasonable implementation of the interface. People should choose other methods if better behavior is required.

Rhino.Collections.GenericIListImplementation.IndexOf(System.Collections.Generic.IList{Rhino.Geometry.Point3f},System.Object)
Provides a generic way to find an index in a Rhino table. O(n) where n is length of table.
table needs to provide Count and indexer as backing accessors.
This is to provide a full and reasonable implementation of the interface. People should choose other methods if better behavior is required.

Rhino.Collections.GenericIListImplementation.IndexOf(System.Collections.Generic.IList{Rhino.Geometry.Vector3f},System.Object)
Provides a generic way to find an index in a Rhino table. O(n) where n is length of table.
table needs to provide Count and indexer as backing accessors.
This is to provide a full and reasonable implementation of the interface. People should choose other methods if better behavior is required.

Rhino.Collections.GenericIListImplementation.Insert``1(Rhino.Collections.IResizableList{``0},System.Int32,``0)
Provides a generic way to insert at an index in a Rhino table. table needs to provide Count and indexer as backing accessors.
This is to provide a full and reasonable implementation of the interface. People should choose other methods if better behavior is required.

Rhino.Collections.GenericIListImplementation.RemoveAt``1(Rhino.Collections.IResizableList{``0},System.Int32)
Provides a generic way to remove from a list at an index in a Rhino table. table needs to provide Count and indexer as backing accessors.
This is to provide a full and reasonable implementation of the interface. People should choose other methods if better behavior is required.

Rhino.Collections.GenericIListImplementation.CopyTo``1(System.Collections.Generic.IList{``0},``0[],System.Int32)
Provides a generic way to copy to an array starting at an index. table needs to provide Count and indexer as backing accessors.
This is to provide a full and reasonable implementation of the interface. People should choose other methods if better behavior is required.

Rhino.Collections.GenericIListImplementation.CopyTo``1(System.Collections.Generic.IList{``0},System.Array,System.Int32)
Provides a non-generic way to copy to an array starting at an index. table needs to provide Count and indexer as backing accessors.
This is to provide a full and reasonable implementation of the interface. People should choose other methods if better behavior is required.

Rhino.Collections.GenericIListImplementation.CopyToFromReadOnlyCollection``1(System.Collections.Generic.IReadOnlyCollection{``0},``0[],System.Int32)
Provides a non-generic way to copy to an array starting at an index. table needs to provide Count and indexer as backing accessors.
This is to provide a full and reasonable implementation of the interface. People should choose other methods if better behavior is required.

Rhino.Collections.GenericIListImplementation.Remove``1(Rhino.Collections.IResizableList{``0},``0)
Provides a generic way to remove the first occurrence of an item in a Rhino table. table needs to provide Count and indexer as backing accessors.
This is to provide a full and reasonable implementation of the interface. People should choose other methods if better behavior is required.

Rhino.Collections.GenericIListImplementation.ClearByItems``2(``0)
Forms a reverse list with all items, then removed them using Remove().

Rhino.Collections.GenericIListImplementation.ClearByItems``1(System.Collections.Generic.ICollection{``0})
Forms a reverse list with all items, then removed them using Remove().

Rhino.Collections.GenericIListImplementation.ClearReverseOrder``2(``0)
Removes the last index, then the previous one, etc

Rhino.Collections.GenericIListImplementation.HelperTryCoerce(System.Object,Rhino.Geometry.Point3f@)
Converts any object that is deemed suitable to Point3f.

Rhino.Collections.GenericIListImplementation.HelperTryCoerce(System.Object,Rhino.Geometry.Vector3f@)
Converts any object that is deemed suitable to Vector3f.

Rhino.Collections.GenericIListImplementation.HelperTryCoerce(System.Object,Rhino.Geometry.Point2f@)
Converts any object that is deemed suitable to Vector2f.

Rhino.Collections.GenericIListImplementation.HelperCoercePoint(System.Object)
Converts any object that is deemed suitable to Point3f, or raises an exception.

Rhino.Collections.GenericIListImplementation.HelperCoercePoint2(System.Object)
Converts any object that is deemed suitable to Point2f, or raises an exception.

Rhino.Collections.GenericIListImplementation.HelperCoerceVector(System.Object)
Converts any object that is deemed suitable to Vector3f, or raises an exception.