Rhino.Render.CustomRenderMeshes.MeshProviderIds
Built in primitive provider ids.

Rhino.Render.CustomRenderMeshes.MeshProviderIds.EdgeSoftening
Since: 8.0

Rhino.Render.CustomRenderMeshes.MeshProviderIds.Displacement
Since: 8.0

Rhino.Render.CustomRenderMeshes.MeshProviderIds.CurvePiping
Since: 8.0

Rhino.Render.CustomRenderMeshes.MeshProviderIds.Shutlining
Since: 8.0

Rhino.Render.CustomRenderMeshes.MeshProviderIds.Thickening
Since: 8.0