Rhino.RhinoFileWatcherChangeReason
Passed to IRhinoFileEventWatcher::Changed when a change event is raised.

Rhino.RhinoFileWatcherChangeReason.Created
The creation of a file or folder.

Rhino.RhinoFileWatcherChangeReason.Deleted
The deletion of a file or folder.

Rhino.RhinoFileWatcherChangeReason.Changed
The change of a file or folder. The types of changes include: changes to size,
attributes, security settings, last write, and last access time.

Rhino.RhinoFileWatcherChangeReason.Renamed
The renaming of a file or folder.