Rhino.Runtime.LicenseManager.UuidCallback
Delegate passed to rhcommon_c as a call back function pointer
mode:
Constants defined in rh_license.cpp which define which LicenseUtils
method to call.
id:
License type id
Returns: