Rhino.Geometry.Plane
Represents the value of a center point and two axes in a plane in three dimensions.

Rhino.Geometry.Plane.Origin
Gets or sets the origin point of this plane.
Since: 5.0

Rhino.Geometry.Plane.OriginX
Gets or sets the X coordinate of the origin of this plane.
Since: 5.0

Rhino.Geometry.Plane.OriginY
Gets or sets the Y coordinate of the origin of this plane.
Since: 5.0

Rhino.Geometry.Plane.OriginZ
Gets or sets the Z coordinate of the origin of this plane.
Since: 5.0

Rhino.Geometry.Plane.XAxis
Gets or sets the X axis vector of this plane.
Since: 5.0

Rhino.Geometry.Plane.YAxis
Gets or sets the Y axis vector of this plane.
Since: 5.0

Rhino.Geometry.Plane.ZAxis
Gets or sets the Z axis vector of this plane.
Since: 5.0

Rhino.Geometry.Plane.WorldXY
plane coincident with the World XY plane.
Since: 5.0

Rhino.Geometry.Plane.WorldYZ
plane coincident with the World YZ plane.
Since: 5.0

Rhino.Geometry.Plane.WorldZX
plane coincident with the World ZX plane.
Since: 5.0

Rhino.Geometry.Plane.Unset
Gets a plane that contains Unset origin and axis vectors.
Since: 5.0

Rhino.Geometry.Plane.#ctor(Rhino.Geometry.Plane)
Copy constructor.
other: The source plane value.
Since: 5.0

Rhino.Geometry.Plane.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)
Constructs a plane from a point and a normal vector.
origin: Origin point of the plane.
normal: Non-zero normal to the plane.
CreateFromNormal
Since: 5.0

Rhino.Geometry.Plane.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Constructs a plane from a point and two vectors in the plane.
Origin point of the plane.
Non-zero vector in the plane that determines the x-axis direction.
Non-zero vector not parallel to x_dir that is used to determine the
y-axis direction. y_dir does not need to be perpendicular to x_dir.
Since: 5.0

Rhino.Geometry.Plane.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Initializes a plane from three non-collinear points.
Origin point of the plane.
Second point in the plane. The x-axis will be parallel to x_point-origin.
Third point on the plane that is not collinear with the first two points.
taxis*(y_point-origin) will be > 0.
Since: 5.0

Rhino.Geometry.Plane.#ctor(System.Double,System.Double,System.Double,System.Double)
Constructs a plane from an equation
Ax+By+Cz+D=0.
Since: 5.0

Rhino.Geometry.Plane.CreateFromFrame(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Constructs a plane from a point, and two vectors in the plane.
origin: Point on the plane.
xDirection: Non-zero vector in the plane that determines the XAxis direction.
yDirection:
Non-zero vector not parallel to xDirection that is used to determine the YAxis direction.
Note, yDirection does not have to be perpendicular to xDirection.
Returns: A valid plane if successful, or Plane.Unset on failure.
Since: 8.0

Rhino.Geometry.Plane.CreateFromNormal(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)
Constructs a plane from a point and normal vector.
origin: Point on the plane.
normal: Non-zero normal to the plane.
Returns: A valid plane if successful, or Plane.Unset on failure.
Since: 8.0

Rhino.Geometry.Plane.CreateFromNormalYup(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Construct a plane from a point, a normal vector, and a vector that projects to the positive YAxis.
origin: Point on the plane.
normal: Non-zero normal to the plane.
yDirection: Non-zero vector, linearly independent from normal, that projects to the positive YAxis of the plane.
Returns: A valid plane if successful, or Plane.Unset on failure.
Since: 8.0

Rhino.Geometry.Plane.CreateFromPoints(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Construct a plane from three non-collinear points.
origin: Point on the plane.
xPoint: Second point in the plane. XAxis will be parallel to xPoint-origin.
yPoint:
Third point on the plane that is not collinear with the first two points, where
YAxis*(yPoint-origin) will be > 0.
Returns: A valid plane if successful, or Plane.Unset on failure.
Since: 8.0

Rhino.Geometry.Plane.FitPlaneToPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.Geometry.Plane@)
Fit a plane through a collection of points.
points: Points to fit to.
plane: Resulting plane.
Returns: A value indicating the result of the operation.
Since: 5.0

Rhino.Geometry.Plane.FitPlaneToPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.Geometry.Plane@,System.Double@)
Fit a plane through a collection of points.
points: Points to fit to.
plane: Resulting plane.
maximumDeviation: The distance from the furthest point to the plane.
Returns: A value indicating the result of the operation.
Since: 5.0

Rhino.Geometry.Plane.op_Equality(Rhino.Geometry.Plane,Rhino.Geometry.Plane)
Determines if two planes are equal.
a: A first plane.
b: A second plane.
Returns: true if the two planes have all equal components; false otherwise.
Since: 5.0

Rhino.Geometry.Plane.op_Inequality(Rhino.Geometry.Plane,Rhino.Geometry.Plane)
Determines if two planes are different.
a: A first plane.
b: A second plane.
Returns: true if the two planes have any different component components; false otherwise.
Since: 5.0

Rhino.Geometry.Plane.Equals(System.Object)
Determines if an object is a plane and has the same components as this plane.
obj: An object.
Returns: true if obj is a plane and has the same components as this plane; false otherwise.

Rhino.Geometry.Plane.Equals(Rhino.Geometry.Plane)
Determines if another plane has the same components as this plane.
plane: A plane.
Returns: true if plane has the same components as this plane; false otherwise.
Since: 5.0

Rhino.Geometry.Plane.GetHashCode
Gets a non-unique hashing code for this entity.
Returns: A particular number for a specific instance of plane.

Rhino.Geometry.Plane.ToString
Constructs the string representation of this plane.
Returns: Text.

Rhino.Geometry.Plane.ToString(System.String,System.IFormatProvider)
Since: 7.0

Rhino.Geometry.Plane.Normal
Gets the normal of this plane. This is essentially the ZAxis of the plane.
Since: 5.0

Rhino.Geometry.Plane.IsValid
Gets a value indicating whether or not this is a valid plane.
A plane is considered to be valid when all fields contain reasonable
information and the equation jibes with point and z-axis.
Since: 5.0

Rhino.Geometry.Plane.GetPlaneEquation
Gets the plane equation for this plane in the format of Ax+By+Cz+D=0.
Returns:
Array of four values.
Since: 5.0

Rhino.Geometry.Plane.UpdateEquation
Update Equations
Returns:
bool
Since: 6.0

Rhino.Geometry.Plane.ValueAt(Rhino.Geometry.Point3d)
Get the value of the plane equation at the point.
p: evaluation point.
Returns: returns pe[0]*p.X + pe[1]*p.Y + pe[2]*p.Z + pe[3] where
pe[0], pe[1], pe[2] and pe[3] are the coefficients of the plane equation.
Since: 5.7

Rhino.Geometry.Plane.PointAt(System.Double,System.Double)
Evaluate a point on the plane.
u: evaluation parameter.
v: evaluation parameter.
Returns: plane.origin + u*plane.xaxis + v*plane.yaxis.
Since: 5.0

Rhino.Geometry.Plane.IsCoplanar(Rhino.Geometry.Plane)
Test if this plane is co-planar with a another plane.
plane: The plane to test.
Returns: True if this plane is co-planar with the test plane, false otherwise.
Since: 8.0

Rhino.Geometry.Plane.IsCoplanar(Rhino.Geometry.Plane,System.Double)
Test if this plane is co-planar with a another plane.
plane: The plane to test.
tolerance: Testing tolerance.
Returns: True if this plane is co-planar with the test plane, false otherwise.
Since: 8.0

Rhino.Geometry.Plane.PointAt(System.Double,System.Double,System.Double)
Evaluate a point on the plane.
u: evaluation parameter.
v: evaluation parameter.
w: evaluation parameter.
Returns: plane.origin + u*plane.xaxis + v*plane.yaxis + z*plane.zaxis.
Since: 5.0

Rhino.Geometry.Plane.ExtendThroughBox(Rhino.Geometry.BoundingBox,Rhino.Geometry.Interval@,Rhino.Geometry.Interval@)
Extends this plane through a bounding box.
box: A box to use as minimal extension boundary.
s:
If this function returns true,
the s parameter returns the Interval on the plane along the X direction that will
encompass the Box.
t:
If this function returns true,
the t parameter returns the Interval on the plane along the Y direction that will
encompass the Box.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Plane.ExtendThroughBox(Rhino.Geometry.Box,Rhino.Geometry.Interval@,Rhino.Geometry.Interval@)
Extend this plane through a Box.
box: A box to use for extension.
s:
If this function returns true,
the s parameter returns the Interval on the plane along the X direction that will
encompass the Box.
t:
If this function returns true,
the t parameter returns the Interval on the plane along the Y direction that will
encompass the Box.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Plane.ClosestParameter(Rhino.Geometry.Point3d,System.Double@,System.Double@)
Gets the parameters of the point on the plane closest to a test point.
testPoint: Point to get close to.
s: Parameter along plane X-direction.
t: Parameter along plane Y-direction.
Returns:
true if a parameter could be found,
false if the point could not be projected successfully.
Since: 5.0

Rhino.Geometry.Plane.ClosestPoint(Rhino.Geometry.Point3d)
Gets the point on the plane closest to a test point.
testPoint: Point to get close to.
Returns:
The point on the plane that is closest to testPoint,
or Point3d.Unset on failure.
Since: 5.0

Rhino.Geometry.Plane.DistanceTo(Rhino.Geometry.Point3d)
Returns the signed distance from testPoint to its projection onto this plane.
If the point is below the plane, a negative distance is returned.
testPoint: Point to test.
Returns: Signed distance from this plane to testPoint.
Since: 5.0

Rhino.Geometry.Plane.DistanceTo(Rhino.Geometry.BoundingBox,System.Double@,System.Double@)
Returns the signed minimum and maximum distances from bounding box to this plane.
bbox: bounding box to get distances from
min: minimum signed distance from plane to box
max: maximum signed distance from plane to box
Returns: false if plane has zero length normal
Since: 6.0

Rhino.Geometry.Plane.RemapToPlaneSpace(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d@)
Convert a point from World space coordinates into Plane space coordinates.
ptSample: World point to remap.
ptPlane: Point in plane (s,t,d) coordinates.
Returns: true on success, false on failure.
Remarks: D stands for distance, not disease.
Since: 5.0

Rhino.Geometry.Plane.Flip
Flip this plane by swapping out the X and Y axes and inverting the Z axis.
Since: 5.0

Rhino.Geometry.Plane.Transform(Rhino.Geometry.Transform)
Transform the plane with a Transformation matrix.
xform: Transformation to apply to plane.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Plane.Translate(Rhino.Geometry.Vector3d)
Translate (move) the plane along a vector.
delta: Translation (motion) vector.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Plane.Rotate(System.Double,System.Double,Rhino.Geometry.Vector3d)
Rotate the plane about its origin point.
sinAngle: Sin(angle).
cosAngle: Cos(angle).
axis: Axis of rotation.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Plane.Rotate(System.Double,Rhino.Geometry.Vector3d)
Rotate the plane about its origin point.
angle: Angle in radians.
axis: Axis of rotation.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Plane.Rotate(System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Rotate the plane about a custom anchor point.
angle: Angle in radians.
axis: Axis of rotation.
centerOfRotation: Center of rotation.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Plane.Rotate(System.Double,System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Rotate the plane about a custom anchor point.
sinAngle: Sin(angle)
cosAngle: Cos(angle)
axis: Axis of rotation.
centerOfRotation: Center of rotation.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Plane.EpsilonEquals(Rhino.Geometry.Plane,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:
Since: 5.4

Rhino.Geometry.Plane.System#ICloneable#Clone
Since: 6.0

Rhino.Geometry.Plane.Clone
Returns a deep copy of this instance.
Returns: A plane with the same values as this item.
Since: 6.0