Rhino.Runtime.InteropWrappers.SimpleArrayByte
Wrapper for ON_SimpleArray<unsigned char>. If you are not writing C++ code
then this class is not for you.

Rhino.Runtime.InteropWrappers.SimpleArrayByte.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.
Since: 7.0

Rhino.Runtime.InteropWrappers.SimpleArrayByte.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.
Since: 7.0

Rhino.Runtime.InteropWrappers.SimpleArrayByte.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayByte class.
Since: 7.0

Rhino.Runtime.InteropWrappers.SimpleArrayByte.#ctor(System.Int32)
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayByte class.
initialSize: Initial size of the array - all values are set to zero.
Since: 7.0

Rhino.Runtime.InteropWrappers.SimpleArrayByte.#ctor(Rhino.Runtime.InteropWrappers.SimpleArrayByte)
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayByte with the contents of another SimpleArrayByte.
Since: 7.0

Rhino.Runtime.InteropWrappers.SimpleArrayByte.CopyTo(Rhino.Runtime.InteropWrappers.SimpleArrayByte)
Copies the contents of a Rhino.Runtime.InteropWrappers.SimpleArrayByte into another SimpleArrayByte.
Since: 7.0

Rhino.Runtime.InteropWrappers.SimpleArrayByte.#ctor(System.Collections.Generic.IEnumerable{System.Byte})
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayByte class
values: initial set of integers to add to the array
Since: 7.0

Rhino.Runtime.InteropWrappers.SimpleArrayByte.Count
Gets the amount of elements in this array.
Since: 7.0

Rhino.Runtime.InteropWrappers.SimpleArrayByte.Array
Return the raw data.
Since: 7.0

Rhino.Runtime.InteropWrappers.SimpleArrayByte.ToArray
Returns the managed counterpart of the unmanaged array.
Returns: The managed array.
Since: 7.0

Rhino.Runtime.InteropWrappers.SimpleArrayByte.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.SimpleArrayByte.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 7.0