Rhino.Render.RenderContentType
Represents one of the render content types registered with Rhino.

Rhino.Render.RenderContentType.#ctor(System.Guid)
Since: 6.0

Rhino.Render.RenderContentType.GetAllAvailableTypes
Gets an array of all available render content types registered with Rhino.
Returns: An array with all types.
Since: 6.0

Rhino.Render.RenderContentType.NewRenderContent
Returns a new instance of the render content of this type.  This content can be added to a persistent list.
Returns: A new render content instance.
Since: 6.0

Rhino.Render.RenderContentType.NewContentFromTypeId(System.Guid)
Create a new content specified by the Guid.
This function can be used to create temporary content, as it calls
::RhRdkContentFactories().NewContentFromType().
typeId:
Returns:
Since: 6.0

Rhino.Render.RenderContentType.NewContentFromTypeId(System.Guid,Rhino.RhinoDoc)
Since: 6.4

Rhino.Render.RenderContentType.Id
Returns the type identifier associated with this type.
Since: 6.0

Rhino.Render.RenderContentType.InternalName
Returns the internal name identifier associated with this type.
Since: 6.0

Rhino.Render.RenderContentType.RenderEngineId
Since: 6.0

Rhino.Render.RenderContentType.PlugInId
Since: 6.0

Rhino.Render.RenderContentType.Dispose
Since: 6.0