Rhino.Geometry.Matrix
Represents an arbitrarily sized matrix of double-precision
floating point numbers. If you are working with a 4x4 matrix, then you may want
to use the Rhino.Geometry.Transform class instead.

Rhino.Geometry.Matrix.#ctor(System.Int32,System.Int32)
Initializes a new instance of the matrix.
rowCount: A positive integer, or 0, for the number of rows.
columnCount: A positive integer, or 0, for the number of columns.
Throws System.ArgumentOutOfRangeException: If either rowCount, or columnCount
or both are negative.
Since: 5.0

Rhino.Geometry.Matrix.#ctor(Rhino.Geometry.Transform)
Initializes a new instance of the matrix based on a 4x4 matrix Rhino.Geometry.Transform.
xform: A 4x4 matrix to copy from.
Since: 5.0

Rhino.Geometry.Matrix.Duplicate
Create a duplicate of this matrix.
Returns: An exact duplicate of this matrix.
Since: 5.1

Rhino.Geometry.Matrix.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Geometry.Matrix.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0

Rhino.Geometry.Matrix.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.Geometry.Matrix.Item(System.Int32,System.Int32)
Gets or sets the matrix value at the given row and column indices.
row: Index of row to access.
column: Index of column to access.
Returns: The value at [row, column].
The new value at [row, column].

Rhino.Geometry.Matrix.IsValid
Gets a value indicating whether this matrix is valid.
Since: 5.0

Rhino.Geometry.Matrix.IsSquare
Gets a value indicating whether this matrix has the same number of rows
and columns. 0x0 matrices are not considered square.
Since: 5.0

Rhino.Geometry.Matrix.RowCount
Gets the amount of rows.
Since: 5.0

Rhino.Geometry.Matrix.ColumnCount
Gets the amount of columns.
Since: 5.0

Rhino.Geometry.Matrix.Zero
Sets all values inside the matrix to zero.
Since: 5.0

Rhino.Geometry.Matrix.SetDiagonal(System.Double)
Sets diagonal value and zeros off all non-diagonal values.
d: The new diagonal value.
Since: 5.0

Rhino.Geometry.Matrix.Transpose
Modifies this matrix to be its transpose.
This is like swapping rows with columns.
http://en.wikipedia.org/wiki/Transpose
Returns: true if operation succeeded; otherwise false.
Since: 5.0

Rhino.Geometry.Matrix.SwapRows(System.Int32,System.Int32)
Exchanges two rows.
rowA: A first row.
rowB: Another row.
Returns: true if operation succeeded; otherwise false.
Since: 5.0

Rhino.Geometry.Matrix.SwapColumns(System.Int32,System.Int32)
Exchanges two columns.
columnA: A first column.
columnB: Another column.
Returns: true if operation succeeded; otherwise false.
Since: 5.0

Rhino.Geometry.Matrix.Invert(System.Double)
Modifies this matrix to become its own inverse.
Matrix might be non-invertible (singular) and the return value will be false.
zeroTolerance: The admitted tolerance for 0.
Returns: true if operation succeeded; otherwise false.
Since: 5.0

Rhino.Geometry.Matrix.op_Multiply(Rhino.Geometry.Matrix,Rhino.Geometry.Matrix)
Multiplies two matrices and returns a new product matrix.
a: A first matrix to use in calculation.
b: Another matrix to use in calculation.
Returns: The product matrix.
Throws System.ArgumentException:
When a.ColumnCount != b.RowCount.
Since: 5.0

Rhino.Geometry.Matrix.op_Addition(Rhino.Geometry.Matrix,Rhino.Geometry.Matrix)
Adds two matrices and returns a new sum matrix.
a: A first matrix to use in calculation.
b: Another matrix to use in calculation.
Returns: The sum matrix.
Throws System.ArgumentException:
When the two matrices are not the same size.

Rhino.Geometry.Matrix.Scale(System.Double)
Modifies the current matrix by multiplying its values by a number.
s: A scale factor.
Since: 5.0

Rhino.Geometry.Matrix.RowReduce(System.Double,System.Double@,System.Double@)
Row reduces a matrix to calculate rank and determinant.
zeroTolerance:
(>=0.0) zero tolerance for pivot test.  If a the absolute value of
a pivot is <= zeroTolerance, then the pivot is assumed to be zero.
determinant: value of determinant is returned here.
pivot: value of the smallest pivot is returned here.
Returns: Rank of the matrix.
Remarks:
The matrix itself is row reduced so that the result is an upper
triangular matrix with 1's on the diagonal.
Since: 5.0

Rhino.Geometry.Matrix.RowReduce(System.Double,System.Double[],System.Double@)
Row reduces a matrix as the first step in solving M*X=b where
b is a column of values.
zeroTolerance:
(>=0.0) zero tolerance for pivot test. If the absolute value of a pivot
is <= zero_tolerance, then the pivot is assumed to be zero.
b: an array of RowCount values that is row reduced with the matrix.
pivot: the value of the smallest pivot is returned here.
Returns: Rank of the matrix.
Remarks:
The matrix itself is row reduced so that the result is an upper
triangular matrix with 1's on the diagonal.
Since: 5.0

Rhino.Geometry.Matrix.RowReduce(System.Double,Rhino.Geometry.Point3d[],System.Double@)
Row reduces a matrix as the first step in solving M*X=b where
b is a column of 3d points.
zeroTolerance:
(>=0.0) zero tolerance for pivot test. If the absolute value of a pivot
is <= zero_tolerance, then the pivot is assumed to be zero.
b: An array of RowCount 3d points that is row reduced with the matrix.
pivot: The value of the smallest pivot is returned here.
Returns: Rank of the matrix.
Remarks:
The matrix itself is row reduced so that the result is an upper
triangular matrix with 1's on the diagonal.
Since: 5.0

Rhino.Geometry.Matrix.BackSolve(System.Double,System.Double[])
Solves M*x=b where M is upper triangular with a unit diagonal and
b is a column of values.
zeroTolerance: (>=0.0) used to test for "zero" values in b
in under determined systems of equations.
b: The values in B[RowCount],...,B[B.Length-1] are tested to
make sure they are within "zeroTolerance".
Returns:
Array of length ColumnCount on success. null on error.
Since: 5.0

Rhino.Geometry.Matrix.BackSolvePoints(System.Double,Rhino.Geometry.Point3d[])
Solves M*x=b where M is upper triangular with a unit diagonal and
b is a column of 3d points.
zeroTolerance: (>=0.0) used to test for "zero" values in b
in under determined systems of equations.
b: The values in B[RowCount],...,B[B.Length-1] are tested to
make sure they are "zero".
Returns:
Array of length ColumnCount on success. null on error.
Since: 5.0

Rhino.Geometry.Matrix.IsRowOrthogonal
Gets a value indicating whether the matrix is row orthogonal.
Since: 5.0

Rhino.Geometry.Matrix.IsColumnOrthogonal
Gets a value indicating whether the matrix is column orthogonal.
Since: 5.0

Rhino.Geometry.Matrix.IsRowOrthoNormal
Gets a value indicating whether the matrix is row orthonormal.
Since: 5.0

Rhino.Geometry.Matrix.IsColumnOrthoNormal
Gets a value indicating whether the matrix is column orthonormal.
Since: 5.0

Rhino.Geometry.Matrix.GetHashCode
Gets the hash code for this matrix. The hash code will change
when the matrix changes so you cannot change matrices while they are stored in
hash tables.
Returns: Hash code.