Rhino.Geometry.Collections.MeshVertexColorList
Provides access to the vertex colors of a mesh object.

Rhino.Geometry.Collections.MeshVertexColorList.Count
Gets or sets the number of mesh colors.
Since: 5.0

Rhino.Geometry.Collections.MeshVertexColorList.Item(System.Int32)
Gets or sets the vertex color at the given index.
The index must be valid or an IndexOutOfRangeException will be thrown.
index: Index of vertex control to access.
Throws System.IndexOutOfRangeException: Thrown when the index is invalid.
Returns: The vertex color at [index].

Rhino.Geometry.Collections.MeshVertexColorList.Tag
Gets or sets a mapping information for the mesh associated with these vertex colors.
Since: 5.0

Rhino.Geometry.Collections.MeshVertexColorList.ToARGBArray
Return colors as an array of integers with packed ARGB values
Returns:
Since: 7.0

Rhino.Geometry.Collections.MeshVertexColorList.Clear
Clears the vertex color list on the mesh.
Since: 5.0

Rhino.Geometry.Collections.MeshVertexColorList.Add(System.Int32,System.Int32,System.Int32)
Adds a new vertex color to the end of the color list.
red: Red component of color, must be in the 0~255 range.
green: Green component of color, must be in the 0~255 range.
blue: Blue component of color, must be in the 0~255 range.
Returns: The index of the newly added color.
Since: 5.0

Rhino.Geometry.Collections.MeshVertexColorList.Add(System.Drawing.Color)
Adds a new vertex color to the end of the color list.
color: Color to append.
Returns: The index of the newly added color.
Since: 5.0

Rhino.Geometry.Collections.MeshVertexColorList.AddRange(System.Collections.Generic.IEnumerable{System.Drawing.Color})
Adds an enumerable of colors to the to the vertex color list.
For the Mesh to be valid, the number of colors must match the number of vertices.
colors: Colors to append.
Returns: true on success, false on failure.
Since: 8.12

Rhino.Geometry.Collections.MeshVertexColorList.SetColor(System.Int32,System.Int32,System.Int32,System.Int32)
Sets or adds a vertex color to the color List.
If [index] is less than [Count], the existing vertex at [index] will be modified.
If [index] equals [Count], a new vertex is appended to the end of the vertex list.
If [index] is larger than [Count], the function will return false.
index: Index of vertex color to set.
If index equals Count, then the color will be appended.
red: Red component of vertex color. Value must be in the 0~255 range.
green: Green component of vertex color. Value must be in the 0~255 range.
blue: Blue component of vertex color. Value must be in the 0~255 range.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Collections.MeshVertexColorList.SetColor(System.Int32,System.Drawing.Color)
Sets or adds a vertex to the Vertex List.
If [index] is less than [Count], the existing vertex at [index] will be modified.
If [index] equals [Count], a new vertex is appended to the end of the vertex list.
If [index] is larger than [Count], the function will return false.
index: Index of vertex color to set.
If index equals Count, then the color will be appended.
color: Color to set, Alpha channels will be ignored.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Collections.MeshVertexColorList.SetColor(Rhino.Geometry.MeshFace,System.Drawing.Color)
Sets a color at the three or four vertex indices of a specified face.
face: A face to use to retrieve indices.
color: A color.
Returns: true on success; false on error.
Since: 5.0

Rhino.Geometry.Collections.MeshVertexColorList.Capacity
Gets or sets the total number of vertex colors the internal data structure can hold without resizing.
Since: 6.0

Rhino.Geometry.Collections.MeshVertexColorList.CreateMonotoneMesh(System.Drawing.Color)
Constructs a valid vertex color list consisting of a single color.
baseColor: Color to apply to every vertex.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Collections.MeshVertexColorList.SetColors(System.Drawing.Color[])
Sets all the vertex colors in one go. For the Mesh to be valid, the number
of colors must match the number of vertices.
colors: Colors to set.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Collections.MeshVertexColorList.AppendColors(System.Drawing.Color[])
Appends a collection of colors to the vertex color list.
For the Mesh to be valid, the number of colors must match the number of vertices.
colors: Colors to append.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Collections.MeshVertexColorList.Destroy
Releases all memory allocated to store vertex colors. The list capacity will be 0 after this call.
Subsequent calls can add new items.
Since: 6.0

Rhino.Geometry.Collections.MeshVertexColorList.System#Collections#Generic#ICollection{System#Drawing#Color}#Add(System.Drawing.Color)
Since: 5.0

Rhino.Geometry.Collections.MeshVertexColorList.GetEnumerator
Gets an enumerator that yields all colors in this collection.
Returns: The enumerator.
Since: 5.0

Rhino.Geometry.Collections.MeshVertexColorList.System#Collections#IEnumerable#GetEnumerator
Since: 5.0