Rhino.Geometry.Rectangle3d
Represents the values of a plane and two intervals
that form an oriented rectangle in three dimensions.

Rhino.Geometry.Rectangle3d.CreateFromPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Attempts to create a rectangle from a polyline. This method only works well for
polylines that already closely resemble rectangles. If the polyline contains
more than four vertices, the least significant ones will be ignored. If the
polylines is non-orthogonal, the discrepancies will be averaged away.
This method should not be used as a Rectangle fitter.
polyline: Polyline to parse.
Returns: A rectangle that is shaped similarly to the polyline or Rectangle3d.Unset
if the polyline does not represent a rectangle.
Since: 5.0

Rhino.Geometry.Rectangle3d.CreateFromPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Double@,System.Double@)
Attempts to create a rectangle from a polyline. This method only works well for
polylines that already closely resemble rectangles. If the polyline contains
more than four vertices, the least significant ones will be ignored. If the
polylines is non-orthogonal, the discrepancies will be averaged away.
This method should not be used as a Rectangle fitter.
polyline: Polyline to parse.
deviation: On success, the deviation will contain the largest deviation between the polyline and the rectangle.
angleDeviation: On success, the angleDeviation will contain the largest deviation (in radians) between the polyline edges and the rectangle edges.
Returns: A rectangle that is shaped similarly to the polyline or Rectangle3d.Unset
if the polyline does not represent a rectangle.
Since: 5.0

Rhino.Geometry.Rectangle3d.CreateDegenerateRectangle(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Create a degenerate (i.e. line-like) rectangle between two points.
a: First point.
b: Second point.
Returns: Rectangle.

Rhino.Geometry.Rectangle3d.CreateTwoSidedRectangle(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Create a rectangle from two sides of a triangle.
a: First point.
b: Second point.
c: third point.
Returns: Rectangle.

Rhino.Geometry.Rectangle3d.RecursiveReduceVertices(System.Collections.Generic.List{Rhino.Geometry.Point3d})
Recursively remove the least significant vertex until we're down to four.
p: Vertices.
Returns: Reduced vertices.

Rhino.Geometry.Rectangle3d.ComputeDeviation(Rhino.Geometry.Rectangle3d,System.Collections.Generic.IList{Rhino.Geometry.Point3d},System.Double@,System.Double@)
Compute the absolute and angular deviation of a rectangle compared to a polyline.

Rhino.Geometry.Rectangle3d.#ctor(Rhino.Geometry.Plane,System.Double,System.Double)
Initializes a new rectangle from width and height.
plane: Base plane for Rectangle.
width: Width (as measured along the base plane x-axis) of rectangle.
height: Height (as measured along the base plane y-axis) of rectangle.
Since: 5.0

Rhino.Geometry.Rectangle3d.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.Interval,Rhino.Geometry.Interval)
Initializes a new rectangle from dimensions.
plane: Base plane for Rectangle.
width: Dimension of rectangle along the base plane x-axis.
height: Dimension of rectangle along the base plane y-axis.
Since: 5.0

Rhino.Geometry.Rectangle3d.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Initializes a new rectangle from a base plane and two corner points.
plane: Base plane for Rectangle.
cornerA: First corner of Rectangle (will be projected onto plane).
cornerB: Second corner of Rectangle (will be projected onto plane).
Since: 5.0

Rhino.Geometry.Rectangle3d.Unset
Gets a rectangle with Unset components.
Since: 5.0

Rhino.Geometry.Rectangle3d.IsValid
Gets a value indicating whether or not this is a valid rectangle.
A rectangle is considered to be valid when the base plane and both dimensions are valid.
Since: 5.0

Rhino.Geometry.Rectangle3d.Plane
Gets or sets the base plane of the rectangle.
Since: 5.0

Rhino.Geometry.Rectangle3d.X
Gets or sets the dimensions of the rectangle along the base plane X-Axis (i.e. the width).
Since: 5.0

Rhino.Geometry.Rectangle3d.Y
Gets or sets the dimensions of the rectangle along the base plane Y-Axis (i.e. the height).
Since: 5.0

Rhino.Geometry.Rectangle3d.Width
Gets the signed width of the rectangle. If the X dimension is decreasing, the width will be negative.
Since: 5.0

Rhino.Geometry.Rectangle3d.Height
Gets the signed height of the rectangle. If the Y dimension is decreasing, the height will be negative.
Since: 5.0

Rhino.Geometry.Rectangle3d.Area
Gets the unsigned Area of the rectangle.
Since: 5.0

Rhino.Geometry.Rectangle3d.Circumference
Gets the circumference of the rectangle.
Since: 5.0

Rhino.Geometry.Rectangle3d.BoundingBox
Gets the world aligned bounding box for this rectangle.
Since: 5.0

Rhino.Geometry.Rectangle3d.Center
Gets the point in the center of the rectangle.
Since: 5.0

Rhino.Geometry.Rectangle3d.MakeIncreasing
Ensures the X and Y dimensions are increasing or singleton intervals.
Since: 5.0

Rhino.Geometry.Rectangle3d.Corner(System.Int32)
Gets the corner at the given index.
index:
Index of corner, valid values are:
0 = lower left (min-x, min-y)
1 = lower right (max-x, min-y)
2 = upper right (max-x, max-y)
3 = upper left (min-x, max-y)
Returns: The point at the given corner index.
Since: 5.0

Rhino.Geometry.Rectangle3d.RecenterPlane(System.Int32)
Re-centers the base plane on one of the corners.
index:
Index of corner, valid values are:
0 = lower left (min-x, min-y)
1 = lower right (max-x, min-y)
2 = upper right (max-x, max-y)
3 = upper left (min-x, max-y)
Since: 5.0

Rhino.Geometry.Rectangle3d.RecenterPlane(Rhino.Geometry.Point3d)
Re-centers the base plane on a new origin.
origin: New origin for plane.
Since: 5.0

Rhino.Geometry.Rectangle3d.PointAt(System.Double,System.Double)
Gets a point in Rectangle space.
x: Normalized parameter along Rectangle width.
y: Normalized parameter along Rectangle height.
Returns: The point at the given x,y parameter.
Since: 5.0

Rhino.Geometry.Rectangle3d.PointAt(System.Double)
Gets a point along the rectangle boundary.
t: Parameter along rectangle boundary. Valid values range from 0.0 to 4.0,
where each integer domain represents a single boundary edge.
Returns: The point at the given boundary parameter.
Since: 5.0

Rhino.Geometry.Rectangle3d.ClosestPoint(Rhino.Geometry.Point3d)
Gets the point on the rectangle that is closest to a test-point.
point: Point to project.
Returns: The point on or in the rectangle closest to the test point or Point3d.Unset on failure.
Since: 5.0

Rhino.Geometry.Rectangle3d.ClosestPoint(Rhino.Geometry.Point3d,System.Boolean)
Gets the point on the rectangle that is closest to a test-point.
point: Point to project.
includeInterior: If false, the point is projected onto the boundary edge only,
otherwise the interior of the rectangle is also taken into consideration.
Returns: The point on the rectangle closest to the test point or Point3d.Unset on failure.
Since: 5.0

Rhino.Geometry.Rectangle3d.Contains(Rhino.Geometry.Point3d)
Determines if a point is included in this rectangle.
pt: Point to test. The point will be projected onto the Rectangle plane before inclusion is determined.
Returns: Point Rectangle relationship.
Since: 5.0

Rhino.Geometry.Rectangle3d.Contains(System.Double,System.Double)
Determines if two plane parameters are included in this rectangle.
x: Parameter along base plane X direction.
y: Parameter along base plane Y direction.
Returns: Parameter Rectangle relationship.
Since: 5.0

Rhino.Geometry.Rectangle3d.Transform(Rhino.Geometry.Transform)
Transforms this rectangle. Note that rectangles cannot be skewed or tapered.
xform: Transformation to apply.
Since: 5.0

Rhino.Geometry.Rectangle3d.ToPolyline
Constructs a polyline from this rectangle.
Returns: A polyline with the same shape as this rectangle.
Since: 5.0

Rhino.Geometry.Rectangle3d.ToNurbsCurve
Constructs a nurbs curve representation of this rectangle.
Returns: A nurbs curve with the same shape as this rectangle.
Since: 5.0

Rhino.Geometry.Rectangle3d.EpsilonEquals(Rhino.Geometry.Rectangle3d,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:
Since: 5.4