Rhino.Render.PreviewBackground
PreviewBackGround takes care of construction and destruction of PreviewLight

Rhino.Render.PreviewBackground.CppPointer
CppPointer for PreivewLighting
Since: 6.0

Rhino.Render.PreviewBackground.#ctor(System.IntPtr)
Constructor for PreivewLighting
Since: 6.0

Rhino.Render.PreviewBackground.EnvironmentInstanceId
EnvironmentInstanceId
Since: 6.0

Rhino.Render.PreviewBackground.SetEnvironmentInstanceId(System.Guid)
SetEnvironmentInstanceId
Since: 6.0

Rhino.Render.PreviewBackground.SetUpPreview(System.IntPtr,System.Guid)
SetUpPreview
Since: 6.0

Rhino.Render.PreviewBackground.ElementKind
ElementKind
Since: 6.0