Rhino.DocObjects.RadialDimensionObject
Rhino Object that represents a radial dimension geometry and attributes

Rhino.DocObjects.RadialDimensionObject.RadialDimensionGeometry
Get the dimension geometry for this object.
Since: 6.0