Rhino.Geometry.RTree
Represents a spatial search structure based on implementations of the
R-tree algorithm by Toni Gutman.
Remarks:
The opennurbs rtree code is a modified version of the free and unrestricted
R-tree implementation obtained from http://www.superliminal.com/sources/sources.htm .

Rhino.Geometry.RTree.#ctor
Initializes a new, empty instance of the tree.
Since: 5.0

Rhino.Geometry.RTree.CreateMeshFaceTree(Rhino.Geometry.Mesh)
Constructs a new tree with an element for each face in the mesh.
The element id is set to the index of the face.
mesh: A mesh.
Returns: A new tree, or null on error.
Since: 5.0

Rhino.Geometry.RTree.CreatePointCloudTree(Rhino.Geometry.PointCloud)
Constructs a new tree with an element for each point cloud point.
cloud: A point cloud.
Returns: A new tree, or null on error.
Since: 5.0

Rhino.Geometry.RTree.CreateFromPointArray(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Constructs a new tree with an element for each point cloud point.
points: Points.
Returns: A new tree, or null on error.
Since: 6.0

Rhino.Geometry.RTree.Insert(Rhino.Geometry.Point3d,System.Int32)
Inserts an element into the tree.
point: A point.
elementId: A number.
Returns: true if element was successfully inserted.
Since: 5.0

Rhino.Geometry.RTree.Insert(Rhino.Geometry.Point3d,System.IntPtr)
Inserts an element into the tree.
point: A point.
elementId: A pointer.
Returns: true if element was successfully inserted.
Since: 5.0

Rhino.Geometry.RTree.Insert(Rhino.Geometry.BoundingBox,System.Int32)
Inserts an element into the tree.
box: A bounding box.
elementId: A number.
Returns: true if element was successfully inserted.
Since: 5.0

Rhino.Geometry.RTree.Insert(Rhino.Geometry.BoundingBox,System.IntPtr)
Inserts an element into the tree.
box: A bounding box.
elementId: A pointer.
Returns: true if element was successfully inserted.
Since: 5.0

Rhino.Geometry.RTree.Insert(Rhino.Geometry.Point2d,System.Int32)
Inserts an element into the tree.
point: A point.
elementId: A number.
Returns: true if element was successfully inserted.
Since: 5.0

Rhino.Geometry.RTree.Insert(Rhino.Geometry.Point2d,System.IntPtr)
Inserts an element into the tree.
point: A point.
elementId: A pointer.
Returns: true if element was successfully inserted.
Since: 5.0

Rhino.Geometry.RTree.Remove(Rhino.Geometry.Point3d,System.Int32)
Removes an element from the tree.
point: A point.
elementId: A number.
Returns: true if element was successfully removed.
Since: 5.0

Rhino.Geometry.RTree.Remove(Rhino.Geometry.Point3d,System.IntPtr)
Removes an element from the tree.
point: A point.
elementId: A pointer.
Returns: true if element was successfully removed.
Since: 5.0

Rhino.Geometry.RTree.Remove(Rhino.Geometry.BoundingBox,System.Int32)
Removes an element from the tree.
box: A bounding box.
elementId: A number.
Returns: true if element was successfully removed.
Since: 5.0

Rhino.Geometry.RTree.Remove(Rhino.Geometry.BoundingBox,System.IntPtr)
Removes an element from the tree.
box: A bounding box.
elementId: A pointer.
Returns: true if element was successfully removed.
Since: 5.0

Rhino.Geometry.RTree.Remove(Rhino.Geometry.Point2d,System.Int32)
Removes an element from the tree.
point: A point.
elementId: A number.
Returns: true if element was successfully removed.
Since: 5.0

Rhino.Geometry.RTree.Clear
Removes all elements.
Since: 5.0

Rhino.Geometry.RTree.Count
Gets the number of items in this tree.
Since: 5.0

Rhino.Geometry.RTree.Search(Rhino.Geometry.BoundingBox,System.EventHandler{Rhino.Geometry.RTreeEventArgs})
Searches for items in a bounding box.
The bounding box can be singular and contain exactly one single point.
box: A bounding box.
callback: An event handler to be raised when items are found.
Returns:
true if entire tree was searched. It is possible no results were found.
Remarks:
Do not modify the tree while a Search() is in progress. Doing so can
have unintended consequences, including corruption and crashes.If you
need to modify the tree, collect the results during the search and modify
the tree once the search is completed.
Since: 5.0

Rhino.Geometry.RTree.Search(Rhino.Geometry.BoundingBox,System.EventHandler{Rhino.Geometry.RTreeEventArgs},System.Object)
Searches for items in a bounding box.
The bounding box can be singular and contain exactly one single point.
box: A bounding box.
callback: An event handler to be raised when items are found.
tag: State to be passed inside the Rhino.Geometry.RTreeEventArgs Tag property.
Returns:
true if entire tree was searched. It is possible no results were found.
Remarks:
Do not modify the tree while a Search() is in progress. Doing so can
have unintended consequences, including corruption and crashes.If you
need to modify the tree, collect the results during the search and modify
the tree once the search is completed.
Since: 5.0

Rhino.Geometry.RTree.Search(Rhino.Geometry.Sphere,System.EventHandler{Rhino.Geometry.RTreeEventArgs})
Searches for items in a sphere.
sphere: bounds used for searching.
callback: An event handler to be raised when items are found.
Returns:
true if entire tree was searched. It is possible no results were found.
Remarks:
Do not modify the tree while a Search() is in progress. Doing so can
have unintended consequences, including corruption and crashes.If you
need to modify the tree, collect the results during the search and modify
the tree once the search is completed.
Since: 5.0

Rhino.Geometry.RTree.Search(Rhino.Geometry.Sphere,System.EventHandler{Rhino.Geometry.RTreeEventArgs},System.Object)
Searches for items in a sphere.
sphere: bounds used for searching.
callback: An event handler to be raised when items are found.
tag: State to be passed inside the Rhino.Geometry.RTreeEventArgs Tag property.
Returns:
true if entire tree was searched. It is possible no results were found.
Remarks:
Do not modify the tree while a Search() is in progress. Doing so can
have unintended consequences, including corruption and crashes.If you
need to modify the tree, collect the results during the search and modify
the tree once the search is completed.
Since: 5.0

Rhino.Geometry.RTree.SearchOverlaps(Rhino.Geometry.RTree,Rhino.Geometry.RTree,System.Double,System.EventHandler{Rhino.Geometry.RTreeEventArgs})
Searches two R-trees for all pairs elements whose bounding boxes overlap.
treeA: A first tree.
treeB: A second tree.
tolerance:
If the distance between a pair of bounding boxes is less than tolerance,
then callback is called.
callback: A callback event handler.
Returns:
true if entire tree was searched.  It is possible no results were found.
Remarks:
Do not modify the tree while a Search() is in progress. Doing so can
have unintended consequences, including corruption and crashes.If you
need to modify the tree, collect the results during the search and modify
the tree once the search is completed.
Since: 5.0

Rhino.Geometry.RTree.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Geometry.RTree.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0

Rhino.Geometry.RTree.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.Geometry.RTree.PointCloudClosestPoints(Rhino.Geometry.PointCloud,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Double)
Finds the point in a list of 3D points that is closest to a test point.
pointcloud: A point cloud to be searched.
needlePts: Points to search for.
limitDistance: The maximum allowed distance.
Returns: An enumerable of arrays of indices; each array contains the indices for each of the needlePts.
Since: 6.0

Rhino.Geometry.RTree.Point3dClosestPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Double)
Finds the point in a list of 3D points that is closest to a test point.
hayPoints: A series of points.
needlePts: Points to search for.
limitDistance: The maximum allowed distance.
Returns: An enumerable of arrays of indices; each array contains the indices for each of the needlePts.
Since: 6.0

Rhino.Geometry.RTree.PointCloudKNeighbors(Rhino.Geometry.PointCloud,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32)
Finds a certain amount of points in a list of 3D points that are the k-closest to a test point.
pointcloud: A point cloud to be searched.
needlePts: Points to search for.
amount: The required amount of closest neighbors to find.
Returns: An enumerable of arrays of indices; each array contains the indices for each of the needlePts.
Rhino.Collections.RhinoList.PointCloudKNeighbors(Rhino.Geometry.PointCloud,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32)
Since: 6.0

Rhino.Geometry.RTree.Point3dKNeighbors(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32)
Finds a certain amount of points in a list of 3D points that are the k-closest to a test point.
hayPoints: A series of points.
needlePts: Points to search for.
amount: The required amount of closest neighbors to find.
Returns: An enumerable of arrays of indices; each array contains the indices for each of the needlePts.
Rhino.Collections.RhinoList.Point3dKNeighbors(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32)
Since: 6.0