Rhino.Display.PageViewPropertiesChangeEventArgs
PageView properties change event arguments.
Since: 8.9

Rhino.Display.PageViewPropertiesChangeEventArgs.DocumentSerialNumber
The serial number of the Rhino document.
Since: 8.9

Rhino.Display.PageViewPropertiesChangeEventArgs.PageViewSerialNumber
The serial number of the page view.
Since: 8.9

Rhino.Display.PageViewPropertiesChangeEventArgs.Document
Gets the Rhino document.
Since: 8.9

Rhino.Display.PageViewPropertiesChangeEventArgs.PageView
Gets the Rhino page view.
Since: 8.9