Rhino.Runtime.AdvancedSetting
Advanced setting Id

Rhino.Runtime.AdvancedSetting.UseNewDraftAngleAnalysisUi
UseNewDraftAngleAnalysisUi
bool Value, defaults to true

Rhino.Runtime.AdvancedSetting.UseCompressionWhenSaving
Use compressed buffers when saving 3dm files (default is true).

Rhino.Runtime.AdvancedSetting.TestAdvancedString
String value, defaults to "test string"

Rhino.Runtime.AdvancedSetting.TestAdvancedInt
Integer value, defaults 123

Rhino.Runtime.AdvancedSetting.PdfOptionalContentGroups
How optional content should be included when exporting PDF files

Rhino.Runtime.AdvancedSetting.LeaveFloatingPanelsHiddenOnMac
Bool value used on Mac to satisfy a user request to hide floating stuff when a command starts and
leave it hidden when the command ends.  This is false by default.
https://mcneel.myjetbrains.com/youtrack/issue/RH-57945

Rhino.Runtime.AdvancedSetting.DisableFileWatchers
Disable file watchers, using to diagnose Mac Rhino mystery crashes
https://mcneel.myjetbrains.com/youtrack/issue/RH-52805

Rhino.Runtime.AdvancedSetting.EnableCheckForUpdates
Auto check for update, enabled by default on Mac, does not show up in Windows
https://mcneel.myjetbrains.com/youtrack/issue/RH-60427

Rhino.Runtime.AdvancedSetting.LeftJustifyNumericText
Mainly an issue on Windows; there are different numeric controls
scattered across the product and no consistent text alignment.
This is an attempt to provide a way to control the preferred
alignment style.

Rhino.Runtime.AdvancedSetting.EnableWindowsGestures
https://mcneel.myjetbrains.com/youtrack/issue/RH-62173
Disable gestures for Windows views for a customer who was complaining when
upgrading.

Rhino.Runtime.AdvancedSetting.MakeInteriorNgonVertexesSelectable
Set this to false if you only want boundary vertexes selectable
when you run PointsOn.
https://mcneel.myjetbrains.com/youtrack/issue/RH-62140

Rhino.Runtime.AdvancedSetting.MacDisplayOldVersionAutosaveWarning
Set this to true if you want to be warned about autosave for old file
versions on Mac.
https://mcneel.myjetbrains.com/youtrack/issue/RH-62359

Rhino.Runtime.AdvancedSetting.UseNewMissingFontUI
Set this to true if you want to be use the new missing font mapping
UI.
https://mcneel.myjetbrains.com/youtrack/issue/RH-62642

Rhino.Runtime.AdvancedSetting.ExportDocumentUserText
Set to true to write document user text on Export and Copy/Paste.
Set to false to not write document user text (default).
https://mcneel.myjetbrains.com/youtrack/issue/RH-63589

Rhino.Runtime.AdvancedSetting.CommandsToIgnoreWhenAutoHidingToolPalettes
String list of command names to ignore when closing tool-palette on
begin command.
https://mcneel.myjetbrains.com/youtrack/issue/RH-65131

Rhino.Runtime.AdvancedSetting.DisplayNonOriginModelBasepointWarning
Set this to true if you want to be warned about ModelBasepoints
that are not set to the origin on open/import.
https://mcneel.myjetbrains.com/youtrack/issue/RH-67520

Rhino.Runtime.AdvancedSetting.UseEntireWidthForTopBand
Use the entire client width for top and bottom dock sites
https://mcneel.myjetbrains.com/youtrack/issue/RH-67783

Rhino.Runtime.AdvancedSetting.UseMFCMenuBar
Experimenting with using a CMFCMenuBar to host main frame
menu with a CMFCVisualManager derived class for styling
the menu.
https://mcneel.myjetbrains.com/youtrack/issue/RH-70314

Rhino.Runtime.AdvancedSetting.IgnoreRUIPlatform
Will ignore the platforms attribute in RUI files when set.
Requires restarting Rhino to take affect.
https://mcneel.myjetbrains.com/youtrack/issue/RH-70777

Rhino.Runtime.AdvancedSetting.EnableMcNeelOnlyFeatures
Enable McNeel only features for a particular user

Rhino.Runtime.AdvancedSetting.UseRhinoColorsForModalDialogs
Enable to use Eto Appearance page only

Rhino.Runtime.AdvancedSetting.AcadExportSelectUnexportableObjects
Set to true to select objects that could not be exported
to DWG, either becuase the object was invalid or the exporter
failed for whatever reason.
https://mcneel.myjetbrains.com/youtrack/issue/RH-77693

Rhino.Runtime.AdvancedSetting.AcadExportSortLayers
Temporary advanced settings for 8.x so no UI is required.
Will be removed in 9.x when proper UI us added.
https://mcneel.myjetbrains.com/youtrack/issue/RH-78977
https://mcneel.myjetbrains.com/youtrack/issue/RH-28804
https://mcneel.myjetbrains.com/youtrack/issue/RH-48103

Rhino.Runtime.AdvancedSetting.AcadExportWriteEmptyLayers
ditto

Rhino.Runtime.AdvancedSetting.DisableModelAndPageUnitsDifferDialog
Advanced settings to re-enable the units helper dialogs.
see https://mcneel.myjetbrains.com/youtrack/issue/RH-81439

Rhino.Runtime.AdvancedSetting.DisablePageUnitsNotInchesOrMMDialog
ditto

Rhino.Runtime.AdvancedSetting.UseLegacyCurveJoiner
6-May-2024 Dale Fugier, https://mcneel.myjetbrains.com/youtrack/issue/RH-81815

Rhino.Runtime.AdvancedSetting.UseLegacyBrepCapper
13-Jun-2024 Dale Fugier, https://mcneel.myjetbrains.com/youtrack/issue/RH-82566

Rhino.Runtime.AdvancedSetting.HideFloatingWindowsOnDeactivate
19-Sep-2024 Dale Fugier, https://mcneel.myjetbrains.com/youtrack/issue/RH-83845

Rhino.Runtime.AdvancedSetting.RecordAnimationTargetFolder
14-Oct-2024 Nathan Letwory, https://mcneel.myjetbrains.com/youtrack/issue/RH-79386