Rhino.DocObjects.Tables.LinetypeTableEventArgs
LinetypeTable event arguments
Since: 8.0

Rhino.DocObjects.Tables.LinetypeTableEventArgs.Document
The document in which the event occurred.
Since: 8.0

Rhino.DocObjects.Tables.LinetypeTableEventArgs.EventType
The event type.
Since: 8.0

Rhino.DocObjects.Tables.LinetypeTableEventArgs.LinetypeIndex
Index of the linetype.
Since: 8.0

Rhino.DocObjects.Tables.LinetypeTableEventArgs.NewState
The new state.
Since: 8.0

Rhino.DocObjects.Tables.LinetypeTableEventArgs.OldState
The old state.
Since: 8.0