Rhino.Render.AddCustomUISections
This class contains the event to add custom ui sections when the content ui is created.

Rhino.Render.AddCustomUISections.OnAddCustomUISections
This event is raised when a OnAddCustomUISections Event is triggered in rdk.
Since: 7.0