Rhino.Render.RenderMaterial.AssignToSubFaceChoices
Since: 7.14

Rhino.Render.RenderMaterial.AssignToSubFaceChoices.Keep
Keep any existing sub-face assignments.

Rhino.Render.RenderMaterial.AssignToSubFaceChoices.Remove
Remove any existing sub-face assignments first.

Rhino.Render.RenderMaterial.AssignToSubFaceChoices.Ask
Ask the user what to do.