Rhino.DocObjects.Worksession
Manages a list of models that are being used as reference geometry.

Rhino.DocObjects.Worksession.Document
Gets the document that owns this worksession.
Since: 6.0

Rhino.DocObjects.Worksession.RuntimeSerialNumber
Unique serial number for the worksession while the application is running.
This is not a persistent value.
Since: 6.3

Rhino.DocObjects.Worksession.FileName
Returns the path to the open worksession, or .rws, file.
If there is no worksession file open, or the active worksession
has not yet been saved, then null is returned.
Since: 6.0

Rhino.DocObjects.Worksession.FileNameFromRuntimeSerialNumber(System.UInt32)
Returns the path to the open worksession, or .rws, file.
If there is no worksession file open, or the active worksession
has not yet been saved, then null is returned.
runtimeSerialNumber:
Returns:
Since: 6.3

Rhino.DocObjects.Worksession.ModelCount
Returns the number of models in the worksession. The active model will included
in this count whether or not it has been saved.
Since: 6.0

Rhino.DocObjects.Worksession.ModelPaths
Returns the paths to the models used by the worksession. If the active model has
not been saved, then it will not be included in the output array.
Since: 6.0

Rhino.DocObjects.Worksession.ModelPathFromSerialNumber(System.UInt32)
Returns the path to a model, used by the worksession, given a reference model serial number
modelSerialNumber: The reference model serial number.
Returns: The path to the model if successful, null otherwise.
Since: 6.12