Rhino.Geometry.Intersect.CurveIntersections
Maintains an ordered list of Curve Intersection results.

Rhino.Geometry.Intersect.CurveIntersections.#ctor(System.IntPtr,System.Int32)
Constructor.

Rhino.Geometry.Intersect.CurveIntersections.Finalize
Destructor.

Rhino.Geometry.Intersect.CurveIntersections.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0

Rhino.Geometry.Intersect.CurveIntersections.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.Geometry.Intersect.CurveIntersections.Count
Gets the number of recorded intersection events.
Since: 5.0

Rhino.Geometry.Intersect.CurveIntersections.Item(System.Int32)
Gets the intersection event data at the given index.
index: Index of intersection event to retrieve.

Rhino.Geometry.Intersect.CurveIntersections.CopyTo(Rhino.Geometry.Intersect.IntersectionEvent[],System.Int32)
Copies all intersection results into another array, departing at an index in the target array.
array: The target array. This value cannot be null.
arrayIndex: Zero-based index in which to start the copy.
Throws System.ArgumentNullException: If array is null.
Throws System.ArgumentOutOfRangeException: If arrayIndex is less than 0.
Throws System.ArgumentException: If array is multi-dimensional; or if arrayIndex is
larger than or equal to the length of this collection; or this collection contains more
IntersectionEvents than the ones that can be stored in array after and including arrayIndex.
Since: 5.0

Rhino.Geometry.Intersect.CurveIntersections.GetEnumerator
Returns an enumerator that is capable of yielding all IntersectionEvents in the collection.
Returns: The constructed enumerator.
Since: 5.0

Rhino.Geometry.Intersect.CurveIntersections.System#Collections#Generic#IList{Rhino#Geometry#Intersect#IntersectionEvent}#Item(System.Int32)
Gets the intersection event data at the given index; setting always throws an exception.
index: Index of intersection event to retrieve.
Returns: The intersection event.
Throws System.NotSupportedException: NotSupportedException is always thrown when
setting this indexer.

Rhino.Geometry.Intersect.CurveIntersections.System#Collections#Generic#IList{Rhino#Geometry#Intersect#IntersectionEvent}#IndexOf(Rhino.Geometry.Intersect.IntersectionEvent)
Determines the index of an IntersectionEvent.
item: The IntersectionEvent to be found.
Returns: The index in case the IntersectionEvent was found; -1 otherwise.

Rhino.Geometry.Intersect.CurveIntersections.System#Collections#Generic#IList{Rhino#Geometry#Intersect#IntersectionEvent}#Insert(System.Int32,Rhino.Geometry.Intersect.IntersectionEvent)
Inserting is not supported and this method always throws NotSupportedException.
index: Inserting is not supported and this value is ignored.
item: Inserting is not supported and this value is ignored.
Throws System.NotSupportedException: NotSupportedException is always thrown.

Rhino.Geometry.Intersect.CurveIntersections.System#Collections#Generic#IList{Rhino#Geometry#Intersect#IntersectionEvent}#RemoveAt(System.Int32)
Removal is not supported and this method always throws NotSupportedException.
index: Removal is not supported and this value is ignored.
Throws System.NotSupportedException: NotSupportedException is always thrown.

Rhino.Geometry.Intersect.CurveIntersections.System#Collections#Generic#ICollection{Rhino#Geometry#Intersect#IntersectionEvent}#Add(Rhino.Geometry.Intersect.IntersectionEvent)
Addition is not supported and this method always throws NotSupportedException.
item: Addition is not supported and this value is ignored.
Throws System.NotSupportedException: NotSupportedException is always thrown.

Rhino.Geometry.Intersect.CurveIntersections.System#Collections#Generic#ICollection{Rhino#Geometry#Intersect#IntersectionEvent}#Clear
Clearing is not supported and this method always throws NotSupportedException.
Throws System.NotSupportedException: NotSupportedException is always thrown.

Rhino.Geometry.Intersect.CurveIntersections.System#Collections#Generic#ICollection{Rhino#Geometry#Intersect#IntersectionEvent}#Contains(Rhino.Geometry.Intersect.IntersectionEvent)
Allows to establish whether this collection contains and IntersectionEvent.
This method is O(n), where n is the Count of elements in this collection.
item: Object to be found.
Returns: true if element is contained; otherwise false.

Rhino.Geometry.Intersect.CurveIntersections.System#Collections#Generic#ICollection{Rhino#Geometry#Intersect#IntersectionEvent}#IsReadOnly
This collection is read-only, so this property returns always true.

Rhino.Geometry.Intersect.CurveIntersections.System#Collections#Generic#ICollection{Rhino#Geometry#Intersect#IntersectionEvent}#Remove(Rhino.Geometry.Intersect.IntersectionEvent)
Removal is not supported and this method always throws NotSupportedException.
Throws System.NotSupportedException: NotSupportedException is always thrown.

Rhino.Geometry.Intersect.CurveIntersections.System#Collections#IEnumerable#GetEnumerator
Returns a non-generic enumerator that is capable of yielding all IntersectionEvents in the collection.
This returns the same enumerator as the generic counterpart.
Returns: The constructed enumerator.
Since: 5.0