Rhino.PrivateMeshCommands.MeshTypes.TopologyVertex._edgeIndexStart
Array locations containing all edges indices

Rhino.PrivateMeshCommands.MeshTypes.TopologyVertex._vertexIndexStart
Array locations with all unwelded vertices indices