Rhino.DocObjects.AngleDisplayMode
Defines enumerated values for the display of angles.
Since: 6.0

Rhino.DocObjects.AngleDisplayMode.Degrees
Shows angle in decimal degrees

Rhino.DocObjects.AngleDisplayMode.DMS
Show angle as degree,minute,second.

Rhino.DocObjects.AngleDisplayMode.Grads
Show angle as grads.