Rhino.Collections.Point3dList.YAccess
Utility class for easy-access of x-components of points inside an ON_3dPointList.

Rhino.Collections.Point3dList.YAccess.#ctor(Rhino.Collections.Point3dList)
XAccess constructor.

Rhino.Collections.Point3dList.YAccess.Item(System.Int32)
Gets or sets the y-coordinate of the specified point.
index: Index of point.