Rhino.Runtime.InteropWrappers.ClassArrayOnObjRef
Represents a wrapper to an unmanaged "array" (list) of ON_ObjRef instances.
Wrapper for a C++ ON_ClassArray of ON_ObjRef

Rhino.Runtime.InteropWrappers.ClassArrayOnObjRef.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.
Since: 5.8

Rhino.Runtime.InteropWrappers.ClassArrayOnObjRef.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.
Since: 5.8

Rhino.Runtime.InteropWrappers.ClassArrayOnObjRef.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.ClassArrayOnObjRef instance.
Since: 5.8

Rhino.Runtime.InteropWrappers.ClassArrayOnObjRef.#ctor(System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjRef})
Initializes a new instances from a set of ObjRefs
objrefs: An array, a list or any enumerable set of Rhino object references.
Since: 5.8

Rhino.Runtime.InteropWrappers.ClassArrayOnObjRef.Count
Gets the number of ObjRef instances in this array.
Since: 5.8

Rhino.Runtime.InteropWrappers.ClassArrayOnObjRef.Add(Rhino.DocObjects.ObjRef)
Adds an ObjRef to the list.
objref: An ObjRef to add.
Since: 5.8

Rhino.Runtime.InteropWrappers.ClassArrayOnObjRef.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.ClassArrayOnObjRef.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.8

Rhino.Runtime.InteropWrappers.ClassArrayOnObjRef.ToNonConstArray
Copies the unmanaged array to a managed counterpart.
Returns: The managed array.
Since: 5.8

Rhino.Runtime.InteropWrappers.ClassArrayOnObjRef.ToNonConstArray(Rhino.RhinoDoc)
Copies the unmanaged array to a managed counterpart.
doc: Document containing the array of objects
Returns: The managed array.
Since: 7.6