Rhino.Input.GetResult
Possible results from GetObject.Get(), GetPoint.Get(), etc...
Since: 5.0

Rhino.Input.GetResult.Cancel
User wants to cancel current command.

Rhino.Input.GetResult.Nothing
User pressed enter - typically used to accept defaults.

Rhino.Input.GetResult.Option
User specified an option - call Option() to get option index.

Rhino.Input.GetResult.Number
User entered a real number - call Number() to get value.

Rhino.Input.GetResult.Color
User entered a color - call Color() to get value.

Rhino.Input.GetResult.Undo
User pressed undo.

Rhino.Input.GetResult.Miss
User clicked and missed.

Rhino.Input.GetResult.Point
User picked 3d point - call Point() to get 3d point.

Rhino.Input.GetResult.Point2d
User picked 2d window point in CRhinoGetPoint::Get2dPoint()
call ON_2dPoint() to get the point and View() to get the view.

Rhino.Input.GetResult.Line2d
User picked a 2d line in CRhinoGetPoint::Get2dLine() call Line2d()
to get the line and View() to get the view.

Rhino.Input.GetResult.Rectangle2d
User picked a 2d rectangle in CRhinoGetPoint::Get2dRectangle() call
Rectangle2d() to get the rectangle and View() to get the view.

Rhino.Input.GetResult.Object
User selected an object - call Object() to get object.

Rhino.Input.GetResult.String
User typed a string - call String() to get the string.

Rhino.Input.GetResult.CustomMessage
A custom message was posted to the RhinoGet

Rhino.Input.GetResult.Timeout
The getter waited for the amount of time specified in RhinoGet::SetWaitDuration()
and then gave up.

Rhino.Input.GetResult.Circle
call CRhinoGetCircle::GetCircle() to get the circle.

Rhino.Input.GetResult.Plane
call CRhinoGetPlane::GetPlane() to get the plane.

Rhino.Input.GetResult.Cylinder
call CRhinoGetCylinder::GetCylinder() to get the cylinder.

Rhino.Input.GetResult.Sphere
call CRhinoGetSphere::GetSphere() to get the sphere.

Rhino.Input.GetResult.Angle
call CRhinoGetAngle::Angle() to get the angle in radians (CRhinoGetAngle() returns this for typed number, too).

Rhino.Input.GetResult.Distance
call CRhinoGetDistance::Distance() to get the distance value.

Rhino.Input.GetResult.Direction
call CRhinoGetDirection::Direction() to get the direction vector.

Rhino.Input.GetResult.Frame
call CRhinoGetFrame::Frame() to get the frame that was picked.

Rhino.Input.GetResult.ExitRhino
Stop now, do not cleanup, just return ASAP.