Rhino.FileIO.FileSkpWriteOptions
Options used when writing a Skp file

Rhino.FileIO.FileSkpWriteOptions.Version
Set the version of the skp file being written.
Since: 8.0

Rhino.FileIO.FileSkpWriteOptions.ExportPlanarRegionsAsPolygons
Since: 8.0

Rhino.FileIO.FileSkpWriteOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0