Rhino.Geometry.KnotStyle
Knot styles for NURBS curves and surfaces.
If a knot vector meets the conditions of two styles,
then the style with the lowest value is used.
Since: 7.0

Rhino.Geometry.KnotStyle.Unknown
Unknown knot style

Rhino.Geometry.KnotStyle.Uniform
Uniform knots (ends not clamped).

Rhino.Geometry.KnotStyle.QuasiUniform
Uniform knots (clamped ends, degree >= 2).

Rhino.Geometry.KnotStyle.PiecewiseBezier
All internal knots have full multiplicity.

Rhino.Geometry.KnotStyle.ClampedEnd
Clamped end knots (with at least one interior non-uniform knot).

Rhino.Geometry.KnotStyle.NonUniform
Known to be none of the other styles