Rhino.FileIO.File3dmTypeCodes
Typecode format 4 bytes long
x xxxxxxxxxxxxxxx,x xxx xxxx xxxx x x xx
| |               | |               | |  |
|        |        |                 |
|        |        |         |       +---  "stuff" bit
|        |        |         |
|        |        |         +-- specific codes
|        |        |
|        |        +-- RESERVED - DO NOT USE (should be 0) (will be used to control CRC on/off)
|        |
|        +-- category:_000 0000 0000 0001  Legacy geometry    TCODE_LEGACY_GEOMETRY
|                     _000 0000 0000 0010  openNURBS object   TCODE_OPENNURBS_OBJECT
|                     _000 0000 0000 0100  -- RESERVED - DO NOT USE (should be 0 in any typecode) --
|                     _000 0000 0000 1000  -- RESERVED - DO NOT USE (should be 0 in any typecode) --
|                     _000 0000 0001 0000  Geometry           TCODE_GEOMETRY
|                     _000 0000 0010 0000  Annotation
|                     _000 0000 0100 0000  Display Attributes TCODE_DISPLAY
|                     _000 0000 1000 0000  Rendering          TCODE_RENDER
|                     _000 0001 0000 0000
|                     _000 0010 0000 0000  Interface          TCODE_INTERFACE
|                     _000 0100 0000 0000  -- RESERVED - DO NOT USE (should be 0 in any typecode) --
|                     _000 1000 0000 0000  Tolerances         TCODE_TOLERANCE
|                     _001 0000 0000 0000  Tables             TCODE_TABLE
|                     _010 0000 0000 0000  Table record       TCODE_TABLEREC
|                     _100 0000 0000 0000  User information   TCODE_USER
|
+-- format: 0 - data size in header  - data block follows    TCODE_SHORT
1 - data in header - no data block follows

Rhino.FileIO.File3dmTypeCodes.TCODE_COMMENTBLOCK
(0x00000001)
The TCODE_COMMENTBLOCK is the first chunk in the file, starts 32 bytes into
the file, and contains text information terminated with a ^m_z.  This ^m_z and
contents of this chunk were expanded in February 2000.  Files written with
code released earlier than this will not have the ^m_z.

Rhino.FileIO.File3dmTypeCodes.TCODE_ENDOFFILE
(0x00007FFF)
The TCODE_ENDOFFILE is the last chunk in the file and the first 4 bytes
of information in this chunk is an integer that contains the file length.
This chunk was added in February 2000 and files written with code released
earlier than this will not have this termination block.

Rhino.FileIO.File3dmTypeCodes.TCODE_ENDOFFILE_GOO
(0x00007FFE)
this typecode is returned when a rogue eof marker is found
Some v1 3dm file writers put these markers in a "goo".
Simply skip these chunks and continue.

Rhino.FileIO.File3dmTypeCodes.TCODE_OPENNURBS_OBJECT
0x00020000.

Rhino.FileIO.File3dmTypeCodes.TCODE_GEOMETRY
0x0010000.

Rhino.FileIO.File3dmTypeCodes.TCODE_ANNOTATION
0x0020000.

Rhino.FileIO.File3dmTypeCodes.TCODE_DISPLAY
0x0040000.

Rhino.FileIO.File3dmTypeCodes.TCODE_RENDER
0x0080000.

Rhino.FileIO.File3dmTypeCodes.TCODE_INTERFACE
0x02000000.

Rhino.FileIO.File3dmTypeCodes.TCODE_TOLERANCE
0x08000000.

Rhino.FileIO.File3dmTypeCodes.TCODE_TABLE
0x10000000.

Rhino.FileIO.File3dmTypeCodes.TCODE_TABLEREC
0x20000000.

Rhino.FileIO.File3dmTypeCodes.TCODE_USER
0x40000000.

Rhino.FileIO.File3dmTypeCodes.TCODE_SHORT
0x80000000.

Rhino.FileIO.File3dmTypeCodes.TCODE_CRC
0x8000.

Rhino.FileIO.File3dmTypeCodes.TCODE_ANONYMOUS_CHUNK
(TCODE_USER | TCODE_CRC | 0x0000)

Rhino.FileIO.File3dmTypeCodes.TCODE_MATERIAL_TABLE
rendering materials.

Rhino.FileIO.File3dmTypeCodes.TCODE_LAYER_TABLE
layers.

Rhino.FileIO.File3dmTypeCodes.TCODE_LIGHT_TABLE
rendering lights.

Rhino.FileIO.File3dmTypeCodes.TCODE_OBJECT_TABLE
geometry and annotation.

Rhino.FileIO.File3dmTypeCodes.TCODE_PROPERTIES_TABLE
Model Properties: revision history, notes, preview image.