Rhino.Display.VisualAnalysisMode.AnalysisStyle
Contains enumerated values for analysis styles, such as wireframe, texture or false colors..
Since: 5.0

Rhino.Display.VisualAnalysisMode.AnalysisStyle.Wireframe
The analysis is showing with wires.

Rhino.Display.VisualAnalysisMode.AnalysisStyle.Texture
The analysis is showing with textures.

Rhino.Display.VisualAnalysisMode.AnalysisStyle.FalseColor
The analysis is showing with false colors.