Rhino.FileIO.File3dmRenderEnvironments


Rhino.FileIO.File3dmRenderEnvironments.#ctor(Rhino.FileIO.File3dm)
Since: 8.0

Rhino.FileIO.File3dmRenderEnvironments.GetEnumerator
Since: 8.0

Rhino.FileIO.File3dmRenderEnvironments.Find(System.Guid)
Finds an environment by its id, if possible. Returns null on failure.
Since: 8.0

Rhino.FileIO.File3dmRenderEnvironments.System#Collections#IEnumerable#GetEnumerator
Since: 8.0