Rhino.Runtime.DocumentCollectedException
Represents the error that happen when a class user attempts to execute a modifying operation
on an object that has been added to a document.

Rhino.Runtime.DocumentCollectedException.#ctor
Initializes a new instance of the document controlled exception class.
Since: 5.0

Rhino.Runtime.DocumentCollectedException.#ctor(System.String)
Initializes a new instance of the document collected exception class.
message: A more specific message.
Since: 6.0