Rhino.ApplicationSettings.PaintColor
Contains enumerated constant values to represent logical colors associated with elements of the user interface.

Rhino.ApplicationSettings.PaintColor.NormalStart
Gradient start for active toolbar tab and non-client area of Rhino.

Rhino.ApplicationSettings.PaintColor.NormalEnd
Gradient end for active toolbar tab and non-client area of Rhino.

Rhino.ApplicationSettings.PaintColor.NormalBorder
Edge color used for grippers, toolbar border, resize bars, status bar pane borders.

Rhino.ApplicationSettings.PaintColor.HotStart
Gradient start for inactive toolbar tab.

Rhino.ApplicationSettings.PaintColor.HotEnd
Gradient end for inactive toolbar tab.

Rhino.ApplicationSettings.PaintColor.HotBorder
Inactive toolbar tab border.

Rhino.ApplicationSettings.PaintColor.PressedStart
Pressed gradient start.

Rhino.ApplicationSettings.PaintColor.PressedEnd
Pressed gradient end.

Rhino.ApplicationSettings.PaintColor.PressedBorder
Pressed border.

Rhino.ApplicationSettings.PaintColor.TextEnabled
Toolbar tab text and status bar text.

Rhino.ApplicationSettings.PaintColor.TextDisabled
Disabled text color.

Rhino.ApplicationSettings.PaintColor.MouseOverControlStart
Color for hovering gradient start.

Rhino.ApplicationSettings.PaintColor.MouseOverControlEnd
Color for hovering gradient end.

Rhino.ApplicationSettings.PaintColor.MouseOverControlBorder
Color for hovering border.

Rhino.ApplicationSettings.PaintColor.ActiveCaption
Active floating window non-client area

Rhino.ApplicationSettings.PaintColor.InactiveCaption
Inactive floating window non-client area

Rhino.ApplicationSettings.PaintColor.PanelBackground
Background color of panels

Rhino.ApplicationSettings.PaintColor.ActiveViewportTitle
Active viewport title.

Rhino.ApplicationSettings.PaintColor.InactiveViewportTitle
Inactive viewport title.

Rhino.ApplicationSettings.PaintColor.ModifiedValueControlColor
Modified property value label text color

Rhino.ApplicationSettings.PaintColor.EditBoxBackground
Background fill for input elements (edit box, checkbox)

Rhino.ApplicationSettings.PaintColor.GridLinesOnPanelBackground
Grid lines on panel background color

Rhino.ApplicationSettings.PaintColor.GridLinesOnEditBoxBackground
Grid lines on edit box background color

Rhino.ApplicationSettings.PaintColor.InactiveTabBackground
Fill for inactive tabs