Rhino.DocObjects.DisplayMode
Defines enumerated values for display modes, such as wireframe or shaded.
Since: 5.0

Rhino.DocObjects.DisplayMode.Default
The default display mode.

Rhino.DocObjects.DisplayMode.Wireframe
The wireframe display mode.
Objects are generally only outlined by their corresponding isocurves and edges.

Rhino.DocObjects.DisplayMode.Shaded
The shaded display mode.
Objects are generally displayed with their corresponding isocurves and edges,
and are filled with their display colors.

Rhino.DocObjects.DisplayMode.RenderPreview
The render display mode.
Objects are generally displayed in a similar way to the one that will be resulting
from rendering.