Rhino.Geometry.NurbsMultiMatcher.InteriorMovementOption


Rhino.Geometry.NurbsMultiMatcher.InteriorMovementOption.Unset


Rhino.Geometry.NurbsMultiMatcher.InteriorMovementOption.None


Rhino.Geometry.NurbsMultiMatcher.InteriorMovementOption.Rigid


Rhino.Geometry.NurbsMultiMatcher.InteriorMovementOption.Smooth
