Rhino.PrivateMeshCommands.Operations.Tasks.CatmullClarkWeaver.GetTasks(Rhino.PrivateMeshCommands.Operations.Tasks.WeaverSettings)
Calculates a new Mesh, with new points and a new topology.
Points are set in this order:
new FPoints (points deriving from faces)
new EPoints (points deriving from edges)
new VPoints (points deriving from vertices)
Returns: