Rhino.Geometry.MeshingParameterStyle
Type of Mesh Parameters used by the RhinoDoc for meshing objects
Since: 5.1

Rhino.Geometry.MeshingParameterStyle.None
No style

Rhino.Geometry.MeshingParameterStyle.Fast


Rhino.Geometry.MeshingParameterStyle.Quality


Rhino.Geometry.MeshingParameterStyle.Custom


Rhino.Geometry.MeshingParameterStyle.PerObject
