Rhino.DocObjects.Custom.ClassIdAttribute
Useful for legacy UserData

Rhino.DocObjects.Custom.ClassIdAttribute.#ctor(System.String)
Initializes a class id attribute.
id: String in the form of a Guid.
Since: 6.0

Rhino.DocObjects.Custom.ClassIdAttribute.Id
Gets the associated style.
Since: 6.0