Rhino.Render.RenderContentKindList
Models a collection of kinds.

Rhino.Render.RenderContentKindList.CppPointer
Since: 6.1

Rhino.Render.RenderContentKindList.#ctor
Construct an empty kind list
Since: 6.7

Rhino.Render.RenderContentKindList.#ctor(Rhino.Render.RenderContentKindList)
Construct a kind list from another.
kind_list: Kind list to copy
Since: 6.7

Rhino.Render.RenderContentKindList.#ctor(System.IntPtr)
Construct from native pointer - internal use only.
pRdkRenderContentKindList: C++ pointer to a kind list.
Since: 6.1

Rhino.Render.RenderContentKindList.Finalize
Kind list finalizer

Rhino.Render.RenderContentKindList.Dispose
Dispose a kind list.
Since: 6.1

Rhino.Render.RenderContentKindList.Add(Rhino.Render.RenderContentKind)
Add a kind to a kind list.
kind: The RenderContent kind to add.
Since: 6.7

Rhino.Render.RenderContentKindList.Count
The number of kinds in the collection
Returns: The number of kinds in the collection
Since: 6.1

Rhino.Render.RenderContentKindList.SingleKind
The single kind in the list. If the list does not contain exactly one kind, returns 'None'.
Returns: A RenderContentKind
Since: 6.1

Rhino.Render.RenderContentKindList.Contains(Rhino.Render.RenderContentKind)
Query whether or not the collection contains a particular kind designation.
kind:
Returns: true if the kind is in the collection.
Since: 6.3