Rhino.Render.RenderPropertyChangedEvent
Used by Rhino.Render object property value has changed events.

Rhino.Render.RenderPropertyChangedEvent.Document
The document triggering the event.
Since: 5.10

Rhino.Render.RenderPropertyChangedEvent.Context
Optional argument which may specify the property being modified.
Since: 5.10