Rhino.FileIO.FileLwoWriteOptions
Options for writing a Lwo file

Rhino.FileIO.FileLwoWriteOptions.WriteVersion6
Since: 8.0

Rhino.FileIO.FileLwoWriteOptions.MeshingParameters
Since: 8.0

Rhino.FileIO.FileLwoWriteOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0