Rhino.Geometry.RevSurface
Represents a surface of revolution.
Revolutions can be incomplete (they can form arcs).

Rhino.Geometry.RevSurface.Curve
Gets the revolute curve.
Since: 6.0

Rhino.Geometry.RevSurface.Axis
Gets the axis of revolution.
Since: 6.0

Rhino.Geometry.RevSurface.Angle
Gets the start and end angles of revolution in radians.
The interval angle must be increasing and satisfy
RhinoMath.ZeroTolerance < Angle.Length<= 2.0 * System.Math.PI.
Since: 6.0

Rhino.Geometry.RevSurface.Interval
Interval specifies the parameterization for the angular parameter.
Interval must be an increasing interval.
The parameter Interval[0] corresponds to Angle[0] and
the parameter Interval[1] corresponds to Angle[1].
Since: 8.4

Rhino.Geometry.RevSurface.IsTransposed
If false, the "u" parameter is the angle parameter and the "v" parameter is the curve parameter.
If true, the "u" parameter is the curve parameter and the "v" parameter is the angle parameter.
Since: 8.4

Rhino.Geometry.RevSurface.Create(Rhino.Geometry.Curve,Rhino.Geometry.Line,System.Double,System.Double)
Constructs a new surface of revolution from a generatrix curve and an axis.
This overload accepts a slice start and end angles.
revoluteCurve: A generatrix.
axisOfRevolution: An axis.
startAngleRadians: An angle in radians for the start.
endAngleRadians: An angle in radians for the end.
Returns: A new surface of revolution, or null if any of the inputs is invalid or on error.
Since: 5.0

Rhino.Geometry.RevSurface.Create(Rhino.Geometry.Curve,Rhino.Geometry.Line)
Constructs a new surface of revolution from a generatrix curve and an axis.
revoluteCurve: A generatrix.
axisOfRevolution: An axis.
Returns: A new surface of revolution, or null if any of the inputs is invalid or on error.
Since: 5.0

Rhino.Geometry.RevSurface.Create(Rhino.Geometry.Line,Rhino.Geometry.Line,System.Double,System.Double)
Constructs a new surface of revolution from a generatrix line and an axis.
This overload accepts a slice start and end angles.
Results can be (truncated) cones, cylinders and circular hyperboloids, or can fail.
revoluteLine: A generatrix.
axisOfRevolution: An axis.
startAngleRadians: An angle in radians for the start.
endAngleRadians: An angle in radians for the end.
Returns: A new surface of revolution, or null if any of the inputs is invalid or on error.
Since: 5.0

Rhino.Geometry.RevSurface.Create(Rhino.Geometry.Line,Rhino.Geometry.Line)
Constructs a new surface of revolution from a generatrix line and an axis.
If the operation succeeds, results can be (truncated) cones, cylinders and circular hyperboloids.
revoluteLine: A generatrix.
axisOfRevolution: An axis.
Returns: A new surface of revolution, or null if any of the inputs is invalid or on error.
Since: 5.0

Rhino.Geometry.RevSurface.Create(Rhino.Geometry.Polyline,Rhino.Geometry.Line,System.Double,System.Double)
Constructs a new surface of revolution from a generatrix polyline and an axis.
This overload accepts a slice start and end angles.
revolutePolyline: A generatrix.
axisOfRevolution: An axis.
startAngleRadians: An angle in radians for the start.
endAngleRadians: An angle in radians for the end.
Returns: A new surface of revolution, or null if any of the inputs is invalid or on error.
Since: 5.0

Rhino.Geometry.RevSurface.Create(Rhino.Geometry.Polyline,Rhino.Geometry.Line)
Constructs a new surface of revolution from a generatrix polyline and an axis.
revolutePolyline: A generatrix.
axisOfRevolution: An axis.
Returns: A new surface of revolution, or null if any of the inputs is invalid or on error.
Since: 5.0

Rhino.Geometry.RevSurface.CreateFromCone(Rhino.Geometry.Cone)
Constructs a new surface of revolution from the values of a cone.
cone: A cone.
Returns: A new surface of revolution, or null if any of the inputs is invalid or on error.
Since: 5.0

Rhino.Geometry.RevSurface.CreateFromCylinder(Rhino.Geometry.Cylinder)
Constructs a new surface of revolution from the values of a cylinder.
cylinder: A cylinder.
Returns: A new surface of revolution, or null if any of the inputs is invalid or on error.
Since: 5.0

Rhino.Geometry.RevSurface.CreateFromSphere(Rhino.Geometry.Sphere)
Constructs a new surface of revolution from the values of a sphere.
sphere: A sphere.
Returns: A new surface of revolution, or null if any of the inputs is invalid or on error.
Since: 5.0

Rhino.Geometry.RevSurface.CreateFromTorus(Rhino.Geometry.Torus)
Constructs a new surface of revolution from the values of a torus.
torus: A torus.
Returns: A new surface of revolution, or null if any of the inputs is invalid or on error.
Since: 5.0

Rhino.Geometry.RevSurface.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor for internal use.
info: Serialization data.
context: Serialization stream.