Rhino.FileIO.File3dmEdgeSoftening
Represents the edge softening attached to file3dm object attributes.

Rhino.FileIO.File3dmEdgeSoftening.On
Specifies whether edge softening is enabled or not.
Since: 8.0

Rhino.FileIO.File3dmEdgeSoftening.Softening
The softening radius.
Since: 8.0

Rhino.FileIO.File3dmEdgeSoftening.Chamfer
Specifies whether to chamfer the edges.
Since: 8.0

Rhino.FileIO.File3dmEdgeSoftening.Faceted
Specifies whether the edges are faceted.
Since: 8.0

Rhino.FileIO.File3dmEdgeSoftening.EdgeAngleThreshold
Threshold angle (in degrees) which controls whether an edge is softened or not.
The angle refers to the angles between the adjacent faces of an edge.
Since: 8.0

Rhino.FileIO.File3dmEdgeSoftening.ForceSoftening
Specifies whether to soften edges despite too large a radius.
Since: 8.0