Rhino.DocObjects.TextureCombineMode
Determines how this texture is combined with others in a material's
texture list.
Since: 5.6

Rhino.DocObjects.TextureCombineMode.None


Rhino.DocObjects.TextureCombineMode.Modulate
Modulate with material diffuse color

Rhino.DocObjects.TextureCombineMode.Decal
Decal

Rhino.DocObjects.TextureCombineMode.Blend
Blend texture with others in the material
To "add" a texture, set BlendAmount = +1
To "subtract" a texture, set BlendAmount = -1