Rhino.FileIO.FilePlyReadOptions
Options for reading a PLY file

Rhino.FileIO.FilePlyReadOptions.PLYModelUnits
Since: 8.0

Rhino.FileIO.FilePlyReadOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0