Rhino.Geometry.HiddenLineDrawingSegment.Visibility
The different types of HiddenLineDrawingSegment visibility
Since: 6.0

Rhino.Geometry.HiddenLineDrawingSegment.Visibility.Unset
Unset value

Rhino.Geometry.HiddenLineDrawingSegment.Visibility.Visible
Visible

Rhino.Geometry.HiddenLineDrawingSegment.Visibility.Hidden
Hidden

Rhino.Geometry.HiddenLineDrawingSegment.Visibility.Duplicate
Duplicate

Rhino.Geometry.HiddenLineDrawingSegment.Visibility.Projecting
Projects to a point (smaller than tolerance)

Rhino.Geometry.HiddenLineDrawingSegment.Visibility.Clipped
Clipped by clipping planes