Rhino.FileIO.BinaryArchiveFile.#ctor(System.String,Rhino.FileIO.BinaryArchiveMode)
Since: 5.1

Rhino.FileIO.BinaryArchiveFile.Open
Since: 5.1

Rhino.FileIO.BinaryArchiveFile.Close
Since: 5.1

Rhino.FileIO.BinaryArchiveFile.Reader
Since: 5.1

Rhino.FileIO.BinaryArchiveFile.Writer
Since: 5.1

Rhino.FileIO.BinaryArchiveFile.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.FileIO.BinaryArchiveFile.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.1