Rhino.Geometry.NurbsMultiMatcher


Rhino.Geometry.NurbsMultiMatcher.#ctor(Rhino.Geometry.NurbsSurface,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})
Since: 8.0

Rhino.Geometry.NurbsMultiMatcher.Finalize
Destructor

Rhino.Geometry.NurbsMultiMatcher.Dispose
Dispose of this object and any unmanaged memory associated with it.
Since: 8.0

Rhino.Geometry.NurbsMultiMatcher.DelayedSolve
Since: 8.0

Rhino.Geometry.NurbsMultiMatcher.InteriorMovement
Since: 8.0

Rhino.Geometry.NurbsMultiMatcher.InteriorStiffness
Since: 8.0

Rhino.Geometry.NurbsMultiMatcher.FreeEdgeMovement
Since: 8.0

Rhino.Geometry.NurbsMultiMatcher.SpanCount
Since: 8.0

Rhino.Geometry.NurbsMultiMatcher.LastResultSurface
Since: 8.0

Rhino.Geometry.NurbsMultiMatcher.LastTolerance
Since: 8.0

Rhino.Geometry.NurbsMultiMatcher.LastMessage
Since: 8.0

Rhino.Geometry.NurbsMultiMatcher.BestResultSurface
Since: 8.0

Rhino.Geometry.NurbsMultiMatcher.BestTolerance
Since: 8.0

Rhino.Geometry.NurbsMultiMatcher.ResultsMaxCount
Since: 8.0

Rhino.Geometry.NurbsMultiMatcher.SaveIntermediateResults
Since: 8.0

Rhino.Geometry.NurbsMultiMatcher.InsertKnot(System.Int32,System.Double,System.Int32)
Since: 8.0

Rhino.Geometry.NurbsMultiMatcher.IncreaseDegree(System.Int32,System.Int32)
Since: 8.0

Rhino.Geometry.NurbsMultiMatcher.MatchStructureOneSide(System.Int32)
Since: 8.0

Rhino.Geometry.NurbsMultiMatcher.MatchStructureBothSidesOneDir(System.Int32)
Since: 8.0

Rhino.Geometry.NurbsMultiMatcher.MatchStructureAllSides
Since: 8.0

Rhino.Geometry.NurbsMultiMatcher.RefineSrf(System.Double)
Since: 8.0

Rhino.Geometry.NurbsMultiMatcher.AddConstraint(Rhino.Geometry.NurbsCurve,Rhino.Geometry.NurbsMultiMatcher.EdgeContinuityOption)
Since: 8.0

Rhino.Geometry.NurbsMultiMatcher.AddConstraintSide(System.Int32,Rhino.Geometry.NurbsCurve,Rhino.Geometry.NurbsMultiMatcher.EdgeContinuityOption)
Since: 8.0

Rhino.Geometry.NurbsMultiMatcher.EditConstraint(Rhino.Geometry.NurbsCurve,Rhino.Geometry.NurbsMultiMatcher.EdgeContinuityOption)
Since: 8.0

Rhino.Geometry.NurbsMultiMatcher.EditConstraintSide(System.Int32,Rhino.Geometry.NurbsCurve,Rhino.Geometry.NurbsMultiMatcher.EdgeContinuityOption)
Since: 8.0

Rhino.Geometry.NurbsMultiMatcher.RemoveConstraint(Rhino.Geometry.NurbsCurve)
Since: 8.0

Rhino.Geometry.NurbsMultiMatcher.RemoveConstraintSide(System.Int32)
Since: 8.0

Rhino.Geometry.NurbsMultiMatcher.EditInitialSurface(Rhino.Geometry.NurbsSurface)
Since: 8.0

Rhino.Geometry.NurbsMultiMatcher.Solve
Since: 8.0

Rhino.Geometry.NurbsMultiMatcher.SolveOrderedEdges
Since: 8.0