Rhino.Render.ChangeQueue.Mesh
Representation of ChangeQueue Mesh

Rhino.Render.ChangeQueue.Mesh.GetMeshes
Get a SimpleArrayMeshPointer containing all meshes for the related Mesh
Since Rhino 8.0, this function only ever returns a single mesh.  Use the Mesh property to get this single mesh.
Returns:
Since: 6.0
Rhino.Render.ChangeQueue.Mesh.SingleMesh

Rhino.Render.ChangeQueue.Mesh.SingleMesh
Get the single mesh.
Since: 8.0

Rhino.Render.ChangeQueue.Mesh.Id
Get the Object Guid this mesh is for.
Returns: Guid of parent object.
Since: 6.0

Rhino.Render.ChangeQueue.Mesh.SingleMapping
Get texture mapping info as single mapping
Since: 6.0

Rhino.Render.ChangeQueue.Mesh.Mapping
Get the mapping for this mesh.
Since: 6.0
Rhino.Render.ChangeQueue.Mesh.Mappings

Rhino.Render.ChangeQueue.Mesh.Mappings
Get the mapping channels for this mesh
Since: 8.0

Rhino.Render.ChangeQueue.Mesh.OcsTransform
OCS Transform for the MeshInstance - this is the Object Coordinate System texture mapping transformation set in the texture mapping properties dialog.
(identity means no OCS, potentially just simple WCS/WCS Box)
Since: 8.0

Rhino.Render.ChangeQueue.Mesh.Attributes
Get object attributes of object associated to this mesh. This will be possible only
after returning true from ChangeQueue.ProvideOriginalObject()
Since: 6.0

Rhino.Render.ChangeQueue.Mesh.Object
Get a copy of the original RhinoObject this Mesh is created from. Possible only after
return true from ChangeQueue.ProvideOriginalObject().
Access this only with a using(var o = mesh.Object) {} construct.
Note that the object is free floating, i.e. not part of a document.
Since: 6.8