Rhino.Runtime.Interop
Contains static methods to marshal objects between RhinoCommon and legacy Rhino_DotNet or C++.

Rhino.Runtime.Interop.ColorToABGR(System.Drawing.Color)
Convert to internal color format used in Rhino
c:
Returns:

Rhino.Runtime.Interop.FontFromPointer(System.IntPtr)
Create managed Font from native ON_Font*
ptrManagedFont:
Returns:
Since: 6.0

Rhino.Runtime.Interop.ViewCaptureFromPointer(System.IntPtr)
Create a ViewCaptureSettings class from a native const CRhinoPrintInfo*
The pointer values are copied
ptrViewCapture:
Returns:
Since: 6.0

Rhino.Runtime.Interop.NativeRhinoDocPointer(Rhino.RhinoDoc)
Gets the C++ CRhinoDoc* for a given RhinoCommon RhinoDoc class.
doc: A document.
Returns: A pointer value.
Since: 5.0

Rhino.Runtime.Interop.NSFontFromFont(Rhino.DocObjects.Font)
Get native NSFont* from a Rhino Font. Only works on Mac
Returns: NSFont* on success. IntPtr.Zero on failure
font:
Since: 6.9

Rhino.Runtime.Interop.NSFontFromFont(Rhino.DocObjects.Font,System.Double)
Get native NSFont* from a Rhino Font. Only works on Mac
Returns: NSFont* on success. IntPtr.Zero on failure
font:
pointSize: Point size
Since: 6.9

Rhino.Runtime.Interop.NativeGeometryConstPointer(Rhino.Geometry.GeometryBase)
Returns the underlying const ON_Geometry* for a RhinoCommon class. You should only
be interested in using this function if you are writing C++ code.
geometry: A geometry object. This can be null and in such a case System.IntPtr.Zero is returned.
Returns: A pointer to the const geometry.
Since: 5.0

Rhino.Runtime.Interop.NativeGeometryNonConstPointer(Rhino.Geometry.GeometryBase)
Returns the underlying non-const ON_Geometry* for a RhinoCommon class. You should
only be interested in using this function if you are writing C++ code.
geometry: A geometry object. This can be null and in such a case System.IntPtr.Zero is returned.
Returns: A pointer to the non-const geometry.
Since: 5.0

Rhino.Runtime.Interop.MarshalProgressAndCancelToken(System.Threading.CancellationToken,System.IProgress{System.Double},System.IntPtr@,System.Int32@,Rhino.ProgressReporter@,Rhino.ThreadTerminator@)
You must call Disable on the reporter output if it's not null when you are done with it. It will NOT clean itself.
You should call Dispose on the terminator if it's not null, because that will keep it alive for the time of the computation.

Rhino.Runtime.Interop.NativeNonConstPointer(Rhino.Display.ViewCaptureSettings)
Get a CRhinoPrintInfo* for a given ViewCaptureSettings class
settings:
Returns:
Since: 6.0

Rhino.Runtime.Interop.NativeNonConstPointer(Rhino.DocObjects.ViewportInfo)
Get ON_Viewport* from a ViewportInfo instance
viewport:
Returns:
Since: 5.1

Rhino.Runtime.Interop.NativeNonConstPointer(Rhino.Display.RhinoViewport)
Get CRhinoViewport* from a RhinoViewport instance
viewport:
Returns:
Since: 6.0

Rhino.Runtime.Interop.NativeNonConstPointer(Rhino.Display.DisplayPipeline)
Get CRhinoDisplayPipeline* for a DisplayPipeline instance
pipeline:
Returns:
Since: 6.0

Rhino.Runtime.Interop.NativeNonConstPointer(Rhino.Input.Custom.GetPoint)
Get CRhinoGetPoint* from a GetPoint instance
getPoint:
Returns:
Since: 6.0

Rhino.Runtime.Interop.RhinoObjectConstPointer(Rhino.DocObjects.RhinoObject)
Returns the underlying const CRhinoObject* for a RhinoCommon class. You should only
be interested in using this function if you are writing C++ code.
rhinoObject: A Rhino object.
Returns: A pointer to the Rhino const object.
Since: 5.0

Rhino.Runtime.Interop.RhinoObjectFromPointer(System.IntPtr)
Constructs a RhinoCommon Rhino object from an unmanaged C++ RhinoObject pointer.
pRhinoObject: The original pointer.
Returns: A new Rhino object, or null if the pointer was invalid or System.IntPtr.Zero.
Since: 5.0

Rhino.Runtime.Interop.FileWriteOptionsConstPointer(Rhino.FileIO.FileWriteOptions)
Returns the underlying const CRhinoFileWriteOptions* for a Rhino.FileIO.FileWriteOptions object.
You should only be interested in using this function if you are writing C++ code.
options: A FileWriteOptions object.
Returns: A pointer to the Rhino const object.
Since: 6.0

Rhino.Runtime.Interop.FileReadOptionsConstPointer(Rhino.FileIO.FileReadOptions)
Returns the underlying const CRhinoFileReadOptions* for a Rhino.FileIO.FileReadOptions object.
You should only be interested in using this function if you are writing C++ code.
options: A FileReadOptions object.
Returns: A pointer to the Rhino const object.
Since: 6.0

Rhino.Runtime.Interop.CreateFromNativePointer(System.IntPtr)
Constructs a RhinoCommon Geometry class from a given ON_Geomety*. The ON_Geometry*
must be declared on the heap and its lifetime becomes controlled by RhinoCommon.
pGeometry: ON_Geometry*
Returns: The appropriate geometry class in RhinoCommon on success.
Since: 5.0

Rhino.Runtime.Interop.TryCopyFromOnArc(System.Object,Rhino.Geometry.Arc@)
Attempts to copy the contents of a RMA.OpenNURBS.OnArc to a Rhino.Geometry.Arc.
source: A source OnArc.
destination: A destination arc.
Returns: true if the operation succeeded; false otherwise.
Since: 5.0

Rhino.Runtime.Interop.TryCopyToOnArc(Rhino.Geometry.Arc,System.Object)
Attempts to copy the contents of a Rhino.Geometry.Arc to a RMA.OpenNURBS.OnArc.
source: A source arc.
destination: A destination OnArc.
Returns: true if the operation succeeded; false otherwise.
Since: 5.0

Rhino.Runtime.Interop.FromOnBrep(System.Object)
Copies a Rhino_DotNet brep to a RhinoCommon brep class.
source:
RMA.OpenNURBS.IOnBrep or RMA.OpenNURBS.OnBrep.
Returns:
RhinoCommon object on success. This will be an independent copy.
Since: 5.0

Rhino.Runtime.Interop.FromOnSurface(System.Object)
Copies a Rhino_DotNet surface to a RhinoCommon Surface class.
source:
Any of the following in the RMA.OpenNURBS namespace are acceptable.
IOnSurface, OnSurface, IOnPlaneSurface, OnPlaneSurface, IOnClippingPlaneSurface,
OnClippingPlaneSurface, IOnNurbsSurface, OnNurbsSurfac, IOnRevSurface, OnRevSurface,
IOnSumSurface, OnSumSurface.
Returns:
RhinoCommon object on success. This will be an independent copy.
Since: 5.0

Rhino.Runtime.Interop.FromOnMesh(System.Object)
Copies a Rhino_DotNet mesh to a RhinoCommon mesh class.
source:
RMA.OpenNURBS.IOnMesh or RMA.OpenNURBS.OnMesh.
Returns:
RhinoCommon object on success. This will be an independent copy.
Since: 5.0

Rhino.Runtime.Interop.FromOnCurve(System.Object)
Copies a Rhino_DotNet curve to a RhinoCommon curve class.
source:
RMA.OpenNURBS.IOnCurve or RMA.OpenNURBS.OnCurve.
Returns:
RhinoCommon object on success. This will be an independent copy.
Since: 5.0

Rhino.Runtime.Interop.ToOnBrep(Rhino.Geometry.Brep)
Constructs a Rhino_DotNet OnBrep that is a copy of a given brep.
source: A source brep.
Returns:
Rhino_DotNet object on success. This will be an independent copy.
Since: 5.0

Rhino.Runtime.Interop.ToOnSurface(Rhino.Geometry.Surface)
Constructs a Rhino_DotNet OnSurface that is a copy of a given curve.
source: A source brep.
Returns:
Rhino_DotNet object on success. This will be an independent copy.
Since: 5.0

Rhino.Runtime.Interop.ToOnMesh(Rhino.Geometry.Mesh)
Constructs a Rhino_DotNet OnMesh that is a copy of a given mesh.
source: A source brep.
Returns:
Rhino_DotNet object on success. This will be an independent copy.
Since: 5.0

Rhino.Runtime.Interop.ToOnCurve(Rhino.Geometry.Curve)
Constructs a Rhino_DotNet OnCurve that is a copy of a given curve.
source: A RhinoCommon source curve.
Returns:
Rhino_DotNet object on success. This will be an independent copy.
Since: 5.0

Rhino.Runtime.Interop.ToOnXform(Rhino.Geometry.Transform)
Constructs a Rhino_DotNet OnXform from a given RhinoCommon Transform.
source: A RhinoCommon source transform.
Returns:
Rhino_DotNet object on success. This will be an independent copy.
Since: 5.0

Rhino.Runtime.Interop.CommandLineOptionFromNativePointer(System.IntPtr)
Create a command line option for a native pointer. Do not hold onto this class as it does not control
the lifetime of the underlying pointer
ptrCommandLineOption:
Returns:
Since: 8.0

Rhino.Runtime.Interop.ToIRhinoViewport(Rhino.Display.RhinoViewport)
Convert a Rhino.Display.Viewport to an RMA.Rhino.IRhinoViewport.
source: A RhinoCommon viewport.
Returns:
Rhino_DotNet IRhinoViewport object on success. This will be an independent copy.
Since: 5.0

Rhino.Runtime.Interop.PlugInPointer(Rhino.PlugIns.PlugIn)
Gets a C++ plug-in pointer for a given RhinoCommon plug-in.
This is a Rhino SDK function.
plugin: A plug-in.
Returns: A pointer.
Since: 5.0