Rhino.ApplicationSettings.ModelAidSettingsState
Represents a snapshot of Rhino.ApplicationSettings.ModelAidSettings.

Rhino.ApplicationSettings.ModelAidSettingsState.GridSnap
Gets or sets the enabled state of Rhino's grid snap modeling aid.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettingsState.Ortho
Gets or sets the enabled state of Rhino's ortho modeling aid.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettingsState.Planar
Gets or sets the enabled state of Rhino's Planar modeling aid.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettingsState.ProjectSnapToCPlane
Gets or sets the enabled state of Rhino's Project modeling aid.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettingsState.UseHorizontalDialog
Gets or sets the enabled state of Rhino's use horizontal dialog modeling aid.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettingsState.ExtendTrimLines
Gets or sets the enabled state of Rhino's extend trim lines.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettingsState.ExtendToApparentIntersection
Gets or sets the enabled state of Rhino's extend to apparent intersections.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettingsState.AltPlusArrow
true mean Alt+arrow is used for nudging.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettingsState.DisplayControlPolygon
Gets or sets the enabled state of Rhino's display control polygon.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettingsState.HighlightControlPolygon
Gets or sets the enabled state of Rhino's highlight dialog modeling aid.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettingsState.Osnap
Gets or sets the enabled state of Rhino's object snap modeling aid.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettingsState.SnapToLocked
Gets or sets the locked state of the snap modeling aid.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettingsState.UniversalConstructionPlaneMode
Gets or sets the locked state of the snap modeling aid.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettingsState.AutoAlignCPlane
Since: 8.0

Rhino.ApplicationSettings.ModelAidSettingsState.AutoCPlaneAlignment
//0 = object, 1 = world, 2 = view
Since: 8.0

Rhino.ApplicationSettings.ModelAidSettingsState.StickyAutoCPlane
Gets or set whether the auto cplane will stay even after deselection
Since: 8.0

Rhino.ApplicationSettings.ModelAidSettingsState.OrientAutoCPlaneToView
Gets or sets whether the auto cplane will rotate towards the view after aligning to the selection
Since: 8.7

Rhino.ApplicationSettings.ModelAidSettingsState.OrthoAngle
Gets or sets the base orthogonal angle.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettingsState.NudgeKeyStep
Gets or sets the nudge step amount.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettingsState.CtrlNudgeKeyStep
Gets or sets the Ctrl-key based nudge step amount.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettingsState.ShiftNudgeKeyStep
Gets or sets the Shift-key based nudge step amount.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettingsState.OsnapPickboxRadius
Enables or disables Rhino's planar modeling aid.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettingsState.NudgeMode
0 = world, 1 = cplane, 2 = view, 3 = UVN, -1 = not set.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettingsState.ControlPolygonDisplayDensity
Gets or sets the control polygon display density.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettingsState.OsnapCursorMode
Gets or sets the OSnap cursor mode.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettingsState.OsnapModes
Returns or sets Rhino's current object snap mode.
The mode is a bitwise value based on the OsnapModes enumeration.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettingsState.MousePickboxRadius
Gets or sets the radius of the mouse pick box in pixels.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettingsState.PointDisplay
Gets or sets the point display mode.
Since: 5.0

Rhino.ApplicationSettings.ModelAidSettingsState.OrthoUseZ
Gets or sets whether Ortho will snap to the CPlane Z axis
Since: 8.0