Rhino.Geometry.FilletSurfaceSplitType
RhinoFilletSurfaceSplitType

Rhino.Geometry.FilletSurfaceSplitType.Nothing
Nothing

Rhino.Geometry.FilletSurfaceSplitType.Trim
Trim

Rhino.Geometry.FilletSurfaceSplitType.Split
Split