Rhino.FileIO.File3dmPlugInDataTable
Table of custom data provided by plug-ins

Rhino.FileIO.File3dmPlugInDataTable.Dump
Prepares a text dump of table.
Returns: A string containing the dump.
Since: 5.0

Rhino.FileIO.File3dmPlugInDataTable.Count
Gets the number of Rhino.FileIO.File3dmPlugInData objects in this table.
Since: 5.0

Rhino.FileIO.File3dmPlugInDataTable.Item(System.Int32)
Gets the Rhino.FileIO.File3dmPlugInData object at the given index.
index: Index of File3dmPlugInData to access.
Throws System.IndexOutOfRangeException: Thrown when the index is invalid.
Returns: The File3dmPlugInData at [index].

Rhino.FileIO.File3dmPlugInDataTable.TryRead(Rhino.FileIO.File3dmPlugInData,System.Func{Rhino.FileIO.File3dm,Rhino.FileIO.BinaryArchiveReader,System.Boolean})
Attempts to read a Rhino plug-in's custom data from the Rhino.FileIO.File3dm file.
pluginData: The plug-in whose data you want to try to read.
dataReader:
The function that will read the data.
This function must be implemented identical to the originating plug-in's Rhino.PlugIns.PlugIn.ReadDocument(Rhino.RhinoDoc,Rhino.FileIO.BinaryArchiveReader,Rhino.FileIO.FileReadOptions) method.
Returns: The value returned by the data reading function if successful, false otherwise.

Rhino.FileIO.File3dmPlugInDataTable.Clear
Remove all entries from this table.
Since: 5.0

Rhino.FileIO.File3dmPlugInDataTable.GetEnumerator
Gets the enumerator that visits any Rhino.FileIO.File3dmPlugInData in this table.
Returns: The enumerator.
Since: 5.0

Rhino.FileIO.File3dmPlugInDataTable.System#Collections#IEnumerable#GetEnumerator
Since: 5.0