Rhino.Geometry.ComponentStatus
Provides information about selection, highlighting, visibility, editability and integrity states of a component.
This structure is immutable.

Rhino.Geometry.ComponentStatus.#ctor(Rhino.Geometry.ComponentState)
Only used to create from named states.

Rhino.Geometry.ComponentStatus.#ctor(System.Byte)
Used in marshaling. Do NOT expose this.
This will ensure the same type safety present in OpenNURBS.

Rhino.Geometry.ComponentStatus.Clear
This is the default value and equal to undefined.
Since: 6.0

Rhino.Geometry.ComponentStatus.Selected
The selection flag is checked.
Since: 6.0

Rhino.Geometry.ComponentStatus.SelectedPersistent
The persistent selection flag is checked.
Since: 6.0

Rhino.Geometry.ComponentStatus.Highlighted
The highlight selection flag is checked.
Since: 6.0

Rhino.Geometry.ComponentStatus.Hidden
The hidden flag is checked.
Since: 6.0

Rhino.Geometry.ComponentStatus.Locked
The locked flag is checked.
Since: 6.0

Rhino.Geometry.ComponentStatus.Damaged
The damaged flag is checked.
Since: 6.0

Rhino.Geometry.ComponentStatus.AllSet
All flags are checked.
Since: 6.0

Rhino.Geometry.ComponentStatus.IsClear
True if every setting is 0 or false.
Returns: True if the component status is undefined or clear.
Since: 6.0

Rhino.Geometry.ComponentStatus.IsDamaged
Returns false if component is not damaged. True otherwise.
Returns: The component status for damaged.
Since: 6.0

Rhino.Geometry.ComponentStatus.IsHighlighted
Returns true if highlighted. False otherwise.
Returns: The component status for highlighted.
Since: 6.0

Rhino.Geometry.ComponentStatus.IsHidden
Returns true if hidden. False otherwise.
Returns: The component status for hidden.
Since: 6.0

Rhino.Geometry.ComponentStatus.IsLocked
Returns true if locked. False otherwise.
Returns: The component status for locked.
Since: 6.0

Rhino.Geometry.ComponentStatus.IsSelected
Returns true if selected or selected persistent. False otherwise.
Returns: The component status for selected.
Since: 6.0

Rhino.Geometry.ComponentStatus.IsSelectedPersistent
Returns true if selected persistent. False otherwise.
Returns: The component status for selected.
Since: 6.0

Rhino.Geometry.ComponentStatus.WithStates(Rhino.Geometry.ComponentStatus)
Activates any information flag described in any of the two input component statuses
and returns a new ComponentStatus with those flags checked.
additionalStatus: To be used for adding status values.
Since: 6.0

Rhino.Geometry.ComponentStatus.HasSomeEqualStates(Rhino.Geometry.ComponentStatus,Rhino.Geometry.ComponentStatus)
For the purposes of this test, Selected and SelectedPersistent are considered equal.
statesFilter: If no states are specified, then false is returned.
comparand: If a state is set in states_filter, the corresponding state
in "this" and comparand will be tested.
Returns: True if at least one tested state in "this" and comparand are identical.
Since: 6.0

Rhino.Geometry.ComponentStatus.HasAllEqualStates(Rhino.Geometry.ComponentStatus,Rhino.Geometry.ComponentStatus)
For the purposes of this test, Selected and SelectedPersistent are considered equal.
statesFilter: If no states are specified, then false is returned.
comparand: If a state is set in states_filter, the corresponding state
in "this" and comparand will be tested.
Returns: True if at all tested states in "this" and comparand are identical.
Since: 6.0

Rhino.Geometry.ComponentStatus.HasNoEqualStates(Rhino.Geometry.ComponentStatus,Rhino.Geometry.ComponentStatus)
For the purposes of this test, Selected and SelectedPersistent are considered equal.
statesFilter: If no states are specified, then false is returned.
comparand: If a state is set in states_filter, the corresponding state
in "this" and comparand will be tested.
Returns: True if at all tested states in "this" and comparand are identical.
Since: 6.0

Rhino.Geometry.ComponentStatus.op_Addition(Rhino.Geometry.ComponentStatus,Rhino.Geometry.ComponentStatus)
Sets flags from both component states and returns a new ComponentStatus.
a: The first ComponentStatus.
b: The second ComponentStatus.
Returns: A new ComponentStatus.

Rhino.Geometry.ComponentStatus.op_Equality(Rhino.Geometry.ComponentStatus,Rhino.Geometry.ComponentStatus)
Determines if two ComponentStatus objects are equal.
a: The first ComponentStatus.
b: The second ComponentStatus.
Returns: true if they are exactly equal. False otherwise.
Since: 6.0

Rhino.Geometry.ComponentStatus.op_Inequality(Rhino.Geometry.ComponentStatus,Rhino.Geometry.ComponentStatus)
Determines if two ComponentStatus objects differ.
a: The first ComponentStatus.
b: The second ComponentStatus.
Returns: true if they are in any way different. False otherwise.
Since: 6.0

Rhino.Geometry.ComponentStatus.ToString
Provides a string representation of this ComponentStatus.
Returns: The representation in English.

Rhino.Geometry.ComponentStatus.Equals(Rhino.Geometry.ComponentStatus)
Determines if another ComponentStatus and this are equal.
other: A ComponentStatus.
Returns: true if equal in value. false otherwise
Since: 6.0

Rhino.Geometry.ComponentStatus.Equals(System.Object)
Determines if an object and this are equal.
obj: An object.
Returns: true if equal in value. false otherwise

Rhino.Geometry.ComponentStatus.GetHashCode
Serves as a special hash function. The inner value is used for the purpose.
Returns: An integer deriving from a bit mask.