Rhino.Geometry.Collections.HiddenLineDrawingSegmentList
Provides access to all the HiddenLineDrawingCurve objects in a HiddenLineDrawing object.

Rhino.Geometry.Collections.HiddenLineDrawingSegmentList.Count
Gets the number of HiddenLineDrawingCurve objects.

Rhino.Geometry.Collections.HiddenLineDrawingSegmentList.Item(System.Int32)
Get the HiddenLineDrawingCurve at a given index.
index: Index of HiddenLineDrawingCurve to access.
Throws System.IndexOutOfRangeException: Thrown when the index is invalid.
Returns: The HiddenLineDrawingCurve at [index].

Rhino.Geometry.Collections.HiddenLineDrawingSegmentList.GetEnumerator
Gets an enumerator that visits all curves.
Returns: The enumerator.

Rhino.Geometry.Collections.HiddenLineDrawingSegmentList.System#Collections#IEnumerable#GetEnumerator
Gets the same enumerator as Rhino.Geometry.Collections.HiddenLineDrawingSegmentList.GetEnumerator.
Returns: The enumerator.