Rhino.Geometry.Intersect.PlaneSphereIntersection
Represents all possible cases of a Plane|Sphere intersection event.
Since: 5.0

Rhino.Geometry.Intersect.PlaneSphereIntersection.None
No intersections.

Rhino.Geometry.Intersect.PlaneSphereIntersection.Point
Tangent intersection.

Rhino.Geometry.Intersect.PlaneSphereIntersection.Circle
Circular intersection.