Rhino.Geometry.Morphs.MaelstromSpaceMorph
Deforms objects in a spiral as if they were caught in a whirlpool.

Rhino.Geometry.Morphs.MaelstromSpaceMorph.#ctor(Rhino.Geometry.Plane,System.Double,System.Double,System.Double)
Constructs a maelstrom space morph.
plane: Plane on which the base circle will lie. Origin of the plane will be the center point of the circle.
radius0: First radius.
radius1: Second radius.
angle: Coil angle in radians.
Remarks:
If radius0 = radius1 > 0, then the morph is a rotation where the angle of rotation is proportional to the radius.
If radius0 < radius1, then everything inside of the circle of radius radius0 if fixed, the rotation angle increases
smoothly from 0 at radius0 to m_a at radius1, and everything outside of the circle of radius radius1 is rotated by angle.
If radius0 > radius1, then everything outside of the circle of radius radius0 if fixed, the rotation angle increases
smoothly from 0 at radius0 to m_a at radius1, and everything inside of the circle of radius radius1 is rotated by angle.
Since: 5.9

Rhino.Geometry.Morphs.MaelstromSpaceMorph.IsValid
Returns true if the space morph definition is valid, false otherwise.
Since: 5.9

Rhino.Geometry.Morphs.MaelstromSpaceMorph.MorphPoint(Rhino.Geometry.Point3d)
Morphs an Euclidean point.
point: A point that will be morphed by this object.
Returns: Resulting morphed point.
Since: 5.9

Rhino.Geometry.Morphs.MaelstromSpaceMorph.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Geometry.Morphs.MaelstromSpaceMorph.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.9

Rhino.Geometry.Morphs.MaelstromSpaceMorph.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.