Rhino.Geometry.Ellipse
Represents the values of a plane and the two semi-axes radii in an ellipse.

Rhino.Geometry.Ellipse.#ctor(Rhino.Geometry.Plane,System.Double,System.Double)
Initializes a new ellipse from base plane and both principal radii.
plane: Base plane of ellipse.
radius1: Ellipse radius along base plane X direction.
radius2: Ellipse radius along base plane Y direction.
Since: 5.0

Rhino.Geometry.Ellipse.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Initializes a new ellipse from a center point and the two semi-axes intersections.
center: A center for the ellipse. The average of the foci.
second: The intersection of the ellipse X axis with the ellipse itself.
third: A point that determines the radius along the Y semi-axis.
If the point is at right angle with the (center - second point) vector,
it will be the intersection of the ellipse Y axis with the ellipse itself.
Since: 5.0

Rhino.Geometry.Ellipse.Plane
Gets or sets the base plane of the ellipse.
Since: 5.0

Rhino.Geometry.Ellipse.Radius1
Gets or sets the radius of the ellipse along the base plane X semi-axis.
Since: 5.0

Rhino.Geometry.Ellipse.Radius2
Gets or sets the radius of the ellipse along the base plane Y semi-axis.
Since: 5.0

Rhino.Geometry.Ellipse.Center
Gets or sets the center of the ellipse.
Since: 7.16

Rhino.Geometry.Ellipse.FocalDistance
Gets the distance from the center to a focus.
Since: 7.16

Rhino.Geometry.Ellipse.IsValid
Returns an indication of the validity of this ellipse.
Since: 6.0

Rhino.Geometry.Ellipse.GetFoci(Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)
Gets the foci. The foci are two points whose sum of distances from any point on the ellipse is always the same.
F1: The first focus.
F2: The second focus.
Since: 7.16

Rhino.Geometry.Ellipse.ToNurbsCurve
Constructs a nurbs curve representation of this ellipse.
This is equivalent to calling NurbsCurve.CreateFromEllipse().
Returns: A nurbs curve representation of this ellipse or null if no such representation could be made.
Since: 5.0

Rhino.Geometry.Ellipse.EpsilonEquals(Rhino.Geometry.Ellipse,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:
Since: 5.4