Rhino.FileIO.File3dmCurvePiping
Represents the curve piping attached to file3dm object attributes.

Rhino.FileIO.File3dmCurvePiping.On
Specifies whether curve piping is enabled or not.
Since: 8.0

Rhino.FileIO.File3dmCurvePiping.Radius
Specifies the radius of the pipe (minimum value 0.0001).
Since: 8.0

Rhino.FileIO.File3dmCurvePiping.Segments
Specifies the number of segments in the pipe (minimum value 2).
Since: 8.0

Rhino.FileIO.File3dmCurvePiping.Faceted
Specifies whether the pipe is faceted or not.
Since: 8.0

Rhino.FileIO.File3dmCurvePiping.Accuracy
Specifies the accuracy of the pipe in the range 0 to 100.
Since: 8.0

Rhino.FileIO.File3dmCurvePiping.CapType
Specifies the cap type to use.
Since: 8.0