Rhino.Render.ComponentOrders
Pixel component order for channels in the RenderWindow and PostEffects.
Since: 7.0

Rhino.Render.ComponentOrders.Irrelevant
Used in single-value channels.

Rhino.Render.ComponentOrders.RGBA
This is the default (to match Rhino 5)

Rhino.Render.ComponentOrders.ARGB
ARGB component order

Rhino.Render.ComponentOrders.RGB
This will only access 3 components, even in the case of the RGBA channel

Rhino.Render.ComponentOrders.BGR
This will only access 3 components, even in the case of the RGBA channel.

Rhino.Render.ComponentOrders.ABGR
ABGR component order

Rhino.Render.ComponentOrders.BGRA
BGRA component order

Rhino.Render.ComponentOrders.XYZ
For readability when using the Normal XYZ channel.  Same as RGB

Rhino.Render.ComponentOrders.ZYX
For readability when using the Normal XYZ channel.  Same as BGR