Rhino.FileIO.FileFindPreference
Defines options for file search.

Rhino.FileIO.FileFindPreference.None
The choice is not defined.

Rhino.FileIO.FileFindPreference.FullPath
File name exists in FullPath().

Rhino.FileIO.FileFindPreference.RelativePath
File name exists in base path + RelativePath().

Rhino.FileIO.FileFindPreference.BasePath
File name exists in base path directory.

Rhino.FileIO.FileFindPreference.ContentMatch
File with matching content exists.

Rhino.FileIO.FileFindPreference.MostRecent
Most recently modified file.