Rhino.Input.Custom.GetObject
The GetObject class is the tool commands use to interactively select objects.
GetObject go = new GetObject();
go.GetObjects(1,0);
if( go.CommandResult() != Command.Result.Success )
... use canceled or some other type of input was provided
int object_count = go.ObjectCount();
for( int i=0; i<object_count; i++ )
{
ObjectReference objref = go.Object(i);
ON_Geometry geo = objref.Geometry();
...
}

Rhino.Input.Custom.GetObject.ActiveGetObject(Rhino.RhinoDoc)
Get the currently running GetObject for a given document
doc:
Returns:
Since: 6.3

Rhino.Input.Custom.GetObject.#ctor
Since: 5.0

Rhino.Input.Custom.GetObject.GeometryFilter
The geometry type filter controls which types of geometry
(points, curves, surfaces, meshes, etc.) can be selected.
The default geometry type filter permits selection of all
types of geometry.
NOTE: the filter can be a bitwise combination of multiple ObjectTypes.
Since: 5.0

Rhino.Input.Custom.GetObject.GeometryAttributeFilter
The geometry attribute filter provides a secondary filter that
can be used to restrict which objects can be selected. Control
of the type of geometry (points, curves, surfaces, meshes, etc.)
is provided by GetObject.SetGeometryFilter. The geometry attribute
filter is used to require the selected geometry to have certain
attributes (open, closed, etc.). The default attribute filter
permits selection of all types of geometry.
Since: 5.0

Rhino.Input.Custom.GetObject.CustomGeometryFilter(Rhino.DocObjects.RhinoObject,Rhino.Geometry.GeometryBase,Rhino.Geometry.ComponentIndex)
Checks geometry to see if it can be selected.
Override to provide fancy filtering.
rhObject: parent object being considered.
geometry: geometry being considered.
componentIndex:
if >= 0, geometry is a proper sub-part of object->Geometry() with componentIndex.
Returns:
The default returns true unless you've set a custom geometry filter. If a custom
filter has been set, that delegate is called.
Remarks: The delegate should not throw exceptions. If an exception is thrown, a message box will show and
the filter will be disabled.
Since: 5.0

Rhino.Input.Custom.GetObject.SetCustomGeometryFilter(Rhino.Input.Custom.GetObjectGeometryFilter)
Set filter callback function that will be called by the CustomGeometryFilter
filter:
Since: 5.0

Rhino.Input.Custom.GetObject.PassesGeometryAttributeFilter(Rhino.DocObjects.RhinoObject,Rhino.Geometry.GeometryBase,Rhino.Geometry.ComponentIndex)
Checks geometry to see if it passes the basic GeometryAttributeFilter.
rhObject: parent object being considered.
geometry: geometry being considered.
componentIndex: if >= 0, geometry is a proper sub-part of object->Geometry() with componentIndex.
Returns:
true if the geometry passes the filter returned by GeometryAttributeFilter().
Since: 5.0

Rhino.Input.Custom.GetObject.EnablePreSelect(System.Boolean,System.Boolean)
Control the pre-selection behavior GetObjects.
enable: if true, pre-selection is enabled.
ignoreUnacceptablePreselectedObjects:
If true and some acceptable objects are pre-selected, then any unacceptable
pre-selected objects are ignored. If false and any unacceptable are pre-selected,
then the user is forced to post-select.
Remarks:
By default, if valid input is pre-selected when GetObjects() is called, then that input
is returned and the user is not given the opportunity to post-select. If you want
to force the user to post-select, then call EnablePreSelect(false).
Since: 5.0

Rhino.Input.Custom.GetObject.DisablePreSelect
Since: 5.0

Rhino.Input.Custom.GetObject.EnablePostSelect(System.Boolean)
Control the availability of post selection in GetObjects.
Remarks:
By default, if no valid input is pre-selected when GetObjects is called, then
the user is given the chance to post select. If you want to force the user to pre-select,
then call EnablePostSelect(false).
Since: 5.0

Rhino.Input.Custom.GetObject.DeselectAllBeforePostSelect
true if pre-selected input will be deselected before
post-selection begins when no pre-selected input is valid.
Since: 5.0

Rhino.Input.Custom.GetObject.OneByOnePostSelect
In one-by-one post selection, the user is forced
to select objects by post picking them one at a time.
Since: 5.0

Rhino.Input.Custom.GetObject.SubObjectSelect
By default, GetObject.Input will permit a user to select
sub-objects (like a curve in a b-rep or a curve in a group).
If you only want the user to select "top" level objects,
then call EnableSubObjectSelect = false.
Since: 5.0

Rhino.Input.Custom.GetObject.ChooseOneQuestion
By default, if a call to Input is permitted to select different parts
of the same object, like a polysurface and an edge of that polysurface,
then the top-most object is automatically selected. If you want the
choose-one-object mechanism to include pop up in these cases, then call
EnableChooseOneQuestion = true before calling GetObjects().
Since: 5.0

Rhino.Input.Custom.GetObject.BottomObjectPreference
By default, if a call to Input is permitted to select different parts of
the same object, like a polysurface, a surface and an edge, then the
top-most object is preferred. (polysurface beats face beats edge). If
you want the bottom most object to be preferred, then call
EnableBottomObjectPreference = true before calling GetObjects().
Since: 5.0

Rhino.Input.Custom.GetObject.GroupSelect
By default, groups are ignored in GetObject. If you want your call to
GetObjects() to select every object in a group that has any objects
selected, then enable group selection.
Since: 5.0

Rhino.Input.Custom.GetObject.ProxyBrepFromSubD
If a subd (or a subd component) cannot be selected, but a brep (or brep
component) can be selected, then automatically create and use a proxy brep.
Since: 7.0

Rhino.Input.Custom.GetObject.InactiveDetailPickEnabled
By default, objects in inactive details are not permitted to be picked.
In a few rare cases this is used (ex. picking circles during DimRadius)
Since: 5.8

Rhino.Input.Custom.GetObject.EnableSelPrevious(System.Boolean)
By default, any object selected during a command becomes part of the
"previous selection set" and can be reselected by the SelPrev command.
If you need to select objects but do not want them to be selected by
a subsequent call to SelPrev, then call EnableSelPrev = false.
Since: 5.0

Rhino.Input.Custom.GetObject.EnableHighlight(System.Boolean)
By default, any object post-pick selected by GetObjects() is highlighted.
If you want to post-pick objects and not have them automatically highlight,
then call EnableHighlight = false.
Since: 5.0

Rhino.Input.Custom.GetObject.ReferenceObjectSelect
By default, reference objects can be selected. If you do not want to be
able to select reference objects, then call EnableReferenceObjectSelect=false.
Since: 5.0

Rhino.Input.Custom.GetObject.EnableIgnoreGrips(System.Boolean)
By default, post selection will select objects with grips on. If you do
not want to be able to post select objects with grips on, then call
EnableIgnoreGrips = false. The ability to preselect an object with grips
on is determined by the value returned by the virtual
RhinoObject.IsSelectableWithGripsOn.
Since: 5.0

Rhino.Input.Custom.GetObject.EnablePressEnterWhenDonePrompt(System.Boolean)
By default, when GetObject.GetObjects is called with minimumNumber > 0
and maximumNumber = 0, the command prompt automatically includes "Press Enter
when done" after the user has selected at least minimumNumber of objects. If
you want to prohibit the addition of the "Press Enter when done", then call
EnablePressEnterWhenDonePrompt = false;
Since: 5.0

Rhino.Input.Custom.GetObject.SetPressEnterWhenDonePrompt(System.String)
The default prompt when EnablePressEnterWhenDonePrompt is enabled is "Press Enter
when done". Use this function to specify a different string to be appended.
prompt: The text that will be displayed just after the prompt,
after the selection has been made.
Since: 5.0

Rhino.Input.Custom.GetObject.AlreadySelectedObjectSelect
Allow selecting objects that are already selected. By default, GetObjects() disallows
selection of objects that are already selected to avoid putting the same object
in the selection set more than once. Calling EnableAlreadySelectedObjectSelect = true
overrides that restriction and allows selected objects to be selected and
returned by GetObjects. This is useful because, coupled with the return immediately
mode of GetObjects(1, -1), it is possible to select a selected object to deselect
when the selected objects are being managed outside GetObjects() as in the case of
CRhinoPolyEdge::GetEdge().
Since: 5.0

Rhino.Input.Custom.GetObject.Get
Call to select a single object.
Returns:
GetResult.Object if an object was selected.
GetResult.Cancel if the user pressed ESCAPE to cancel the selection.
See GetResults for other possible values that may be returned when options, numbers,
etc., are acceptable responses.
Since: 5.0

Rhino.Input.Custom.GetObject.GetMultiple(System.Int32,System.Int32)
Call to select objects.
minimumNumber: minimum number of objects to select.
maximumNumber:
maximum number of objects to select.
If 0, then the user must press enter to finish object selection.
If -1, then object selection stops as soon as there are at least minimumNumber of object selected.
If >0, then the picking stops when there are maximumNumber objects.  If a window pick, crossing
pick, or Sel* command attempts to add more than maximumNumber, then the attempt is ignored.
Returns:
GetResult.Object if one or more objects were selected.
GetResult.Cancel if the user pressed ESCAPE to cancel the selection.
See GetResults for other possible values that may be returned when options, numbers,
etc., are acceptable responses.
Since: 5.0

Rhino.Input.Custom.GetObject.ObjectCount
Gets the number of objects that were selected.
Since: 5.0

Rhino.Input.Custom.GetObject.Object(System.Int32)
Since: 5.0

Rhino.Input.Custom.GetObject.Objects
Since: 5.0

Rhino.Input.Custom.GetObject.ObjectsWerePreselected
Since: 5.0

Rhino.Input.Custom.GetObject.SerialNumber
Each instance of GetObject has a unique runtime serial number that
is used to identify object selection events associated with that instance.
Since: 5.0

Rhino.Input.Custom.GetObject.EnableClearObjectsOnEntry(System.Boolean)
By default the picked object list is cleared when GetObject.GetObjects() is called.
If you are reusing a GetObject class and do not want the existing object list
cleared when you call Input, then call EnableClearObjectsOnEntry(false) before
calling GetObjects().
enable: The state to set.
Since: 5.0

Rhino.Input.Custom.GetObject.EnableUnselectObjectsOnExit(System.Boolean)
By default any objects in the object list are unselected when GetObject.GetObjects()
exits with any return code besides Object. If you want to leave the objects
selected when non-object input is returned, then call EnableUnselectObjectsOnExit(false)
before calling GetObjects().
enable: The state to set.
Since: 5.0

Rhino.Input.Custom.GetObject.AppendToPickList(Rhino.DocObjects.ObjRef)
objref:
Since: 6.3

Rhino.Input.Custom.GetObject.ClearObjects
Clear possible special object drawing
Since: 6.12