Rhino.UI.Controls.CollapsibleSectionImpl.#ctor(Rhino.UI.Controls.ICollapsibleSection)
Since: 6.0

Rhino.UI.Controls.CollapsibleSectionImpl.CreateHostedSection(Rhino.UI.Controls.ICollapsibleSection)
Since: 6.0

Rhino.UI.Controls.CollapsibleSectionImpl.__InternalSetParent(System.IntPtr)
Since: 6.0

Rhino.UI.Controls.CollapsibleSectionImpl.Dispose
Since: 6.0

Rhino.UI.Controls.CollapsibleSectionImpl.ReplaceClient(Rhino.UI.Controls.ICollapsibleSection)
Since: 6.0

Rhino.UI.Controls.CollapsibleSectionImpl.CppPointer
Since: 6.0

Rhino.UI.Controls.CollapsibleSectionImpl.Find(System.IntPtr)
Since: 6.0

Rhino.UI.Controls.CollapsibleSectionImpl.NewNativeWrapper(System.IntPtr)
Since: 6.0

Rhino.UI.Controls.CollapsibleSectionImpl.GetSibling(Rhino.UI.Controls.ICollapsibleSection,System.Guid)
Since: 6.0

Rhino.UI.Controls.CollapsibleSectionImpl.GetSiblings(Rhino.UI.Controls.ICollapsibleSection)
Since: 6.0

Rhino.UI.Controls.CollapsibleSectionImpl.ViewModel
Since: 6.0

Rhino.UI.Controls.CollapsibleSectionImpl.IsSameObject(System.IntPtr)
Since: 6.0

Rhino.UI.Controls.CollapsibleSectionImpl.DataChanged
Since: 6.0

Rhino.UI.Controls.CollapsibleSectionImpl.ViewModelActivated
Since: 6.0