Rhino.PlugIns.LicenseBuildType
License build contentType enumerations.
Since: 5.0

Rhino.PlugIns.LicenseBuildType.Unspecified
An unspecified build

Rhino.PlugIns.LicenseBuildType.Release
A release build (e.g. commercial, education, NFR, etc.)

Rhino.PlugIns.LicenseBuildType.Evaluation
A evaluation build

Rhino.PlugIns.LicenseBuildType.Beta
A beta build (e.g. WIP)