Rhino.Geometry.RTreeEventArgs
Represents event data that is passed when an item that meets certain
criteria is found and the passed RTree event is raised.

Rhino.Geometry.RTreeEventArgs.Id
Gets the identifier of the found item.
Throws System.OverflowException: If, on 64-bit platforms, the value of this instance is too large or too small to be represented as a 32-bit signed integer.
Since: 5.0

Rhino.Geometry.RTreeEventArgs.IdPtr
Gets the identifier pointer of the found item.
Since: 5.0

Rhino.Geometry.RTreeEventArgs.Cancel
Gets or sets a value that determines if the search should be conducted farther.
Since: 5.0

Rhino.Geometry.RTreeEventArgs.IdB
If search is using two r-trees, IdB is element b in the search.
Since: 5.0

Rhino.Geometry.RTreeEventArgs.IdBPtr
If search is using two r-trees, IdB is the element b pointer in the search.
Since: 5.0

Rhino.Geometry.RTreeEventArgs.Tag
Gets or sets an arbitrary object that can be attached to this event args.
This object will "stick" through a single search and can represent user-defined state.
Since: 5.0

Rhino.Geometry.RTreeEventArgs.SearchSphere
Sphere bounds used during a search. You can modify the sphere in a search callback to
help reduce the bounds to search.
Since: 5.0

Rhino.Geometry.RTreeEventArgs.SearchBoundingBox
Bounding box bounds used during a search. You may modify the box in a search callback
to help reduce the bounds to search.
Since: 5.0