Rhino.Render.DecalProjection
Since: 5.10

Rhino.Render.DecalProjection.None
No projection

Rhino.Render.DecalProjection.Forward
Project forward

Rhino.Render.DecalProjection.Backward
Project backward

Rhino.Render.DecalProjection.Both
Project forward and backward