Rhino.DocObjects.Tables.LinetypeTable.Document
Document that owns this table.
Since: 5.0

Rhino.DocObjects.Tables.LinetypeTable.Count
Returns number of linetypes in the linetypes table, including deleted linetypes.
Since: 5.0

Rhino.DocObjects.Tables.LinetypeTable.ActiveCount
Returns number of linetypes in the linetypes table, excluding deleted linetypes.
Since: 5.0

Rhino.DocObjects.Tables.LinetypeTable.CurrentLinetypeIndex
At all times, there is a "current" linetype.  Unless otherwise specified,
new objects are assigned to the current linetype. If the current linetype
source is LinetypeFromLayer the object's layer's linetype is used instead.
Since: 5.0

Rhino.DocObjects.Tables.LinetypeTable.LinetypeScale
For display in Rhino viewports, the linetypes are scaled by a single scale
factor for all viewports. This is not used for printing, where all linetype
patterns are scaled to print in their defined size 1:1 on the paper.
Since: 5.0

Rhino.DocObjects.Tables.LinetypeTable.Item(System.Int32)
Conceptually, the linetype table is an array of linetypes.
The operator[] can be used to get individual linetypes. A linetype is
either active or deleted and this state is reported by Linetype.IsDeleted.
index: zero based array index.
Returns:
Reference to the linetype.  If index is out of range, the current
linetype is returned. Note that this reference may become invalid after
AddLinetype() is called.

Rhino.DocObjects.Tables.LinetypeTable.CurrentLinetypeSource
Source used by an object to determine its current linetype to be used by new objects.
Since: 5.0

Rhino.DocObjects.Tables.LinetypeTable.SetCurrentLinetypeIndex(System.Int32,System.Boolean)
At all times, there is a "current" linetype. Unless otherwise specified, new objects
are assigned to the current linetype. The current linetype is never deleted.
linetypeIndex:
Value for new current linetype. 0 <= linetypeIndex < LinetypeTable.Count.
quiet:
if true, then no warning message box pops up if the current linetype request can't be satisfied.
Returns: true if current linetype index successfully set.
Since: 5.0

Rhino.DocObjects.Tables.LinetypeTable.LinetypeIndexForObject(Rhino.DocObjects.RhinoObject)
Returns the effective linetype index to be used to find the
linetype definition to draw an object. If an object's linetype
source is LinetypeFromObject, the linetype index in the object's
attributes is used. If an object's linetype source is LinetypeFromLayer
the linetype index from the object's layer is used.
rhinoObject: The Rhino object to use in the query.
Returns: The effective linetype index.
Since: 5.0

Rhino.DocObjects.Tables.LinetypeTable.CurrentLinetype
Returns reference to the current linetype. Note that this reference may
become invalid after a call to AddLinetype().
Remarks:
At all times, there is a "current" linetype. Unless otherwise specified,
new objects are assigned to the current linetype. The current linetype
is never deleted.
Since: 5.0

Rhino.DocObjects.Tables.LinetypeTable.LoadDefaultLinetypes
Fills in the linetype table with any default linetypes not already included.
Remarks:
New documents only contain the continuous linetype. Other default linetypes
are added, on demand, when the user needs them. Calling this function ensures
that the linetype table is populated with the default linetypes.
Returns: The number of default linetypes added to the linetype table.
Since: 6.0

Rhino.DocObjects.Tables.LinetypeTable.LoadDefaultLinetypes(System.Boolean)
Fills in the linetype table with any default linetypes not already included.
ignoreDeleted: Ignore default linetypes that have been deleted.
Remarks:
New documents only contain the continuous linetype. Other default linetypes
are added, on demand, when the user needs them. Calling this function ensures
that the linetype table is populated with the default linetypes.
Returns: The number of default linetypes added to the linetype table.
Since: 8.0

Rhino.DocObjects.Tables.LinetypeTable.Find(System.String,System.Boolean)
Obsolete. Use the other overload.
name: search ignores case.
ignoreDeletedLinetypes: If true, deleted linetypes are not checked.
Returns:
>=0 index of the linetype with the given name
-1  no linetype has the given name.
Since: 5.0
6.0

Rhino.DocObjects.Tables.LinetypeTable.Find(System.String)
Finds the linetype with a given name.
name: The name of the linetype to find. The search ignores case.
Returns:
If the linetype was found, the linetype index, >=0, is returned.
If the linetype was not found, -1 is returned.
Note, the linetype index of -1 denotes the default, or "Continuous" linetype.
Since: 6.0

Rhino.DocObjects.Tables.LinetypeTable.Find(System.Guid,System.Boolean)
Finds a linetype with a matching ID.
id: The ID of the line type to be found.
ignoreDeletedLinetypes: If true, deleted linetypes are not checked.
Returns:
If the linetype was found, the linetype index, >=0, is returned.
If the linetype was not found, -1 is returned.
Note, the linetype index of -1 denotes the default, or "Continuous" linetype.
Since: 5.0

Rhino.DocObjects.Tables.LinetypeTable.FindName(System.String)
Finds the linetype with a given name.
name: he name of the linetype to find.
Returns:
The linetype. If the linetype was not found, then the default, or "Continuous" linetype is returned.
Since: 6.0

Rhino.DocObjects.Tables.LinetypeTable.FindIndex(System.Int32)
Retrieves a Linetype object based on Index. This search type of search is discouraged.
We are moving towards using only IDs for all tables.
index: The index to search for.
Returns: A Linetype object, or null if none was found.
Since: 6.0

Rhino.DocObjects.Tables.LinetypeTable.Add(Rhino.DocObjects.Linetype)
Adds a new linetype with specified definition to the linetype table.
linetype:
Definition of new linetype.  The information in linetype is copied.
If linetype.Name is empty then a unique name of the form "Linetype 01"
will be automatically created.
Returns:
Index of newline type or -1 on error.
Since: 5.0

Rhino.DocObjects.Tables.LinetypeTable.System#Collections#Generic#ICollection{Rhino#DocObjects#Linetype}#Add(Rhino.DocObjects.Linetype)
Since: 5.0

Rhino.DocObjects.Tables.LinetypeTable.Add(System.String,System.Collections.Generic.IEnumerable{System.Double})
Adds a new linetype with specified definition to the linetype table.
name: A name for the new linetype.
segmentLengths: Positive values are dashes, negative values are gaps.
Returns:
Index of new linetype or -1 on error.
Since: 5.0

Rhino.DocObjects.Tables.LinetypeTable.AddReferenceLinetype(Rhino.DocObjects.Linetype)
Adds a reference linetypes that will not be saved in files.
linetype: Definition of new linetype.  The information in linetype is copied.
If linetype.Name is empty then a unique name of the form "Linetype 01"
will be automatically created.
Returns:
Index of new linetype or -1 on error.
Since: 5.0

Rhino.DocObjects.Tables.LinetypeTable.Modify(Rhino.DocObjects.Linetype,System.Int32,System.Boolean)
Modify linetype settings.
linetype: New linetype settings. This information is copied.
index: Zero based index of linetype to set.
quiet:
if true, information message boxes pop up when illegal changes are attempted.
Returns:
true if successful. false if linetype_index is out of range or the
settings attempt to lock or hide the current linetype.
Since: 5.0

Rhino.DocObjects.Tables.LinetypeTable.UndoModify(System.Int32)
If the linetype has been modified and the modification can be undone,
then UndoModify() will restore the linetype to its previous state.
index: Zero based index of linetype for which to undo changes.
Returns:
true if this linetype had been modified and the modifications were undone.
Since: 5.0

Rhino.DocObjects.Tables.LinetypeTable.Delete(System.Int32,System.Boolean)
Deletes linetype.
index: zero based index of linetype to delete.
quiet:
If true, no warning message box appears if a linetype the
linetype cannot be deleted because it is the current linetype
or it contains active geometry.
Returns:
true if successful. false if linetypeIndex is out of range or the
linetype cannot be deleted because it is the current linetype or
because it linetype is referenced by active geometry.
Since: 5.0

Rhino.DocObjects.Tables.LinetypeTable.Delete(Rhino.DocObjects.Linetype)
Since: 6.0

Rhino.DocObjects.Tables.LinetypeTable.Delete(System.Collections.Generic.IEnumerable{System.Int32},System.Boolean)
Deletes multiple linetypes.
indices: An array, a list or any enumerable instance of linetype indices.
quiet: If true, no warning message box appears if a linetype the
linetype cannot be deleted because it is the current linetype
or it contains active geometry.
Returns: true if operation succeeded.
Since: 5.0

Rhino.DocObjects.Tables.LinetypeTable.Undelete(System.Int32)
Restores a linetype that has been deleted.
index: A linetype index to be undeleted.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.LinetypeTable.GetUnusedLinetypeName(System.Boolean)
Obsolete. Use the other overload. Gets unused linetype name used as default when creating new linetypes.
ignoreDeleted:
If this is true then a name used by a deleted linetype is allowed.
Returns: The unused linetype name.
Since: 5.0
6.0

Rhino.DocObjects.Tables.LinetypeTable.GetUnusedLinetypeName
Gets unused linetype name used as default when creating new linetypes.
Returns: The unused linetype name.
Since: 6.0

Rhino.DocObjects.Tables.LinetypeTable.ContinuousLinetypeName
Returns the text name of the continuous linetype.
Since: 5.0

Rhino.DocObjects.Tables.LinetypeTable.ByLayerLinetypeName
Returns the text name of the by-layer linetype.
Since: 5.0

Rhino.DocObjects.Tables.LinetypeTable.ByParentLinetypeName
Returns the text name of the by-parent linetype.
Since: 6.0

Rhino.DocObjects.Tables.LinetypeTable.ComponentType
Since: 6.0

Rhino.DocObjects.Tables.LinetypeTable.GetEnumerator
Since: 5.0