Rhino.Runtime.Notifications.NotificationButtonClickedArgs
Used when a button is clicked for a notification.

Rhino.Runtime.Notifications.NotificationButtonClickedArgs.#ctor(Rhino.Runtime.Notifications.Notification,Rhino.Runtime.Notifications.ButtonType)
Creates a new instance.
notification: The notification whose button was clicked.
buttonClicked: The button that was clicked.
Since: 6.0

Rhino.Runtime.Notifications.NotificationButtonClickedArgs.Notification
The notification whose button was clicked.
Since: 6.0

Rhino.Runtime.Notifications.NotificationButtonClickedArgs.ButtonClicked
The button that was clicked.
Since: 6.0