Rhino.UI.LOC
Used a placeholder which is used by LocalizationProcessor application to create contextId
mapped localized strings.

Rhino.UI.LOC.STR(System.String)
Strings that need to be localized should call this function. The STR function doesn't actually
do anything but return the original string. The LocalizationProcessor application walks
through the source code of a project and looks for LOC.STR. The function is then replaced with a
call to Localization.LocalizeString using a unique context ID.
[in] The English string to localize.
Since: 5.0

Rhino.UI.LOC.STR(System.String,System.Object)
Similar to System.String.Format(System.String,System.Object) function.
english: The English name.
assemblyOrObject: Unused.
Returns: English name.
Since: 5.0

Rhino.UI.LOC.STR(System.String,System.Int32)
DO NOT use this function, it is a trap to determine
where context IDs have been copied from other, already extracted,
strings.
english: The English name.
contextid: Copied context id.
Returns: English name.
Since: 7.0
7.1

Rhino.UI.LOC.COMMANDNAME(System.String)
Command names that need to be localized should call this function. The COMMANDNAME function doesn't actually
do anything but return the original string. The LocalizationProcessor application walks
through the source code of a project and looks for LOC.COMMANDNAME and builds a record for each command
name for the translators that can be used by developers in a commands overridden Rhino.Commands.Command.LocalName
which should call Rhino.UI.Localization.LocalizeCommandName(EnglishName)
[in] The English string to localize.
Since: 5.0

Rhino.UI.LOC.CON(System.String)
Command option name strings that need to be localized should call this function. The CON function
doesn't actually do anything but return the original string. The LocalizationProcessor application walks
through the source code of a project and looks for LOC.CON. The function is then replaced with a
call to Localization.LocalizeCommandOptionName using a unique context ID.
[in] The English string to localize.
Returns: Returns localized string pair with both the English and local names set to the English value.
Since: 5.0

Rhino.UI.LOC.CON(System.String,System.Object)
Command option name strings that need to be localized should call this function. The CON function
doesn't actually do anything but return the original string. The LocalizationProcessor application walks
through the source code of a project and looks for LOC.CON. The function is then replaced with a
call to Localization.LocalizeCommandOptionName using a unique context ID.
[in] The English string to localize.
[in] The object that identifies the assembly that owns the command option name.
Returns: Returns localized string pair with both the English and local names set to the English value.
Since: 5.0

Rhino.UI.LOC.CON(System.String,System.Int32)
DO NOT use this function, it is a trap to determine
where context IDs have been copied from other, already extracted,
strings.
english: The English name.
contextid: Copied context id.
Returns: English name.
Since: 7.0
7.1

Rhino.UI.LOC.COV(System.String)
Command option name strings that need to be localized should call this function. The COV function
doesn't actually do anything but return the original string. The LocalizationProcessor application walks
through the source code of a project and looks for LOC.COV. The function is then replaced with a
call to Localization.LocalizeCommandOptionValue using a unique context ID.
[in] The English string to localize.
Returns: Returns localized string pair with both the English and local names set to the English value.
Since: 5.0

Rhino.UI.LOC.COV(System.String,System.Object)
Command option name strings that need to be localized should call this function. The COV function
doesn't actually do anything but return the original string. The LocalizationProcessor application walks
through the source code of a project and looks for LOC.COV. The function is then replaced with a
call to Localization.LocalizeCommandOptionValue using a unique context ID.
[in] The English string to localize.
[in] The object that identifies the assembly that owns the command option value.
Returns: Returns localized string pair with both the English and local names set to the English value.
Since: 5.0