Rhino.FileIO.FileStpWriteOptions
Options used when writing a STP file

Rhino.FileIO.FileStpWriteOptions.Schema
Get and set the schema of the step file being written.
Since: 8.0

Rhino.FileIO.FileStpWriteOptions.Export2dCurves
Some (not most, and not Rhino) importing applications can make use of
the 2-D trimming curves to get a more accurate and faster import. The
size of the step file will be larger
Since: 7.0

Rhino.FileIO.FileStpWriteOptions.ExportBlack
Let importing application set color for black objects. If a Rhino
object has color black, no color is assigned to the object in the step
file.This will cause the importing application to give the object its
default color.This is desirable because black objects look like
ink blots in some applications.This option is grayed out if the schema
option is AP203ControConfigDesign since that schema does not include
color entities.
Since: 7.0

Rhino.FileIO.FileStpWriteOptions.SplitClosedSurfaces
Splits closed surfaces, for example, the interior surfaces of drilled
holes.
Since: 7.0

Rhino.FileIO.FileStpWriteOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0