Rhino.Display.Text3d
3D aligned text with font settings.

Rhino.Display.Text3d.#ctor(System.String)
Constructs a new instance of Text3d.
text: Text string.
Since: 5.0

Rhino.Display.Text3d.#ctor(System.String,Rhino.Geometry.Plane,System.Double)
Constructs a new instance of Text3d.
text: Text string.
plane: 3D Plane for text.
height: Height (in units) for text.
Since: 5.0

Rhino.Display.Text3d.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0

Rhino.Display.Text3d.Text
Gets or sets the text string for this Text3d object.
Since: 5.0

Rhino.Display.Text3d.TextPlane
Gets or sets the 3D aligned plane for this Text3d object.
Since: 5.0

Rhino.Display.Text3d.Height
Gets or sets the height (in units) of this Text3d object.
The height should be a positive number larger than zero.
Since: 5.0

Rhino.Display.Text3d.FontFace
Gets or sets the FontFace name.
Since: 5.0

Rhino.Display.Text3d.Bold
Gets or sets whether this Text3d object will be drawn in Bold.
Since: 5.0

Rhino.Display.Text3d.Italic
Gets or sets whether this Text3d object will be drawn in Italics.
Since: 5.0

Rhino.Display.Text3d.BoundingBox
Gets the bounding box for this Text3d object.
Since: 5.0

Rhino.Display.Text3d.HorizontalAlignment
Horizontal alignment that this Text3d is drawn with
Since: 6.4

Rhino.Display.Text3d.VerticalAlignment
Vertical alignment that this Text3d is drawn with
Since: 6.4