Rhino.FileIO.FileObjWriteOptions.ObjGroupNames
Since: 6.0

Rhino.FileIO.FileObjWriteOptions.ObjGroupNames.NoGroups
Neither layer or group names are exported as OBJ groups

Rhino.FileIO.FileObjWriteOptions.ObjGroupNames.LayerAsGroup
Rhino layer names are exported as OBJ groups

Rhino.FileIO.FileObjWriteOptions.ObjGroupNames.GroupAsGroup
Rhino group names are exported as OBJ groups