Rhino.UI.RhinoGetPlotWidthArgs
Argument flags passed to methods used to get Rhino plot width lists

Rhino.UI.RhinoGetPlotWidthArgs.NoArgs
Just get the standard or default width list

Rhino.UI.RhinoGetPlotWidthArgs.ByLayer
Include a By Layer option

Rhino.UI.RhinoGetPlotWidthArgs.ByParent
Include a By Parent option

Rhino.UI.RhinoGetPlotWidthArgs.HairLine
Include a hairline width option

Rhino.UI.RhinoGetPlotWidthArgs.Default
Include a default width option

Rhino.UI.RhinoGetPlotWidthArgs.None
Include a no print option

Rhino.UI.RhinoGetPlotWidthArgs.All
Include everything