Rhino.Commands.RunMode
Provides enumerated constants for a command running mode. This is currently interactive or scripted.
Since: 5.0

Rhino.Commands.RunMode.Interactive
Can use dialogs for input. Must use message boxes to
report serious error conditions.

Rhino.Commands.RunMode.Scripted
All input must come from command line, GetPoint, GetObject,
GetString, etc.  Must use message boxes to report serious
error conditions.  Script mode gets used when a command is
run with a hyphen (-) prefix.