Rhino.Display.DisplayPen
Pen used to define stroke applied to several DisplayPipeline draw functions

Rhino.Display.DisplayPen.Duplicate
Create a duplicate of this display pen.
Returns: An exact duplicate of this display pen.
Since: 8.0

Rhino.Display.DisplayPen.FromLinetype(Rhino.DocObjects.Linetype,System.Drawing.Color,System.Double)
Create a display pen that matches a linetype definition
linetype:
patternScale: scale to be applied to linetype dash pattern. Typically this is 1
color:
Returns:
Since: 8.0

Rhino.Display.DisplayPen.Color
Color applied to stroke
Since: 8.0

Rhino.Display.DisplayPen.Thickness
Thickness for stroke
Since: 8.0

Rhino.Display.DisplayPen.ThicknessSpace
Coordinate system for the pen's thickness
Since: 8.0

Rhino.Display.DisplayPen.CapStyle
How caps are drawn at the ends of open curves
Since: 8.0

Rhino.Display.DisplayPen.JoinStyle
How corners of curves are joined
Since: 8.0

Rhino.Display.DisplayPen.HaloThickness
Halos are blended colors drawn around a curve for purposes like selection
Since: 8.0

Rhino.Display.DisplayPen.HaloColor
Halos are blended colors drawn around a curve for purposes like selection
Since: 8.0

Rhino.Display.DisplayPen.SetPattern(System.Collections.Generic.IEnumerable{System.Single})
Set pattern to apply for a stroke.
dashesAndGaps:
Lengths of dashes and gaps for a pattern. Dash is always assumed the first item.
There is a limit to 8 dashes and gaps total
Throws System.ArgumentOutOfRangeException:
thrown when dashes and gaps have more than 8 items
Since: 8.0

Rhino.Display.DisplayPen.PatternAsArray
Get the pattern for this pen as an array of dash,gap,dash,gap... values
Returns:
Since: 8.0

Rhino.Display.DisplayPen.PatternOffset
Offset to apply to pattern. If RhinoMath.UnsetSingle, then pattern
is centered to keep even dash lengths at ends
Since: 8.0

Rhino.Display.DisplayPen.PatternBySegment
Restart patterns at corners in a curve
Since: 8.0

Rhino.Display.DisplayPen.PatternLengthInWorldUnits
If true, lengths in pattern definition are interpreted to be in world
units. If false, screen pixel distances are used.
Since: 8.0

Rhino.Display.DisplayPen.SetTaper(System.Single,System.Single,Rhino.Geometry.Point2f)
Positions and thickness at those positions along a curve that define a taper.
startThickness:
endThickness:
taperPoint:
Since: 8.0

Rhino.Display.DisplayPen.TaperAsArray
Collection of positions and thicknesses at those positions to define a taper
Rhino currently only supports either no taper or a single taper. An array is
used here in case Rhino supports multiple taper values in the future.
Since: 8.0