Rhino.Render.ContentUndoBlocker.#ctor
Constructs a ContentUndoBlocker object inside a using block to block undo when modifying a RenderContent
while a ContentUndoHelper is active. Alternatively - create the ContentUndoBlocker and explicitly call Dispose when you are done.
Since: 5.10

Rhino.Render.ContentUndoBlocker.Dispose
Since: 5.10