Rhino.SettingValue
PersistentSettings contains a dictionary of these items.

Rhino.SettingValue.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
ISerializable constructor.
info: Serialization data.
context: Serialization stream.

Rhino.SettingValue.#ctor(Rhino.PersistentSettings,System.String,System.Type,System.String,System.String)
Constructor.
parent: PersistentSettings collection this is being added to.
name: Current value name.
runtimeType: Value data type.
value: Current value string.
defaultValue: Default value string.

Rhino.SettingValue.System#Runtime#Serialization#ISerializable#GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
ISerializable required method.
info: Serialization data.
context: Serialization stream.

Rhino.SettingValue.CopyFrom(Rhino.SettingValue)
Copies values from another SettingsValue object. If the destination contains more than one item,
assumes it is a string list and appends values from the source object that are not currently in
the array.
source: The source settings.

Rhino.SettingValue.ValuesAreEqual(Rhino.SettingValue)
Determines if two SettingsValue have the same data. Does not compare default values.
other: The other value.
Returns: true if this and other setting have the same value, without comparing the default. Otherwise, false.

Rhino.SettingValue.ValuesAreEqual(Rhino.SettingValue,System.Boolean)
Determines if two SettingsValues have the same data and optionally compares default data.
other: The other value.
compareDefaults: true if the default value should be compared.
Returns: true if this and other setting have the same value, optionally comparing the default. Otherwise, false.

Rhino.SettingValue.SetValue(System.Boolean,System.String,System.Boolean)
Sets either the current or default value string.
isDefault: If true then the current value string is set otherwise the default value string is.
s: New value string.
setChangedFlag:
If true then ChangedSinceSave will get set if the s is not exactly the,
same as m_value.  If false then ChangedSinceSave will not get modified.
Setting ChangedSinceSave to true causes the parent to get notified that
a setting has changed and queue a write settings file request.
SetValue() may get called by a Get... method when using a default value
which should not trigger a changed event.

Rhino.SettingValue.GetValue(System.Boolean)
Gets the current or default value as requested.
isDefault: If true then the default value string is returned otherwise the current value string is returned.
Returns: If isDefault is true then the default value string is returned otherwise the current value string is returned.

Rhino.SettingValue.ValueSameAsDefault
Compare current and default values and return true if they are identical, compare is case sensitive.

Rhino.SettingValue.ValueDifferentThanDefault
Compare current and default values and return true if they differ, compare is case sensitive.

Rhino.SettingValue.StringListSeparator
I was going to use Path.PathSeparator, ';' which works when specifying a path but is a valid file name character so
it does not work in a file name list, the '|' character is in both the Path.GetInvalidFileNameChars() and
Path.GetInvalidPathChars() list of characters so I went ahead and used it for now.

Rhino.SettingValue.StringListSeparatorAsArray
Gets the Rhino.SettingValue.StringListSeparator value in an array.