Rhino.DocObjects.DimensionStyle.CenterMarkStyle
Style for drawing centermark for Radial dimensions and Centermark objects

Rhino.DocObjects.DimensionStyle.CenterMarkStyle.None
No centermark display

Rhino.DocObjects.DimensionStyle.CenterMarkStyle.Mark
+ mark only

Rhino.DocObjects.DimensionStyle.CenterMarkStyle.MarkAndLines
+ mark and lines to radius