Rhino.FileIO.BinaryArchiveException
Thrown by BinaryArchiveReader and BinaryArchiveWriter classes when
an IO error has occurred.

Rhino.FileIO.BinaryArchiveException.#ctor(System.String)
Initializes a new instance of the Rhino.FileIO.BinaryArchiveException class.
message: The inner message to show to users.
Since: 5.0