Rhino.Render.RenderContent.ChangeChildContentFlags
Delete a child content.
\param parentContent is the content whose child is to be deleted. This must be an
RDK-owned content that is in the persistent content list (either top-level or child).
\param wszChildSlotName is the child-slot name of the child to be deleted.
\return \e true if successful, else \e false.

Rhino.Render.RenderContent.ChangeChildContentFlags.AllowNone
Allow (none) item to be displayed in dialog.

Rhino.Render.RenderContent.ChangeChildContentFlags.AutoEdit
Automatically open new content in thumbnail editor.

Rhino.Render.RenderContent.ChangeChildContentFlags.HarvestMask
Mask to use to isolate harvesting flags.

Rhino.Render.RenderContent.ChangeChildContentFlags.HarvestUseOpt
Use Renderer Support option to decide about harvesting.

Rhino.Render.RenderContent.ChangeChildContentFlags.HarvestAlways
Always copy similar parameters from old child.

Rhino.Render.RenderContent.ChangeChildContentFlags.HarvestNever
Never copy similar parameters from old child.