Rhino.DocumentSaveEventArgs
Provides document information for RhinoDoc events.

Rhino.DocumentSaveEventArgs.FileName
Name of file being written.
Since: 5.0

Rhino.DocumentSaveEventArgs.ExportSelected
true if only selected objects are being written to a file.
Since: 5.0