Rhino.Runtime.IPlatformServiceLocator
Get platform specific services that are used internally for
general cross platform funtions in RhinoCommon. This includes
services like localization and GUI components that have concrete
implementations in the RhinoWindows or RhinoMac assemblies

Rhino.Runtime.IPlatformServiceLocator.GetService``1
Used to get service of a specific type
Returns:
Since: 6.0