Rhino.FileIO.FileUdo
Support for writing Moray UDO file format

Rhino.FileIO.FileUdo.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileUdoWriteOptions)
Write a Moray UDO file based on the contents of a RhinoDoc
path: path to write a file to
doc: document to get geometry from
options: options used for generating the Moray UDO file
Returns: true on success
Since: 8.0