Rhino.Geometry.BrepSolidOrientation
Enumerates all possible Solid Orientations for a Brep.
Since: 5.0

Rhino.Geometry.BrepSolidOrientation.None
Brep is not a Solid.

Rhino.Geometry.BrepSolidOrientation.Inward
Brep is a Solid with inward facing normals.

Rhino.Geometry.BrepSolidOrientation.Outward
Brep is a Solid with outward facing normals.

Rhino.Geometry.BrepSolidOrientation.Unknown
Breps is a Solid but no orientation could be computed.