Rhino.FileIO.FileDst
Support for writing dst file format

Rhino.FileIO.FileDst.Read(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileDstReadOptions)
Read a dst file into a RhinoDoc
path: path to read a file from
doc: document to import geometry into
options: options used for importing the dst file
Returns: true on success
Since: 8.0