Rhino.UI.RhinoPlotWidthValue
Default width values used by UI objects to represent different states

Rhino.UI.RhinoPlotWidthValue.Default
Use default plot width

Rhino.UI.RhinoPlotWidthValue.None
Don't print

Rhino.UI.RhinoPlotWidthValue.ByLayer
Plot width from layer

Rhino.UI.RhinoPlotWidthValue.ByParent
Plot width from parent object

Rhino.UI.RhinoPlotWidthValue.Varies
Multiple objects selected with different types/widths