Rhino.Runtime.InteropWrappers.SimpleArrayGuid
Wrapper for ON_SimpleArray<ON_UUID>. If you are not writing C++ code
then this class is not for you.

Rhino.Runtime.InteropWrappers.SimpleArrayGuid.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayGuid.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayGuid.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayGuid class.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayGuid.#ctor(System.Collections.Generic.IEnumerable{System.Guid})
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayGuid class
values: initial set of Guids to add to the array
Since: 7.0

Rhino.Runtime.InteropWrappers.SimpleArrayGuid.Item(System.Int32)
Get the Guid at index
index:
Returns:

Rhino.Runtime.InteropWrappers.SimpleArrayGuid.Append(System.Guid)
Appends a new System.Guid at the end of this array.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayGuid.Count
Gets the amount of elements in this array.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayGuid.Capacity
The capacity for the array
Since: 8.21

Rhino.Runtime.InteropWrappers.SimpleArrayGuid.ToArray
Returns the managed counterpart of the unmanaged array.
Returns: The managed array.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayGuid.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.SimpleArrayGuid.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0