Rhino.Display.ViewCaptureSettings.ViewAreaMapping
Defines how a viewport is mapped to output.

Rhino.Display.ViewCaptureSettings.ViewAreaMapping.View
Best fit rectangle of what is displayed in a viewport

Rhino.Display.ViewCaptureSettings.ViewAreaMapping.Extents
Zoom projection to all visible geometry in a viewport

Rhino.Display.ViewCaptureSettings.ViewAreaMapping.Window
Use window rectangle defined by user