Rhino.Geometry.Intersect.CircleCircleIntersection
Represents all possible cases of a Circle|Circle intersection event.
Since: 7.12

Rhino.Geometry.Intersect.CircleCircleIntersection.None
Circles do not intersect.

Rhino.Geometry.Intersect.CircleCircleIntersection.Single
Circles touch at a one point.

Rhino.Geometry.Intersect.CircleCircleIntersection.Multiple
Circles intersect at two points.

Rhino.Geometry.Intersect.CircleCircleIntersection.Overlap
Circles are identical.