Rhino.FileIO.FileStpReadOptions
Options used when reading a STP file

Rhino.FileIO.FileStpReadOptions.JoinSurfaces
Since: 8.0

Rhino.FileIO.FileStpReadOptions.LimitFaces
Since: 8.0

Rhino.FileIO.FileStpReadOptions.MaxFaceCount
Since: 8.0

Rhino.FileIO.FileStpReadOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Import function
Returns:
Since: 8.0