Rhino.Runtime.InteropWrappers.SimpleArrayArrayPoint3d
Wrapper for ON_SimpleArray<ON_PolyLine*>, ON_SimpleArray<ON_3dPointArray*>
If you are not writing C++ code then this class is not for you.

Rhino.Runtime.InteropWrappers.SimpleArrayArrayPoint3d.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.
Since: 7.0

Rhino.Runtime.InteropWrappers.SimpleArrayArrayPoint3d.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.
Since: 7.0

Rhino.Runtime.InteropWrappers.SimpleArrayArrayPoint3d.#ctor
Initializes a new empty Rhino.Runtime.InteropWrappers.SimpleArrayArrayPoint3d instance.
Since: 7.0

Rhino.Runtime.InteropWrappers.SimpleArrayArrayPoint3d.Count
Gets the amount of polylines in this array.
Since: 7.0

Rhino.Runtime.InteropWrappers.SimpleArrayArrayPoint3d.PointCountAt(System.Int32)
Gets the amount of points in a polyline.
Since: 7.0

Rhino.Runtime.InteropWrappers.SimpleArrayArrayPoint3d.Item(System.Int32,System.Int32)
Gets a point in a polyline.

Rhino.Runtime.InteropWrappers.SimpleArrayArrayPoint3d.PolylineAt(System.Int32)
Gets a polyline at an index.
index: The index.
Returns: The polyline if successful, null otherwise.
Since: 8.0

Rhino.Runtime.InteropWrappers.SimpleArrayArrayPoint3d.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.SimpleArrayArrayPoint3d.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 7.0

Rhino.Runtime.InteropWrappers.SimpleArrayArrayPoint3d.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.