Rhino.Geometry.SubDFace
Single face of a SubD

Rhino.Geometry.SubDFace.ClearSavedSubdivisionPoints(System.Boolean)
Discards the cached subdivision and surface points for this face, so they are
recomputed on next use.
clearNeighborhood:
If true, the cached points of the neighboring components are discarded too. Moving a
control net point changes the surface around it, not just at it, so pass true after
an edit unless you know only this face is affected.
Since: 8.36

Rhino.Geometry.SubDFace.EdgeCount
Number of edges for this face. Note that EdgeCount is always the same
as VertexCount. Two properties are provided simply for clarity.
Since: 7.0

Rhino.Geometry.SubDFace.VertexCount
Number of vertices for this face. Note that EdgeCount is always the same
as VertexCount. Two properties are provided simply for clarity.
Since: 7.0

Rhino.Geometry.SubDFace.PerFaceColor
If per-face color is "Empty", then this face does not have a custom color
Since: 7.0

Rhino.Geometry.SubDFace.ComponentIndex
Gets the component index of this face.
Returns: The component index.
Since: 7.9

Rhino.Geometry.SubDFace.LimitSurfaceCenterPoint
Get the limit surface point location at the center of the face
Since: 7.0

Rhino.Geometry.SubDFace.ControlNetCenterPoint
The face's control net center point is the average of the face's
vertex control net points. This is the same point as the face's
subdivision point.
Returns:
The average of the face's vertex control net points
Since: 8.0

Rhino.Geometry.SubDFace.SurfaceCenterNormal
Get the limit surface normal vector at the center of the face.
Returns:
Limit surface normal vector at the face's center.
Since: 8.0

Rhino.Geometry.SubDFace.ControlNetCenterNormal
When the face's control net polygon is planar, the face's
control net normal is a unit vector perpendicular to the plane
that points outwards. If the control net polygon is not
planar, the control net normal is control net normal is a unit
vector that is the average of the control polygon's corner normals.
Returns:
A unit vector that is normal to planar control net polygons and a good
compromise for nonplanar control net polygons.
Since: 8.0

Rhino.Geometry.SubDFace.SurfaceCenterFrame
Get the limit surface tangent plane at the center of the face.
The plane's origin is the point on the limit surface at the center of the face.
The plane's z axis is the limit surface normal vector at the center of the face.
Returns:
Limit surface tanget plane at the face's center.
Since: 8.0

Rhino.Geometry.SubDFace.ControlNetCenterFrame
The face's control net center frame is a plane
with normal equal to ControlNetCenterNormal
and origin equal to ControlNetCenterPoint.
The x and y axes of the frame have no predictable relationship
to the face or SubD control net topology.
Returns:
A plane with unit normal equal to ControlNetCenterNormal
and origin equal to ControlNetCenterPoint.
Since: 8.0

Rhino.Geometry.SubDFace.EdgeAt(System.Int32)
Get an edge at a given index
index:
Returns:
Since: 7.0

Rhino.Geometry.SubDFace.EdgeDirectionMatchesFaceOrientation(System.Int32)
Check if a given edge in this face has the same direction as the face orientation
index:
Returns:
Since: 7.0

Rhino.Geometry.SubDFace.VertexAt(System.Int32)
Get a vertex that this face uses by index
index:
Returns:
Since: 7.0