Rhino.PrivateMeshCommands.MeshTypes.WeldedInvariantWeshTopology
Maintains vertex-edge-face information in an order that does not change with point transformations.
Uses the first appearance of an edge in the face array to define its invariant position.
Allows tolerance usage.