Rhino.DocObjects.Tables.DimStyleTable.BuiltInStyles
Creates an array of default AnnotationStyle objects
Since: 6.0

Rhino.DocObjects.Tables.DimStyleTable.FindIndex(System.Int32)
Retrieves a DimensionStyle object based on Index. This search type of search is discouraged.
We are moving towards using only IDs for all tables.
index: The index to search for.
Returns: A DimensionStyle object, or null if none was found.
Since: 6.0

Rhino.DocObjects.Tables.DimStyleTable.Add(System.String)
Adds a new AnnotationStyle to the document. The new AnnotationStyle will be initialized
with the current default AnnotationStyle properties.
name:
Name of the new AnnotationStyle. If null or empty, Rhino automatically generates the name.
Returns: index of new AnnotationStyle.
Since: 5.0

Rhino.DocObjects.Tables.DimStyleTable.Add(Rhino.DocObjects.DimensionStyle,System.Boolean)
Adds a new DimensionStyle to the document.
dimstyle: The dimension style to add
reference: if true the dimstyle will not be saved in files.
Returns: index of new AnnotationStyle.
Since: 6.0

Rhino.DocObjects.Tables.DimStyleTable.Add(System.String,System.Boolean)
Adds a new AnnotationStyle to the document. The new AnnotationStyle will be initialized
with the current default AnnotationStyle properties.
name:
Name of the new AnnotationStyle. If null or empty, Rhino automatically generates the name.
reference: if true the dimstyle will not be saved in files.
Returns: index of new AnnotationStyle.
Since: 5.0

Rhino.DocObjects.Tables.DimStyleTable.CurrentIndex
Since: 6.0

Rhino.DocObjects.Tables.DimStyleTable.CurrentId
Since: 6.0

Rhino.DocObjects.Tables.DimStyleTable.CurrentDimensionStyle
Do not use. Use the Rhino.DocObjects.Tables.DimStyleTable.Current property.
Since: 5.0

Rhino.DocObjects.Tables.DimStyleTable.Current
Returns an instance of the current Rhino.DocObjects.DimensionStyle.
Since: 6.0

Rhino.DocObjects.Tables.DimStyleTable.ComponentType
Returns Rhino.DocObjects.ModelComponentType.DimStyle.
Since: 6.0

Rhino.DocObjects.Tables.DimStyleTable.SetCurrent(System.Int32,System.Boolean)
Sets the Rhino.DocObjects.Tables.DimStyleTable.Current property.
index: The index of the current DimStyle.
quiet: true if error dialog boxes are disabled. False if they are enabled.
Returns: true if the method achieved its goal; otherwise false.
Since: 6.0

Rhino.DocObjects.Tables.DimStyleTable.SetCurrentDimensionStyleIndex(System.Int32,System.Boolean)
Do not use. Use the Rhino.DocObjects.Tables.DimStyleTable.SetCurrent(System.Int32,System.Boolean) method.
index: Do not use.
quiet: Do not use.
Returns: Do not use.
Since: 5.0
6.0

Rhino.DocObjects.Tables.DimStyleTable.Find(System.String,System.Boolean)
Since: 5.0
6.0

Rhino.DocObjects.Tables.DimStyleTable.FindName(System.String)
Finds the DimensionStyle with a given name and returns it. None is returned if no DimensionStyle is found.
name: The string to search. Deleted styles are ignored.
Returns: The instance, or null.
Since: 6.0

Rhino.DocObjects.Tables.DimStyleTable.Find(System.Guid,System.Boolean)
Since: 6.0

Rhino.DocObjects.Tables.DimStyleTable.FindRoot(System.Guid,System.Boolean)
Since: 6.0

Rhino.DocObjects.Tables.DimStyleTable.GetUnusedStyleName
Get a unique name for a style that does not already exist in the DimStyle table
Returns:
Since: 6.0

Rhino.DocObjects.Tables.DimStyleTable.GetUnusedStyleName(System.String)
Get a unique name for a dimension style that does not already exist in the DimStyle table
rootName: prefix in name; typically the parent style name
Returns:
Since: 6.0

Rhino.DocObjects.Tables.DimStyleTable.Delete(System.Int32,System.Boolean)
Since: 6.0

Rhino.DocObjects.Tables.DimStyleTable.Delete(Rhino.DocObjects.DimensionStyle)
Removes an annotation style.
item: The item to remove.
Returns: True if the item was removed; false otherwise.
Since: 6.0

Rhino.DocObjects.Tables.DimStyleTable.Modify(Rhino.DocObjects.DimensionStyle,System.Int32,System.Boolean)
Modifies dimension style settings.
newSettings: This information is copied.
dimstyleIndex:
zero based index of dimension to set. Must be in the range 0 <= dimstyleIndex < DimStyleTable.Count.
quiet: if true, information message boxes pop up when illegal changes are attempted.
Returns:
true if successful. false if dimstyleIndex is out of range
Since: 6.0

Rhino.DocObjects.Tables.DimStyleTable.Modify(Rhino.DocObjects.DimensionStyle,System.Guid,System.Boolean)
Modifies dimension style settings.
newSettings: This information is copied.
dimstyleId:  Id of dimension style
quiet: if true, information message boxes pop up when illegal changes are attempted.
Returns:
true if successful. false if Id is not already in table
Since: 6.0

Rhino.DocObjects.Tables.DimStyleTable.Modify(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.AnnotationBase)
Since: 6.0

Rhino.DocObjects.Tables.DimStyleTable.GetEnumerator
Since: 5.0