Rhino.PrivateMeshCommands.Operations.IMeshTask.ActOnto
Executes a task from a certain index onto a specific object.
When not otherwise specified, the order of points must be set as follow:
V -> E -> F

Rhino.PrivateMeshCommands.Operations.IMeshTask.StorageSize
Is particularly handy when the new OnMesh is created.
It makes possible to predict the correct length beforehand.
Returns: The length