Rhino.UI.Fonts.Style
Style for UI font.

Rhino.UI.Fonts.Style.Regular
Normal

Rhino.UI.Fonts.Style.Bold
Bold

Rhino.UI.Fonts.Style.Italic
Italic

Rhino.UI.Fonts.Style.Underline
Underline

Rhino.UI.Fonts.Style.Strikeout
Strikeout