Rhino.Render.RealtimeDisplayMode
Base class for implementing real-time display modes in .NET.
Pay special attention that in StartRenderer the RenderWindow.SetSize()
function is called if the implementation relies on the RenderWindow to
do the drawing to the viewport. If i.e. OpenGL is used to draw render
results to the viewport then SetSize() doesn't have to be called, nor
should the implementation then access channels on the RenderWindow, as
those then don't exist. For OpenGL-based drawing the RenderWindow is
used as a container for ViewInfo management, nothing else.

Rhino.Render.RealtimeDisplayMode.RegisterDisplayModes(Rhino.PlugIns.PlugIn)
Find and register classes that derive from RealtimeDisplayMode
from the given plug-in.
plugin:
Returns:
Since: 6.0

Rhino.Render.RealtimeDisplayMode.RegisterDisplayModes(System.Reflection.Assembly,System.Guid)
Find and register classes that derive from RealtimeDisplayMode
from the given plug-in. The plug-in is found in the given assembly
assembly:
pluginId:
Returns:
Since: 6.0

Rhino.Render.RealtimeDisplayMode.UnregisterDisplayModes(Rhino.PlugIns.PlugIn)
Since: 6.0

Rhino.Render.RealtimeDisplayMode.UnregisterDisplayModes(System.Reflection.Assembly,System.Guid)
Since: 6.0

Rhino.Render.RealtimeDisplayMode.GetRealtimeDisplayModeTypesFromAssembly(System.Reflection.Assembly)
Get a list of types that implement RealtimeDisplayMode and are decorated properly
with RealtimeDisplayModeClassInfoAttribute
assembly: Assembly to load RealtimeDisplayMode types from.
Returns: List of tuples with Type and RealtimeDisplayModeClassInfoAttribute instance

Rhino.Render.RealtimeDisplayMode.PostConstruct
Override PostConstruct if you need to initialize where
the underlying RealtimeDisplayMode is available.
The connection is made right after RealtimeDisplayMode
has been instantiated, but just before PostConstruct is called.
For instance finding out OpenGL information can be done in
PostConstruct.
Since: 6.0

Rhino.Render.RealtimeDisplayMode.SignalRedraw
Use to signal the underlying pipeline a redraw is wanted. This can be used
for instance when a renderer has completed a pass which should be
updated in the associated viewport.
Since: 6.0

Rhino.Render.RealtimeDisplayMode.ComputeViewportCrc(Rhino.DocObjects.ViewInfo)
Compute viewport CRC for the given ViewInfo
view:
Returns: the CRC for the given view
Since: 6.0

Rhino.Render.RealtimeDisplayMode.SetView(Rhino.DocObjects.ViewInfo)
Set ViewInfo for this RealtimeDisplayMode instance.
view: The ViewInfo to set for subsequent tests.
Since: 6.0

Rhino.Render.RealtimeDisplayMode.GetView
Get ViewInfo that has been registered with this RealtimeDisplayMode instance.
Returns:
Since: 6.0

Rhino.Render.RealtimeDisplayMode.LinearWorkflow
Returns the LinearWorkflow data for this realtime display mode.
Since: 6.0

Rhino.Render.RealtimeDisplayMode.RemoveRealtimeViewport(System.IntPtr)
Remove RealtimeDisplayMode instance from internal dictionary.
realtimeViewport: IntPtr to the RealtimeDisplayMode instance to remove.
Since: 6.0

Rhino.Render.RealtimeDisplayMode.GetRealtimeViewport(System.IntPtr)
Retrieve RealtimeDisplayMode instance that the IntPtr refers to.
realtimeViewport: IntPtr of the instance searched for. If
the instance doesn't exist, a new one is created.
Returns:
Since: 6.0

Rhino.Render.RealtimeDisplayMode.GetRealtimeViewport(System.IntPtr,System.Boolean)
Retrieve RealtimeDisplayMode instance. If create is set to true
then a new instance is created if not found, null is returned for false.
realtimeViewport: IntPtr
create: true to create if not found, false to return null if not found.
Returns:
Since: 6.0

Rhino.Render.RealtimeDisplayMode.CreateWorld(Rhino.RhinoDoc,Rhino.DocObjects.ViewInfo,Rhino.Display.DisplayPipelineAttributes)
Implement if you need to handle the initial CreateWorld call initiated by the display pipeline system. Note
that this is not the same as the CreateWorld call in Rhino.Render.ChangeQueue.ChangeQueue, although
related.
doc: Rhino document
viewInfo: active viewport info
displayPipelineAttributes: display pipeline attributes
Since: 6.0

Rhino.Render.RealtimeDisplayMode.GetRenderSize(System.Int32@,System.Int32@)
Get the current render resolution for the running render session.
width:
height:
Since: 6.0

Rhino.Render.RealtimeDisplayMode.StartRenderer(System.Int32,System.Int32,Rhino.RhinoDoc,Rhino.DocObjects.ViewInfo,Rhino.DocObjects.ViewportInfo,System.Boolean,Rhino.Render.RenderWindow)
Override to start your render engine.
Note that before using the RenderWindow you *must* call SetSize
to properly initialize the underlying DIB.
w: Width of resolution
h: Height of resolution
doc: Rhino document
view: active view
viewportInfo: active viewport info
forCapture: true if renderer is started for capture purposes (ViewCaptureTo*), false for regular interactive rendering
renderWindow: RenderWindow to hold render results in.
Returns: Return true when your render engine started correctly, false when that failed
Since: 6.0

Rhino.Render.RealtimeDisplayMode.ShutdownRenderer
Override to shutdown your render engine
Since: 6.0

Rhino.Render.RealtimeDisplayMode.LastRenderedPass
Implement to communicate last completed pass to the underlying system.
Returns: the last completed pass
Since: 6.0

Rhino.Render.RealtimeDisplayMode.ShowCaptureProgress
Override if you want to i.e. hide the progress dialog for capture progress.
Returns: Return true to show, false to hide
Since: 6.0

Rhino.Render.RealtimeDisplayMode.CaptureProgress
Override to communicate the progress of a capture.
Returns: A number between 0.0 and 1.0 inclusive. 1.0 means 100%.
Since: 6.0

Rhino.Render.RealtimeDisplayMode.OnRenderSizeChanged(System.Int32,System.Int32)
Override to restart your render engine
width:
height:
Returns:
Since: 6.0

Rhino.Render.RealtimeDisplayMode.IsRendererStarted
Override to tell the started state of your render engine.
Returns: true if render engine is ready and rendering
Since: 6.0

Rhino.Render.RealtimeDisplayMode.IsFrameBufferAvailable(Rhino.DocObjects.ViewInfo)
Implement to tell the render pipeline that a framebuffer is ready
view:
Returns: Return true when a framebuffer is ready. This is generally the
case when StartRenderer as returned successfully.
Since: 6.0

Rhino.Render.RealtimeDisplayMode.IsCompleted
Implement to tell if your render engine has completed a frame for drawing into the viewport
Returns:
Since: 6.0

Rhino.Render.RealtimeDisplayMode.OnDisplayPipelineSettingsChanged
Since: 6.0

Rhino.Render.RealtimeDisplayMode.OnInitFramebuffer
Since: 6.0

Rhino.Render.RealtimeDisplayMode.OnDrawMiddleground
Since: 6.0

Rhino.Render.RealtimeDisplayMode.DrawOpenGl
Since: 6.0

Rhino.Render.RealtimeDisplayMode.UseFastDraw
Implement and return true if you want the display pipeline to not
wait for IsFramebufferAvailable during the MiddleGround draw phase.
This will also tell the pipeline to draw a complete middleground pass in OpenGL.
Since: 6.0

Rhino.Render.RealtimeDisplayMode.SetUseDrawOpenGl(System.Boolean)
During run-time change whether to use OpenGL drawing of results or not. For instance
offline rendering (viewcapture* with different resolution than viewport) could use
RenderWindow instead of direct OpenGL drawing.
use: Set to true if OpenGL drawing is wanted, set to false if RenderWindow
method is needed.
Since: 6.0

Rhino.Render.RealtimeDisplayMode.OpenGlVersion
Since: 6.0

Rhino.Render.RealtimeDisplayMode.HudProductName
Override to return the name of your product. This will be printed in
the HUD.
Returns: Name of the product.
Since: 6.0

Rhino.Render.RealtimeDisplayMode.HudCustomStatusText
Override to display status of the render engine.
Returns: Status text to display
Since: 6.0

Rhino.Render.RealtimeDisplayMode.HudMaximumPasses
Override to communicate the maximum passes count currently in use for the render session.
Can be shown in the HUD
Returns: Maximum passes
Since: 6.0

Rhino.Render.RealtimeDisplayMode.HudLastRenderedPass
Override to communicate the last completed pass. Can be shown in the HUD
Returns: Last completed pass
Since: 6.0

Rhino.Render.RealtimeDisplayMode.HudRendererPaused
Implement to support pausing and resuming in the viewport
Returns: Return true if the render engine is paused.
Since: 6.0

Rhino.Render.RealtimeDisplayMode.HudRendererLocked
Implement to support locking in the viewport
Returns: Return true if the render engine is locked.
Since: 6.0

Rhino.Render.RealtimeDisplayMode.HudAllowEditMaxPasses
Override to allow maximum pass editing. By default disabled.
Returns: Return true to allow users to edit the maximum pass count.
Since: 6.0

Rhino.Render.RealtimeDisplayMode.HudShowMaxPasses
Override to show maximum passes in HUD. By default disabled.
Returns: Return true to show maximum passes.
Since: 6.0

Rhino.Render.RealtimeDisplayMode.HudShowPasses
Override to show current pass in HUD. By default disabled.
Returns: Return true to show current pass in HUD.
Since: 6.0

Rhino.Render.RealtimeDisplayMode.HudShowCustomStatusText
Override to show status text in HUD. By default disabled.
Returns: Return true to show status text in HUD
Since: 6.0

Rhino.Render.RealtimeDisplayMode.HudShowControls
Show control buttons on the realtime display HUD.
By default these are shown, override this function and
return false if HUD controls aren't needed.
Returns:
Since: 6.0

Rhino.Render.RealtimeDisplayMode.HudShow
Override if you want to hide the HUD. Shown by default
Returns: Return false to hide the HUD.
Since: 6.0

Rhino.Render.RealtimeDisplayMode.in_the_beginning
Begin of epoch for timestamp calculation.

Rhino.Render.RealtimeDisplayMode.HudStartTime
Since: 6.0

Rhino.Render.RealtimeDisplayMode.HudPlayButtonPressed
Listen to this event if you want to handle the play button control.
Since: 6.0

Rhino.Render.RealtimeDisplayMode.HudPlayButtonLeftClicked
Since: 7.0

Rhino.Render.RealtimeDisplayMode.HudPlayButtonRightClicked
Since: 7.0

Rhino.Render.RealtimeDisplayMode.HudPlayButtonDoubleClicked
Since: 7.0

Rhino.Render.RealtimeDisplayMode.HudPauseButtonPressed
Listen tot his event if you want to handle the pause button control
Since: 6.0

Rhino.Render.RealtimeDisplayMode.HudPauseButtonLeftClicked
Since: 7.0

Rhino.Render.RealtimeDisplayMode.HudPauseButtonRightClicked
Since: 7.0

Rhino.Render.RealtimeDisplayMode.HudPauseButtonDoubleClicked
Since: 7.0

Rhino.Render.RealtimeDisplayMode.HudLockButtonPressed
Listen tot his event if you want to handle the lock button control
Since: 6.0

Rhino.Render.RealtimeDisplayMode.HudLockButtonLeftClicked
Since: 7.0

Rhino.Render.RealtimeDisplayMode.HudLockButtonRightClicked
Since: 7.0

Rhino.Render.RealtimeDisplayMode.HudLockButtonDoubleClicked
Since: 7.0

Rhino.Render.RealtimeDisplayMode.HudUnlockButtonPressed
Listen tot his event if you want to handle the unlock button control
Since: 6.0

Rhino.Render.RealtimeDisplayMode.HudUnlockButtonLeftClicked
Since: 7.0

Rhino.Render.RealtimeDisplayMode.HudUnlockButtonRightClicked
Since: 7.0

Rhino.Render.RealtimeDisplayMode.HudUnlockButtonDoubleClicked
Since: 7.0

Rhino.Render.RealtimeDisplayMode.HudProductNamePressed
Listen tot his event if you want to handle a press on the product name component
Since: 6.0

Rhino.Render.RealtimeDisplayMode.HudProductNameLeftClicked
Since: 7.0

Rhino.Render.RealtimeDisplayMode.HudProductNameRightClicked
Since: 7.0

Rhino.Render.RealtimeDisplayMode.HudProductNameDoubleClicked
Since: 7.0

Rhino.Render.RealtimeDisplayMode.HudStatusTextPressed
Listen tot his event if you want to handle a press on the status text component
Since: 6.0

Rhino.Render.RealtimeDisplayMode.HudStatusTextLeftClicked
Since: 7.0

Rhino.Render.RealtimeDisplayMode.HudStatusTextRightClicked
Since: 7.0

Rhino.Render.RealtimeDisplayMode.HudStatusTextDoubleClicked
Since: 7.0

Rhino.Render.RealtimeDisplayMode.HudTimePressed
Listen tot his event if you want to handle a press press on the time component
Since: 6.0

Rhino.Render.RealtimeDisplayMode.HudTimeLeftClicked
Since: 7.0

Rhino.Render.RealtimeDisplayMode.HudTimeRightClicked
Since: 7.0

Rhino.Render.RealtimeDisplayMode.HudTimeDoubleClicked
Since: 7.0

Rhino.Render.RealtimeDisplayMode.HudPostEffectsOnButtonLeftClicked
Since: 7.0

Rhino.Render.RealtimeDisplayMode.HudPostEffectsOnButtonRightClicked
Since: 7.0

Rhino.Render.RealtimeDisplayMode.HudPostEffectsOnButtonDoubleClicked
Since: 7.0

Rhino.Render.RealtimeDisplayMode.HudPostEffectsOffButtonLeftClicked
Since: 7.0

Rhino.Render.RealtimeDisplayMode.HudPostEffectsOffButtonRightClicked
Since: 7.0

Rhino.Render.RealtimeDisplayMode.HudPostEffectsOffButtonDoubleClicked
Since: 7.0

Rhino.Render.RealtimeDisplayMode.Paused
Since: 6.6

Rhino.Render.RealtimeDisplayMode.Locked
Since: 6.6

Rhino.Render.RealtimeDisplayMode.PostEffectsOn
Since: 7.1

Rhino.Render.RealtimeDisplayMode.MaxPasses
Since: 6.6

Rhino.Render.RealtimeDisplayMode.MaxPassesChanged
Listen to this if you want to handle changes in maximum pass count through
the HUD.
Since: 6.0