Rhino.Geometry.Sphere
Represents the plane and radius values of a sphere.

Rhino.Geometry.Sphere.#ctor(Rhino.Geometry.Point3d,System.Double)
Initializes a new sphere given center point and radius.
center: A center point.
radius: A radius value.
Since: 5.0

Rhino.Geometry.Sphere.#ctor(Rhino.Geometry.Plane,System.Double)
Initializes a new sphere given the plane of the equator circle and radius.
equatorialPlane: A plane that will be intersecting
the sphere at the same distance from both poles (parameterization
singularities).
radius: A radius value.
Since: 5.0

Rhino.Geometry.Sphere.Unset
Gets a sphere with invalid members.
Since: 5.0

Rhino.Geometry.Sphere.FitSphereToPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Attempts to fit a sphere to a collection of points.
points: Points to fit. The collection must contain at least three points.
Returns: The Sphere that best approximates the points or Sphere.Unset on failure.
Since: 5.0

Rhino.Geometry.Sphere.IsValid
Gets a value that indicates whether the sphere is valid.
Since: 5.0

Rhino.Geometry.Sphere.BoundingBox
Gets the world aligned bounding box for this Sphere.
If the Sphere is Invalid, an empty box is returned.
Since: 5.0

Rhino.Geometry.Sphere.Diameter
Gets or sets the diameter for this sphere.
Since: 5.0

Rhino.Geometry.Sphere.Radius
Gets or sets the Radius for this sphere.
Since: 5.0

Rhino.Geometry.Sphere.EquitorialPlane
Gets or sets the Equatorial plane for this sphere.
Since: 5.0

Rhino.Geometry.Sphere.EquatorialPlane
Gets or sets the Equatorial plane for this sphere.
Since: 6.0

Rhino.Geometry.Sphere.Center
Gets or sets the center point of the sphere.
Since: 5.0

Rhino.Geometry.Sphere.NorthPole
Gets the point at the North Pole of the sphere.
This is the parameterization singularity that can be obtained,
at V value +Math.Pi/2.
Since: 5.0

Rhino.Geometry.Sphere.SouthPole
Gets the point at the South Pole of the sphere.
This is the parameterization singularity that can be obtained,
at V value -Math.Pi/2.
Since: 5.0

Rhino.Geometry.Sphere.LatitudeRadians(System.Double)
Computes the parallel at a specific latitude angle.
The angle is specified in radians.
radians: An angle in radians for the parallel.
Returns: A circle.
Since: 5.0

Rhino.Geometry.Sphere.LatitudeDegrees(System.Double)
Computes the parallel at a specific latitude angle.
The angle is specified in degrees.
degrees: An angle in degrees for the meridian.
Returns: A circle.
Since: 5.0

Rhino.Geometry.Sphere.LongitudeRadians(System.Double)
Computes the meridian at a specific longitude angle.
The angle is specified in radians.
radians: An angle in radians.
Returns: A circle.
Since: 5.0

Rhino.Geometry.Sphere.LongitudeDegrees(System.Double)
Computes the meridian at a specific longitude angle.
The angle is specified in degrees.
degrees: An angle in degrees.
Returns: A circle.
Since: 5.0

Rhino.Geometry.Sphere.PointAt(System.Double,System.Double)
Evaluates the sphere at specific longitude and latitude angles.
longitudeRadians: A number within the interval [0, 2pi].
latitudeRadians: A number within the interval [-pi/2,pi/2].
Returns: A point value.
Since: 5.0

Rhino.Geometry.Sphere.NormalAt(System.Double,System.Double)
Computes the normal at a specific angular location on the sphere.
longitudeRadians: A number within the interval [0, 2pi].
latitudeRadians: A number within the interval [-pi/2, pi/2].
Returns: A vector.
Since: 5.0

Rhino.Geometry.Sphere.ClosestPoint(Rhino.Geometry.Point3d)
Returns point on sphere that is closest to given point.
testPoint: Point to project onto Sphere.
Returns: Point on sphere surface closest to testPoint.
Since: 5.0

Rhino.Geometry.Sphere.ClosestParameter(Rhino.Geometry.Point3d,System.Double@,System.Double@)
Finds the angle parameters on this sphere that are closest to a test point.
testPoint: Point to project onto the sphere.
longitudeRadians: The longitudinal angle (in radians; 0.0 to 2pi) where the sphere approaches testPoint best.
latitudeRadians: The latitudinal angle (in radians; -0.5pi to +0.5pi) where the sphere approaches testPoint best.
Returns: true on success, false on failure. This function will fail if the point it coincident with the sphere center.
Since: 5.0

Rhino.Geometry.Sphere.Rotate(System.Double,System.Double,Rhino.Geometry.Vector3d)
Rotates this sphere about the center point.
sinAngle: sin(angle)
cosAngle: cos(angle)
axisOfRotation: The direction of the axis of rotation.
Returns: true on success; false on failure.
Since: 5.0

Rhino.Geometry.Sphere.Rotate(System.Double,Rhino.Geometry.Vector3d)
Rotates the sphere about the center point.
angleRadians: Angle of rotation (in radians)
axisOfRotation: Rotation axis.
Returns: true on success; false on failure.
Since: 5.0

Rhino.Geometry.Sphere.Rotate(System.Double,System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Rotates this sphere about a point and an axis.
sinAngle: sin(angle)
cosAngle: cod(angle)
axisOfRotation: Axis of rotation.
centerOfRotation: Center of rotation.
Returns: true on success; false on failure.
Since: 5.0

Rhino.Geometry.Sphere.Rotate(System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Rotates this sphere about a point and an axis.
angleRadians: Rotation angle (in Radians)
axisOfRotation: Axis of rotation.
centerOfRotation: Center of rotation.
Returns: true on success; false on failure.
Since: 5.0

Rhino.Geometry.Sphere.Translate(Rhino.Geometry.Vector3d)
Moves this sphere along a motion vector.
delta: Motion vector.
Returns: true on success; false on failure.
Since: 5.0

Rhino.Geometry.Sphere.Transform(Rhino.Geometry.Transform)
Transforms this sphere. Note that non-similarity preserving transformations
cannot be applied to a sphere as that would result in an ellipsoid.
xform: Transformation matrix to apply.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Sphere.ToBrep
Converts this sphere is it Brep representation
Returns:
Since: 5.0

Rhino.Geometry.Sphere.ToNurbsSurface
Converts this sphere to its NurbsSurface representation.
This is synonymous with calling NurbsSurface.CreateFromSphere().
Returns: A nurbs surface representation of this sphere or null.
Since: 5.0

Rhino.Geometry.Sphere.ToRevSurface
Converts this Sphere to a RevSurface representation.
This is synonymous with calling RevSurface.CreateFromSphere().
Returns: A surface of revolution representation of this sphere or null.
Since: 5.0

Rhino.Geometry.Sphere.EpsilonEquals(Rhino.Geometry.Sphere,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:
Since: 5.4