Rhino.DocObjects.DimensionStyle
Can also be considered an annotation style since it is used for
more than just dimensions

Rhino.DocObjects.DimensionStyle.#ctor
Create a new non-document controlled annotation style
Since: 5.0

Rhino.DocObjects.DimensionStyle.Duplicate
Construct a deep (full) copy of this object.
Returns: An object of the same type as this, with the same properties and behavior.
Since: 6.0

Rhino.DocObjects.DimensionStyle.Duplicate(System.String,System.Guid,System.Guid)
Construct a deep (full) copy of this object.
Returns: An object of the same type as this, with the same properties and behavior.
Since: 6.0

Rhino.DocObjects.DimensionStyle.CopyFrom(Rhino.DocObjects.DimensionStyle)
Copy settings from source dimension style without changing the name, Id or
index of this DimensionStyle.
source:
DimensionStyle to copy settings from.
Since: 6.0

Rhino.DocObjects.DimensionStyle.ComponentType
Returns Rhino.DocObjects.ModelComponentType.DimStyle.
Since: 6.0

Rhino.DocObjects.DimensionStyle.IsReference
Since: 5.0

Rhino.DocObjects.DimensionStyle.IsDeleted
Since: 6.0

Rhino.DocObjects.DimensionStyle.Font
Since: 6.0

Rhino.DocObjects.DimensionStyle.CreatePreviewBitmap(System.Int32,System.Int32)
Since: 6.0

Rhino.DocObjects.DimensionStyle.ScaleLengthValues(System.Double)
Scales all length values by 'scale'
scale:
Since: 6.0

Rhino.DocObjects.DimensionStyle.ArrowBlockId1
Since: 6.0

Rhino.DocObjects.DimensionStyle.ArrowBlockId2
Since: 6.0

Rhino.DocObjects.DimensionStyle.LeaderArrowBlockId
Since: 6.0

Rhino.DocObjects.DimensionStyle.SuppressExtension1
Since: 6.0

Rhino.DocObjects.DimensionStyle.SuppressExtension2
Since: 6.0

Rhino.DocObjects.DimensionStyle.SuppressArrow1
Since: 6.0

Rhino.DocObjects.DimensionStyle.SuppressArrow2
Since: 6.0

Rhino.DocObjects.DimensionStyle.AlternateUnitsDisplay
Since: 6.0

Rhino.DocObjects.DimensionStyle.AlternateBelowLine
Since: 6.0

Rhino.DocObjects.DimensionStyle.DrawTextMask
Since: 6.0

Rhino.DocObjects.DimensionStyle.FixedExtensionOn
Since: 6.0

Rhino.DocObjects.DimensionStyle.LeaderHasLanding
Since: 6.0

Rhino.DocObjects.DimensionStyle.DrawForward
Since: 6.0

Rhino.DocObjects.DimensionStyle.TextUnderlined
Since: 6.0

Rhino.DocObjects.DimensionStyle.MaskOffset
Since: 6.0

Rhino.DocObjects.DimensionStyle.ExtensionLineExtension
Since: 5.0

Rhino.DocObjects.DimensionStyle.ExtensionLineOffset
Since: 5.0

Rhino.DocObjects.DimensionStyle.DimensionLineExtension
Since: 6.0

Rhino.DocObjects.DimensionStyle.ArrowLength
Since: 5.0

Rhino.DocObjects.DimensionStyle.LeaderArrowLength
Since: 5.0

Rhino.DocObjects.DimensionStyle.CentermarkSize
Since: 5.0

Rhino.DocObjects.DimensionStyle.TextGap
Since: 5.0

Rhino.DocObjects.DimensionStyle.TextHeight
Since: 5.0

Rhino.DocObjects.DimensionStyle.LengthFactor
Since: 5.0

Rhino.DocObjects.DimensionStyle.AlternateLengthFactor
Since: 5.0

Rhino.DocObjects.DimensionStyle.ToleranceUpperValue
Since: 6.0

Rhino.DocObjects.DimensionStyle.ToleranceLowerValue
Since: 6.0

Rhino.DocObjects.DimensionStyle.ToleranceHeightScale
Since: 6.0

Rhino.DocObjects.DimensionStyle.BaselineSpacing
Since: 6.0

Rhino.DocObjects.DimensionStyle.DimensionScale
Since: 6.0

Rhino.DocObjects.DimensionStyle.FixedExtensionLength
Since: 6.0

Rhino.DocObjects.DimensionStyle.TextRotation
Since: 6.0

Rhino.DocObjects.DimensionStyle.StackHeightScale
Since: 6.0

Rhino.DocObjects.DimensionStyle.Roundoff
Since: 6.0

Rhino.DocObjects.DimensionStyle.AlternateRoundoff
Since: 6.0

Rhino.DocObjects.DimensionStyle.AngularRoundoff
Since: 6.0

Rhino.DocObjects.DimensionStyle.LeaderLandingLength
Since: 6.0

Rhino.DocObjects.DimensionStyle.LeaderTextRotationRadians
Angle of leader text for Rotated style
Since: 6.0

Rhino.DocObjects.DimensionStyle.LeaderTextRotationDegrees
Since: 6.0

Rhino.DocObjects.DimensionStyle.DimensionScaleValue
Since: 6.0

Rhino.DocObjects.DimensionStyle.ScaleLeftLengthMillimeters
Since: 6.0

Rhino.DocObjects.DimensionStyle.ScaleRightLengthMillimeters
Since: 6.0

Rhino.DocObjects.DimensionStyle.FitText
Since: 6.20

Rhino.DocObjects.DimensionStyle.FitArrow
Since: 6.20

Rhino.DocObjects.DimensionStyle.ForceDimensionLineBetweenExtensionLines
Since: 6.20

Rhino.DocObjects.DimensionStyle.DimensionLengthDisplay
Since: 6.0

Rhino.DocObjects.DimensionStyle.AlternateDimensionLengthDisplay
Since: 6.0

Rhino.DocObjects.DimensionStyle.UnitSystem
The dimension style's own unit system. This is what the style's lengths - text height,
arrow size and so on - are expressed in, and openNURBS uses it internally to get scales
right when annotation moves between model space, page space and instance definitions
whose unit systems differ. A style that reports
Rhino.UnitSystem.None has no unit system of its own, and unknown scales
resolve to 1.
Since: 8.36

Rhino.DocObjects.DimensionStyle.DimensionLengthDisplayUnit(System.UInt32)
Since: 6.0

Rhino.DocObjects.DimensionStyle.AlternateDimensionLengthDisplayUnit(System.UInt32)
Since: 6.0

Rhino.DocObjects.DimensionStyle.AngleFormat
Since: 6.0

Rhino.DocObjects.DimensionStyle.ToleranceFormat
Since: 6.0

Rhino.DocObjects.DimensionStyle.MaskColorSource
Since: 6.0

Rhino.DocObjects.DimensionStyle.MaskFrameType
Since: 7.0

Rhino.DocObjects.DimensionStyle.StackFractionFormat
Since: 6.0

Rhino.DocObjects.DimensionStyle.ZeroSuppress
Since: 6.0

Rhino.DocObjects.DimensionStyle.AlternateZeroSuppress
Since: 6.0

Rhino.DocObjects.DimensionStyle.ToleranceZeroSuppress
Since: 6.0

Rhino.DocObjects.DimensionStyle.AngleZeroSuppress
Since: 6.0

Rhino.DocObjects.DimensionStyle.ArrowType1
Since: 6.0

Rhino.DocObjects.DimensionStyle.ArrowType2
Since: 6.0

Rhino.DocObjects.DimensionStyle.LeaderArrowType
Since: 5.6

Rhino.DocObjects.DimensionStyle.TextMoveLeader
Since: 6.0

Rhino.DocObjects.DimensionStyle.ArcLengthSymbol
Since: 6.0

Rhino.DocObjects.DimensionStyle.CenterMarkType
Since: 6.0

Rhino.DocObjects.DimensionStyle.LeaderContentAngleType
Style of leader content angle
Horizontal
Aligned
Rotated
Since: 6.0

Rhino.DocObjects.DimensionStyle.TextVerticalAlignment
Since: 6.0

Rhino.DocObjects.DimensionStyle.TextHorizontalAlignment
Since: 6.0

Rhino.DocObjects.DimensionStyle.LeaderTextVerticalAlignment
Since: 6.0

Rhino.DocObjects.DimensionStyle.LeaderTextHorizontalAlignment
Since: 6.0

Rhino.DocObjects.DimensionStyle.DimTextLocation
Since: 6.0

Rhino.DocObjects.DimensionStyle.DimRadialTextLocation
Since: 6.0

Rhino.DocObjects.DimensionStyle.LeaderCurveType
Since: 6.0

Rhino.DocObjects.DimensionStyle.DimTextAngleType
Since: 6.0

Rhino.DocObjects.DimensionStyle.DimRadialTextAngleType
Since: 6.0

Rhino.DocObjects.DimensionStyle.TextOrientation
Since: 6.0

Rhino.DocObjects.DimensionStyle.LeaderTextOrientation
Since: 6.0

Rhino.DocObjects.DimensionStyle.DimTextOrientation
Since: 6.0

Rhino.DocObjects.DimensionStyle.DimRadialTextOrientation
Since: 6.0

Rhino.DocObjects.DimensionStyle.LengthResolution
Since: 5.0

Rhino.DocObjects.DimensionStyle.AlternateLengthResolution
Since: 6.0

Rhino.DocObjects.DimensionStyle.AngleResolution
Since: 5.0

Rhino.DocObjects.DimensionStyle.ToleranceResolution
Since: 6.0

Rhino.DocObjects.DimensionStyle.AlternateToleranceResolution
Since: 6.0

Rhino.DocObjects.DimensionStyle.MaskColor
Since: 6.0

Rhino.DocObjects.DimensionStyle.DecimalSeparator
Since: 7.0

Rhino.DocObjects.DimensionStyle.Prefix
Since: 5.0

Rhino.DocObjects.DimensionStyle.Suffix
Since: 5.0

Rhino.DocObjects.DimensionStyle.AlternatePrefix
Since: 6.0

Rhino.DocObjects.DimensionStyle.AlternateSuffix
Since: 6.0

Rhino.DocObjects.DimensionStyle.IsFieldOverriden(Rhino.DocObjects.DimensionStyle.Field)
Normally, a DimensionStyle is neither a Child nor a Parent.
Setting the value of DimensionStyle.ParentId to the Id of another
DimensionStyle makes that style the Parent of this style.
Fields in a DimensionStyle can get their values from the
Child style or the Parent style.
If a field is marked overridden in the Child style,
the value of that field comes from the Parent.
Typically, when an individual field is overridden for a specific annotation
object, a Child DimensionStyle is made with that field marked as
an overridden field (SetFieldOverride()) and that DimensionStyle is
made the Child of the annotation object's DimensionStyle.
Then the DimensionStyleId of the annotation object is set to the
Id of the Child style
Returns:
True if the field corresponding to field_id is overridden in this AnnotationStyle
False if the field is not overridden
Since: 6.0

Rhino.DocObjects.DimensionStyle.SetFieldOverride(Rhino.DocObjects.DimensionStyle.Field)
Set a field as overridden
field:
Since: 6.0

Rhino.DocObjects.DimensionStyle.ClearFieldOverride(Rhino.DocObjects.DimensionStyle.Field)
Set the field as not overridden
field:
Since: 6.0

Rhino.DocObjects.DimensionStyle.ClearAllFieldOverrides
Sets all the fields in this DimensionStyle to be not overridden
Does not change any dimstyle_id's or parent_id's
Since: 6.0

Rhino.DocObjects.DimensionStyle.HasFieldOverrides
Checks if any fields in this DimensionStyle are overrides
Returns:
True if any fields are overrides
False is no fields are overrides
Since: 6.0

Rhino.DocObjects.DimensionStyle.IsChild
Tests if this DimensionStyle is a child of any other DimensionStyle
Returns:
True if this is a child DimensionStyle,
False otherwise.
Since: 6.0

Rhino.DocObjects.DimensionStyle.IsChildOf(System.Guid)
Tests if this DimensionStyle is a child of a specific DimensionStyle
parentId:
Returns:
True if this is a child of the DimensionStyle with Parent
False otherwise.
Since: 6.0

Rhino.DocObjects.DimensionStyle.ParentId
Get or Set the Id of this DimensionStyle's parent.
If ParentId is Guid.Empty, this DimensionStyle has no parent
Since: 6.0

Rhino.DocObjects.DimensionStyle.SetUserString(System.String,System.String)
Attach a user string (key,value combination) to this geometry.
key: id used to retrieve this string.
value: string associated with key.
Returns: true on success.
Since: 8.9

Rhino.DocObjects.DimensionStyle.GetUserString(System.String)
Gets user string from this geometry.
key: id used to retrieve the string.
Returns: string associated with the key if successful. null if no key was found.
Since: 8.9

Rhino.DocObjects.DimensionStyle.UserStringCount
Gets the amount of user strings.
Since: 8.9

Rhino.DocObjects.DimensionStyle.GetUserStrings
Gets a copy of all (user key string, user value string) pairs attached to this geometry.
Returns: A new collection.
Since: 8.9

Rhino.DocObjects.DimensionStyle.DeleteUserString(System.String)
Since: 8.9

Rhino.DocObjects.DimensionStyle.DeleteAllUserStrings
Since: 8.9