Rhino.FileIO.File3dmObject
Used to store geometry table object definition and attributes in a File3dm.

Rhino.FileIO.File3dmObject.Geometry
Gets the geometry that is linked with this document object.
Since: 5.0

Rhino.FileIO.File3dmObject.Attributes
Gets the attributes that are linked with this document object.
Since: 5.0

Rhino.FileIO.File3dmObject.Name
Gets or sets the Name of the object. Equivalent to this.Attributes.Name.
Since: 5.0

Rhino.FileIO.File3dmObject.ComponentType
Returns Rhino.DocObjects.ModelComponentType.ModelGeometry.
Since: 6.0

Rhino.FileIO.File3dmObject.Equals(System.Object)
Verified that two objects refer to the same object in a document.
obj: The other item to test.
Returns: true is the two objects coincide.

Rhino.FileIO.File3dmObject.Equals(Rhino.FileIO.File3dmObject)
Verified that two File3dmObject items refer to the same object in a document.
other: The other item to test.
Returns: true is the two objects coincide.
Since: 6.0

Rhino.FileIO.File3dmObject.GetHashCode
Provides an hash code for this item.
Returns: The hash code.

Rhino.FileIO.File3dmObject.TryReadUserData(System.Guid,System.Boolean,System.Func{Rhino.FileIO.File3dm,Rhino.FileIO.BinaryArchiveReader,System.Boolean})
Attempts to read a Rhino plug-in's custom userdata from the Rhino.FileIO.File3dmObject object.
userDataId: The id of the custom userdata object whose data you want to try to read
readFromAttributes:
Set true to attempt to read custom userdata object from the object's Rhino.FileIO.File3dmObject.Attributes.
Set false to attempt to read custom userdata object from the object's Rhino.FileIO.File3dmObject.Geometry.
dataReader:
The function that will read the data.
This function must be implemented identical to the originating Rhino.DocObjects.Custom.UserData-inherited class's Read method.
Returns: The value returned by the data reading function if successful, false otherwise.

Rhino.FileIO.File3dmObject.GetTextureMapping(System.Int32,Rhino.Geometry.Transform@)
Gets the texture mapping from the Rhino.FileIO.File3dmObject object.
mappingChannelId: The mapping channel id to search for.
xform: The transformation that was applied to the mapping.
Returns: The texture mapping if found, null otherwise.
Since: 8.9