Rhino.DocObjects.Font.FontStyle
Vertical angle of font
Upright, Italic, or Oblique

Rhino.DocObjects.Font.FontStyle.Unset
Not set.

Rhino.DocObjects.Font.FontStyle.Upright
Default font style.

Rhino.DocObjects.Font.FontStyle.Italic
The face is sloped so the top is to the right of the base.
Face names sometimes use the word "oblique" for italic faces.

Rhino.DocObjects.Font.FontStyle.Oblique
The face is sloped so the top is to the left of the base.
This is extremely rare.
NOTE WELL: Face names sometimes use the word "oblique" for italic faces.