Rhino.Geometry.CurveOffsetCornerStyle
Defines enumerated values for all implemented corner styles in curve offsets.
Since: 5.0

Rhino.Geometry.CurveOffsetCornerStyle.None
The default value.

Rhino.Geometry.CurveOffsetCornerStyle.Sharp
Offsets and extends curves with a straight line until they intersect.

Rhino.Geometry.CurveOffsetCornerStyle.Round
Offsets and fillets curves with an arc of radius equal to the offset distance.

Rhino.Geometry.CurveOffsetCornerStyle.Smooth
Offsets and connects curves with a smooth (G1 continuity) curve.

Rhino.Geometry.CurveOffsetCornerStyle.Chamfer
Offsets and connects curves with a straight line between their endpoints.