Rhino.Geometry.HiddenLineDrawing
Represents a hidden line drawing object.
A hidden line drawing consists of curves generated from source objects.
The curves correspond to edges, and silhouettes of  source objects and
intersections with cutting planes.

Rhino.Geometry.HiddenLineDrawing.Compute(Rhino.Geometry.HiddenLineDrawingParameters,System.Boolean)
Perform the hidden line drawing calculation based on input parameters
parameters:
multipleThreads:
Returns: Results of calculation on success, null on failure
Since: 6.0

Rhino.Geometry.HiddenLineDrawing.Compute(Rhino.Geometry.HiddenLineDrawingParameters,System.Boolean,System.IProgress{System.Double},System.Threading.CancellationToken)
Perform the hidden line drawing calculation based on input parameters
parameters:
multipleThreads:
progress:
cancelToken:
Returns: Results of calculation on success, null on failure or cancellation
Since: 6.0

Rhino.Geometry.HiddenLineDrawing.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Geometry.HiddenLineDrawing.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 6.0

Rhino.Geometry.HiddenLineDrawing.#ctor
Construct an empty hidden line drawing.

Rhino.Geometry.HiddenLineDrawing.Objects
Objects in the hidden line drawing. There is one object for each
piece of geometry added in the input parameters.

Rhino.Geometry.HiddenLineDrawing.FullCurves
Full curve objects calculated by the hidden line drawing.

Rhino.Geometry.HiddenLineDrawing.Segments
Sub-curve objects calculated by the hidden line drawing.
Since: 6.0

Rhino.Geometry.HiddenLineDrawing.Points
Point objects calculated by the hidden line drawing.
Since: 6.8

Rhino.Geometry.HiddenLineDrawing.AddObject(Rhino.Geometry.GeometryBase,Rhino.Geometry.Transform,System.Int32)
Add Brep, Curve, Extrusion, or Mesh that is to be drawn.
geometry: The geometry to be drawn.
xform: A transformation to apply to geometry to place it in the world coordinate system.
tagIndex: A value used to cross-reference the geometry, such as a layer index.
Returns: Index of the object, or -1 if the geometry type is not supported.

Rhino.Geometry.HiddenLineDrawing.Compute(System.Boolean)
Computes the hidden line drawing for the objects.
allowUseThreads: If true multiprocessors may be used to speed up the calculation.
Returns: true when drawing completes without error.

Rhino.Geometry.HiddenLineDrawing.Compute(System.Boolean,System.IProgress{System.Double},System.Threading.CancellationToken)
Computes the hidden line drawing for the objects.
allowUseThreads: If true multiprocessors may be used to speed up the calculation.
progress: Provider for progress updates.
cancelToken: Notification that the operation should be canceled.
Returns: true when drawing completes without error.

Rhino.Geometry.HiddenLineDrawing.Flatten
Flatten, or project, all full curves to the x-y plane in HLD-coordinates.

Rhino.Geometry.HiddenLineDrawing.RejoinCompatibleVisible
Join consecutive visible curves from a single FullCurve
Since: 8.0

Rhino.Geometry.HiddenLineDrawing.Viewport
Returns the ViewportInfo used by the hidden line drawing.
Returns: The ViewportInfo
Since: 6.0

Rhino.Geometry.HiddenLineDrawing.BoundingBox(System.Boolean)
Get tight bounding box of the hidden line drawing.
includeHidden: Include hidden objects.
Returns: The tight bounding box.
Since: 6.0

Rhino.Geometry.HiddenLineDrawing.WorldToHiddenLine
Returns the world-coordinate system to HLD-coordinate system transformation.
Since: 6.0