Rhino.Render.ChangeQueue.ChangeQueue.BakingFunctions
Enumeration of functions for baking to conduct.
Since: 6.0

Rhino.Render.ChangeQueue.ChangeQueue.BakingFunctions.None
No baking

Rhino.Render.ChangeQueue.ChangeQueue.BakingFunctions.Decals
Bake decals

Rhino.Render.ChangeQueue.ChangeQueue.BakingFunctions.ProceduralTextures
Bake procedural textures

Rhino.Render.ChangeQueue.ChangeQueue.BakingFunctions.CustomObjectMappings
Bake custom object mappings

Rhino.Render.ChangeQueue.ChangeQueue.BakingFunctions.WcsBasedMappings
Bake WCS-based mappings

Rhino.Render.ChangeQueue.ChangeQueue.BakingFunctions.MultipleMappingChannels
Bake multiple mapping channels

Rhino.Render.ChangeQueue.ChangeQueue.BakingFunctions.NoRepeatTextures
Bake no-repeat textures

Rhino.Render.ChangeQueue.ChangeQueue.BakingFunctions.All
Bake everything