Rhino.Input.Custom.GetPointDrawEventArgs
Arguments for drawing during point getting.

Rhino.Input.Custom.GetPointDrawEventArgs.CurrentPoint
Since: 5.0

Rhino.Input.Custom.GetPointDrawEventArgs.Source
GetPoint class that this draw event originated from.
Since: 5.0