Rhino.Render.CrcRenderHashFlags
Since: 6.2

Rhino.Render.CrcRenderHashFlags.Normal
Normal render CRC; nothing is excluded.

Rhino.Render.CrcRenderHashFlags.ExcludeLinearWorkflow
Linear Workflow color and texture changes are not included.

Rhino.Render.CrcRenderHashFlags.ExcludeLocalMapping
Local mapping is excluded (only used by Textures).

Rhino.Render.CrcRenderHashFlags.ExcludeUnits
Units are excluded (only used by Textures).

Rhino.Render.CrcRenderHashFlags.Reserved2
Reserved for future use

Rhino.Render.CrcRenderHashFlags.ForSimulation
Use this flag when simulating

Rhino.Render.CrcRenderHashFlags.ExcludeDocumentEffects
Use this flag when you want to calculate the CRC independantly of any effect the document has on the content.