Rhino.Display.Color4f
Color defined by 4 floating point values.

Rhino.Display.Color4f.#ctor(System.Drawing.Color)
Since: 5.0

Rhino.Display.Color4f.#ctor(Rhino.Display.Color4f)
Since: 5.0

Rhino.Display.Color4f.#ctor(System.Single,System.Single,System.Single,System.Single)
Since: 5.0

Rhino.Display.Color4f.#ctor(System.Int32)
Since: 7.0

Rhino.Display.Color4f.Empty
Since: 5.0

Rhino.Display.Color4f.Black
Since: 5.0

Rhino.Display.Color4f.White
Since: 5.0

Rhino.Display.Color4f.FromArgb(System.Single,System.Single,System.Single,System.Single)
Since: 5.11

Rhino.Display.Color4f.FromArgb(System.Single,Rhino.Display.Color4f)
Since: 5.11

Rhino.Display.Color4f.R
Since: 5.0

Rhino.Display.Color4f.G
Since: 5.0

Rhino.Display.Color4f.B
Since: 5.0

Rhino.Display.Color4f.A
Since: 5.0

Rhino.Display.Color4f.L
Since: 6.3

Rhino.Display.Color4f.op_Equality(Rhino.Display.Color4f,Rhino.Display.Color4f)
Since: 5.0

Rhino.Display.Color4f.op_Inequality(Rhino.Display.Color4f,Rhino.Display.Color4f)
Since: 5.0

Rhino.Display.Color4f.BlendTo(System.Single,Rhino.Display.Color4f)
Since: 5.0

Rhino.Display.Color4f.ApplyGamma(Rhino.Display.Color4f,System.Single)
Since: 6.0

Rhino.Display.Color4f.AsSystemColor
Since: 5.0