Rhino.Render.TextureMappingType
Defines enumerated constants for mapping types such as planar, cylindrical or spherical.
Since: 5.0

Rhino.Render.TextureMappingType.None
No mapping is selected.

Rhino.Render.TextureMappingType.SurfaceParameters
(u, v) = linear transform of surface params, w = 0.

Rhino.Render.TextureMappingType.PlaneMapping
(u, v, w) = 3d coordinates wrt frame.

Rhino.Render.TextureMappingType.CylinderMapping
(u, v, w) = longitude, height, radius.

Rhino.Render.TextureMappingType.SphereMapping
(u, v, w) = longitude,latitude,radius.

Rhino.Render.TextureMappingType.BoxMapping
Box mapping type.

Rhino.Render.TextureMappingType.MeshMappingPrimitive
Mapping primitive is a mesh.

Rhino.Render.TextureMappingType.SurfaceMappingPrimitive
Mapping primitive is a surface.

Rhino.Render.TextureMappingType.BrepMappingPrimitive
Mapping primitive is a brep.

Rhino.Render.TextureMappingType.OcsMapping
OCS mapping type (WCS/WCS Box with object frame).

Rhino.Render.TextureMappingType.FalseColors
Some sort of false color mapping used to set per vertex colors