Rhino.Geometry.CurveEnd
Defines the extremes of a curve through a flagged enumeration.
Since: 5.0

Rhino.Geometry.CurveEnd.None
Not the start nor the end.

Rhino.Geometry.CurveEnd.Start
The frontal part of the curve.

Rhino.Geometry.CurveEnd.End
The tail part of the curve.

Rhino.Geometry.CurveEnd.Both
Both the start and the end of the curve.