Rhino.Render.SafeFrame
Safe frame

Rhino.Render.SafeFrame.#ctor(Rhino.RhinoDoc)
Create the SafeFrame object which is associated with the document
Since: 7.12

Rhino.Render.SafeFrame.#ctor
Create a utility object not associated with any document
Since: 7.12

Rhino.Render.SafeFrame.#ctor(Rhino.Render.SafeFrame)
Create a utility object not associated with any document from another object
sf:
Since: 7.12

Rhino.Render.SafeFrame.Changed
This event is raised when a SafeFrame property value is changed.

Rhino.Render.SafeFrame.CopyFrom(Rhino.Render.FreeFloatingBase)
Since: 7.12

Rhino.Render.SafeFrame.Finalize


Rhino.Render.SafeFrame.Dispose
Since: 8.0

Rhino.Render.SafeFrame.Enabled
Determines whether the safe-frame is enabled.
Since: 7.12

Rhino.Render.SafeFrame.PerspectiveOnly
Show the safe-frame only in perspective views.
Since: 7.12

Rhino.Render.SafeFrame.FieldsOn
Show the 4 by 3 field grid in the safe-frame.
Since: 7.12

Rhino.Render.SafeFrame.LiveFrameOn
Turn on the live area, which shows the size of the rendered view as a yellow frame
in the viewport.
Since: 7.12

Rhino.Render.SafeFrame.ActionFrameOn
Turn on the user specified action area, which shown with blue frames.
Since: 7.12

Rhino.Render.SafeFrame.ActionFrameLinked
Action Frame Linked, On = Use the same scale for X and Y. Off = use
different scales for X and Y.
Since: 7.12

Rhino.Render.SafeFrame.ActionFrameXScale
Action Frame X-scale.
This value should be in the range 0..1 but it is not clamped.
It is displayed in the UI in the range 0..100.
Since: 7.12

Rhino.Render.SafeFrame.ActionFrameYScale
Action Frame Y-scale.
This value should be in the range 0..1 but it is not clamped.
It is displayed in the UI in the range 0..100.
Since: 7.12

Rhino.Render.SafeFrame.TitleFrameOn
Show a user specified title area frame in orange.
Since: 7.12

Rhino.Render.SafeFrame.TitleFrameLinked
Title Frame Linked, On = Use the same scale for X and Y. Off = use
different scales for X and Y.
Since: 7.12

Rhino.Render.SafeFrame.TitleFrameXScale
Title Frame X-scale.
This value should be in the range 0..1 but it is not clamped.
It is displayed in the UI in the range 0..100.
Since: 7.12

Rhino.Render.SafeFrame.TitleFrameYScale
Title Frame Y-scale.
This value should be in the range 0..1 but it is not clamped.
It is displayed in the UI in the range 0..100.
Since: 7.12