Rhino.Display.DisplayPipelineAttributes.ClippingPlaneFillColorUse
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ClippingPlaneFillColorUse.ViewportColor
Follows how the object displays in the viewport.

Rhino.Display.DisplayPipelineAttributes.ClippingPlaneFillColorUse.RenderMaterialColor
Uses the object's render material.

Rhino.Display.DisplayPipelineAttributes.ClippingPlaneFillColorUse.PlaneMaterialColor
Uses the clipping plane's color or layer color property.

Rhino.Display.DisplayPipelineAttributes.ClippingPlaneFillColorUse.SolidColor
Solid color