Rhino.ApplicationSettings.Installation
The type of Rhino executable that is executing
Since: 5.0

Rhino.ApplicationSettings.Installation.Undefined
Unknown

Rhino.ApplicationSettings.Installation.Commercial


Rhino.ApplicationSettings.Installation.Educational


Rhino.ApplicationSettings.Installation.EducationalLab


Rhino.ApplicationSettings.Installation.NotForResale


Rhino.ApplicationSettings.Installation.NotForResaleLab


Rhino.ApplicationSettings.Installation.Beta


Rhino.ApplicationSettings.Installation.BetaLab


Rhino.ApplicationSettings.Installation.Evaluation
25 Save limit evaluation version of Rhino

Rhino.ApplicationSettings.Installation.Corporate


Rhino.ApplicationSettings.Installation.EvaluationTimed
90 day time limit evaluation version of Rhino