Rhino.Geometry.CurveKnotStyle
Defines enumerated values for knot spacing styles in interpolated curves.
Since: 5.0

Rhino.Geometry.CurveKnotStyle.Uniform
Parameter spacing between consecutive knots is 1.0.

Rhino.Geometry.CurveKnotStyle.Chord
Chord length spacing, requires degree=3 with CV1 and CVn1 specified.

Rhino.Geometry.CurveKnotStyle.ChordSquareRoot
Square root of chord length, requires degree=3 with CV1 and CVn1 specified.

Rhino.Geometry.CurveKnotStyle.UniformPeriodic
Periodic with uniform spacing.

Rhino.Geometry.CurveKnotStyle.ChordPeriodic
Periodic with chord length spacing.

Rhino.Geometry.CurveKnotStyle.ChordSquareRootPeriodic
Periodic with square root of chord length spacing.