Rhino.Geometry.SubDSurfaceInterpolator
Interpolate some or all of the vertices limit surface positions in a SubD to specified locations.
NB: It is recommended not to use these methods to interpolate more than 1000 vertices.
Rhino.Geometry.SubD.SetVertexSurfacePoint(System.UInt32,Rhino.Geometry.Point3d)
Rhino.Geometry.SubD.InterpolateSurfacePoints(Rhino.Geometry.Point3d[])
Rhino.Geometry.SubD.InterpolateSurfacePoints(System.UInt32[],Rhino.Geometry.Point3d[])
Rhino.Geometry.SubDVertex.SurfacePoint

Rhino.Geometry.SubDSurfaceInterpolator.#ctor
Initialize an empty SubDSurfaceInterpolator.
Since: 8.0

Rhino.Geometry.SubDSurfaceInterpolator.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
Since: 8.0

Rhino.Geometry.SubDSurfaceInterpolator.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 8.0

Rhino.Geometry.SubDSurfaceInterpolator.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.
Since: 8.0

Rhino.Geometry.SubDSurfaceInterpolator.MaximumRecommendedInterpolatedVertexCount
Interpolation requires building a solver.
We estimate that this solver will work in reasonnable time if the number of
interplolated vertices is smaller than MaximumInterpolatedVertexCount.
However, given sufficient time, memory, and CPU resources, the code will work with
any value.
In version 8.0, this value is 1000.
Since: 8.0

Rhino.Geometry.SubDSurfaceInterpolator.CreateFromSubD(Rhino.Geometry.SubD,System.UInt32@)
Create an interpolator where all the vertices in the SubD are free vertices in the
linear system used for interpolation (i.e. can move as a result of the
interpolation, and can receive an interpolation target location).
subd: The SubD to use for interpolation
freeVertexCount: The number of free vertices in the system
Returns: A new SubDSurfaceInterpolator
Remarks:
Sets Rhino.Geometry.SubDSurfaceInterpolator.ContextId to the Guid of the Rhino SubD object for subd.
Since: 8.0

Rhino.Geometry.SubDSurfaceInterpolator.CreateFromMarkedVertices(Rhino.Geometry.SubD,System.Boolean,System.UInt32@)
Create an interpolator where all the marked vertices (unmarked if
interpolatedVerticesMark is false) in the SubD are free vertices in the linear
system used for interpolation, and the unmarked (marked if interpolatedVerticesMark
is false) are fixed to their initial positions. Free vertices are can move as a
result of the interpolation, and can receive an interpolation target location.
subd: The SubD to use for interpolation
interpolatedVerticesMark: If True, marked vertices will be considered free, and unmarked vertices will be fixed.
freeVertexCount: The number of free vertices in the system
Returns: A new SubDSurfaceInterpolator
Remarks:
Sets Rhino.Geometry.SubDSurfaceInterpolator.ContextId to the Guid of the Rhino SubD object for subd.
Since: 8.0

Rhino.Geometry.SubDSurfaceInterpolator.CreateFromSelectedVertices(Rhino.Geometry.SubD,System.UInt32@)
Create an interpolator where all the selected vertices in the SubD are free
vertices in the linear system used for interpolation, and the unselected are fixed
to their initial positions. Free vertices are can move as a result of the
interpolation, and can receive an interpolation target location.
subd: The SubD to use for interpolation
freeVertexCount: The number of free vertices in the system
Returns: A new SubDSurfaceInterpolator
Remarks:
Sets Rhino.Geometry.SubDSurfaceInterpolator.ContextId to the Guid of the Rhino SubD object for subd.
Since: 8.0

Rhino.Geometry.SubDSurfaceInterpolator.CreateFromVertexIdList(Rhino.Geometry.SubD,System.Collections.Generic.IEnumerable{System.UInt32},System.UInt32@)
Create an interpolator where all the listed vertices in the SubD are free
vertices in the linear system used for interpolation, and the unselected are fixed
to their initial positions. Free vertices are can move as a result of the
interpolation, and can receive an interpolation target location.
subd: The SubD to use for interpolation
vertexIndices: Indices of the vertices to be interpolated
freeVertexCount: The number of free vertices in the system
Returns: A new SubDSurfaceInterpolator
Remarks:
Sets Rhino.Geometry.SubDSurfaceInterpolator.ContextId to the Guid of the Rhino SubD object for subd.
Since: 8.0

Rhino.Geometry.SubDSurfaceInterpolator.Clear
Destroys the information needed to solve the interpolation.
Since: 8.0

Rhino.Geometry.SubDSurfaceInterpolator.InterpolatedVertexCount
Returns: Number of vertices with interpolated surface points.
Since: 8.0

Rhino.Geometry.SubDSurfaceInterpolator.FixedVertexCount
Returns: Number of vertices with fixed surface points.
Since: 8.0

Rhino.Geometry.SubDSurfaceInterpolator.IsInterpolatedVertex(System.UInt32)
Returns: True if the vertex surface point is being interpolated.
Since: 8.0

Rhino.Geometry.SubDSurfaceInterpolator.IsInterpolatedVertex(Rhino.Geometry.SubDVertex)
Returns: True if the vertex surface point is being interpolated.
Since: 8.0

Rhino.Geometry.SubDSurfaceInterpolator.Solve(Rhino.Geometry.Point3d[])
Solve the interpolation system, given target interpolation locations for the free
vertices in the system. Updates the subd referenced by this system so the corresponding
surface points are at the locations given by surfacePoints.
surfacePoints:
The limit surface locations for the interpolated vertices. The number of desired locations
needs to match the Rhino.Geometry.SubDSurfaceInterpolator.InterpolatedVertexCount.
Returns: True if a solution was found.
Since: 8.0

Rhino.Geometry.SubDSurfaceInterpolator.InterpolatedVertexIndex(System.UInt32)
Returns:
If vertex is an interpolated vertex, returns the index of the vertex in the array returned
by Rhino.Geometry.SubDSurfaceInterpolator.VertexIdList. Otherwise, returns ON_UNSET_UINT_INDEX.
Since: 8.0

Rhino.Geometry.SubDSurfaceInterpolator.ContextId
The context assigned id. This id is provided for applications using
ON_SubDSurfaceInterpolator. It is not inspected or used in any part of the interpolation
setup or calculations.
Remarks:
In Rhino, when an interpolator is being used to modify a CRhinoSubDObject, this id
is often the Rhino object id.
Since: 8.0

Rhino.Geometry.SubDSurfaceInterpolator.VertexIdList
Returns:
List of indices of the vertices with interpolated surface points. Vertices that are not in
this vertex list have unchanged control net points.
Since: 8.0

Rhino.Geometry.SubDSurfaceInterpolator.Transform(Rhino.Geometry.Transform)
Apply an arbitrary transformation to the target interpolation points.
transform: The transformation to apply.
Since: 8.0