Rhino.Geometry.Collections.NurbsCurvePointList
Provides access to the control points of a NURBS curve.

Rhino.Geometry.Collections.NurbsCurvePointList.EnsurePrivateCopy
If you want to keep a copy of this class around by holding onto it in a variable after a command
completes, call EnsurePrivateCopy to make sure that this class is not tied to the document. You can
call this function as many times as you want.
Since: 5.0

Rhino.Geometry.Collections.NurbsCurvePointList.Count
Gets the number of control points in this curve.
Since: 5.0

Rhino.Geometry.Collections.NurbsCurvePointList.Item(System.Int32)
Gets or sets the control point location at the given index.
index: Index of control vertex to access.
Returns: The control vertex at [index]

Rhino.Geometry.Collections.NurbsCurvePointList.ControlPolygonLength
Gets the length of the polyline connecting all control points.
Since: 5.0

Rhino.Geometry.Collections.NurbsCurvePointList.ControlPolygon
Constructs a polyline through all the control points.
Note that periodic curves generate a closed polyline with fewer
points than control-points.
Returns: A polyline connecting all control points.
Since: 5.0

Rhino.Geometry.Collections.NurbsCurvePointList.ChangeEndWeights(System.Double,System.Double)
Use a combination of scaling and reparameterization to change the end weights to the specified values.
w0: Weight for first control point.
w1: Weight for last control point.
Returns: true on success, false on failure.
Remarks:
The domain, Euclidean locations of the control points, and locus of the curve
do not change, but the weights, homogeneous CV values and internal knot values
may change. If w0 and w1 are 1 and the curve is not rational, the curve is not changed.
Since: 5.0

Rhino.Geometry.Collections.NurbsCurvePointList.MakeRational
Converts the curve to a Rational NURBS curve. Rational NURBS curves have weighted control points.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Collections.NurbsCurvePointList.MakeNonRational
Converts the curve to a Non-rational NURBS curve. Non-rational curves have unweighted control points.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Collections.NurbsCurvePointList.SetPoint(System.Int32,System.Double,System.Double,System.Double)
Sets a world 3-D, or Euclidean, control point at the given index.
The 4-D representation is (x, y, z, 1.0).
index: Index of control point to set.
x: X coordinate of control point.
y: Y coordinate of control point.
z: Z coordinate of control point.
Returns: true on success, false on failure.
Since: 6.0

Rhino.Geometry.Collections.NurbsCurvePointList.SetPoint(System.Int32,System.Double,System.Double,System.Double,System.Double)
Sets a homogeneous control point at the given index, where the 4-D representation is (x, y, z, w).
The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
index: Index of control point to set.
x: X coordinate of control point.
y: Y coordinate of control point.
z: Z coordinate of control point.
weight: Weight of control point.
Returns: true on success, false on failure.
Remarks:
For expert use only. If you do not understand homogeneous coordinates, then
use an override that accepts world 3-D, or Euclidean, coordinates as input.
Since: 5.0

Rhino.Geometry.Collections.NurbsCurvePointList.SetPoint(System.Int32,Rhino.Geometry.Point3d)
Sets a world 3-D, or Euclidean, control point at the given index.
The 4-D representation is (x, y, z, 1.0).
index: Index of control point to set.
point: Coordinate of control point.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Collections.NurbsCurvePointList.SetPoint(System.Int32,Rhino.Geometry.Point4d)
Sets a homogeneous control point at the given index, where the 4-D representation is (x, y, z, w).
The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
index: Index of control point to set.
point: Coordinate and weight of control point.
Returns: true on success, false on failure.
Remarks:
For expert use only. If you do not understand homogeneous coordinates, then
use an override that accepts world 3-D, or Euclidean, coordinates as input.
Since: 5.0

Rhino.Geometry.Collections.NurbsCurvePointList.SetPoint(System.Int32,Rhino.Geometry.Point3d,System.Double)
Sets a world 3-D, or Euclidean, control point and weight at a given index.
The 4-D representation is (x*w, y*w, z*w, w).
index: Index of control point to set.
point: Coordinates of the control point.
weight: Weight of control point.
Returns: true on success, false on failure.
Since: 6.0

Rhino.Geometry.Collections.NurbsCurvePointList.GetPoint(System.Int32,Rhino.Geometry.Point3d@)
Gets a world 3-D, or Euclidean, control point at the given index.
The 4-D representation is (x, y, z, 1.0).
index: Index of control point to get.
point: Coordinate of control point.
Returns: true on success, false on failure.
Since: 6.0

Rhino.Geometry.Collections.NurbsCurvePointList.GetPoint(System.Int32,Rhino.Geometry.Point4d@)
Gets a homogeneous control point at the given index, where the 4-D representation is (x, y, z, w).
The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
index: Index of control point to get.
point: Coordinate and weight of control point.
Returns: true on success, false on failure.
Remarks:
For expert use only. If you do not understand homogeneous coordinates, then
use the override that returns world 3-D, or Euclidean, coordinates.
Since: 6.0

Rhino.Geometry.Collections.NurbsCurvePointList.SetWeight(System.Int32,System.Double)
Sets the weight of a control point at the given index
Note, if the curve is non-rational, it will be converted to rational.
index: Index of control point to set.
weight: The control point weight.
Returns: true if successful, false otherwise.
Since: 6.0

Rhino.Geometry.Collections.NurbsCurvePointList.GetWeight(System.Int32)
Gets the weight of a control point at the given index.
Note, if the curve is non-rational, the weight will be 1.0.
index: Index of control point to get.
Returns: The control point weight if successful, Rhino.Math.UnsetValue otherwise.
Since: 6.0

Rhino.Geometry.Collections.NurbsCurvePointList.PointSize
Returns the control point size, or the number of doubles per control point.
For rational curves, PointSize = Curve.Dimension + 1.
For non-rational curves, PointSize = Curve.Dimension.
Since: 6.9

Rhino.Geometry.Collections.NurbsCurvePointList.ValidateSpacing(System.Double,System.Double,System.Int32[]@,System.Int32[]@)
Simple check of distance between adjacent control points
closeTolerance: tolerance to use for determining if control points are 'close'
stackTolerance: tolerance to use for determining if control points are 'stacked'
closeIndices: indices of 'close' points are returned in this array
stackedIndices: indices of 'stacked' points are returned in this array
Returns: true if close or stacked indices are found
Since: 6.0

Rhino.Geometry.Collections.NurbsCurvePointList.UVNDirectionsAt(System.Int32,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@)
Calculates the U, V, and N directions of a NURBS curve control point similar to the method used by Rhino's MoveUVN command.
index: Index of control point.
uDir: The U direction.
vDir: The V direction.
nDir: The N direction.
Returns: true if successful, false otherwise.
Since: 7.0

Rhino.Geometry.Collections.NurbsCurvePointList.EpsilonEquals(Rhino.Geometry.Collections.NurbsCurvePointList,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:
Since: 5.4

Rhino.Geometry.Collections.NurbsCurvePointList.System#Collections#Generic#ICollection{Rhino#Geometry#ControlPoint}#IsReadOnly
Returns false.

Rhino.Geometry.Collections.NurbsCurvePointList.IndexOf(Rhino.Geometry.ControlPoint)
Gets the index of a control point, or -1.
item: The exact item to search for.
Returns: The index.
Since: 6.0

Rhino.Geometry.Collections.NurbsCurvePointList.Contains(Rhino.Geometry.ControlPoint)
Determines if this list contains an item.
item: The exact item to search for.
Returns: A boolean value.
Since: 6.0

Rhino.Geometry.Collections.NurbsCurvePointList.CopyTo(Rhino.Geometry.ControlPoint[],System.Int32)
Copied the list to an array.
array: The array to copy to.
arrayIndex: The index in which the copy will begin.
Since: 6.0