Rhino.Geometry.Mesh
Represents a geometry type that is defined by vertices and faces.
This is often called a face-vertex mesh.

Rhino.Geometry.Mesh.Check(Rhino.FileIO.TextLog,Rhino.Geometry.MeshCheckParameters@)
Examines the mesh and logs a description of what it finds right or wrong.
The various properties the function checks for are described in MeshCheckParameters.
textLog: The text log
parameters: The mesh checking parameter and results.
Returns: Returns true if the mesh is valid, false otherwise.
Since: 7.0

Rhino.Geometry.Mesh.CreateFromPlane(Rhino.Geometry.Plane,Rhino.Geometry.Interval,Rhino.Geometry.Interval,System.Int32,System.Int32)
Constructs a planar mesh grid.
plane: Plane of mesh.
xInterval: Interval describing size and extends of mesh along plane x-direction.
yInterval: Interval describing size and extends of mesh along plane y-direction.
xCount: Number of faces in x-direction.
yCount: Number of faces in y-direction.
Throws System.ArgumentException: Thrown when plane is a null reference.
Throws System.ArgumentException: Thrown when xInterval is a null reference.
Throws System.ArgumentException: Thrown when yInterval is a null reference.
Throws System.ArgumentOutOfRangeException: Thrown when xCount is less than or equal to zero.
Throws System.ArgumentOutOfRangeException: Thrown when yCount is less than or equal to zero.
Since: 5.0

Rhino.Geometry.Mesh.CreateFromFilteredFaceList(Rhino.Geometry.Mesh,System.Collections.Generic.IEnumerable{System.Boolean})
Constructs a sub-mesh, that contains a filtered list of faces.
original: The mesh to copy. If null, null is returned.
inclusion: A series of true and false values, that determine if each face is used in the new mesh.
If null or empty, a non-filtered copy of the original mesh is returned.
If the amount does not match the length of the face list, the pattern is repeated. If it exceeds the amount
of faces in the mesh face list, the pattern is truncated.
Returns: A copy of the original mesh with its faces filtered, or null on failure.
Since: 7.0

Rhino.Geometry.Mesh.CreateFromBox(Rhino.Geometry.BoundingBox,System.Int32,System.Int32,System.Int32)
Constructs new mesh that matches a bounding box.
box: A box to use for creation.
xCount: Number of faces in x-direction.
yCount: Number of faces in y-direction.
zCount: Number of faces in z-direction.
Returns: A new brep, or null on failure.
Since: 5.6

Rhino.Geometry.Mesh.CreateFromBox(Rhino.Geometry.Box,System.Int32,System.Int32,System.Int32)
Constructs new mesh that matches an aligned box.
box: Box to match.
xCount: Number of faces in x-direction.
yCount: Number of faces in y-direction.
zCount: Number of faces in z-direction.
Returns:
Since: 5.3

Rhino.Geometry.Mesh.CreateFromBox(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32,System.Int32,System.Int32)
Constructs new mesh from 8 corner points.
corners:
8 points defining the box corners arranged as the vN labels indicate.
v7_____________v6
|\             |\
| \            | \
|  \ _____________\
|   v4         |   v5
|   |          |   |
|   |          |   |
v3--|----------v2  |
\  |           \  |
\ |            \ |
\|             \|
v0_____________v1
xCount: Number of faces in x-direction.
yCount: Number of faces in y-direction.
zCount: Number of faces in z-direction.
Returns: A new brep, or null on failure.
Returns: A new box mesh, on null on error.
Since: 5.3

Rhino.Geometry.Mesh.CreateFromSphere(Rhino.Geometry.Sphere,System.Int32,System.Int32)
Constructs a mesh sphere.
sphere: Base sphere for mesh.
xCount: Number of faces in the around direction.
yCount: Number of faces in the top-to-bottom direction.
Throws System.ArgumentException: Thrown when sphere is invalid.
Throws System.ArgumentOutOfRangeException: Thrown when xCount is less than or equal to two.
Throws System.ArgumentOutOfRangeException: Thrown when yCount is less than or equal to two.
Returns:
Since: 5.0

Rhino.Geometry.Mesh.CreateIcoSphere(Rhino.Geometry.Sphere,System.Int32)
Constructs a icospherical mesh. A mesh icosphere differs from a standard
UV mesh sphere in that it's vertices are evenly distributed. A mesh icosphere
starts from an icosahedron (a regular polyhedron with 20 equilateral triangles).
It is then refined by splitting each triangle into 4 smaller triangles.
This splitting can be done several times.
sphere: The input sphere provides the orienting plane and radius.
subdivisions:
The number of times you want the faces split, where 0  <= subdivisions <= 7.
Note, the total number of mesh faces produces is: 20 * (4 ^ subdivisions)
Returns: A welded mesh icosphere if successful, or null on failure.
Since: 6.0

Rhino.Geometry.Mesh.CreateQuadSphere(Rhino.Geometry.Sphere,System.Int32)
Constructs a quad mesh sphere. A quad mesh sphere differs from a standard
UV mesh sphere in that it's vertices are evenly distributed. A quad mesh sphere
starts from a cube (a regular polyhedron with 6 square sides).
It is then refined by splitting each quad into 4 smaller quads.
This splitting can be done several times.
sphere: The input sphere provides the orienting plane and radius.
subdivisions:
The number of times you want the faces split, where 0  <= subdivisions <= 8.
Note, the total number of mesh faces produces is: 6 * (4 ^ subdivisions)
Returns: A welded quad mesh sphere if successful, or null on failure.
Since: 6.0

Rhino.Geometry.Mesh.CreateFromCylinder(Rhino.Geometry.Cylinder,System.Int32,System.Int32)
Constructs a capped mesh cylinder.
cylinder:
vertical: Number of faces in the top-to-bottom direction.
around: Number of faces around the cylinder.
Throws System.ArgumentException: Thrown when cylinder is invalid.
Returns: Returns a mesh cylinder if successful, null otherwise.
Since: 5.0

Rhino.Geometry.Mesh.CreateFromCylinder(Rhino.Geometry.Cylinder,System.Int32,System.Int32,System.Boolean,System.Boolean)
Constructs a mesh cylinder.
cylinder:
vertical: Number of faces in the top-to-bottom direction.
around: Number of faces around the cylinder.
capBottom: If true end at Cylinder.Height1 should be capped.
capTop: If true end at Cylinder.Height2 should be capped.
Throws System.ArgumentException: Thrown when cylinder is invalid.
Returns: Returns a mesh cylinder if successful, null otherwise.
Since: 7.0

Rhino.Geometry.Mesh.CreateFromCylinder(Rhino.Geometry.Cylinder,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean)
Constructs a mesh cylinder.
cylinder:
vertical: Number of faces in the top-to-bottom direction.
around: Number of faces around the cylinder.
capBottom: If true end at Cylinder.Height1 should be capped.
capTop: If true end at Cylinder.Height2 should be capped.
quadCaps: If true and it's possible to make quad caps, i.e.. around is even, then caps will have quad faces.
Throws System.ArgumentException: Thrown when cylinder is invalid.
Returns: Returns a mesh cylinder if successful, null otherwise.
Since: 7.0

Rhino.Geometry.Mesh.CreateFromCylinder(Rhino.Geometry.Cylinder,System.Int32,System.Int32,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Constructs a mesh cylinder.
cylinder:
vertical: Number of faces in the top-to-bottom direction.
around: Number of faces around the cylinder.
capBottom: If true end at Cylinder.Height1 should be capped.
capTop: If true end at Cylinder.Height2 should be capped.
circumscribe: If true end polygons will circumscribe circle.
quadCaps: If true and it's possible to make quad caps, i.e.. around is even, then caps will have quad faces.
Throws System.ArgumentException: Thrown when cylinder is invalid.
Returns: Returns a mesh cylinder if successful, null otherwise.
Since: 7.0

Rhino.Geometry.Mesh.CreateFromCone(Rhino.Geometry.Cone,System.Int32,System.Int32)
Constructs a solid mesh cone.
cone:
vertical: Number of faces in the top-to-bottom direction.
around: Number of faces around the cone.
Throws System.ArgumentException: Thrown when cone is invalid.
Returns: A valid mesh if successful.
Since: 5.0

Rhino.Geometry.Mesh.CreateFromCone(Rhino.Geometry.Cone,System.Int32,System.Int32,System.Boolean)
Constructs a mesh cone.
cone:
vertical: Number of faces in the top-to-bottom direction.
around: Number of faces around the cone.
solid: If false the mesh will be open with no faces on the circular planar portion.
Throws System.ArgumentException: Thrown when cone is invalid.
Returns: A valid mesh if successful.
Since: 6.8

Rhino.Geometry.Mesh.CreateFromCone(Rhino.Geometry.Cone,System.Int32,System.Int32,System.Boolean,System.Boolean)
Constructs a mesh cone.
cone:
vertical: Number of faces in the top-to-bottom direction.
around: Number of faces around the cone.
solid: If false the mesh will be open with no faces on the circular planar portion.
quadCaps: If true and it's possible to make quad caps, i.e.. around is even, then caps will have quad faces.
Throws System.ArgumentException: Thrown when cone is invalid.
Returns: A valid mesh if successful.
Since: 7.0

Rhino.Geometry.Mesh.CreateFromTorus(Rhino.Geometry.Torus,System.Int32,System.Int32)
Constructs a mesh torus.
torus: The torus.
vertical: Number of faces in the top-to-bottom direction.
around: Number of faces around the torus.
Throws System.ArgumentException: Thrown when torus is invalid.
Returns: Returns a mesh torus if successful, null otherwise.
Since: 7.0

Rhino.Geometry.Mesh.CreateFromPlanarBoundary(Rhino.Geometry.Curve,Rhino.Geometry.MeshingParameters)
Do not use this overload. Use version that takes a tolerance parameter instead.
boundary: Do not use.
parameters: Do not use.
Returns:
Do not use.
Since: 5.0
6.0

Rhino.Geometry.Mesh.CreateFromPlanarBoundary(Rhino.Geometry.Curve,Rhino.Geometry.MeshingParameters,System.Double)
Attempts to construct a mesh from a closed planar curve.RhinoMakePlanarMeshes
boundary: must be a closed planar curve.
parameters: parameters used for creating the mesh.
tolerance: Tolerance to use during operation.
Returns:
New mesh on success or null on failure.
Since: 6.0

Rhino.Geometry.Mesh.CreateFromClosedPolyline(Rhino.Geometry.Polyline)
Attempts to create a Mesh that is a triangulation of a simple closed polyline that projects onto a plane.
polyline: must be closed
Returns:
New mesh on success or null on failure.
Since: 5.0

Rhino.Geometry.Mesh.CreateFromClosedPolylinesAndPoints(Rhino.Geometry.Point2d[],System.Int32[][],System.Boolean,System.Boolean,System.Double,Rhino.TesselationFailure@)
Attempts to create a Mesh that is a triangulation of an outermost simple closed polyline possibly with holes, all supplied by loops.
The loops are indices into the points array. All loops have to be closed - meaning that their first and last entries have to be the same -, free from self-intersections, and not intersecting each other.
The outermost loop will be interpreted as representing the outer boundary, and all other loops will be interpreted as holes.
Loops that are nested to deeper levels will be ignored.
This function will perform a fast de-duplication of the points before meshing.
This function may fail and return null, in which case it gives the caller some indication about what went wrong in its TesselationFailure argument.
points: The input point array.
loopIndices: The indices of closed loops standing for the inner and outer boundaries of the region to be meshed.
permitVertexAdditions: Boolean to indicate if you are fine with new vertices
permitEdgeSplitting: Boolean to indicate if you are with your edges getting split
tolerance: The tolerance to use for de-duplicating the points.
failure: [out] The reason for failure, if any.
Returns:
New mesh on success or null on failure.

Rhino.Geometry.Mesh.CreateFromTessellation(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d}},Rhino.Geometry.Plane,System.Boolean)
Attempts to create a mesh that is a triangulation of a list of points, projected on a plane,
including its holes and fixed edges.
points: A list, an array or any enumerable of points.
plane: A plane.
allowNewVertices: If true, the mesh might have more vertices than the list of input points,
if doing so will improve long thin triangles.
edges: A list of polylines, or other lists of points representing edges.
This can be null. If nested enumerable items are null, they will be discarded.
Returns: A new mesh, or null if not successful.
Throws System.ArgumentNullException: If points is null.
Throws System.ArgumentException: If plane is not valid.

Rhino.Geometry.Mesh.CreateFromBrep(Rhino.Geometry.Brep)
Constructs a mesh from a brep.
brep: Brep to approximate.
Returns: An array of meshes.
Since: 5.0
6.0

Rhino.Geometry.Mesh.CreateFromBrep(Rhino.Geometry.Brep,Rhino.Geometry.MeshingParameters)
Constructs a mesh from a brep.
brep: Brep to approximate.
meshingParameters: Parameters to use during meshing.
Returns: An array of meshes.
Since: 5.0

Rhino.Geometry.Mesh.CreateFromSurface(Rhino.Geometry.Surface)
Constructs a mesh from a surface
surface: Surface to approximate
Returns: New mesh representing the surface
Since: 6.5

Rhino.Geometry.Mesh.CreateFromSurface(Rhino.Geometry.Surface,Rhino.Geometry.MeshingParameters)
Constructs a mesh from a surface
surface: Surface to approximate
meshingParameters: settings used to create the mesh
Returns: New mesh representing the surface
Since: 6.5

Rhino.Geometry.Mesh.CreateFromSubD(Rhino.Geometry.SubD,System.Int32)
Create a mesh from a SubD limit surface
subd: SubD to mesh
displayDensity:
Adaptive display density value to use. If in doubt, pass
Rhino.Geometry.SubDDisplayParameters.Density.DefaultDensity: this is what the cache uses.
Returns: New mesh representing the SubD
Rhino.Geometry.SubD.UpdateSurfaceMeshCache(System.Boolean)
Since: 7.0

Rhino.Geometry.Mesh.CreateFromExtrusion(Rhino.Geometry.Extrusion,Rhino.Geometry.MeshingParameters)
Constructs a mesh from a brep.
extrusion: Brep to approximate.
meshingParameters: Parameters to use during meshing.
Returns: A mesh.
Since: 8.3

Rhino.Geometry.Mesh.SplitMesh(Rhino.Geometry.Mesh,System.Int32,System.Boolean,System.Boolean)
Some file formats and rendering engines are only able to process small batches of triangles.
Use this function to split the mesh into subsets of vertices and faces that those file formats
and rendering engines can handle.
mesh: Mesh to split.
maxCount: Maximum count.
countSum:
If true, split if total vertices + faces is greater than maxCount.
If false, split if either total vertices or faces is greater than maxCount.
countTriangles:
If true, count triangles.
If false, count triangles and quads.
Returns: An array of sub-meshes if successful, otherwise an empty array.
Since: 8.25

Rhino.Geometry.Mesh.PartitionMesh(Rhino.Geometry.Mesh,System.Int32,System.Int32)
Some file formats and rendering engines are only able to process small batches of triangles.
Use this function to partition the mesh into subsets of vertices and faces that those file formats
and rendering engines can handle.
mesh: Mesh to partition.
maxVertexCount: Maximum number of vertices in a partition.///
maxFaceCount: Maximum number of faces in a partition.
Returns: An array of sub-meshes if successful, otherwise an empty array.
Remarks:
The resulting sub-meshes tend to be less disjoint than the output of Rhino.Geometry.Mesh.SplitMesh(Rhino.Geometry.Mesh,System.Int32,System.Boolean,System.Boolean).
The less disjoint meshes will take more time to compute.
Since: 8.25

Rhino.Geometry.Mesh.CreateFromSubDControlNet(Rhino.Geometry.SubD)
Create a mesh from a SubD control net
subd:
Returns: mesh representing control net on success, null on failure
Since: 7.0

Rhino.Geometry.Mesh.CreateFromSubDControlNetWithTextureCoordinates(Rhino.Geometry.SubD)
Create a mesh from a SubD control net including texture coordinates
subd:
Returns: mesh representing control net on success, null on failure
Since: 8.3

Rhino.Geometry.Mesh.CreateFromSurfaceControlNet(Rhino.Geometry.Surface)
Calculate a mesh representation of a surface's control net.
surface: The surface.
Returns: Mesh representing the surface control net on success, null on failure
Since: 7.18

Rhino.Geometry.Mesh.CreatePatch(Rhino.Geometry.Polyline,System.Double,Rhino.Geometry.Surface,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Boolean,System.Int32)
Construct a mesh patch from a variety of input geometry.
outerBoundary: (optional: can be null) Outer boundary
polyline, if provided this will become the outer boundary of the
resulting mesh. Any of the input that is completely outside the outer
boundary will be ignored and have no impact on the result. If any of
the input intersects the outer boundary the result will be
unpredictable and is likely to not include the entire outer boundary.
angleToleranceRadians:
Maximum angle between unit tangents and adjacent vertices. Used to
divide curve inputs that cannot otherwise be represented as a polyline.
innerBoundaryCurves:
(optional: can be null) Polylines to create holes in the output mesh.
If innerBoundaryCurves are the only input then the result may be null
if trimback is set to false (see comments for trimback) because the
resulting mesh could be invalid (all faces created contained vertices
from the perimeter boundary).
pullbackSurface:
(optional: can be null) Initial surface where 3d input will be pulled
to make a 2d representation used by the function that generates the mesh.
Providing a pullbackSurface can be helpful when it is similar in shape
to the pattern of the input, the pulled 2d points will be a better
representation of the 3d points. If all of the input is more or less
coplanar to start with, providing pullbackSurface has no real benefit.
innerBothSideCurves:
(optional: can be null) These polylines will create faces on both sides
of the edge. If there are only input points(innerPoints) there is no
way to guarantee a triangulation that will create an edge between two
particular points. Adding a line, or polyline, to innerBothsideCurves
that includes points from innerPoints will help guide the triangulation.
innerPoints:
(optional: can be null) Points to be used to generate the mesh. If
outerBoundary is not null, points outside of that boundary after it has
been pulled to pullbackSurface (or the best plane through the input if
pullbackSurface is null) will be ignored.
trimback:
Only used when a outerBoundary has not been provided. When that is the
case, the function uses the perimeter of the surface as the outer boundary
instead. If true, any face of the resulting triangulated mesh that
contains a vertex of the perimeter boundary will be removed.
divisions:
Only used when a outerBoundary has not been provided. When that is the
case, division becomes the number of divisions each side of the surface's
perimeter will be divided into to create an outer boundary to work with.
Returns: mesh on success; null on failure
Since: 6.0

Rhino.Geometry.Mesh.CreateBooleanUnion(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh})
Computes the solid union of a set of meshes. WARNING: Use the overload that takes a tolerance or options.
meshes: Meshes to union.
Returns: An array of Mesh results or null on failure.
Since: 5.0

Rhino.Geometry.Mesh.CreateBooleanUnion(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Double)
Computes the solid union of a set of meshes.
meshes: Meshes to union.
tolerance: A valid tolerance value. See Rhino.Geometry.Intersect.Intersection.MeshIntersectionsTolerancesCoefficient
Returns: An array of Mesh results or null on failure.
Since: 8.0

Rhino.Geometry.Mesh.CreateBooleanUnion(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Geometry.MeshBooleanOptions,Rhino.Commands.Result@)
Computes the solid union of a set of meshes.
meshes: Meshes to union.
options: An option instance. Can be null, but generally it should be instantiated and have a tolerance set.
commandResult: A value indicating if the function was successful, or if it was cancelled, or if it did nothing, or failed.
Since: 8.0

Rhino.Geometry.Mesh.CreateBooleanDifference(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh})
Computes the solid difference of two sets of Meshes.
firstSet: First set of Meshes (the set to subtract from).
secondSet: Second set of Meshes (the set to subtract).
Returns: An array of Mesh results or null on failure.
Since: 5.0

Rhino.Geometry.Mesh.CreateBooleanDifference(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Geometry.MeshBooleanOptions,Rhino.Commands.Result@)
Computes the solid difference of two sets of Meshes.
firstSet: First set of Meshes (the set to subtract from).
secondSet: Second set of Meshes (the set to subtract).
options: An option instance. Should have a valid Tolerance set.
result: Indicates if the function succeeded, was cancelled, did nothing, or failed.
Returns: An array of Mesh results or null on failure.
Since: 8.0

Rhino.Geometry.Mesh.CreateBooleanIntersection(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh})
Computes the solid intersection of two sets of meshes.
firstSet: First set of Meshes.
secondSet: Second set of Meshes.
Returns: An array of Mesh results or null on failure.
Since: 5.0

Rhino.Geometry.Mesh.CreateBooleanIntersection(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Geometry.MeshBooleanOptions,Rhino.Commands.Result@)
Computes the solid intersection of two sets of meshes.
firstSet: First set of Meshes.
secondSet: Second set of Meshes.
options: The boolean option instance, or null.
result: A value indicating success, or cancel, or failure, or nothing.
Returns: An array of Mesh results or null on failure.
Since: 5.0

Rhino.Geometry.Mesh.CreateBooleanSplit(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh})
Splits a set of meshes with another set.
meshesToSplit: A list, an array, or any enumerable set of meshes to be split. If this is null, null will be returned.
meshSplitters: A list, an array, or any enumerable set of meshes that cut. If this is null, null will be returned.
Returns: A new mesh array, or null on error.
Since: 5.0

Rhino.Geometry.Mesh.CreateBooleanSplit(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Geometry.MeshBooleanOptions,Rhino.Commands.Result@)
Splits a set of meshes with another set.
meshesToSplit: A list, an array, or any enumerable set of meshes to be split. If this is null, null will be returned.
meshSplitters: A list, an array, or any enumerable set of meshes that cut. If this is null, null will be returned.
result: A value indicating success, or cancel, or failure, or nothing.
options: The boolean option instance, or null.
Returns: A new mesh array, or null on error.
Since: 5.0

Rhino.Geometry.Mesh.CreateFromCurvePipe(Rhino.Geometry.Curve,System.Double,System.Int32,System.Int32,Rhino.Geometry.MeshPipeCapStyle,System.Boolean,System.Collections.Generic.IEnumerable{Rhino.Geometry.Interval})
Constructs a new mesh pipe from a curve.
curve: A curve to pipe.
radius: The radius of the pipe, a measure from the curve to the surface of the mesh pipe.
segments: The number of mesh faces that surround the curve. For example with three segments, the cross-section of the pipe looks like an equilateral triangle. The more segments there are, the rounder the pipe is.
accuracy: The accuracy of the pipe. Changes the visual fidelity of the pipe along the curve. Higher value means that the center of the pipe is closer to the curve. By increasing the accuracy, the mesh will get more faces along the curve.
capType: The type of cap to be created at the end of the pipe.
faceted: Specifies whether the pipe is faceted, or not. This setting only affects the normals of the pipe mesh.
intervals: A series of intervals to pipe, or null to pipe the entire curve.
Returns: A new mesh if successful, or null on failure.
Since: 6.0

Rhino.Geometry.Mesh.CreateFromCurveExtrusion(Rhino.Geometry.Curve,Rhino.Geometry.Vector3d,Rhino.Geometry.MeshingParameters,Rhino.Geometry.BoundingBox)
Constructs a mesh from an extruded curve.
This method is designed for projecting curves onto a mesh.
In most cases, a better to use Rhino.Geometry.Mesh.CreateExtrusion(Rhino.Geometry.Curve,Rhino.Geometry.Vector3d).
curve: A curve to extrude.
direction: The direction of extrusion.
parameters: The parameters of meshing.
boundingBox: The bounding box controls the length of the extrusion.
Returns: A new mesh, or null on failure.
Since: 7.0

Rhino.Geometry.Mesh.CreateExtrusion(Rhino.Geometry.Curve,Rhino.Geometry.Vector3d)
Constructs a mesh by extruding a curve along a vector.
profile: Profile curve to extrude.
direction: Direction and length of extrusion.
Returns: A mesh on success or null on failure.
Since: 8.0

Rhino.Geometry.Mesh.CreateExtrusion(Rhino.Geometry.Curve,Rhino.Geometry.Vector3d,Rhino.Geometry.MeshingParameters)
Constructs a mesh by extruding a curve along a vector.
profile: Profile curve to extrude.
direction: Direction and length of extrusion.
parameters: Parameters used to create the mesh.
Returns: A mesh on success or null on failure.
Since: 8.0

Rhino.Geometry.Mesh.CreateFromIterativeCleanup(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Double)
Repairs meshes with vertices that are too near, using a tolerance value.
meshes: The meshes to be repaired.
tolerance: A minimum distance for clean vertices.
Returns: A valid meshes array if successful. If no change was required, some meshes can be null. Otherwise, null, when no changes were done.
Remarks: Rhino.Geometry.Mesh.RequireIterativeCleanup(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Double)
Since: 7.0

Rhino.Geometry.Mesh.CreateConvexHull3D(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32[][]@,System.Double,System.Double)
Attempts to create a 3d convex hull mesh from input points.
points: The 3D input points to be covered with the convex hull.
These points must not be coplanar.
hullFacets: An out parameter of jagged array of indices into the argument point enumerable.
Each list item specifies the indices that make up a facet of the convex hull.
These indices are not indices into the resulting mesh's indices.
Can be the empty jagged array if the resulting mesh is null.
tolerance: The tolerance used to decide if points are coplanar or not.
Use the document's tolerance if in doubt.
angleTolerance: The angle tolerance used for merging coplanar points into facets.
Use the document's angle tolerance in radians if in doubt.
Returns: A valid mesh if successful. If there were too few input points, or the input was coplanar
up to the specified tolerance, the result can be null.
Since: 8.5

Rhino.Geometry.Mesh.RequireIterativeCleanup(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Double)
Analyzes some meshes, and determines if a pass of CreateFromIterativeCleanup would change the array.
All available cleanup steps are used. Currently available cleanup steps are:
- mending of single precision coincidence even though double precision vertices differ.
- union of nearly identical vertices, irrespectively of their origin.
- removal of t-joints along edges.
meshes: A list, and array or any enumerable of meshes.
tolerance: A 3d distance. This is usually a value of about 10e-7 magnitude.
Returns: True if meshes would be changed, otherwise false.
Remarks: Rhino.Geometry.Mesh.CreateFromIterativeCleanup(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Double)
Since: 7.0

Rhino.Geometry.Mesh.RebuildMesh(Rhino.Geometry.Mesh)
Use this function to rebuild meshes that are not acting properly.
Vertices and faces are kept. Face normals and vertex normals are recalculated.
Texture coordinates, vertex colors, surface curvatures, and surfaces parameters are not replaced.
mesh: Mesh to be rebuilt.
Returns: The rebuilt mesh if successful, null otherwise.
Since: 8.23

Rhino.Geometry.Mesh.RebuildMesh(Rhino.Geometry.Mesh,System.Boolean,System.Boolean)
Use this function to rebuild meshes that are not acting properly.
Vertices and faces are kept. Face normals and vertex normals are recalculated.
Surface curvatures, and surfaces parameters are not replaced.
mesh: Mesh to be rebuilt.
preserveTextureCoordinates: Retains mesh texture coordinates.
preserveVertexColors: Retains mesh vertex colors.
Returns: The rebuilt mesh if successful, null otherwise.
Since: 8.23

Rhino.Geometry.Mesh.#ctor
Initializes a new empty mesh.
Since: 5.0

Rhino.Geometry.Mesh.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor for internal use.
info: Serialization data.
context: Serialization stream.

Rhino.Geometry.Mesh.OnSwitchToNonConst
Performs some memory cleanup if necessary

Rhino.Geometry.Mesh.NonConstOperation
Clear local cache on non constant calls

Rhino.Geometry.Mesh.CopyFrom(Rhino.Geometry.Mesh)
Copies mesh values into this mesh from another mesh.
other: The other mesh to copy from.
Throws System.ArgumentNullException: If other is null.
Since: 5.0

Rhino.Geometry.Mesh.Duplicate
Constructs a copy of this mesh.
This is the same as Rhino.Geometry.Mesh.DuplicateMesh.
Returns: A mesh.
Since: 5.0

Rhino.Geometry.Mesh.DuplicateMesh
Constructs a copy of this mesh.
This is the same as Rhino.Geometry.Mesh.Duplicate.
Since: 5.0

Rhino.Geometry.Mesh.DisjointMeshCount
Gets the number of disjoint (topologically unconnected) pieces in this mesh.
Since: 5.0

Rhino.Geometry.Mesh.IsClosed
Returns true if every mesh "edge" has two or more faces.
Since: 5.0

Rhino.Geometry.Mesh.IsOriented
Returns true if the mesh is manifold and every pair of faces that share an "edge" have compatible orientations.
Since: 7.6

Rhino.Geometry.Mesh.IsSolid
Returns true if the mesh is solid. A "solid" is a closed oriented manifold.
Since: 7.6

Rhino.Geometry.Mesh.IsManifold
Returns true if every mesh "edge" has at most two faces.
Returns: true if the mesh is manifold, false otherwise.
Since: 7.6

Rhino.Geometry.Mesh.IsManifold(System.Boolean,System.Boolean@,System.Boolean@)
Gets a value indicating whether or not the mesh is manifold.
A manifold mesh does not have any edge that borders more than two faces.
topologicalTest:
If true, the query treats coincident vertices as the same.
isOriented:
isOriented will be set to true if the mesh is a manifold
and adjacent faces have compatible face normals.
hasBoundary:
hasBoundary will be set to true if the mesh is a manifold
and there is at least one "edge" with no more than one adjacent face.
Returns: true if every mesh "edge" has at most two adjacent faces.
Since: 5.0

Rhino.Geometry.Mesh.HasCachedTextureCoordinates
Will return true if SetCachedTextureCoordinates has been called;
otherwise will return false.
Since: 5.10

Rhino.Geometry.Mesh.HasPrincipalCurvatures
HasPrincipalCurvatures
Since: 7.0

Rhino.Geometry.Mesh.Vertices
Gets access to the vertices set of this mesh.
Since: 5.0

Rhino.Geometry.Mesh.TopologyVertices
Gets the Rhino.Geometry.Collections.MeshTopologyVertexList object associated with this mesh.
This object stores vertex connectivity and the indices of vertices
that were unified while computing the edge topology.
Since: 5.0

Rhino.Geometry.Mesh.TopologyEdges
Gets the Rhino.Geometry.Collections.MeshTopologyEdgeList object associated with this mesh.
This object stores edge connectivity.
Since: 5.0

Rhino.Geometry.Mesh.Normals
Gets access to the vertex normal collection in this mesh.
Since: 5.0

Rhino.Geometry.Mesh.Faces
Gets access to the mesh face list.
Since: 5.0

Rhino.Geometry.Mesh.Ngons
Gets access to the mesh ngon list.
Ngons represent groups of Faces (triangles + quads).
Faces are used to tessellate an Ngon internally.
When a triangle or quad is referenced in the Ngon list, it is no longer visualized and
conceived as a single entity, but takes part of the Ngon.
If you need to get access to both Ngons and the faces that are not referenced by Ngons,
that is, all polygons that are visible in the mesh, then use the
Rhino.Geometry.Mesh.GetNgonAndFacesEnumerable helper method.
Since: 6.0

Rhino.Geometry.Mesh.FaceNormals
Gets access to the face normal collection in this mesh.
Since: 5.0

Rhino.Geometry.Mesh.VertexColors
Gets access to the (optional) vertex color collection in this mesh.
Since: 5.0

Rhino.Geometry.Mesh.TextureCoordinates
Gets access to the vertex texture coordinate collection in this mesh.
Since: 5.0

Rhino.Geometry.Mesh.ComponentStates
Gets access to the vertex hidden/visibility collection in this mesh.
This is a runtime property and it is not saved in the 3dm file.
Since: 6.0

Rhino.Geometry.Mesh.ClearTextureData
Removes all texture coordinate information from this mesh.
Since: 5.0

Rhino.Geometry.Mesh.ClearSurfaceData
Removes surface parameters, curvature parameters and surface statistics from the mesh.
Since: 6.0

Rhino.Geometry.Mesh.SetSurfaceParametersFromTextureCoordinates
If the mesh does not have surface evaluation parameters,
has texture coordinates, and the surface parameters can
be set in a way so the existing texture coordinates can
be computed from the surface parameters, then this function
sets the surface parameters. This is useful when meshes
that have texture coordinates and do not have surface
parameters want to set the surface parameters in a way
so that the texture mapping of type
TextureMappingType.SurfaceParameters
will restore the texture coordinates.
Returns:
true - successful
false - failure - no changes made to the mesh
Since: 8.0

Rhino.Geometry.Mesh.DestroyTopology
Removes topology data, forcing all topology information to be recomputed.
Since: 6.0

Rhino.Geometry.Mesh.DestroyTree
Destroys the mesh vertex access tree.
Since: 6.0

Rhino.Geometry.Mesh.DestroyPartition
Destroys mesh partition.
Since: 6.0

Rhino.Geometry.Mesh.EvaluateMeshGeometry(Rhino.Geometry.Surface)
If the mesh has SurfaceParameters, the surface is evaluated at
these parameters and the mesh geometry is updated.
surface: An input surface.
Returns: true if the operation succeeded; false otherwise.
Since: 5.0

Rhino.Geometry.Mesh.SetTextureCoordinates(Rhino.Render.TextureMapping,Rhino.Geometry.Transform,System.Boolean)
Set texture coordinates using given mapping and applying given transform.
Set lazy to false to generate texture coordinates right away.
tm: Texture mapping
xf: Transform to apply to the texture mapping
lazy: Whether to generate lazily (true) or right away (false)
Since: 6.0

Rhino.Geometry.Mesh.SetTextureCoordinates(Rhino.Render.TextureMapping,Rhino.Geometry.Transform,System.Boolean,System.Boolean)
Set texture coordinates using given mapping and applying given transform.
Set lazy to false to generate texture coordinates right away.
tm: Texture mapping
xf: Transform to apply to the texture mapping
lazy: Whether to generate lazily (true) or right away (false)
seamCheck: If true then some mesh edges might be unwelded to better
represent UV discontinuities in the texture mapping.
This only happens for the following mappings:
Box, Sphere, Cylinder
Since: 7.0

Rhino.Geometry.Mesh.SetCachedTextureCoordinates(Rhino.Render.TextureMapping,Rhino.Geometry.Transform@)
Set cached texture coordinates using the specified mapping.
tm:
xf:
Since: 5.10

Rhino.Geometry.Mesh.SetCachedTextureCoordinatesFromMaterial(Rhino.DocObjects.RhinoObject,Rhino.DocObjects.Material)
Sets up cached texture coordinate set for each texture in the material.
Textures in the Material define which mapping channels are used and
the RhinoObject defines what texture mapping is used for each mapping channel.
After this method is called all necessary texture coordinate sets are cached
and correct texture coordinates for each texture can be fetched using
GetCachedTextureCoordinates(RhinoObject rhinoObject, Rhino.DocObjects.Texture texture)
If any texture coordinates are already cached they will not be re-computed.
rhinoObject: RhinoObject that defines texture mappings
material: Material with textures that define mapping channels
Since: 8.7

Rhino.Geometry.Mesh.GetCachedTextureCoordinates(System.Guid)
Call this method to get cached texture coordinates for a texture
mapping with the specified Id.
textureMappingId:
Texture mapping Id
Returns:
Object which allows access to coordinates and other props.
Since: 5.10

Rhino.Geometry.Mesh.GetCachedTextureCoordinates(Rhino.DocObjects.RhinoObject,Rhino.DocObjects.Texture)
Returns cached texture coordinate set based on the texture.
Make sure to set up cached texture coordinates for all textures in the material first by calling
SetCachedTextureCoordinatesFromMaterial(RhinoObject rhinoObject, Rhino.DocObjects.Material material)
If this function returns null then there are no texture coordinates available.
rhinoObject: RhinoObject that defines texture mappings
texture: Texture that defines the mapping channel
Returns: Cached texture coordinates if available and otherwise null
Since: 8.7

Rhino.Geometry.Mesh.InvalidateCachedTextureCoordinates(System.Boolean)
Invalidates all cached texture coordinates. Call this
function when you have made changes that will affect
the texture coordinates on the mesh.
bOnlyInvalidateCachedSurfaceParameterMapping:
If true then only cached surface parameter mapping
texture coordinates will be invalidated. Use this
after making changes to the m_S array.
Since: 8.0

Rhino.Geometry.Mesh.Compact
Removes any unreferenced objects from arrays, re-indexes as needed
and shrinks arrays to minimum required size.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Mesh.Volume
Compute volume of the mesh.
Returns: Volume of the mesh.
Since: 6.0

Rhino.Geometry.Mesh.ComputeCurvatureApproximation(System.Int32,System.Double[]@)
Compute an approximation of the discrete curvatures of the mesh vertices, according to which
type of curvature information is requested.
This method will not yield meaningful values on nonmanifold vertices, and nan on naked vertices.
For now, this method operates solely on the mesh topology (the fully welded mesh),
but distribtes the result across all the ordinary vertices.
This method is a const and thread-safe method and will leave the m_K array untouched.
type:
An integer indicating which curvature is desired.
gaussian_curvature = 1, mean_curvature = 2, minimum unsigned radius of curvature = 3, maximum unsigned radius of curvature = 4
perVertexCurvatures:
Resulting curvature array on success, null on failure. On success, the length of the array is the number of vertices.
Returns: True on success and false on failure.
Since: 8.6

Rhino.Geometry.Mesh.Flip(System.Boolean,System.Boolean,System.Boolean)
Reverses the direction of the mesh.
vertexNormals: If true, vertex normals will be reversed.
faceNormals: If true, face normals will be reversed.
faceOrientation: If true, face orientations will be reversed.
Since: 5.0

Rhino.Geometry.Mesh.Flip(System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Reverses the direction of the mesh.
vertexNormals: If true, vertex normals will be reversed.
faceNormals: If true, face normals will be reversed.
faceOrientation: If true, face orientations will be reversed.
ngonsBoundaryDirection: If true, ngon boundaries will be reversed
Since: 7.0

Rhino.Geometry.Mesh.SolidOrientation
Determines orientation of a "solid" mesh.
Returns:
+1 = mesh is solid with outward facing normals.
-1 = mesh is solid with inward facing normals.
0 = mesh is not solid.
Since: 5.0

Rhino.Geometry.Mesh.IsPointInside(Rhino.Geometry.Point3d,System.Double,System.Boolean)
Determines if a point is inside a solid mesh.
point: 3d point to test.
tolerance:
(>=0) 3d distance tolerance used for ray-mesh intersection
and determining strict inclusion. This is expected to be a tiny value.
strictlyIn:
If strictlyIn is true, then point must be inside mesh by at least
tolerance in order for this function to return true.
If strictlyIn is false, then this function will return true if
point is inside or the distance from point to a mesh face is <= tolerance.
Returns:
true if point is inside the solid mesh, false if not.
Remarks:
The caller is responsible for making certain the mesh is valid, closed, and 2-manifold before
calling this function. If the mesh is not, the behavior is undetermined.
Since: 5.0

Rhino.Geometry.Mesh.Smooth(System.Double,System.Boolean,System.Boolean,System.Boolean,System.Boolean,Rhino.Geometry.SmoothingCoordinateSystem)
Smooths a mesh by averaging the positions of mesh vertices in a specified region.
smoothFactor: The smoothing factor, which controls how much vertices move towards the average of the neighboring vertices.
bXSmooth: When true vertices move in X axis direction.
bYSmooth: When true vertices move in Y axis direction.
bZSmooth: When true vertices move in Z axis direction.
bFixBoundaries: When true vertices along naked edges will not be modified.
coordinateSystem: The coordinates to determine the direction of the smoothing.
Returns: True if successful, false otherwise.
Since: 6.0

Rhino.Geometry.Mesh.Smooth(System.Double,System.Boolean,System.Boolean,System.Boolean,System.Boolean,Rhino.Geometry.SmoothingCoordinateSystem,Rhino.Geometry.Plane)
Smooths a mesh by averaging the positions of mesh vertices in a specified region.
smoothFactor: The smoothing factor, which controls how much vertices move towards the average of the neighboring vertices.
bXSmooth: When true vertices move in X axis direction.
bYSmooth: When true vertices move in Y axis direction.
bZSmooth: When true vertices move in Z axis direction.
bFixBoundaries: When true vertices along naked edges will not be modified.
coordinateSystem: The coordinates to determine the direction of the smoothing.
plane: If SmoothingCoordinateSystem.CPlane specified, then the construction plane.
Returns: True if successful, false otherwise.
Since: 6.0

Rhino.Geometry.Mesh.Smooth(System.Double,System.Int32,System.Boolean,System.Boolean,System.Boolean,System.Boolean,Rhino.Geometry.SmoothingCoordinateSystem,Rhino.Geometry.Plane)
Smooths a mesh by averaging the positions of mesh vertices in a specified region.
smoothFactor: The smoothing factor, which controls how much vertices move towards the average of the neighboring vertices.
numSteps: The number of smoothing iterations.
bXSmooth: When true vertices move in X axis direction.
bYSmooth: When true vertices move in Y axis direction.
bZSmooth: When true vertices move in Z axis direction.
bFixBoundaries: When true vertices along naked edges will not be modified.
coordinateSystem: The coordinates to determine the direction of the smoothing.
plane: If SmoothingCoordinateSystem.CPlane specified, then the construction plane.
Returns: True if successful, false otherwise.
Since: 8.0

Rhino.Geometry.Mesh.Smooth(System.Collections.Generic.IEnumerable{System.Int32},System.Double,System.Boolean,System.Boolean,System.Boolean,System.Boolean,Rhino.Geometry.SmoothingCoordinateSystem,Rhino.Geometry.Plane)
Smooths part of a mesh by averaging the positions of mesh vertices in a specified region.
vertexIndices: The mesh vertex indices that specify the part of the mesh to smooth.
smoothFactor: The smoothing factor, which controls how much vertices move towards the average of the neighboring vertices.
bXSmooth: When true vertices move in X axis direction.
bYSmooth: When true vertices move in Y axis direction.
bZSmooth: When true vertices move in Z axis direction.
bFixBoundaries: When true vertices along naked edges will not be modified.
coordinateSystem: The coordinates to determine the direction of the smoothing.
plane: If SmoothingCoordinateSystem.CPlane specified, then the construction plane.
Returns: True if successful, false otherwise.
Since: 6.8

Rhino.Geometry.Mesh.Smooth(System.Collections.Generic.IEnumerable{System.Int32},System.Double,System.Int32,System.Boolean,System.Boolean,System.Boolean,System.Boolean,Rhino.Geometry.SmoothingCoordinateSystem,Rhino.Geometry.Plane)
Smooths part of a mesh by averaging the positions of mesh vertices in a specified region.
vertexIndices: The mesh vertex indices that specify the part of the mesh to smooth.
smoothFactor: The smoothing factor, which controls how much vertices move towards the average of the neighboring vertices.
numSteps: The number of smoothing iterations.
bXSmooth: When true vertices move in X axis direction.
bYSmooth: When true vertices move in Y axis direction.
bZSmooth: When true vertices move in Z axis direction.
bFixBoundaries: When true vertices along naked edges will not be modified.
coordinateSystem: The coordinates to determine the direction of the smoothing.
plane: If SmoothingCoordinateSystem.CPlane specified, then the construction plane.
Returns: True if successful, false otherwise.
Since: 8.0

Rhino.Geometry.Mesh.Unweld(System.Double,System.Boolean)
Makes sure that faces sharing an edge and having a difference of normal greater
than or equal to angleToleranceRadians have unique vertices along that edge,
adding vertices if necessary.
angleToleranceRadians: Angle at which to make unique vertices.
modifyNormals:
Determines whether new vertex normals will have the same vertex normal as the original (false)
or vertex normals made from the corresponding face normals (true)
Since: 5.0

Rhino.Geometry.Mesh.UnweldEdge(System.Collections.Generic.IEnumerable{System.Int32},System.Boolean)
Adds creases to a smooth mesh by creating coincident vertices along selected edges.
edgeIndices: An array of mesh topology edge indices.
modifyNormals:
If true, the vertex normals on each side of the edge take the same value as the face to which they belong, giving the mesh a hard edge look.
If false, each of the vertex normals on either side of the edge is assigned the same value as the original normal that the pair is replacing, keeping a smooth look.
Returns: true if successful, false otherwise.
Since: 6.3

Rhino.Geometry.Mesh.UnweldVertices(System.Collections.Generic.IEnumerable{System.Int32},System.Boolean)
Ensures that faces sharing a common topological vertex have unique indices into the Rhino.Geometry.Collections.MeshVertexList collection.
topologyVertexIndices:
Topological vertex indices, from the Rhino.Geometry.Collections.MeshTopologyVertexList collection, to be unwelded.
Use Rhino.Geometry.Collections.MeshTopologyVertexList.TopologyVertexIndex(System.Int32) to convert from vertex indices to topological vertex indices.
modifyNormals: If true, the new vertex normals will be calculated from the face normal.
Returns: true if successful, false otherwise.
Since: 7.0

Rhino.Geometry.Mesh.Weld(System.Double)
Makes sure that faces sharing an edge and having a difference of normal less
than or equal to angleToleranceRadians share vertices along that edge, vertex normals
are averaged.
angleToleranceRadians: Angle at which to weld vertices.
Since: 5.0

Rhino.Geometry.Mesh.CreateUnweldedMesh(Rhino.Geometry.Mesh)
Creates a new unwelded mesh from an existing mesh. Texture coordinates are ignored.
mesh: The source mesh to copy.
Returns: The new unwelded mesh if successful, null otherwise.
Since: 8.12

Rhino.Geometry.Mesh.PatchSingleFace(System.Collections.Generic.IEnumerable{Rhino.Geometry.ComponentIndex})
Creates a single mesh face from the given input. The new mesh will be apppended to this mesh.
components: An enumeration of component indexes from this mesh.
This can be one following combinations:
1 vertex (MeshVertex or MeshTopologyVertex) and 1 edge (MeshTopologyEdge),
2 edges (MeshTopologyEdge),
or 3 vertices (MeshVertex or MeshTopologyVertex).
Returns: true if successful, false otherwise.
Since: 8.0

Rhino.Geometry.Mesh.CreateFromPatchSingleFace(Rhino.Geometry.Mesh,System.Collections.Generic.IEnumerable{Rhino.Geometry.ComponentIndex})
Creates a single mesh face from the given input.
mesh: The input mesh.
components: An enumeration of component indexes from the input mesh.
This can be one following combinations:
1 vertex (MeshVertex or MeshTopologyVertex) and 1 edge (MeshTopologyEdge),
2 edges (MeshTopologyEdge),
or 3 vertices (MeshVertex or MeshTopologyVertex).
Returns: A new mesh if successful, null otherwise.
Since: 8.0

Rhino.Geometry.Mesh.Subdivide
Subdivides the faces of the mesh.
Returns: True if successful, false otherwise.
Since: 8.0

Rhino.Geometry.Mesh.Subdivide(System.Collections.Generic.IEnumerable{System.Int32})
Subdivides specific faces of the mesh.
faceIndices: Indices of the faces to subdivide.
Returns: True if successful, false otherwise.
Since: 8.0

Rhino.Geometry.Mesh.RebuildNormals
Removes mesh normals and reconstructs the face and vertex normals based
on the orientation of the faces.
Since: 6.0

Rhino.Geometry.Mesh.ExtractNonManifoldEdges(System.Boolean)
Extracts, or removes, non-manifold mesh edges.
selective: If true, then extract hanging faces only.
Returns: A mesh containing the extracted non-manifold parts if successful, null otherwise.
Since: 6.0

Rhino.Geometry.Mesh.HealNakedEdges(System.Double)
Attempts to "heal" naked edges in a mesh based on a given distance.
First attempts to move vertices to neighboring vertices that are within that
distance away. Then it finds edges that have a closest point to the vertex within
the distance and splits the edge. When it finds one it splits the edge and
makes two new edges using that point.
distance: Distance to not exceed when modifying the mesh.
Returns: true if successful, false otherwise.
Since: 6.0

Rhino.Geometry.Mesh.FillHoles
Attempts to determine "holes" in the mesh by chaining naked edges together.
Then it triangulates the closed polygons adds the faces to the mesh.
Returns: true if successful, false otherwise.
Remarks: This function does not differentiate between inner and outer naked edges.
If you need that, it would be better to use Mesh.FillHole.
Since: 6.0

Rhino.Geometry.Mesh.FileHole(System.Int32)
Given a starting "naked" edge index, this function attempts to determine a "hole"
by chaining additional naked edges together until if returns to the start index.
Then it triangulates the closed polygon and either adds the faces to the mesh.
topologyEdgeIndex: Starting naked edge index.
Returns: true if successful, false otherwise.
Since: 6.0

Rhino.Geometry.Mesh.MatchEdges(System.Double,System.Boolean)
Moves face edges of an open mesh to meet adjacent face edges.
The method will first try to match vertices, and then it will try to split edges to make the edges match.
distance: The distance tolerance. Use larger tolerances only if you select specific edges to close.
rachet:
If true, matching the mesh takes place in four passes starting at a tolerance that is smaller
than your specified tolerance and working up to the specified tolerance with successive passes.
This matches small edges first and works up to larger edges.
If false, then a single pass is made.
Returns: True of edges were matched, false otherwise.
Since: 7.4

Rhino.Geometry.Mesh.UnifyNormals
Attempts to fix inconsistencies in the directions of mesh faces in a mesh. This function
does not modify mesh vertex normals, it rearranges the mesh face winding and face
normals to make them all consistent. Note, you may want to call Mesh.Normals.ComputeNormals()
to recompute vertex normals after calling this functions.
Returns: number of faces that were modified.
Since: 5.0

Rhino.Geometry.Mesh.UnifyNormals(System.Boolean)
Attempts to fix inconsistencies in the directions of mesh faces in a mesh. This function
does not modify mesh vertex normals, it rearranges the mesh face winding and face
normals to make them all consistent. Note, you may want to call Mesh.Normals.ComputeNormals()
to recompute vertex normals after calling this functions.
countOnly: If true, then only the number of faces that would be modified is determined.
Returns: If countOnly=false, the number of faces that were modified. If countOnly=true, the number of faces that would be modified.
Since: 6.0

Rhino.Geometry.Mesh.MergeAllCoplanarFaces(System.Double)
Merges adjacent coplanar faces into single faces.
tolerance:
Tolerance for determining when edges are adjacent.
When in doubt, use the document's ModelAbsoluteTolerance property.
Returns: true if faces were merged, false if no faces were merged.
Since: 7.9

Rhino.Geometry.Mesh.MergeAllCoplanarFaces(System.Double,System.Double)
Merges adjacent coplanar faces into single faces.
tolerance:
Tolerance for determining when edges are adjacent.
When in doubt, use the document's ModelAbsoluteTolerance property.
angleTolerance:
Angle tolerance, in radians, for determining when faces are parallel.
When in doubt, use the document's ModelAngleToleranceRadians property.
Returns: true if faces were merged, false if no faces were merged.
Since: 7.9

Rhino.Geometry.Mesh.SplitDisjointPieces
Splits up the mesh into its unconnected pieces.
Returns: An array containing all the disjoint pieces that make up this Mesh.
Since: 5.0

Rhino.Geometry.Mesh.Split(Rhino.Geometry.Plane)
Split a mesh by an infinite plane.
plane: The splitting plane.
Returns: A new mesh array with the split result. This can be null if no result was found.
Since: 5.0

Rhino.Geometry.Mesh.Split(Rhino.Geometry.Mesh)
Split a mesh with another mesh. Suggestion: upgrade to overload with tolerance.
mesh: Mesh to split with.
Returns: An array of mesh segments representing the split result.
Since: 5.0

Rhino.Geometry.Mesh.Split(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh})
Split a mesh with a collection of meshes. Suggestion: upgrade to overload with tolerance.
Does not split at coplanar intersections.
meshes: Meshes to split with.
Returns: An array of mesh segments representing the split result.
Since: 5.0

Rhino.Geometry.Mesh.Split(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Double,System.Boolean,Rhino.FileIO.TextLog,System.Threading.CancellationToken,System.IProgress{System.Double})
Split a mesh with a collection of meshes.
meshes: Meshes to split with.
tolerance: A value for intersection tolerance.
WARNING! Correct values are typically in the (10e-8 - 10e-4) range.
An option is to use the document tolerance diminished by a few orders or magnitude.
splitAtCoplanar: If false, coplanar areas will not be separated.
textLog: A text log to write onto.
cancel: A cancellation token.
progress: A progress reporter item. This can be null.
Returns: An array of mesh parts representing the split result, or null: when no mesh intersected, or if a cancel stopped the computation.
Since: 7.0

Rhino.Geometry.Mesh.Split(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Double,System.Boolean,System.Boolean,Rhino.FileIO.TextLog,System.Threading.CancellationToken,System.IProgress{System.Double})
Split a mesh with a collection of meshes.
meshes: Meshes to split with.
tolerance: A value for intersection tolerance.
WARNING! Correct values are typically in the (10e-8 - 10e-4) range.
An option is to use the document tolerance diminished by a few orders or magnitude.
splitAtCoplanar: If false, coplanar areas will not be separated.
createNgons: If true, creates ngons along the split ridge.
textLog: A text log to write onto.
cancel: A cancellation token.
progress: A progress reporter item. This can be null.
Returns: An array of mesh parts representing the split result, or null: when no mesh intersected, or if a cancel stopped the computation.
Since: 7.0

Rhino.Geometry.Mesh.GetOutlines(Rhino.Geometry.Plane)
Constructs the outlines of a mesh projected against a plane.
plane: A plane to project against.
Returns: An array of polylines, or null on error.
Since: 5.0

Rhino.Geometry.Mesh.GetOutlines(Rhino.Display.RhinoViewport)
Constructs the outlines of a mesh. The projection information in the
viewport is used to determine how the outlines are projected.
viewport: A viewport to determine projection direction.
Returns: An array of polylines, or null on error.
Since: 5.0

Rhino.Geometry.Mesh.GetOutlines(Rhino.DocObjects.ViewportInfo,Rhino.Geometry.Plane)
Constructs the outlines of a mesh.
viewportInfo: The viewport info that provides the outline direction.
plane: Usually the view's construction plane. If a parallel projection and view plane is parallel to this, then project the results to the plane.
Returns: An array of polylines, or null on error.
Since: 6.0

Rhino.Geometry.Mesh.GetNakedEdges
Returns all edges of a mesh that are considered "naked" in the
sense that the edge only has one face.
Returns: An array of polylines, or null on error.
Since: 5.0

Rhino.Geometry.Mesh.ExplodeAtUnweldedEdges
Explode the mesh into sub-meshes where a sub-mesh is a collection of faces that are contained
within a closed loop of "unwelded" edges. Unwelded edges are edges where the faces that share
the edge have unique mesh vertices (not mesh topology vertices) at both ends of the edge.
Returns:
Array of sub-meshes on success; null on error. If the count in the returned array is 1, then
nothing happened and the output is essentially a copy of the input.
Since: 5.0

Rhino.Geometry.Mesh.Append(Rhino.Geometry.Mesh)
Appends a copy of another mesh to this one and updates indices of appended mesh parts.
other: Mesh to append to this one.
Since: 5.0

Rhino.Geometry.Mesh.Append(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh})
Append a list of meshes. This function is much more efficient than making
repeated calls to Mesh.Append(Mesh) when lots of meshes are being joined
into a single large mesh.
meshes: Meshes to append to this one.
Since: 6.8

Rhino.Geometry.Mesh.ClosestPoint(Rhino.Geometry.Point3d)
Gets the point on the mesh that is closest to a given test point.
testPoint: Point to search for.
Returns: The point on the mesh closest to testPoint, or Point3d.Unset on failure.
Since: 5.0

Rhino.Geometry.Mesh.ClosestMeshPoint(Rhino.Geometry.Point3d,System.Double)
Gets the point on the mesh that is closest to a given test point. Similar to the
ClosestPoint function except this returns a MeshPoint class which includes
extra information beyond just the location of the closest point.
testPoint: The source of the search.
maximumDistance:
Optional upper bound on the distance from test point to the mesh.
If you are only interested in finding a point Q on the mesh when
testPoint.DistanceTo(Q) < maximumDistance,
then set maximumDistance to that value.
This parameter is ignored if you pass 0.0 for a maximumDistance.
Returns: closest point information on success. null on failure.
Since: 5.0

Rhino.Geometry.Mesh.ClosestPoint(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d@,System.Double)
Gets the point on the mesh that is closest to a given test point.
testPoint: Point to search for.
pointOnMesh: Point on the mesh closest to testPoint.
maximumDistance:
Optional upper bound on the distance from test point to the mesh.
If you are only interested in finding a point Q on the mesh when
testPoint.DistanceTo(Q) < maximumDistance,
then set maximumDistance to that value.
This parameter is ignored if you pass 0.0 for a maximumDistance.
Returns:
Index of face that the closest point lies on if successful.
-1 if not successful; the value of pointOnMesh is undefined.
Since: 5.0

Rhino.Geometry.Mesh.ClosestPoint(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d@,Rhino.Geometry.Vector3d@,System.Double)
Gets the point on the mesh that is closest to a given test point.
testPoint: Point to search for.
pointOnMesh: Point on the mesh closest to testPoint.
normalAtPoint: The normal vector of the mesh at the closest point.
maximumDistance:
Optional upper bound on the distance from test point to the mesh.
If you are only interested in finding a point Q on the mesh when
testPoint.DistanceTo(Q) < maximumDistance,
then set maximumDistance to that value.
This parameter is ignored if you pass 0.0 for a maximumDistance.
Returns:
Index of face that the closest point lies on if successful.
-1 if not successful; the value of pointOnMesh is undefined.
Since: 5.0

Rhino.Geometry.Mesh.PointAt(Rhino.Geometry.MeshPoint)
Evaluate a mesh at a set of barycentric coordinates.
meshPoint: MeshPoint instance containing a valid Face Index and Barycentric coordinates.
Returns: A Point on the mesh or Point3d.Unset if the faceIndex is not valid or if the barycentric coordinates could not be evaluated.
Since: 5.0

Rhino.Geometry.Mesh.PointAt(System.Int32,System.Double,System.Double,System.Double,System.Double)
Evaluates a mesh at a set of barycentric coordinates. Barycentric coordinates must
be assigned in accordance with the rules as defined by MeshPoint.T.
faceIndex: Index of triangle or quad to evaluate.
t0: First barycentric coordinate.
t1: Second barycentric coordinate.
t2: Third barycentric coordinate.
t3: Fourth barycentric coordinate. If the face is a triangle, this coordinate will be ignored.
Returns: A Point on the mesh or Point3d.Unset if the faceIndex is not valid or if the barycentric coordinates could not be evaluated.
Since: 5.0

Rhino.Geometry.Mesh.NormalAt(Rhino.Geometry.MeshPoint)
Evaluate a mesh normal at a set of barycentric coordinates.
meshPoint: MeshPoint instance containing a valid Face Index and Barycentric coordinates.
Returns: A Normal vector to the mesh or Vector3d.Unset if the faceIndex is not valid or if the barycentric coordinates could not be evaluated.
Since: 5.0

Rhino.Geometry.Mesh.NormalAt(System.Int32,System.Double,System.Double,System.Double,System.Double)
Evaluate a mesh normal at a set of barycentric coordinates. Barycentric coordinates must
be assigned in accordance with the rules as defined by MeshPoint.T.
faceIndex: Index of triangle or quad to evaluate.
t0: First barycentric coordinate.
t1: Second barycentric coordinate.
t2: Third barycentric coordinate.
t3: Fourth barycentric coordinate. If the face is a triangle, this coordinate will be ignored.
Returns: A Normal vector to the mesh or Vector3d.Unset if the faceIndex is not valid or if the barycentric coordinates could not be evaluated.
Since: 5.0

Rhino.Geometry.Mesh.ColorAt(Rhino.Geometry.MeshPoint)
Evaluate a mesh color at a set of barycentric coordinates.
meshPoint: MeshPoint instance containing a valid Face Index and Barycentric coordinates.
Returns: The interpolated vertex color on the mesh or Color.Transparent if the faceIndex is not valid,
if the barycentric coordinates could not be evaluated, or if there are no colors defined on the mesh.
Since: 5.0

Rhino.Geometry.Mesh.ColorAt(System.Int32,System.Double,System.Double,System.Double,System.Double)
Evaluate a mesh normal at a set of barycentric coordinates. Barycentric coordinates must
be assigned in accordance with the rules as defined by MeshPoint.T.
faceIndex: Index of triangle or quad to evaluate.
t0: First barycentric coordinate.
t1: Second barycentric coordinate.
t2: Third barycentric coordinate.
t3: Fourth barycentric coordinate. If the face is a triangle, this coordinate will be ignored.
Returns: The interpolated vertex color on the mesh or Color.Transparent if the faceIndex is not valid,
if the barycentric coordinates could not be evaluated, or if there are no colors defined on the mesh.
Remarks: Coordinate 0,0,0,0 is not a valid set of barycentric coordinates. The sum of t0 to t3 should be 1.
Since: 5.0

Rhino.Geometry.Mesh.PullPointsToMesh(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Pulls a collection of points to a mesh.
points: An array, a list or any enumerable set of points.
Returns: An array of points. This can be empty.
Since: 5.0

Rhino.Geometry.Mesh.PullCurve(Rhino.Geometry.Curve,System.Double)
Gets a polyline approximation of the input curve and then moves its control points to the closest point on the mesh.
Then it "connects the points" over edges so that a polyline on the mesh is formed.
curve: A curve to pull.
tolerance: A tolerance value.
Returns: A polyline curve, or null if none could be constructed.
Since: 7.0

Rhino.Geometry.Mesh.SplitWithProjectedPolylines(System.Collections.Generic.IEnumerable{Rhino.Geometry.PolylineCurve},System.Double)
Splits a mesh by adding edges in correspondence with input polylines, and divides the mesh at partitioned areas.
Polyline segments that are measured not to be on the mesh will be ignored.
curves: An array, a list or any enumerable of polyline curves.
tolerance: A tolerance value.
Returns: An array of meshes, or null if no change would happen.
Since: 7.0

Rhino.Geometry.Mesh.SplitWithProjectedPolylines(System.Collections.Generic.IEnumerable{Rhino.Geometry.PolylineCurve},System.Double,Rhino.FileIO.TextLog,System.Threading.CancellationToken,System.IProgress{System.Double})
Splits a mesh by adding edges in correspondence with input polylines, and divides the mesh at partitioned areas.
Polyline segments that are measured not to be on the mesh will be ignored.
curves: An array, a list or any enumerable of polyline curves.
tolerance: A tolerance value.
textLog: A text log, or null.
cancel: A cancellation token to stop the computation at a given point.
progress: A progress reporter to inform the user about progress. The reported value is indicative.
Returns: An array of meshes, or null if no change would happen.
Since: 7.0

Rhino.Geometry.Mesh.Offset(System.Double)
Makes a new mesh with vertices offset a distance in the opposite direction of the existing vertex normals.
Same as Mesh.Offset(distance, false)
distance: A distance value to use for offsetting.
Returns: A new mesh on success, or null on failure.
Since: 5.0

Rhino.Geometry.Mesh.Offset(System.Double,System.Boolean)
Makes a new mesh with vertices offset a distance in the opposite direction of the existing vertex normals.
Optionally, based on the value of solidify, adds the input mesh and a ribbon of faces along any naked edges.
If solidify is false it acts exactly as the Offset(distance) function.
distance: A distance value.
solidify: true if the mesh should be solidified.
Returns: A new mesh on success, or null on failure.
Since: 5.0

Rhino.Geometry.Mesh.Offset(System.Double,System.Boolean,Rhino.Geometry.Vector3d)
Makes a new mesh with vertices offset a distance along the direction parameter.
Optionally, based on the value of solidify, adds the input mesh and a ribbon of faces along any naked edges.
If solidify is false it acts exactly as the Offset(distance) function.
distance: A distance value.
solidify: true if the mesh should be solidified.
direction: Direction of offset for all vertices.
Returns: A new mesh on success, or null on failure.
Since: 6.2

Rhino.Geometry.Mesh.Offset(System.Double,System.Boolean,Rhino.Geometry.Vector3d,System.Collections.Generic.List{System.Int32}@)
Makes a new mesh with vertices offset a distance along the direction parameter.
Optionally, based on the value of solidify, adds the input mesh and a ribbon of faces along any naked edges.
If solidify is false it acts exactly as the Offset(distance) function. Returns list of wall faces, i.e. the
faces that connect original and offset mesh when solidified.
distance: A distance value.
solidify: true if the mesh should be solidified.
direction: Direction of offset for all vertices.
wallFacesOut: Returns list of wall faces.
Returns: A new mesh on success, or null on failure.

Rhino.Geometry.Mesh.CollapseFacesByEdgeLength(System.Boolean,System.Double)
Collapses multiple mesh faces, with greater/less than edge length, based on the principles
found in Stan Melax's mesh reduction PDF,
see http://pomax.nihongoresources.com/downloads/PolygonReduction.pdf
bGreaterThan: Determines whether edge with lengths greater than or less than edgeLength are collapsed.
edgeLength: Length with which to compare to edge lengths.
Returns: Number of edges (faces) that were collapsed, -1 for general failure (like bad topology or index out of range)
or -2 if all of the edges would be collapsed and the resulting mesh would be invalid.
Remarks:
This number may differ from the initial number of edges that meet
the input criteria because the lengths of some initial edges may be altered as other edges are collapsed.
Since: 6.0

Rhino.Geometry.Mesh.CollapseFacesByArea(System.Double,System.Double)
Collapses multiple mesh faces, with areas less than LessThanArea and greater than GreaterThanArea,
based on the principles found in Stan Melax's mesh reduction PDF,
see http://pomax.nihongoresources.com/downloads/PolygonReduction.pdf
lessThanArea: Area in which faces are selected if their area is less than or equal to.
greaterThanArea: Area in which faces are selected if their area is greater than or equal to.
Returns: Number of faces that were collapsed in the process.
Remarks:
This number may differ from the initial number of faces that meet
the input criteria because the areas of some initial faces may be altered as other faces are collapsed.
The face area must be both less than LessThanArea AND greater than GreaterThanArea in order to be considered.
Use large numbers for lessThanArea or zero for greaterThanArea to simulate an OR.
Since: 6.0

Rhino.Geometry.Mesh.CollapseFacesByByAspectRatio(System.Double)
Collapses a multiple mesh faces, determined by face aspect ratio, based on criteria found in Stan Melax's polygon reduction,
see http://pomax.nihongoresources.com/downloads/PolygonReduction.pdf
aspectRatio: Faces with an aspect ratio less than aspectRatio are considered as candidates.
Returns: Number of faces that were collapsed in the process.
Remarks:
This number may differ from the initial number of faces that meet
the input criteria because the aspect ratios of some initial faces may be altered as other faces are collapsed.
Since: 6.0

Rhino.Geometry.Mesh.GetUnsafeLock(System.Boolean)
Allows to obtain unsafe pointers to the underlying unmanaged data structures of the mesh.
writable: true if user will need to write onto the structure. false otherwise.
Returns: A lock that needs to be released.
Remarks: The lock implements the IDisposable interface, and one call of its
System.IDisposable.Dispose or Rhino.Geometry.Mesh.ReleaseUnsafeLock(Rhino.Geometry.MeshUnsafeLock) will update the data structure as required.
This can be achieved with a using statement (Using in Vb.Net).
Since: 6.0

Rhino.Geometry.Mesh.ReleaseUnsafeLock(Rhino.Geometry.MeshUnsafeLock)
Updates the Mesh data with the information that was stored via the Rhino.Geometry.MeshUnsafeLock.
meshData: The data that will be unlocked.
Since: 6.0

Rhino.Geometry.Mesh.WithShutLining(System.Boolean,System.Double,System.Collections.Generic.IEnumerable{Rhino.Geometry.ShutLiningCurveInfo})
Constructs new mesh from the current one, with shut lining applied to it.
faceted: Specifies whether the shutline is faceted.
tolerance: The tolerance of the shutline.
curves: A collection of curve arguments.
Returns: A new mesh with shutlining. Null on failure.
Throws System.ArgumentNullException: If curves is null.
Throws System.InvalidOperationException: If displacement failed
because of an error. The exception message specifies the error.
Since: 6.0

Rhino.Geometry.Mesh.WithDisplacement(Rhino.Geometry.MeshDisplacementInfo)
Constructs new mesh from the current one, with displacement applied to it.
displacement: Information on mesh displacement.
Returns: A new mesh with shutlining.
Throws System.ArgumentNullException: If displacer is null.
Throws System.InvalidOperationException: If displacement failed
because of an error. The exception message specifies the error.
Since: 6.0

Rhino.Geometry.Mesh.WithEdgeSoftening(System.Double,System.Boolean,System.Boolean,System.Boolean,System.Double)
Constructs new mesh from the current one, with edge softening applied to it.
softeningRadius: The softening radius.
chamfer: Specifies whether to chamfer the edges.
faceted: Specifies whether the edges are faceted.
force: Specifies whether to soften edges despite too large a radius.
angleThreshold: Threshold angle (in degrees) which controls whether an edge is softened or not.
The angle refers to the angles between the adjacent faces of an edge.
Returns: A new mesh with soft edges.
Throws System.InvalidOperationException: If displacement failed
because of an error. The exception message specifies the error.
Since: 6.0

Rhino.Geometry.Mesh.GetNakedEdgePointStatus
Returns an array of Boolean values equal in length to the number of vertices in this
mesh. Each value corresponds to a mesh vertex and is set to true if the vertex is
not completely surrounded by faces.
Returns: An array of true/false flags that, at each index, reveals if the corresponding
vertex is completely surrounded by faces.
Since: 5.0

Rhino.Geometry.Mesh.CreatePartitions(System.Int32,System.Int32)
In ancient times (or modern smart phone times), some rendering engines
were only able to process small batches of triangles and the
CreatePartitions() function was provided to partition the mesh into
subsets of vertices and faces that those rendering engines could handle.
maximumVertexCount:
maximumTriangleCount:
Returns: true on success
Since: 5.6

Rhino.Geometry.Mesh.PartitionCount
Number of partition information chunks stored on this mesh based
on the last call to CreatePartitions
Since: 5.6

Rhino.Geometry.Mesh.GetPartition(System.Int32)
Retrieves a partition. See Rhino.Geometry.Mesh.CreatePartitions(System.Int32,System.Int32) for details.
which: The partition index.
Returns:
Since: 5.6

Rhino.Geometry.Mesh.GetNgonAndFacesEnumerable
Retrieves a complete enumerable, i.e., one that provides an iterator over every face that is present,
no matter if defined as a triangle, a quad, or a strictly over-four-sided ngon.
Returns: The enumerator capable of enumerating through Mesh.Ngons> Mesh.Ngons and Faces
Since: 6.0

Rhino.Geometry.Mesh.GetNgonAndFacesCount
Retrieves the count of items that Rhino.Geometry.Mesh.GetNgonAndFacesEnumerable will provide.
Returns: The amount of faces that are not part of an ngon + the amount of ngons.
Since: 6.0

Rhino.Geometry.Mesh.CreateVertexColorsFromBitmap(Rhino.RhinoDoc,Rhino.Render.TextureMapping,Rhino.Geometry.Transform,System.Drawing.Bitmap)
Populate the vertex colors from a bitmap image.
doc: The document associated with this operation for searching purposes.
mapping: The texture mapping to be used on the mesh.  Surface parameter mapping is assumed if null - but surface parameters must be available on the mesh.
xform: Local mapping transform for the mesh mapping.  Use identity for surface parameter mapping.
bitmap: The bitmap to use for the colors.
Returns:
Since: 7.10

Rhino.Geometry.Mesh.QuadRemeshBrep(Rhino.Geometry.Brep,Rhino.Geometry.QuadRemeshParameters)
Create QuadRemesh from a Brep
Set Brep Face Mode by setting QuadRemeshParameters.PreserveMeshArrayEdgesMode
brep:
parameters:
Returns:
Since: 7.0

Rhino.Geometry.Mesh.QuadRemeshBrep(Rhino.Geometry.Brep,Rhino.Geometry.QuadRemeshParameters,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})
Create Quad Remesh from a Brep
brep:
Set Brep Face Mode by setting QuadRemeshParameters.PreserveMeshArrayEdgesMode
parameters:
guideCurves:
A curve array used to influence mesh face layout
The curves should touch the input mesh
Set Guide Curve Influence by using QuadRemeshParameters.GuideCurveInfluence
Returns:
Since: 7.0

Rhino.Geometry.Mesh.QuadRemeshBrepAsync(Rhino.Geometry.Brep,Rhino.Geometry.QuadRemeshParameters,System.IProgress{System.Int32},System.Threading.CancellationToken)
Quad remesh this Brep asynchronously.
brep:
Set Brep Face Mode by setting QuadRemeshParameters.PreserveMeshArrayEdgesMode
parameters:
progress:
cancelToken:
Returns:
Since: 7.0

Rhino.Geometry.Mesh.QuadRemeshBrepAsync(Rhino.Geometry.Brep,Rhino.Geometry.QuadRemeshParameters,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.IProgress{System.Int32},System.Threading.CancellationToken)
Quad remesh this Brep asynchronously.
brep:
Set Brep Face Mode by setting QuadRemeshParameters.PreserveMeshArrayEdgesMode
parameters:
guideCurves:
A curve array used to influence mesh face layout
The curves should touch the input mesh
Set Guide Curve Influence by using QuadRemeshParameters.GuideCurveInfluence
progress:
cancelToken:
Returns:
Since: 7.0

Rhino.Geometry.Mesh.QuadRemesh(Rhino.Geometry.QuadRemeshParameters)
Quad remesh this mesh.
parameters:
Returns:
Since: 7.0

Rhino.Geometry.Mesh.QuadRemesh(Rhino.Geometry.QuadRemeshParameters,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})
Quad remesh this mesh.
parameters:
guideCurves:
A curve array used to influence mesh face layout
The curves should touch the input mesh
Set Guide Curve Influence by using QuadRemeshParameters.GuideCurveInfluence
Returns:
Since: 7.0

Rhino.Geometry.Mesh.QuadRemeshAsync(Rhino.Geometry.QuadRemeshParameters,System.IProgress{System.Int32},System.Threading.CancellationToken)
Quad remesh this mesh asynchronously.
parameters:
progress:
cancelToken:
Returns:
Since: 7.0

Rhino.Geometry.Mesh.QuadRemeshAsync(Rhino.Geometry.QuadRemeshParameters,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.IProgress{System.Int32},System.Threading.CancellationToken)
Quad remesh this mesh asynchronously.
parameters:
guideCurves:
A curve array used to influence mesh face layout
The curves should touch the input mesh
Set Guide Curve Influence by using QuadRemeshParameters.GuideCurveInfluence
progress:
cancelToken:
Returns:
Since: 7.0

Rhino.Geometry.Mesh.QuadRemeshAsync(System.Collections.Generic.IEnumerable{System.Int32},Rhino.Geometry.QuadRemeshParameters,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.IProgress{System.Int32},System.Threading.CancellationToken)
Quad remesh this mesh asynchronously.
faceBlocks:
parameters:
guideCurves:
A curve array used to influence mesh face layout
The curves should touch the input mesh
Set Guide Curve Influence by using QuadRemeshParameters.GuideCurveInfluence
progress:
cancelToken:
Returns:
Since: 7.0

Rhino.Geometry.Mesh.ShrinkWrap(Rhino.Geometry.ShrinkWrapParameters)
Returns a ShrinkWrapped mesh or
null when a mesh was not created or error.
parameters:
A ShrinkWrapParameters object that specifies the configuration settings for the ShrinkWrap process.
Returns:
Since: 8.0

Rhino.Geometry.Mesh.ShrinkWrap(Rhino.Geometry.ShrinkWrapParameters,System.Threading.CancellationToken)
Returns a ShrinkWrapped mesh or
null when a mesh was not created or error.
Supports cancellation during volumetric calculations.
parameters: A ShrinkWrapParameters object that specifies the configuration settings for the ShrinkWrap process.
token: Supports cancellation during volumetric calculations.
Returns:
Since: 8.0

Rhino.Geometry.Mesh.ShrinkWrap(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Geometry.ShrinkWrapParameters)
Creates a unified ShrinkWrap mesh from a collection of input meshes.
Returns null on error or failure.
meshes:
parameters: A ShrinkWrapParameters object that specifies the configuration settings for the ShrinkWrap process.
Returns:
Since: 8.0

Rhino.Geometry.Mesh.ShrinkWrap(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Geometry.ShrinkWrapParameters,System.Threading.CancellationToken)
Creates a unified ShrinkWrap mesh from a collection of input meshes.
Returns null on error or failure.
Supports cancellation during volumetric calculations.
meshes:
parameters:
token: Supports cancellation during volumetric calculations.
Returns:
Since: 8.21

Rhino.Geometry.Mesh.ShrinkWrap(Rhino.Geometry.PointCloud,Rhino.Geometry.ShrinkWrapParameters)
Creates a unified ShrinkWrap mesh from a point cloud
returns null on error or failure
pointCloud:
parameters:
Returns:
Since: 8.0

Rhino.Geometry.Mesh.ShrinkWrap(Rhino.Geometry.PointCloud,Rhino.Geometry.ShrinkWrapParameters,System.Threading.CancellationToken)
Creates a unified ShrinkWrap mesh from a point cloud
returns null on error or failure
Supports cancellation during volumetric calculations.
pointCloud:
parameters:
token:
Returns:
Since: 8.21

Rhino.Geometry.Mesh.ShrinkWrap(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},Rhino.Geometry.ShrinkWrapParameters,Rhino.Geometry.MeshingParameters)
Creates a unified ShrinkWrap mesh from a collection of GeometryBase objects.
returns null or error on failure
geometryBases:
parameters: A ShrinkWrapParameters object that specifies the configuration settings for the ShrinkWrap process.
meshingParameters: GeometryBase objects are converted to meshes first using the MeshingParameters provided. Those meshes are then used in the ShrinkWrap process.
Returns:
Since: 8.3

Rhino.Geometry.Mesh.ShrinkWrap(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},Rhino.Geometry.ShrinkWrapParameters,Rhino.Geometry.MeshingParameters,System.Threading.CancellationToken)
Creates a unified ShrinkWrap mesh from a collection of GeometryBase objects.
returns null or error on failure
Supports cancellation during volumetric calculations. geometryBase mesh creation is not cancellable
geometryBases:
parameters: A ShrinkWrapParameters object that specifies the configuration settings for the ShrinkWrap process.
meshingParameters: GeometryBase objects are converted to meshes first using the MeshingParameters provided. Those meshes are then used in the ShrinkWrap process.
token: Supports cancellation during volumetric calculations. geometryBase mesh creation is not cancellable
Returns:
Since: 8.21

Rhino.Geometry.Mesh.Reduce(System.Int32,System.Boolean,System.Int32,System.Boolean)
Reduce polygon count
desiredPolygonCount: desired or target number of faces
allowDistortion:
If true, faces are removed until desiredPolygonCount is reached, distorting the shape as needed.
If false, only flat (coplanar) regions are simplified, which leaves the shape unchanged and
ignores desiredPolygonCount.
accuracy: Integer from 1 to 10 telling how accurate reduction algorithm
to use. Greater number gives more accurate results
normalizeSize: If true mesh is fitted to an axis aligned unit cube until reduction is complete
Returns: True if mesh is successfully reduced and false if mesh could not be reduced for some reason.
Since: 5.10

Rhino.Geometry.Mesh.Reduce(System.Int32,System.Boolean,System.Int32,System.Boolean,System.Boolean)
Reduce polygon count
desiredPolygonCount: desired or target number of faces
allowDistortion:
If true, faces are removed until desiredPolygonCount is reached, distorting the shape as needed.
If false, only flat (coplanar) regions are simplified, which leaves the shape unchanged and
ignores desiredPolygonCount.
accuracy: Integer from 1 to 10 telling how accurate reduction algorithm
to use. Greater number gives more accurate results
normalizeSize: If true mesh is fitted to an axis aligned unit cube until reduction is complete
threaded:
If True then will run computation inside a worker thread and ignore any provided CancellationTokens and ProgressReporters.
If False then will run on main thread.
Returns: True if mesh is successfully reduced and false if mesh could not be reduced for some reason.
Since: 6.15

Rhino.Geometry.Mesh.Reduce(System.Int32,System.Boolean,System.Int32,System.Boolean,System.Threading.CancellationToken,System.IProgress{System.Double},System.String@)
Reduce polygon count
desiredPolygonCount: desired or target number of faces
allowDistortion:
If true, faces are removed until desiredPolygonCount is reached, distorting the shape as needed.
If false, only flat (coplanar) regions are simplified, which leaves the shape unchanged and
ignores desiredPolygonCount.
accuracy: Integer from 1 to 10 telling how accurate reduction algorithm
to use. Greater number gives more accurate results
normalizeSize: If true mesh is fitted to an axis aligned unit cube until reduction is complete
cancelToken:
progress:
problemDescription:
Returns: True if mesh is successfully reduced and false if mesh could not be reduced for some reason.
Since: 6.0

Rhino.Geometry.Mesh.Reduce(System.Int32,System.Boolean,System.Int32,System.Boolean,System.Threading.CancellationToken,System.IProgress{System.Double},System.String@,System.Boolean)
Reduce polygon count
desiredPolygonCount: desired or target number of faces
allowDistortion:
If true, faces are removed until desiredPolygonCount is reached, distorting the shape as needed.
If false, only flat (coplanar) regions are simplified, which leaves the shape unchanged and
ignores desiredPolygonCount.
accuracy: Integer from 1 to 10 telling how accurate reduction algorithm
to use. Greater number gives more accurate results
normalizeSize: If true mesh is fitted to an axis aligned unit cube until reduction is complete
cancelToken:
progress:
problemDescription:
threaded:
If True then will run computation inside a worker thread and ignore any provided CancellationTokens and ProgressReporters.
If False then will run on main thread.
Returns: True if mesh is successfully reduced and false if mesh could not be reduced for some reason.
Since: 6.15

Rhino.Geometry.Mesh.Reduce(Rhino.Geometry.ReduceMeshParameters)
Reduce polygon count
parameters: Parameters
Returns: True if mesh is successfully reduced and false if mesh could not be reduced for some reason.
Since: 6.0

Rhino.Geometry.Mesh.Reduce(Rhino.Geometry.ReduceMeshParameters,System.Boolean)
Reduce polygon count
parameters: Parameters
threaded:
If True then will run computation inside a worker thread and ignore any provided CancellationTokens and ProgressReporters.
If False then will run on main thread.
Returns: True if mesh is successfully reduced and false if mesh could not be reduced for some reason.
Since: 6.15

Rhino.Geometry.Mesh.ComputeThickness(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Double)
Compute thickness metrics for this mesh.
meshes: Meshes to include in thickness analysis.
maximumThickness: Maximum thickness to consider. Use as small a thickness as possible to speed up the solver.
Returns: Array of thickness measurements.
Since: 6.0

Rhino.Geometry.Mesh.ComputeThickness(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Double,System.Threading.CancellationToken)
Compute thickness metrics for this mesh.
meshes: Meshes to include in thickness analysis.
maximumThickness: Maximum thickness to consider. Use as small a thickness as possible to speed up the solver.
cancelToken: Computation cancellation token.
Returns: Array of thickness measurements.
Since: 6.0

Rhino.Geometry.Mesh.ComputeThickness(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Double,System.Double,System.Threading.CancellationToken)
Compute thickness metrics for this mesh.
meshes: Meshes to include in thickness analysis.
maximumThickness: Maximum thickness to consider. Use as small a thickness as possible to speed up the solver.
sharpAngle: Sharpness angle in radians.
cancelToken: Computation cancellation token.
Returns: Array of thickness measurements.
Since: 6.0

Rhino.Geometry.Mesh.CreateContourCurves(Rhino.Geometry.Mesh,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
(Old call maintained for compatibility.)
meshToContour: Avoid.
contourStart: Avoid.
contourEnd: Avoid.
interval: Avoid.
Returns: Avoid.
Since: 5.0
7.13

Rhino.Geometry.Mesh.CreateContourCurves(Rhino.Geometry.Mesh,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double)
Constructs contour curves for a mesh, sectioned along a linear axis.
meshToContour: A mesh to contour.
contourStart: A start point of the contouring axis.
contourEnd: An end point of the contouring axis.
interval: An interval distance.
tolerance: A tolerance value. If negative, the positive value will be used.
WARNING! Good tolerance values are in the magnitude of 10^-7, or RhinoMath.SqrtEpsilon*10.
See comments at Rhino.Geometry.Intersect.Intersection.MeshIntersectionsTolerancesCoefficient
Returns: An array of curves. This array can be empty.
Since: 7.13

Rhino.Geometry.Mesh.CreateContourCurves(Rhino.Geometry.Mesh,Rhino.Geometry.Plane)
(Old call maintained for compatibility.)
meshToContour: Avoid.
sectionPlane: Avoid.
Returns: Avoid.
Since: 5.0
7.13

Rhino.Geometry.Mesh.CreateContourCurves(Rhino.Geometry.Mesh,Rhino.Geometry.Plane,System.Double)
Constructs contour curves for a mesh, sectioned at a plane.
meshToContour: A mesh to contour.
sectionPlane: A cutting plane.
tolerance: A tolerance value. If negative, the positive value will be used.
WARNING! Good tolerance values are in the magnitude of 10^-7, or RhinoMath.SqrtEpsilon*10.
See comments at Rhino.Geometry.Intersect.Intersection.MeshIntersectionsTolerancesCoefficient
Returns: An array of curves. This array can be empty.
Since: 7.13
Rhino.Geometry.Intersect.Intersection.MeshPlane(Rhino.Geometry.Mesh,Rhino.Geometry.Plane)

Rhino.Geometry.Mesh.GetSelfIntersections(System.Double,Rhino.Geometry.Polyline[]@,System.Boolean,Rhino.Geometry.Polyline[]@,System.Boolean,Rhino.Geometry.Mesh@,Rhino.FileIO.TextLog,System.Threading.CancellationToken,System.IProgress{System.Double})
Gets the intersections of this mesh with itself.
tolerance: A tolerance value. If negative, the positive value will be used.
WARNING! Good tolerance values are in the magnitude of 10^-7, or RhinoMath.SqrtEpsilon*10.
Returns: An array of intersection and overlaps polylines.
perforations: The array of perforations.
overlapsPolylines: If true, the next argument is computed.
overlapsPolylinesResult: The array of overlaps, in terms of polylines.
overlapsMesh: If true, the next argument is computed.
overlapsMeshResult: A mesh that represents the overlaps in terms of surfaces.
textLog: A report of the outcome.
cancel: A cancellation token.
progress: A progress reporter.
Returns: True on success, false on failure and cancellation.
Since: 7.0

Rhino.Geometry.Mesh.CreateFromLines(Rhino.Geometry.Curve[],System.Int32,System.Double)
Creates a mesh by analizing the edge structure. Input lines could be from the extraction
of edges from an original mesh.
lines: Lines to use for computation. If curve is non-linear, curve ends are used
maxFaceValence: The maximum number of edges per face.
tolerance: The distance after which two end points of lines are considered
coincident.
Returns: A new mesh, or null if no mesh is constructed.
Since: 6.0

Rhino.Geometry.Mesh.CreateRefinedLoopMesh(Rhino.Geometry.Mesh,Rhino.Geometry.MeshRefinements.LoopFormula,Rhino.Geometry.MeshRefinements.RefinementSettings)
Instantiates a new mesh that represents a Loop subdivision of the mesh.
mesh: The mesh to subdivide.
formula: The Loop subdivision formula.
settings: An instance of the settings class, or null for defaults.
Returns: A new mesh. null is never returned.
Since: 6.0

Rhino.Geometry.Mesh.CreateRefinedCatmullClarkMesh(Rhino.Geometry.Mesh,Rhino.Geometry.MeshRefinements.RefinementSettings)
Instantiates a new mesh that represents a Catmull-Clark subdivision of the mesh.
mesh: The mesh to subdivide.
settings: An instance of the settings class, or null for defaults.
Returns: A new mesh. null is never returned.
Since: 6.0

Rhino.Geometry.Mesh.ComputeAutoCreaseInformation
Do not use this method.
Length: top.Mesh.Vertices.Count
Returns: An array that is bound to change.
Since: 6.0

Rhino.Geometry.Mesh.ExtendSelectionByEdgeRidge(System.Int32[],System.Int32,System.Boolean)
Suggests an extension of a selection set by using information related with topology and alignment.
preselectedEdges: An array of edges that were already selected.
newEdge: A new edge index.
iterative:
Returns: An array of edges that are in a visual relationship with newEdge.
Throws System.ArgumentOutOfRangeException: If newEdge is less than 0 or larger than the topology edge count.
Since: 6.0

Rhino.Geometry.Mesh.ExtendSelectionByFaceLoop(System.Int32[],System.Int32,System.Boolean)
Suggests an extension of a face selection set by using information related with topology and alignment.
preselectedFaces: An array of faces that were already selected.
newFace: A new face index. If this index is already part of the selection, no extension is suggested.
iterative:
Returns: An array of faces that are in a visual relationship with newFace.
Throws System.ArgumentOutOfRangeException: If newFace is less than 0 or larger than the face count.
Since: 6.0