Rhino.NodeInCode.NodeInCodeTable
Permits rapid access to references to all Grasshopper functions.

Rhino.NodeInCode.NodeInCodeTable.#ctor(System.Collections.Generic.IEnumerable{Rhino.NodeInCode.ComponentFunctionInfo})
Instantiates the table. Users of RhinoCommon do not typically need to call this constructor.
items: Items.
Since: 6.0

Rhino.NodeInCode.NodeInCodeTable.Count
Returns the amount of items in this table.
Since: 6.0

Rhino.NodeInCode.NodeInCodeTable.Contains(System.String)
Check whether node is registered in this table or not
fullName: Full name of node
Returns:
Since: 9.0

Rhino.NodeInCode.NodeInCodeTable.Add(Rhino.NodeInCode.ComponentFunctionInfo)
Adds, or replaces a new instance of component function information.
item:
Since: 6.0

Rhino.NodeInCode.NodeInCodeTable.TryGetMember(System.Dynamic.GetMemberBinder,System.Object@)
Dynamically binds the table to property-like access via its item names.
binder: The dynamic binder.
result: Returns the result.
Returns:
Since: 6.0

Rhino.NodeInCode.NodeInCodeTable.GetDynamicMembers
Returns component info for all additional names in the table.
Returns:
Since: 8.0

Rhino.NodeInCode.NodeInCodeTable.GetDynamicMemberNames
Returns all additional names in the table.
Returns:
Since: 6.0

Rhino.NodeInCode.NodeInCodeTable.TryInvokeMember(System.Dynamic.InvokeMemberBinder,System.Object[],System.Object@)
Dynamically invokes a member of the table.
binder: The binder.
args: The arguments.
result: The result.
Returns: True on success.
Since: 6.0

Rhino.NodeInCode.NodeInCodeTable.TryGetIndex(System.Dynamic.GetIndexBinder,System.Object[],System.Object@)
Gets the ComponentFunctionInfo at
binder: The binder.
indexes: ONE string index.
result: The bound info.
Returns:
Since: 6.0