Rhino.FileIO.BinaryArchiveWriter
Represents an entity that is able to write data to an archive.

Rhino.FileIO.BinaryArchiveWriter.WriteErrorOccured
Gets or sets whether an error occurred.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.Archive3dmVersion
If a 3dm archive is being read or written, then this is the
version of the 3dm archive format (1, 2, 3, 4 or 5).
0     a 3dm archive is not being read/written
1     a version 1 3dm archive is being read/written
2     a version 2 3dm archive is being read/written
3     a version 3 3dm archive is being read/written
4     a version 4 3dm archive is being read/written
5     an old version 5 3dm archive is being read
50    a version 5 3dm archive is being read/written.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.BeginWrite3dmChunk(System.UInt32,System.Int32,System.Int32)
Begins writing a chunk
typecode: chunk's typecode
majorVersion:
minorVersion:
Returns:
True if input was valid and chunk was started.  In this case you must call
EndWrite3dmChunk(), even if something goes wrong while you attempt to write
the contents of the chunk.
False if input was not valid or the write failed.
Since: 6.0

Rhino.FileIO.BinaryArchiveWriter.BeginWrite3dmChunk(System.UInt32,System.Int64)
Begins writing a chunk
typecode:
value:
Returns:

Rhino.FileIO.BinaryArchiveWriter.EndWrite3dmChunk
updates length in chunk header
Returns:
Since: 6.0

Rhino.FileIO.BinaryArchiveWriter.EnableCRCCalculation(System.Boolean)
Expert user function to control CRC calculation while reading and writing.
Typically this is used when seeking around and reading/writing information
in non-serial order.
enable:
Returns:
Current state of CRC calculation.  Use the returned value to restore the
CRC calculation setting after you are finished doing your fancy pants
expert IO.
Since: 6.0

Rhino.FileIO.BinaryArchiveWriter.Write3dmChunkVersion(System.Int32,System.Int32)
A chunk version is a single byte that encodes a major.minor
version number.  Useful when creating I/O code for 3dm chunks
that may change in the future.  Increment the minor version
number if new information is added to the end of the chunk.
Increment the major version if the format of the chunk changes
in some other way.
major: 0 to 15.
minor: 0 to 16.
Returns: true on successful read.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteDictionary(Rhino.Collections.ArchivableDictionary)
Delivers the complete content of a dictionary to the archive.
dictionary: A dictionary to archive.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteBool(System.Boolean)
Writes a System.Boolean value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteByte(System.Byte)
Writes a System.Byte value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteSByte(System.SByte)
Writes a System.SByte value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteShort(System.Int16)
Writes a System.Int16 value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteUShort(System.UInt16)
Writes a System.UInt16 value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteInt(System.Int32)
Writes a System.Int32 value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteUInt(System.UInt32)
Writes a System.UInt32 value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteInt64(System.Int64)
Writes a System.Int64 value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteSingle(System.Single)
Writes a System.Single value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteDouble(System.Double)
Writes a System.Double value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteGuid(System.Guid)
Writes a System.Guid value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteString(System.String)
Writes a System.String value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteUtf8String(System.String)
Writes a System.String value to the archive.
value: A value to write.
Since: 6.0

Rhino.FileIO.BinaryArchiveWriter.WriteBoolArray(System.Collections.Generic.IEnumerable{System.Boolean})
Writes a list, an array, or any enumerable of System.Boolean to the archive.
The return will always be an array.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteByteArray(System.Collections.Generic.IEnumerable{System.Byte})
Writes a list, an array, or any enumerable of System.Byte to the archive.
The return will always be an array.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteCompressedBuffer(System.Collections.Generic.IEnumerable{System.Byte})
Writes a list, an array, or any enumerable of System.Byte to the archive as a compressed buffer.
The return will always be an array.
value: A value to write.
Since: 5.9

Rhino.FileIO.BinaryArchiveWriter.WriteSByteArray(System.Collections.Generic.IEnumerable{System.SByte})
Writes a list, an array, or any enumerable of System.SByte to the archive.
The return will always be an array.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteShortArray(System.Collections.Generic.IEnumerable{System.Int16})
Writes a list, an array, or any enumerable of System.Int16 to the archive.
The return will always be an array.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteIntArray(System.Collections.Generic.IEnumerable{System.Int32})
Writes a list, an array, or any enumerable of System.Int32 to the archive.
The return will always be an array.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteSingleArray(System.Collections.Generic.IEnumerable{System.Single})
Writes a list, an array, or any enumerable of System.Single to the archive.
The return will always be an array.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteDoubleArray(System.Collections.Generic.IEnumerable{System.Double})
Writes a list, an array, or any enumerable of System.Double to the archive.
The return will always be an array.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteGuidArray(System.Collections.Generic.IEnumerable{System.Guid})
Writes a list, an array, or any enumerable of System.Guid to the archive.
The return will always be an array.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteStringArray(System.Collections.Generic.IEnumerable{System.String})
Writes a list, an array, or any enumerable of System.String to the archive.
The return will always be an array.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteColor(System.Drawing.Color)
Writes a System.Drawing.Color value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WritePoint(System.Drawing.Point)
Writes a System.Drawing.Point value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WritePointF(System.Drawing.PointF)
Writes a System.Drawing.PointF value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteRectangle(System.Drawing.Rectangle)
Writes a System.Drawing.Rectangle value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteRectangleF(System.Drawing.RectangleF)
Writes a System.Drawing.RectangleF value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteSize(System.Drawing.Size)
Writes a System.Drawing.Size value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteSizeF(System.Drawing.SizeF)
Writes a System.Drawing.SizeF value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteFont(System.Drawing.Font)
Writes a System.Drawing.Font value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteObjRef(Rhino.DocObjects.ObjRef)
Writes a Rhino.DocObjects.ObjRef to the archive
Returns: the element that was read
Since: 5.8

Rhino.FileIO.BinaryArchiveWriter.WriteObjRefArray(System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjRef})
Writes a list, an array, or any enumerable of Rhino.DocObjects.ObjRef to the archive.
The return will always be an array.
objrefs: A value to write.
Since: 5.8

Rhino.FileIO.BinaryArchiveWriter.WriteGeometryArray(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})
Since: 7.0

Rhino.FileIO.BinaryArchiveWriter.WriteInterval(Rhino.Geometry.Interval)
Writes a Rhino.Geometry.Interval value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WritePoint2d(Rhino.Geometry.Point2d)
Writes a Rhino.Geometry.Point2d value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WritePoint3d(Rhino.Geometry.Point3d)
Writes a Rhino.Geometry.Point3d value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WritePoint4d(Rhino.Geometry.Point4d)
Writes a Rhino.Geometry.Point4d value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteVector2d(Rhino.Geometry.Vector2d)
Writes a Rhino.Geometry.Vector2d value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteVector3d(Rhino.Geometry.Vector3d)
Writes a Rhino.Geometry.Vector3d value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteBoundingBox(Rhino.Geometry.BoundingBox)
Writes a Rhino.Geometry.BoundingBox value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteRay3d(Rhino.Geometry.Ray3d)
Writes a Rhino.Geometry.Ray3d value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteTransform(Rhino.Geometry.Transform)
Writes a Rhino.Geometry.Transform value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WritePlane(Rhino.Geometry.Plane)
Writes a Rhino.Geometry.Plane value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteLine(Rhino.Geometry.Line)
Writes a Rhino.Geometry.Line value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WritePoint3f(Rhino.Geometry.Point3f)
Writes a Rhino.Geometry.Point3f value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteVector3f(Rhino.Geometry.Vector3f)
Writes a Rhino.Geometry.Vector3f value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteMeshingParameters(Rhino.Geometry.MeshingParameters)
Writes a Rhino.Geometry.MeshingParameters value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteGeometry(Rhino.Geometry.GeometryBase)
Writes a Rhino.Geometry.GeometryBase value to the archive.
value: A value to write.
Since: 5.0

Rhino.FileIO.BinaryArchiveWriter.WriteRenderSettings(Rhino.Render.RenderSettings)
Writes a Rhino.Render.RenderSettings value to the archive.
value: A value to write.
Since: 6.0

Rhino.FileIO.BinaryArchiveWriter.WriteEmptyCheckSum
Reads a legacy ON_CheckSum, only provided to read data chunks from old
V5 files, the CheckSum read is discarded
Since: 6.0
6.0