Rhino.Render.RenderContent.ContentInstanceBrowserButtons
Specifies optional buttons for ShowContentInstanceBrowser().
Since: 8.15

Rhino.Render.RenderContent.ContentInstanceBrowserButtons.None
No optional buttons.

Rhino.Render.RenderContent.ContentInstanceBrowserButtons.NewButton
Include New button.

Rhino.Render.RenderContent.ContentInstanceBrowserButtons.EditButton
Include Edit button.