Rhino.Geometry.BrepLoop
Represent a single loop in a Brep object. A loop is composed
of a list of trim curves.

Rhino.Geometry.BrepLoop.Brep
Gets the Brep that owns this loop.
Since: 5.0

Rhino.Geometry.BrepLoop.LoopIndex
Gets the index of this loop in the Brep.Loops collection.
Since: 5.0

Rhino.Geometry.BrepLoop.Face
BrepFace this loop belongs to.
Since: 5.0

Rhino.Geometry.BrepLoop.LoopType
type of loop.
Since: 5.0

Rhino.Geometry.BrepLoop.Trims
List of trims for this loop
Since: 5.1

Rhino.Geometry.BrepLoop.IsSurfaceBoundary
True if the loop's trims all run along the edge's of the underlying surface's parameter space.
Since: 8.20

Rhino.Geometry.BrepLoop.To3dCurve
Create a 3D curve that approximates the loop geometry.
Returns: A 3D curve that approximates the loop or null on failure.
Since: 5.0

Rhino.Geometry.BrepLoop.To2dCurve
Create a 2d curve that traces the entire loop
Returns:
Since: 5.1