Rhino.Geometry.RadialDimension
Represents a dimension of a circular entity that can be measured with radius or diameter.

Rhino.Geometry.RadialDimension.#ctor
Constructs a radial dimension.
Since: 6.0

Rhino.Geometry.RadialDimension.#ctor(Rhino.Geometry.AnnotationType,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Constructs a radial dimension from parameters.
dimtype: AnnotationType.Diameter or AnnotationType.Radius
plane: Dimension's plane
centerpoint: Dimension's center point
radiuspoint: Point on dimension radius
dimlinepoint: Point on dimension line
Since: 8.0

Rhino.Geometry.RadialDimension.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor used in serialization.

Rhino.Geometry.RadialDimension.AnnotationType
Since: 6.0

Rhino.Geometry.RadialDimension.IsDiameterDimension
Gets a value indicating whether the value refers to the diameter, rather than the radius.
Since: 5.0

Rhino.Geometry.RadialDimension.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.AnnotationType,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Initialize Dimension parameters
dimStyle: Dimension's dimstyle
dimtype: AnnotationType.Diameter or AnnotationType.Radius
plane: Dimension's plane
centerpoint: Dimension's center point
radiuspoint: Point on dimension radius
dimlinepoint: Point on dimension line
Returns:
Since: 6.0

Rhino.Geometry.RadialDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
Update Dimension geometry from point locations
plane: Dimension's plane
centerpoint: Dimension's center point
radiuspoint: Point on dimension radius
dimlinepoint: Point on dimension line
rotationInPlane: This parameter is currently ignored
Returns:
Since: 6.0

Rhino.Geometry.RadialDimension.Get3dPoints(Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)
Get locations of dimension's 3d points
centerpoint: Dimension's center point
radiuspoint: Point on dimension's radius
kneepoint: Point where dimension line jogs
dimlinepoint: Point on dimension line
Returns:
Since: 6.0

Rhino.Geometry.RadialDimension.CenterPoint
Since: 6.0

Rhino.Geometry.RadialDimension.RadiusPoint
Since: 6.0

Rhino.Geometry.RadialDimension.DimlinePoint
Since: 6.0

Rhino.Geometry.RadialDimension.KneePoint
Since: 6.0

Rhino.Geometry.RadialDimension.GetTextRectangle(Rhino.Geometry.Point3d[]@)
Since: 6.0

Rhino.Geometry.RadialDimension.GetDistanceDisplayText(Rhino.UnitSystem,Rhino.DocObjects.DimensionStyle)
Since: 6.0

Rhino.Geometry.RadialDimension.LeaderTextHorizontalAlignment
Gets or sets the horizontal alignment of the radial dimension's text
Since: 6.9

Rhino.Geometry.RadialDimension.LeaderArrowType
Since: 6.0

Rhino.Geometry.RadialDimension.LeaderArrowSize
Since: 6.0

Rhino.Geometry.RadialDimension.LeaderArrowBlockId
Since: 6.0

Rhino.Geometry.RadialDimension.LeaderCurveStyle
Since: 6.0

Rhino.Geometry.RadialDimension.TextOrientation
Since: 6.0

Rhino.Geometry.RadialDimension.TextLocation
Since: 6.0

Rhino.Geometry.RadialDimension.TextAngleType
Since: 6.0