Rhino.UI.PanelType
Panel type
Since: 6.1

Rhino.UI.PanelType.PerDoc
Default panel type, creates a panel instance per document

Rhino.UI.PanelType.System
A System panel may appear in one or more container but the
panel will be used for all open documents