Rhino.ApplicationSettings.ChooseOneObjectSettingsState
Represents a snapshot of Rhino.ApplicationSettings.ChooseOneObjectSettings.
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettingsState.FollowCursor
FollowCursor
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettingsState.XOffset
XOffset
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettingsState.YOffset
YOffset
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettingsState.AutomaticResize
AutomaticResize
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettingsState.MaxAutoResizeItems
MaxAutoResizeItems
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettingsState.ShowTitlebarAndBorder
ShowTitlebarAndBorder
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettingsState.ShowObjectName
ShowObjectName
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettingsState.ShowObjectType
ShowObjectType
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettingsState.ShowObjectColor
ShowObjectColor
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettingsState.ShowObjectLayer
ShowObjectLayer
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettingsState.DynamicHighlight
DynamicHighlight
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettingsState.UseCustomColor
UseCustomColor
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettingsState.HighlightColor
HighlightColor
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettingsState.ShowAllOption
ShowAllOption
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettingsState.ShowObjectTypeDetails
ShowObjectTypeDetails
Since: 8.0