Rhino.FileIO.File3dmRenderEnvironment


Rhino.FileIO.File3dmRenderEnvironment.#ctor(System.Guid,Rhino.FileIO.File3dm)
Constructor for when the object is top-level.

Rhino.FileIO.File3dmRenderEnvironment.#ctor(System.Guid,Rhino.FileIO.File3dmRenderContent)
Constructor for when the object is a child.

Rhino.FileIO.File3dmRenderEnvironment.ToEnvironment
Get a simulated environment that approximates this environment's appearance.
Since: 8.0