Rhino.Runtime.DoNothingCloudHost
Default no-op implementation used when no platform service is registered.
Returns the "gate doesn't apply" state per Rhino.Runtime.ICloudHost tri-state
semantics (IsEntitled=false + DenyReason=null) — not an active denial.