Rhino.PlugIns.OnLeaseChangedDelegate
Called by Rhino to signal that a lease from Rhino Accounts has changed. If LicenseLeaseChangedEventArgs.Lease
is null, then the server has signaled that this product is no longer licensed. Your plug-in must change behavior to behave
appropriately.
args: Data passed by Rhino when the lease changes
icon: Icon to be displayed in Tools > Options > Licenses for this lease.