Rhino.Display.ViewTypeFilter
Filter for view types to list

Rhino.Display.ViewTypeFilter.None
No views

Rhino.Display.ViewTypeFilter.Model
Standard Rhino model views

Rhino.Display.ViewTypeFilter.Page
Page views

Rhino.Display.ViewTypeFilter.ModelStyleViews
All view styles except Page.

Rhino.Display.ViewTypeFilter.UVEditor
UV Editor views

Rhino.Display.ViewTypeFilter.BlockEditor
Block Editor views

Rhino.Display.ViewTypeFilter.All
All views