Rhino.DocObjects.RhinoAfterTransformObjectsEventArgs
EventArgs passed to RhinoDoc.AfterTransform.
Since: 8.15

Rhino.DocObjects.RhinoAfterTransformObjectsEventArgs.TransformEventId
The transformation event id.
Since: 8.15