Rhino.Render.RealtimeDisplayModeClassInfo
Class information obligatory for registering RealtimeDisplayMode
implementations.

Rhino.Render.RealtimeDisplayModeClassInfo.Name
Get human-facing class description for RealtimeDisplayMode
implementation. This string might show up in the Rhino
UI.
Since: 6.0

Rhino.Render.RealtimeDisplayModeClassInfo.GUID
Get the RealtimeDisplayMode implementation GUID
Since: 6.0

Rhino.Render.RealtimeDisplayModeClassInfo.DrawOpenGl
Return true if the RealtimeDisplayMode draws its result
using OpenGL. RenderWindow usage will then be skipped.
Since: 6.0

Rhino.Render.RealtimeDisplayModeClassInfo.RealtimeDisplayModeType
Get the type being registered.
Since: 6.0

Rhino.Render.RealtimeDisplayModeClassInfo.DontRegisterAttributesOnStart
Override and return true when you don't want your class info
to cause display attributes to be registered with the system.
Since: 6.0

Rhino.Render.RealtimeDisplayModeClassInfo.RequiredDisplayTechnology
Override to return the display techonology your DisplayMode requires for the viewport to be running in.
Since: 8.21