Rhino.DocObjects.Custom.UnknownUserData
Represents user data with unknown origin.

Rhino.DocObjects.Custom.UnknownUserData.#ctor(System.IntPtr)
Constructs a new unknown data entity.
pointerNativeUserData: A pointer to the entity.
Since: 5.0