Rhino.PrivateMeshCommands.MeshTypes.IWeshTopology.EdgeFacesIndices
This tells for each edge (or vertex), which face(s) it belongs to.
Unwelded sorting enumeration.

Rhino.PrivateMeshCommands.MeshTypes.IWeshTopology.FacesEdgesIndices
Length: fully unwelded edge count

Rhino.PrivateMeshCommands.MeshTypes.IWeshTopology.VertexEdgesIndices
This tells for each topvertex, which edge it belongs to.

Rhino.PrivateMeshCommands.MeshTypes.IWeshTopology.VertexVertexIndices
Length: unwelded mesh vLength. Contains the vertex 3d point index in the welded Vertex array

Rhino.PrivateMeshCommands.MeshTypes.IWeshTopology.SetFaceEdgeRevInArray(System.Int32,System.Int32,System.Int32)
Sets the edge at an index with a direction
index:
edgeIndex:
rev: true == 1, false == 0