Rhino.Render.UICommands.UICommandSubMenus
This enum is for UICommand SubMenu()

Rhino.Render.UICommands.UICommandSubMenus.None
UICommand will appear in the top-level menu.

Rhino.Render.UICommands.UICommandSubMenus.CreateNew
UICommand will appear in a 'Create New' sub-menu.

Rhino.Render.UICommands.UICommandSubMenus.Thumbnails
UICommand will appear in a 'Thumbnails' sub-menu.

Rhino.Render.UICommands.UICommandSubMenus.PlugIn
Custom UICommand will appear in a sub-menu with the current plug-in's name.