Rhino.FileIO.FileSW.Read(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileSwReadOptions)
Read a .sldprt or .sldasm file into a RhinoDoc
path: path to read a file from
doc: document to import geometry into
options: options used for importing the SW file
Returns: true on success
Since: 8.0