Rhino.Input.Custom.OptionColor.#ctor(System.Drawing.Color)
Since: 5.0

Rhino.Input.Custom.OptionColor.Dispose
Since: 5.0

Rhino.Input.Custom.OptionColor.CurrentValue
Since: 5.0

Rhino.Input.Custom.OptionColor.InitialValue
Since: 5.0