Rhino.FileIO.File3dmDisplacement
Represents the displacement attached to file3dm object attributes.

Rhino.FileIO.File3dmDisplacement.On
Specifies whether the displacement feature is enabled or not.
Since: 8.0

Rhino.FileIO.File3dmDisplacement.TextureId
Specifies which texture is used for computing the displacement amount.
Since: 8.0

Rhino.FileIO.File3dmDisplacement.MappingChannel
Specifies which texture mapping channel is used for the displacement texture.
Since: 8.0

Rhino.FileIO.File3dmDisplacement.BlackPoint
Specifies the amount of displacement for the black color in the texture.
Since: 8.0

Rhino.FileIO.File3dmDisplacement.WhitePoint
Specifies the amount of displacement for the white color in the texture.
Since: 8.0

Rhino.FileIO.File3dmDisplacement.InitialQuality
Specifies how densely the object is initially subdivided.
The lower the value, the higher the resolution of the displaced mesh.
Since: 8.0

Rhino.FileIO.File3dmDisplacement.FinalMaxFacesOn
Specifies whether to perform a mesh reduction as a post process to simplify the result of displacement.
Since: 8.0

Rhino.FileIO.File3dmDisplacement.FinalMaxFaces
Specifies how many faces the reduction post process should target.
Since: 8.0

Rhino.FileIO.File3dmDisplacement.FairingOn
Specifies whether or not to perform a fairing step. Fairing straightens rough feature edges.
Since: 8.0

Rhino.FileIO.File3dmDisplacement.Fairing
Specifies the number of steps for the fairing process. Fairing straightens rough feature edges.
Since: 8.0

Rhino.FileIO.File3dmDisplacement.PostWeldAngle
Specifies the maximum angle between face normals of adjacent faces that will get welded together.
Since: 8.0

Rhino.FileIO.File3dmDisplacement.MeshMemoryLimit
Specifies in megabytes how much memory can be allocated for use by the displacement mesh.
Since: 8.0

Rhino.FileIO.File3dmDisplacement.RefineSteps
Specifies the number of refinement passes
Since: 8.0

Rhino.FileIO.File3dmDisplacement.RefineSensitivity
Specifies how sensitive the divider for contrasts is on the displacement texture.
Specify 1 to split all mesh edges on each refine step.
Specify 0.99 to make even slight contrasts on the displacement texture cause edges to be split.
Specifying 0.01 only splits edges where heavy contrast exists.
Since: 8.0

Rhino.FileIO.File3dmDisplacement.SweepResolutionFormula
Specifies which formula is used to calculate sweep resolution from initial quality.
Since: 8.0

Rhino.FileIO.File3dmDisplacement.GetSubItemFaceIndexes
Gets all the sub-items on the displacement. Sub-items can exist to override the top-level parameters
for polysurface/SubD faces. Sub-items are identified by the face index that they apply to.
An array of the face indexes of each sub-item on the displacement.
Since: 8.0

Rhino.FileIO.File3dmDisplacement.AddSubItem(System.Int32,System.Boolean,System.Guid,System.Int32,System.Double,System.Double)
Adds a new sub-item to the displacement.
face_index is the index of the face on the polysurface/SubD.
on is the override for File3dmDisplacement.On.
texture is the override for File3dmDisplacement.TextureId.
mapping_channel is the override for File3dmDisplacement.MappingChannel.
black_point is the override for File3dmDisplacement.BlackPoint.
white_point is the override for File3dmDisplacement.WhitePoint.
Since: 8.0

Rhino.FileIO.File3dmDisplacement.DeleteSubItem(System.Int32)
Deletes a sub-item by its face index.
face_index is the index of the face on the polysurface/SubD.
Since: 8.0

Rhino.FileIO.File3dmDisplacement.DeleteAllSubItems
Deletes all the sub-items from the displacement.
Since: 8.0

Rhino.FileIO.File3dmDisplacement.SubItemOn(System.Int32)
Gets the override for displacement 'on'.
face_index is the index of the face on the polysurface/SubD.
Since: 8.0

Rhino.FileIO.File3dmDisplacement.SetSubItemOn(System.Int32,System.Boolean)
Sets the override for displacement 'on'.
face_index is the index of the face on the polysurface/SubD.
Since: 8.0

Rhino.FileIO.File3dmDisplacement.SubItemTexture(System.Int32)
Gets the override for displacement 'texture'.
face_index is the index of the face on the polysurface/SubD.
Since: 8.0

Rhino.FileIO.File3dmDisplacement.SetSubItemTexture(System.Int32,System.Guid)
Sets the override for displacement 'texture'.
face_index is the index of the face on the polysurface/SubD.
Since: 8.0

Rhino.FileIO.File3dmDisplacement.SubItemMappingChannel(System.Int32)
Gets the override for displacement 'mapping channel'.
face_index is the index of the face on the polysurface/SubD.
Since: 8.0

Rhino.FileIO.File3dmDisplacement.SetSubItemMappingChannel(System.Int32,System.Int32)
Sets the override for displacement 'mapping channel'.
face_index is the index of the face on the polysurface/SubD.
Since: 8.0

Rhino.FileIO.File3dmDisplacement.SubItemBlackPoint(System.Int32)
Gets the override for displacement 'black-point'.
face_index is the index of the face on the polysurface/SubD.
Since: 8.0

Rhino.FileIO.File3dmDisplacement.SetSubItemBlackPoint(System.Int32,System.Double)
Sets the override for displacement 'black-point'.
face_index is the index of the face on the polysurface/SubD.
Since: 8.0

Rhino.FileIO.File3dmDisplacement.SubItemWhitePoint(System.Int32)
Gets the override for displacement 'white-point'.
face_index is the index of the face on the polysurface/SubD.
Since: 8.0

Rhino.FileIO.File3dmDisplacement.SetSubItemWhitePoint(System.Int32,System.Double)
Sets the override for displacement 'white-point'.
face_index is the index of the face on the polysurface/SubD.
Since: 8.0