Rhino.FileIO.File3dsWriteOptions
Options for writing a 3ds file

Rhino.FileIO.File3dsWriteOptions.SaveViews
Since: 8.0

Rhino.FileIO.File3dsWriteOptions.SaveLights
Since: 8.0

Rhino.FileIO.File3dsWriteOptions.MeshingParameters
Since: 8.0

Rhino.FileIO.File3dsWriteOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0