Rhino.Geometry.Intersect.ArcArcIntersection
Represents all possible cases of a Arc|Arc intersection event.
Since: 7.12

Rhino.Geometry.Intersect.ArcArcIntersection.None
Arcs do not intersect.

Rhino.Geometry.Intersect.ArcArcIntersection.Single
Arcs touch at a one point.

Rhino.Geometry.Intersect.ArcArcIntersection.Multiple
Arcs intersect at two points.

Rhino.Geometry.Intersect.ArcArcIntersection.Overlap
Arcs are cocircular and overlap.