Rhino.Geometry.MeshRefinements.RefinementSettings
Defines the way a mesh refinement modifier works.

Rhino.Geometry.MeshRefinements.RefinementSettings.#ctor
Creates a default operation settings object.
Since: 6.0

Rhino.Geometry.MeshRefinements.RefinementSettings.Level
The level of subdivision to achieve.
Since: 6.0

Rhino.Geometry.MeshRefinements.RefinementSettings.HasPull
Gets a value indicating whether this subdivision should create a result on a specific surface.
Since: 6.0

Rhino.Geometry.MeshRefinements.RefinementSettings.ContinueRequest
A token to request computation termination.
Since: 6.0

Rhino.Geometry.MeshRefinements.RefinementSettings.NakedEdgeMode
Set this property to define how naked edges should be treated.
Since: 6.0