Rhino.DocObjects.DimensionStyle.StackDisplayFormat
Format of stacked fractions

Rhino.DocObjects.DimensionStyle.StackDisplayFormat.None
No stacking

Rhino.DocObjects.DimensionStyle.StackDisplayFormat.StackHorizontal
Stack with horizontal line

Rhino.DocObjects.DimensionStyle.StackDisplayFormat.StackDiagonal
Stack with angled line