Rhino.ApplicationSettings.ZebraAnalysisSettings
Contains static methods and properties to modify Zebra analysis-related commands.
Since: 7.8

Rhino.ApplicationSettings.ZebraAnalysisSettings.GetDefaultState
Gets the factory settings of the application.
Since: 7.8

Rhino.ApplicationSettings.ZebraAnalysisSettings.GetCurrentState
Gets the current settings of the application.
Since: 7.8

Rhino.ApplicationSettings.ZebraAnalysisSettings.RestoreDefaults
Commits the default settings as the current settings.
Since: 7.8

Rhino.ApplicationSettings.ZebraAnalysisSettings.UpdateFromState(Rhino.ApplicationSettings.ZebraAnalysisSettingsState)
Sets all settings to a particular defined joined state.
state: The particular state.
Since: 7.8

Rhino.ApplicationSettings.ZebraAnalysisSettings.VerticalStripes
Set to true for vertical stripes, or false for horizontal stripes.
Since: 7.8

Rhino.ApplicationSettings.ZebraAnalysisSettings.ShowIsoCurves
Get or sets the display of surface isocurves.
Since: 7.8

Rhino.ApplicationSettings.ZebraAnalysisSettings.StripeColor
Gets or sets the stripe color.
Since: 7.8

Rhino.ApplicationSettings.ZebraAnalysisSettings.StripeThickness
Gets or sets the stripe thickness, where 0 = thinnest and 6 = thickest.
Since: 7.8