Rhino.Render.PostEffects.PostEffectData
This is a wrapper around the data ('on', 'shown', 'state' parameters, etc.) of a post effect.
Since: 8.0

Rhino.Render.PostEffects.PostEffectData.Collection
Since: 8.0

Rhino.Render.PostEffects.PostEffectData.Dispose
Since: 8.0

Rhino.Render.PostEffects.PostEffectData.Id
Returns the unique id of this post effect.
Since: 8.0

Rhino.Render.PostEffects.PostEffectData.Type
Returns the type of this post effect.
Since: 8.0

Rhino.Render.PostEffects.PostEffectData.LocalName
Returns the localized name of this post effect.
Since: 8.0

Rhino.Render.PostEffects.PostEffectData.On
The 'on' state of this post effect.
Since: 8.0

Rhino.Render.PostEffects.PostEffectData.Shown
The 'shown' state of this post effect.
Since: 8.0

Rhino.Render.PostEffects.PostEffectData.GetParameter(System.String)
Get an arbitrary parameter from this post effect by its name.
If the parameter is not known to the post effect, the method will fail.
Returns a variant object if successful or null on failure.
Since: 8.0

Rhino.Render.PostEffects.PostEffectData.SetParameter(System.String,System.Object)
Set an arbitrary parameter to the post effect by its name.
If the parameter is not known to the post effect, the method will fail.
Returns true if successful or false on failure.
Since: 8.0

Rhino.Render.PostEffects.PostEffectData.DataCRC(System.UInt32)
Get a CRC representing the state of the entire post effect.
Since: 8.0