Rhino.Render.DynamicIconUsage
Since: 6.0

Rhino.Render.DynamicIconUsage.TreeControl
Used in a tree control (e.g., TreeGridView).

Rhino.Render.DynamicIconUsage.SubnodeControl
Used in a sub-node control (\see CRhRdkSubNodeCtrl)

Rhino.Render.DynamicIconUsage.ContentControl
Used in a content control (\see CRhRdkContentCtrl)

Rhino.Render.DynamicIconUsage.General
Used in a custom user interface. The background will be plain white.