Rhino.DocObjects.ClippingPlaneObject
Represents the object of a clipping plane,
stored in the Rhino document and with attributes.

Rhino.DocObjects.ClippingPlaneObject.ClippingPlaneGeometry
Gets the clipping plane surface.
Since: 5.0

Rhino.DocObjects.ClippingPlaneObject.AddClipViewport(Rhino.Display.RhinoViewport,System.Boolean)
Adds a viewport to the list of viewports that this clipping plane clips.
viewport: The viewport to add.
commit: Commit the change. When in doubt, set this parameter to true.
Returns: true if the viewport was added, false if the viewport is already in the list.
Since: 6.1

Rhino.DocObjects.ClippingPlaneObject.RemoveClipViewport(Rhino.Display.RhinoViewport,System.Boolean)
Removes a viewport from the list of viewports that this clipping plane clips.
viewport: The viewport to remove.
commit: Commit the change. When in doubt, set this parameter to true.
Returns: true if the viewport was removed, false if the viewport was not in the list.
Since: 6.1