Rhino.Runtime.InteropWrappers.SimpleArray2dex
Wrapper for ON_SimpleArray<ON_2dex>. If you are not writing C++ code
then this class is not for you.

Rhino.Runtime.InteropWrappers.SimpleArray2dex.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArray2dex.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArray2dex.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArray2dex class.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArray2dex.#ctor(System.Collections.Generic.IEnumerable{Rhino.IndexPair})
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArray2dex class
values: initial set of integer pairs to add to the array
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArray2dex.Count
Gets the amount of elements in this array.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArray2dex.ToArray
Returns the managed counterpart of the unmanaged array.
Returns: The managed array.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArray2dex.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.SimpleArray2dex.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 6.0