Rhino.ApplicationSettings.ViewSettings.ViewRotationStyle
View rotation styles.
Since: 8.1

Rhino.ApplicationSettings.ViewSettings.ViewRotationStyle.RotateAroundWorldAxes
Makes the view rotate relative to the world axes.
You can use the tilt keys to rotate the view around the view depth axis.

Rhino.ApplicationSettings.ViewSettings.ViewRotationStyle.RotateRelativeToView
Makes the view rotate relative to the view axes rather than the model x, y, and z axes.

Rhino.ApplicationSettings.ViewSettings.ViewRotationStyle.RotateRelativeToViewV2Style
The view rotation is always relative to the previous dynamic view.

Rhino.ApplicationSettings.ViewSettings.ViewRotationStyle.RotateAroundCplaneZaxis
Makes the view (RotateView command) or camera (RotateCamera command) rotate around the construction plane z-axis.