Rhino.Geometry.SubDVertexFacetType
Summarizes the number of edges in faces in the whole object.

Rhino.Geometry.SubDVertexFacetType.Unset
Not a valid vertex face type.

Rhino.Geometry.SubDVertexFacetType.Tri
All faces are triangular.

Rhino.Geometry.SubDVertexFacetType.Quad
All faces are quads.

Rhino.Geometry.SubDVertexFacetType.Ngon
Edge count of faces is constant and > 4.

Rhino.Geometry.SubDVertexFacetType.Mixed
Edge count of faces is not constant.