Rhino.Input.GetBoxMode
Enumerates all Box getter modes.
Since: 5.0

Rhino.Input.GetBoxMode.All
All modes are allowed.

Rhino.Input.GetBoxMode.Corner
The base rectangle is created by picking the two corner points.

Rhino.Input.GetBoxMode.ThreePoint
The base rectangle is created by picking three points.

Rhino.Input.GetBoxMode.Vertical
The base vertical rectangle is created by picking three points.

Rhino.Input.GetBoxMode.Center
The base rectangle is created by picking a center point and a corner point.