Rhino.Render.CustomRenderMeshes.CustomRenderMeshProviderAttribute
Attributes for RenderMeshProvider

Rhino.Render.CustomRenderMeshes.CustomRenderMeshProviderAttribute.#ctor(System.Boolean)
Constructor
nonObjectIdsOnly:
Since: 8.8

Rhino.Render.CustomRenderMeshes.CustomRenderMeshProviderAttribute.NonObjectIdsOnly
If set to true, this will quickly return false for HasCustomRenderMeshes if the objectId is in the document.
Since: 8.8