Rhino.PersistentSettings
A dictionary of SettingValue items.

Rhino.PersistentSettings.Service
Since: 6.1

Rhino.PersistentSettings.ContainsKey(System.String)
Check to see if the settings dictionary contains the specified key
Returns: true, if key was contained, false otherwise.
key: Key.

Rhino.PersistentSettings.ItemDeletedSinceSave
This will get set when a settings item is deleted, can't rely on
SettingsValue.ChangedSinceSave flag since the setting is not in the
dictionary.

Rhino.PersistentSettings.ResettingDontWrite
Used to flag a settings instance as being reset, tells Rhino to just delete
the settings file when closing so everything will revert to default values.

Rhino.PersistentSettings.HiddenFromUserInterface
If false then values will appear in the EditOptions window
Since: 6.0

Rhino.PersistentSettings.GetChild(System.String)
Call this method to get a nested settings Rhino.PersistentSettings
instance, will throw a System.Collections.Generic.KeyNotFoundException exception if
the key does not exist.
key: Key name
Throws System.Collections.Generic.KeyNotFoundException: Thrown if the key does not exist.
Returns:
Returns persistent settings for the specified key or throws an
exception if the key is invalid.
Since: 6.0

Rhino.PersistentSettings.TryGetChild(System.String,Rhino.PersistentSettings@)
Call this method to get a nested settings Rhino.PersistentSettings
instance, will return true if the key exists and value was set
otherwise; will return false and value will be set to null.
key: [in] Key name
value:
[out] Will be set the child settings if the key is valid otherwise
it will be null.
Returns:
Returns true if the key exists and value was set otherwise; returns
false.
Since: 6.0

Rhino.PersistentSettings.Keys
Gets a collection containing the keys in the settings dictionary.
Since: 6.0

Rhino.PersistentSettings.ChildKeys
Gets a collection containing the keys in the settings dictionary.
Since: 6.0

Rhino.PersistentSettings.TryGetSettingType(System.String,System.Type@)
Get the type of the last value passed to Set... or Get... for the
specified setting.
key:
Key name for which to search.
type:
Type of the last value passed to Set... or Get... for the specified
setting.
Returns:
Since: 6.0

Rhino.PersistentSettings.GetSettingType(System.String)
Gets the type of the last value passed to Set... or Get... for the
specified setting.
key:
Key name for which to search.
Returns:
Type of the last value passed to Set... or Get... for the specified
setting.
Throws System.Collections.Generic.KeyNotFoundException:
A KeyNotFoundException exception is thrown if the key is not found in
the settings dictionary.
Since: 6.0

Rhino.PersistentSettings.TryGetSettingIsReadOnly(System.String,System.Boolean@)
Values read from all users settings files will be marked as read-only
which will cause any future calls to Set... to fail.
key:
Key name for which to search.
value:
Value will be true if the setting is read-only otherwise false.
setting.
Returns:
Since: 6.0

Rhino.PersistentSettings.GetSettingIsReadOnly(System.String)
Values read from all users settings files will be marked as read-only
which will cause any future calls to Set... to fail.
key:
Key name for which to search.
Returns:
Returns true if the setting is read-only otherwise false.
Throws System.Collections.Generic.KeyNotFoundException:
A KeyNotFoundException exception is thrown if the key is not found in
the settings dictionary.
Since: 6.0

Rhino.PersistentSettings.TryGetSettingIsHiddenFromUserInterface(System.String,System.Boolean@)
Values read from all users settings files will be marked as read-only
which will cause any future calls to Set... to fail.
key:
Key name for which to search.
value:
Value will be true if the setting is read-only otherwise false.
setting.
Returns:
Since: 6.0

Rhino.PersistentSettings.TryGetSettingIsHiddenFromUserInterface(System.String,System.Boolean@,System.Collections.Generic.IEnumerable{System.String})
Values read from all users settings files will be marked as read-only
which will cause any future calls to Set... to fail.
key:
Key name for which to search.
value:
Value will be true if the setting is read-only otherwise false.
setting.
legacyKeyList:
Returns:
Since: 6.0

Rhino.PersistentSettings.GetSettingIsHiddenFromUserInterface(System.String)
Values read from all users settings files will be marked as read-only
which will cause any future calls to Set... to fail.
key:
Key name for which to search.
Returns:
Returns true if the setting is read-only otherwise false.
Throws System.Collections.Generic.KeyNotFoundException:
A KeyNotFoundException exception is thrown if the key is not found in
the settings dictionary.
Since: 6.0

Rhino.PersistentSettings.GetSettingIsHiddenFromUserInterface(System.String,System.Collections.Generic.IEnumerable{System.String})
Values read from all users settings files will be marked as read-only
which will cause any future calls to Set... to fail.
key:
Key name for which to search.
legacyKeyList:
Returns:
Returns true if the setting is read-only otherwise false.
Throws System.Collections.Generic.KeyNotFoundException:
A KeyNotFoundException exception is thrown if the key is not found in
the settings dictionary.
Since: 6.0

Rhino.PersistentSettings.HideSettingFromUserInterface(System.String)
key:
Since: 6.0

Rhino.PersistentSettings.AddChild(System.String)
Call this method to add a new child key, if the key is exists then the
existing key is returned otherwise a new empty Rhino.PersistentSettings
child key is added and the new settings are returned.
key: Key to add to the child dictionary.
Returns:
If the key is exists then the existing key is returned otherwise a new
empty Rhino.PersistentSettings child key is added and the new
settings are returned.
Since: 6.0

Rhino.PersistentSettings.DeleteChild(System.String)
Call this method to delete a child settings key.
key:
Since: 6.0

Rhino.PersistentSettings.FromPlugInId(System.Guid)
Since: 5.0

Rhino.PersistentSettings.RhinoAppSettings
Since: 6.14

Rhino.PersistentSettings.RegisterSettingsValidator``1(System.String,System.EventHandler{Rhino.PersistentSettingsEventArgs{``0}})
Sets a validator for a given key.
Note to implementers: parameter T should be one of the
supported types for the PersistentSettings class and should match the type associated with the key.
This method allows to use anonymous methods and lambda expressions.
key: The key to which to bind the validator.
validator: A validator instance of your own class.

Rhino.PersistentSettings.GetValidator``1(System.String)
Provides a way to find a ready-to-use validator for the
PersistentSetting class for the given the key, or obtaining null.
The type that the validator acts upon.
key: The name of the setting key.
Throws System.InvalidCastException: If type parameter T is not
the right specialization for Rhino.PersistentSettingsEventArgs`1.
Returns: A valid validator, or null if no validator was found.
Since: 5.0

Rhino.PersistentSettings.ContainsChangedValues
Since: 6.0

Rhino.PersistentSettings.ClearChangedFlag
Since: 6.0

Rhino.PersistentSettings.ContainsModifiedValues(Rhino.PersistentSettings)
Since: 5.0

Rhino.PersistentSettings.TryGetGuid(System.String,System.Guid@)
Since: 6.0

Rhino.PersistentSettings.TryGetGuid(System.String,System.Guid@,System.Collections.Generic.IEnumerable{System.String})
Since: 6.0

Rhino.PersistentSettings.TryGetBool(System.String,System.Boolean@)
Since: 5.0

Rhino.PersistentSettings.TryGetBool(System.String,System.Boolean@,System.Collections.Generic.IEnumerable{System.String})
Since: 6.0

Rhino.PersistentSettings.GetBool(System.String)
Since: 5.0

Rhino.PersistentSettings.GetBool(System.String,System.Boolean)
Since: 5.0

Rhino.PersistentSettings.GetBool(System.String,System.Boolean,System.Collections.Generic.IEnumerable{System.String})
Since: 6.0

Rhino.PersistentSettings.TryGetByte(System.String,System.Byte@)
Since: 5.0

Rhino.PersistentSettings.TryGetByte(System.String,System.Byte@,System.Collections.Generic.IEnumerable{System.String})
Since: 6.0

Rhino.PersistentSettings.GetByte(System.String)
Since: 5.0

Rhino.PersistentSettings.GetByte(System.String,System.Byte)
Since: 5.0

Rhino.PersistentSettings.GetByte(System.String,System.Byte,System.Collections.Generic.IEnumerable{System.String})
Since: 6.0

Rhino.PersistentSettings.TryGetInteger(System.String,System.Int32@)
Since: 5.0

Rhino.PersistentSettings.TryGetInteger(System.String,System.Int32@,System.Collections.Generic.IEnumerable{System.String})
Since: 6.0

Rhino.PersistentSettings.GetInteger(System.String)
Since: 5.0

Rhino.PersistentSettings.GetInteger(System.String,System.Int32)
Since: 5.0

Rhino.PersistentSettings.GetInteger(System.String,System.Int32,System.Int32,System.Boolean)
Since: 6.0

Rhino.PersistentSettings.GetInteger(System.String,System.Int32,System.Int32,System.Int32)
Since: 6.0

Rhino.PersistentSettings.GetInteger(System.String,System.Int32,System.Collections.Generic.IEnumerable{System.String})
Since: 6.0

Rhino.PersistentSettings.TryGetUnsignedInteger(System.String,System.UInt32@)
Since: 5.0

Rhino.PersistentSettings.TryGetUnsignedInteger(System.String,System.UInt32@,System.Collections.Generic.IEnumerable{System.String})
Since: 6.0

Rhino.PersistentSettings.GetUnsignedInteger(System.String)
Since: 5.0

Rhino.PersistentSettings.GetUnsignedInteger(System.String,System.UInt32)
Since: 5.0

Rhino.PersistentSettings.GetUnsignedInteger(System.String,System.UInt32,System.Collections.Generic.IEnumerable{System.String})
Since: 6.0

Rhino.PersistentSettings.TryGetDouble(System.String,System.Double@)
Since: 5.0

Rhino.PersistentSettings.TryGetDouble(System.String,System.Double@,System.Collections.Generic.IEnumerable{System.String})
Since: 6.0

Rhino.PersistentSettings.GetDouble(System.String)
Since: 5.0

Rhino.PersistentSettings.GetDouble(System.String,System.Double)
Since: 5.0

Rhino.PersistentSettings.GetDouble(System.String,System.Double,System.Collections.Generic.IEnumerable{System.String})
Since: 6.0

Rhino.PersistentSettings.TryGetChar(System.String,System.Char@)
Since: 5.0

Rhino.PersistentSettings.TryGetChar(System.String,System.Char@,System.Collections.Generic.IEnumerable{System.String})
Since: 6.0

Rhino.PersistentSettings.GetChar(System.String)
Since: 5.0

Rhino.PersistentSettings.GetChar(System.String,System.Char)
Since: 5.0

Rhino.PersistentSettings.GetChar(System.String,System.Char,System.Collections.Generic.IEnumerable{System.String})
Since: 6.0

Rhino.PersistentSettings.TryGetString(System.String,System.String@)
Since: 5.0

Rhino.PersistentSettings.TryGetString(System.String,System.String@,System.Collections.Generic.IEnumerable{System.String})
Since: 6.0

Rhino.PersistentSettings.GetString(System.String)
Since: 5.0

Rhino.PersistentSettings.GetString(System.String,System.String)
Since: 5.0

Rhino.PersistentSettings.GetString(System.String,System.String,System.Collections.Generic.IEnumerable{System.String})
Since: 6.0

Rhino.PersistentSettings.GetStringDictionary(System.String)
Since: 6.0

Rhino.PersistentSettings.TryGetStringList(System.String,System.String[]@)
Since: 5.0

Rhino.PersistentSettings.TryGetStringList(System.String,System.String[]@,System.Collections.Generic.IEnumerable{System.String})
Since: 6.0

Rhino.PersistentSettings.GetStringList(System.String)
Since: 5.0

Rhino.PersistentSettings.GetStringList(System.String,System.String[])
Since: 5.0

Rhino.PersistentSettings.GetStringList(System.String,System.String[],System.Collections.Generic.IEnumerable{System.String})
Since: 6.0

Rhino.PersistentSettings.TryGetDate(System.String,System.DateTime@)
Since: 5.0

Rhino.PersistentSettings.TryGetDate(System.String,System.DateTime@,System.Collections.Generic.IEnumerable{System.String})
Since: 6.0

Rhino.PersistentSettings.GetDate(System.String)
Since: 5.0

Rhino.PersistentSettings.GetDate(System.String,System.DateTime)
Since: 5.0

Rhino.PersistentSettings.GetDate(System.String,System.DateTime,System.Collections.Generic.IEnumerable{System.String})
Since: 6.0

Rhino.PersistentSettings.TryGetColor(System.String,System.Drawing.Color@)
Since: 5.0

Rhino.PersistentSettings.TryGetColor(System.String,System.Drawing.Color@,System.Collections.Generic.IEnumerable{System.String})
Since: 6.0

Rhino.PersistentSettings.GetColor(System.String)
Since: 5.0

Rhino.PersistentSettings.GetColor(System.String,System.Drawing.Color)
Since: 5.0

Rhino.PersistentSettings.GetColor(System.String,System.Drawing.Color,System.Collections.Generic.IEnumerable{System.String})
Since: 6.0

Rhino.PersistentSettings.GetGuid(System.String)
Since: 6.0

Rhino.PersistentSettings.GetGuid(System.String,System.Guid)
Since: 6.0

Rhino.PersistentSettings.GetGuid(System.String,System.Guid,System.Collections.Generic.IEnumerable{System.String})
Since: 6.0

Rhino.PersistentSettings.TryGetPoint(System.String,System.Drawing.Point@)
Since: 5.0

Rhino.PersistentSettings.TryGetPoint(System.String,System.Drawing.Point@,System.Collections.Generic.IEnumerable{System.String})
Since: 6.0

Rhino.PersistentSettings.GetPoint(System.String)
Since: 5.0

Rhino.PersistentSettings.GetPoint(System.String,System.Drawing.Point)
Since: 5.0

Rhino.PersistentSettings.GetPoint(System.String,System.Drawing.Point,System.Collections.Generic.IEnumerable{System.String})
Since: 6.0

Rhino.PersistentSettings.TryGetPoint3d(System.String,Rhino.Geometry.Point3d@)
Since: 5.0

Rhino.PersistentSettings.TryGetPoint3d(System.String,Rhino.Geometry.Point3d@,System.Collections.Generic.IEnumerable{System.String})
Since: 6.0

Rhino.PersistentSettings.GetPoint3d(System.String)
Since: 5.0

Rhino.PersistentSettings.GetPoint3d(System.String,Rhino.Geometry.Point3d)
Since: 5.0

Rhino.PersistentSettings.GetPoint3d(System.String,Rhino.Geometry.Point3d,System.Collections.Generic.IEnumerable{System.String})
Since: 6.0

Rhino.PersistentSettings.TryGetSize(System.String,System.Drawing.Size@)
Since: 5.0

Rhino.PersistentSettings.TryGetSize(System.String,System.Drawing.Size@,System.Collections.Generic.IEnumerable{System.String})
Since: 6.0

Rhino.PersistentSettings.GetSize(System.String)
Since: 5.0

Rhino.PersistentSettings.GetSize(System.String,System.Drawing.Size)
Since: 5.0

Rhino.PersistentSettings.GetSize(System.String,System.Drawing.Size,System.Collections.Generic.IEnumerable{System.String})
Since: 6.0

Rhino.PersistentSettings.TryGetRectangle(System.String,System.Drawing.Rectangle@)
Since: 5.0

Rhino.PersistentSettings.TryGetRectangle(System.String,System.Drawing.Rectangle@,System.Collections.Generic.IEnumerable{System.String})
Since: 6.0

Rhino.PersistentSettings.GetRectangle(System.String)
Since: 5.0

Rhino.PersistentSettings.GetRectangle(System.String,System.Drawing.Rectangle)
Since: 5.0

Rhino.PersistentSettings.GetRectangle(System.String,System.Drawing.Rectangle,System.Collections.Generic.IEnumerable{System.String})
Since: 6.0

Rhino.PersistentSettings.TryGetDefault(System.String,System.Boolean@)
Since: 5.0

Rhino.PersistentSettings.TryGetDefault(System.String,System.Byte@)
Since: 5.0

Rhino.PersistentSettings.TryGetDefault(System.String,System.Int32@)
Since: 5.0

Rhino.PersistentSettings.TryGetDefault(System.String,System.Double@)
Since: 5.0

Rhino.PersistentSettings.TryGetDefault(System.String,System.Char@)
Since: 5.0

Rhino.PersistentSettings.TryGetDefault(System.String,System.String@)
Since: 5.0

Rhino.PersistentSettings.TryGetDefault(System.String,System.String[]@)
Since: 5.0

Rhino.PersistentSettings.TryGetDefault(System.String,System.DateTime@)
Since: 5.0

Rhino.PersistentSettings.TryGetDefault(System.String,System.Drawing.Color@)
Since: 5.0

Rhino.PersistentSettings.TryGetDefault(System.String,Rhino.Geometry.Point3d@)
Since: 5.0

Rhino.PersistentSettings.TryGetDefault(System.String,System.Drawing.Size@)
Since: 5.0

Rhino.PersistentSettings.TryGetDefault(System.String,System.Drawing.Rectangle@)
Since: 5.0

Rhino.PersistentSettings.GetEnumValue``1(``0)
Get a stored enumerated value, or return default value if not found
defaultValue:
Returns:
Since: 5.4

Rhino.PersistentSettings.GetEnumValue``1(System.String,``0)
Gets a stored enumerated value using a custom key, or return default value if not found.
key:
defaultValue:
Returns:
Since: 5.4

Rhino.PersistentSettings.GetEnumValue``1(System.String)
Get a stored enumerated value using a custom key.
key:
Returns:
Throws System.Collections.Generic.KeyNotFoundException:
Since: 5.4

Rhino.PersistentSettings.TryGetEnumValue``1(System.String,``0@)
Attempt to get the stored value for an enumerated setting using a custom key. Note: the enumerated value ALWAYS gets assigned!
Be sure to check for success of this method to prevent erroneous use of the value.
key:
enumValue:
Returns: true if successful
Since: 5.4

Rhino.PersistentSettings.SetGuid(System.String,System.Guid)
Since: 6.0

Rhino.PersistentSettings.SetBool(System.String,System.Boolean)
Since: 5.0

Rhino.PersistentSettings.SetByte(System.String,System.Byte)
Since: 5.0

Rhino.PersistentSettings.SetInteger(System.String,System.Int32)
Since: 5.0

Rhino.PersistentSettings.SetUnsignedInteger(System.String,System.UInt32)
Since: 5.0

Rhino.PersistentSettings.SetDouble(System.String,System.Double)
Since: 5.0

Rhino.PersistentSettings.SetChar(System.String,System.Char)
Since: 5.0

Rhino.PersistentSettings.SetString(System.String,System.String)
Since: 5.0

Rhino.PersistentSettings.StringListRootKey
Adding this string to a string list when calling SetStringList will cause the ProgramData setting to
get inserted at that location in the list.
Since: 5.0

Rhino.PersistentSettings.SetStringList(System.String,System.String[])
Including a item with the value of StringListRootKey will cause the ProgramData value to get inserted at
that location in the list when calling GetStringList.
key: The string key.
value: An array of values to set.
Since: 5.0

Rhino.PersistentSettings.DeleteItem(System.String)
Since: 5.0

Rhino.PersistentSettings.SetDate(System.String,System.DateTime)
Since: 5.0

Rhino.PersistentSettings.SetColor(System.String,System.Drawing.Color)
Since: 5.0

Rhino.PersistentSettings.SetPoint3d(System.String,Rhino.Geometry.Point3d)
Since: 5.0

Rhino.PersistentSettings.SetRectangle(System.String,System.Drawing.Rectangle)
Since: 5.0

Rhino.PersistentSettings.SetSize(System.String,System.Drawing.Size)
Since: 5.0

Rhino.PersistentSettings.SetPoint(System.String,System.Drawing.Point)
Since: 5.0

Rhino.PersistentSettings.SetDefault(System.String,System.Boolean)
Since: 5.0

Rhino.PersistentSettings.SetDefault(System.String,System.Byte)
Since: 5.0

Rhino.PersistentSettings.SetDefault(System.String,System.Int32)
Since: 5.0

Rhino.PersistentSettings.SetDefault(System.String,System.Double)
Since: 5.0

Rhino.PersistentSettings.SetDefault(System.String,System.Char)
Since: 5.0

Rhino.PersistentSettings.SetDefault(System.String,System.String)
Since: 5.0

Rhino.PersistentSettings.SetDefault(System.String,System.String[])
Since: 5.0

Rhino.PersistentSettings.SetDefault(System.String,System.DateTime)
Since: 5.0

Rhino.PersistentSettings.SetDefault(System.String,System.Drawing.Color)
Since: 5.0

Rhino.PersistentSettings.SetDefault(System.String,System.Drawing.Rectangle)
Since: 5.0

Rhino.PersistentSettings.SetDefault(System.String,System.Drawing.Size)
Since: 5.0

Rhino.PersistentSettings.SetDefault(System.String,System.Drawing.Point)
Since: 5.0

Rhino.PersistentSettings.SetDefault(System.String,Rhino.Geometry.Point3d)
Since: 5.0

Rhino.PersistentSettings.SetDefault(System.String,System.Guid)
Since: 6.0

Rhino.PersistentSettings.SetEnumValue``1(``0)
Set an enumerated value in the settings.
enumValue:
Since: 5.4

Rhino.PersistentSettings.SetEnumValue``1(System.String,``0)
Set an enumerated value in the settings using a custom key
key:
value:
Since: 5.4

Rhino.PersistentSettings.WriteXmlElement(System.Xml.XmlWriter,System.String,System.String,System.String,Rhino.PersistentSettings)
If the settings dictionary contains one or more values, which are not equal to the default value, then Write the contents
of this settings dictionary to the specified XmlWriter contained within elementName.
xmlWriter: XmlWriter object to write to.
elementName: Element which will contain key value pairs.
attributeName: Optional element attribute.
attributeValue: Optional element attribute value.
allUserSettings: All users settings to compare with.

Rhino.PersistentSettings.XmlDecode(System.Xml.XmlNode)
node:
Returns:

Rhino.PersistentSettings.ParseXmlNodes(System.Xml.XmlNode)
Parse XmlNode for settings "entry" elements, add entry elements to the
dictionary first and if then check the defaults list and make sure the
entry is in the list before setting the default value.