Rhino.Geometry.DetailView
Represents a view of the model placed on a page layout.

Rhino.Geometry.DetailView.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected serialization constructor for internal use.
info: Data to be serialized.
context: Serialization stream.

Rhino.Geometry.DetailView.IsParallelProjection
Gets or sets whether the view is parallel.
Since: 5.0

Rhino.Geometry.DetailView.IsPerspectiveProjection
Gets or sets whether the view is perspective.
Since: 5.0

Rhino.Geometry.DetailView.IsProjectionLocked
Gets or sets whether the view is locked.
Since: 5.0

Rhino.Geometry.DetailView.PageToModelRatio
Gets the ratio of page units to model units for this detail view.
Returns 0 if the projection is not parallel.
Remarks:
This property is only meaningful when Rhino.Geometry.DetailView.IsParallelProjection is true.
For non-parallel projections, the ratio is undefined and this property returns 0.
Since: 5.0

Rhino.Geometry.DetailView.SetScale(System.Double,Rhino.UnitSystem,System.Double,Rhino.UnitSystem)
Sets the detail viewport's projection so geometry is displayed at a certain scale.
modelLength: Reference model length.
modelUnits: Units for model length.
pageLength: Length on page that the modelLength should equal.
pageUnits: Units for page length.
Returns:
true on success. false if the DetailView projection is perspective or input values are incongruous.
Since: 5.0