Rhino.Geometry.SubDVertex
Single vertex of a SubD

Rhino.Geometry.SubDVertex.ClearSavedSubdivisionPoints(System.Boolean)
Discards the cached subdivision and surface points for this vertex, so they are
recomputed on next use.
clearNeighborhood:
If true, the cached points of the neighboring components are discarded too. Moving a
control net point changes the surface around it, not just at it, so pass true after
an edit unless you know only this vertex is affected.
Since: 8.36

Rhino.Geometry.SubDVertex.ControlNetPoint
Location of the "control net" point that this SubDVertex represents
Remarks:
The setter of this property will refresh the neighborhood cache around the vertex
everytime it is called. This is not efficient if you have multiple vertices to
modify. In that case, call vertex.SetControlNetPoint(position, false) for all the
vertices you want to modify, then call subd.ClearEvaluationCache()
Since: 7.0

Rhino.Geometry.SubDVertex.EdgeCount
Number of edges for this vertex
Since: 7.0

Rhino.Geometry.SubDVertex.FaceCount
Number of faces for this vertex
Since: 7.0

Rhino.Geometry.SubDVertex.ComponentIndex
Gets the component index of this vertex.
Returns: The component index.

Rhino.Geometry.SubDVertex.Next
Next vertex in linked list of vertices on this level
Since: 7.0

Rhino.Geometry.SubDVertex.Previous
Previous vertex in linked list of vertices on this level
Since: 7.0

Rhino.Geometry.SubDVertex.Tag
identifies the type of subdivision vertex
Since: 7.5

Rhino.Geometry.SubDVertex.EdgeAt(System.Int32)
Retrieve a SubDEdge from this vertex
index:
Returns:
Since: 7.0

Rhino.Geometry.SubDVertex.FaceAt(System.Int32)
Retrieve a SubDFace from this vertex
index:
Returns:
Since: 7.7

Rhino.Geometry.SubDVertex.Edges
All edges that this vertex is part of
Since: 7.0

Rhino.Geometry.SubDVertex.SurfacePoint
The SubD surface point
Returns:
Rhino.Geometry.SubD.SetVertexSurfacePoint(System.UInt32,Rhino.Geometry.Point3d)
Rhino.Geometry.SubD.InterpolateSurfacePoints(Rhino.Geometry.Point3d[])
Rhino.Geometry.SubD.InterpolateSurfacePoints(System.UInt32[],Rhino.Geometry.Point3d[])
Rhino.Geometry.SubDSurfaceInterpolator
Rhino.Geometry.SubD.UpdateSurfaceMeshCache(System.Boolean)
Since: 7.1

Rhino.Geometry.SubDVertex.SetControlNetPoint(Rhino.Geometry.Point3d,System.Boolean)
Change the location of the "control net" point that this SubDVertex represents
position:
New position for the vertex' control net point.
bClearNeighborhoodCache:
If true, clear the evaluation cache in the faces around the modified vertex.
Returns:
true if the vertex' control net point was modified.
Remarks:
This method is provided to be able to set multiple control vertices, without clearing
the neighborhood cache everytime as the ControlNetPoint property setter does. When you
are done modifying your SubD, call subd.UpdateEvaluationCache() to refresh
all caches.
Since: 8.0