Rhino.Geometry.BoundingBox
Represents the value of two points in a bounding box
defined by the two extreme corner points.
This box is therefore aligned to the world X, Y and Z axes.

Rhino.Geometry.BoundingBox.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Constructs a new bounding box from two corner points.
min: Point containing all the minimum coordinates.
max: Point containing all the maximum coordinates.
Since: 5.0

Rhino.Geometry.BoundingBox.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Constructs a bounding box from numeric extremes.
minX: Lower extreme for box X size.
minY: Lower extreme for box Y size.
minZ: Lower extreme for box Z size.
maxX: Upper extreme for box X size.
maxY: Upper extreme for box Y size.
maxZ: Upper extreme for box Z size.
Since: 5.0

Rhino.Geometry.BoundingBox.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Constructs a bounding box from a collection of points.
points: Points to include in the bounding box.
Since: 5.0

Rhino.Geometry.BoundingBox.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.Geometry.Transform)
Constructs a bounding box from a collection of points.
points: Points to include in the bounding box.
xform: Transformation.
Since: 6.0

Rhino.Geometry.BoundingBox.Empty
Gets an [Empty] bounding box. An Empty box is an invalid structure that has negative width.
Since: 5.0

Rhino.Geometry.BoundingBox.Unset
Gets a bounding box that has Unset coordinates for Min and Max.
Since: 5.0

Rhino.Geometry.BoundingBox.ToString
Constructs the string representation of this aligned bounding box.
Returns: Text.

Rhino.Geometry.BoundingBox.IsValid
Gets a value that indicates whether or not this bounding box is valid.
Empty boxes are not valid, and neither are boxes with unset points.
Since: 5.0

Rhino.Geometry.BoundingBox.Min
Gets or sets the point in the minimal corner.
Since: 5.0

Rhino.Geometry.BoundingBox.Max
Gets or sets the point in the maximal corner.
Since: 5.0

Rhino.Geometry.BoundingBox.Center
Gets the point in the center of the bounding box.
Since: 5.0

Rhino.Geometry.BoundingBox.Area
Gets the area of this BoundingBox.
Since: 6.0

Rhino.Geometry.BoundingBox.Volume
Gets the volume of this BoundingBox.
Since: 6.0

Rhino.Geometry.BoundingBox.Diagonal
Gets the diagonal vector of this BoundingBox.
The diagonal connects the Min and Max points.
Since: 5.0

Rhino.Geometry.BoundingBox.PointAt(System.Double,System.Double,System.Double)
Evaluates the bounding box with normalized parameters.
The box has idealized side length of 1x1x1.
tx: Normalized (between 0 and 1 is inside the box) parameter along the X direction.
ty: Normalized (between 0 and 1 is inside the box) parameter along the Y direction.
tz: Normalized (between 0 and 1 is inside the box) parameter along the Z direction.
Returns: The point at the {tx, ty, tz} parameters.
Since: 5.0

Rhino.Geometry.BoundingBox.ClosestPoint(Rhino.Geometry.Point3d)
Finds the closest point on or in the bounding box.
point: Sample point.
Returns: The point on or in the box that is closest to the sample point.
Since: 5.0

Rhino.Geometry.BoundingBox.ClosestPoint(Rhino.Geometry.Point3d,System.Boolean)
Finds the closest point on or in the bounding box.
point: Sample point.
includeInterior: If false, the point is projected onto the boundary faces only,
otherwise the interior of the box is also taken into consideration.
Returns: The point on or in the box that is closest to the sample point.
Since: 5.0

Rhino.Geometry.BoundingBox.FurthestPoint(Rhino.Geometry.Point3d)
Finds the furthest point on the Box.
point: Sample point.
Returns: The point on the box that is furthest from the sample point.
Since: 5.0

Rhino.Geometry.BoundingBox.Inflate(System.Double)
Inflates the box with equal amounts in all directions.
Inflating with negative amounts may result in decreasing boxes.
Invalid boxes can not be inflated.
amount: Amount (in model units) to inflate this box in all directions.
Since: 5.0

Rhino.Geometry.BoundingBox.Inflate(System.Double,System.Double,System.Double)
Inflate the box with custom amounts in all directions.
Inflating with negative amounts may result in decreasing boxes.
InValid boxes can not be inflated.
xAmount: Amount (in model units) to inflate this box in the x direction.
yAmount: Amount (in model units) to inflate this box in the y direction.
zAmount: Amount (in model units) to inflate this box in the z direction.
Since: 5.0

Rhino.Geometry.BoundingBox.Contains(Rhino.Geometry.Point3d)
Tests a point for bounding box inclusion. This is the same as calling Contains(point, false)
point: Point to test.
Returns: true if the point is on the inside of or coincident with this bounding box; otherwise false.
Since: 5.0

Rhino.Geometry.BoundingBox.Contains(Rhino.Geometry.Point3d,System.Boolean)
Tests a point for BoundingBox inclusion.
point: Point to test.
strict: If true, the point needs to be fully on the inside of the BoundingBox.
I.e. coincident points will be considered 'outside'.
Returns:
If 'strict' is affirmative, true if the point is inside this bounding box; false if it is on the surface or outside.
If 'strict' is negative, true if the point is on the surface or on the inside of the bounding box; otherwise false.
Since: 5.0

Rhino.Geometry.BoundingBox.Contains(Rhino.Geometry.BoundingBox)
Determines whether this bounding box contains another bounding box.
This is the same as calling Contains(box,false).
box: Box to test.
Returns: true if the box is on the inside of this bounding box, or is coincident with the surface of it.
Since: 5.0

Rhino.Geometry.BoundingBox.Contains(Rhino.Geometry.BoundingBox,System.Boolean)
Determines whether this bounding box contains another bounding box.
The user can choose how to treat bounding boxes with coincident surfaces.
box: Box to test.
strict: If true, the box needs to be fully on the inside of the bounding box.
I.e. coincident boxes will be considered 'outside'.
Returns: true if the box is (strictly) on the inside of this BoundingBox.
Since: 5.0

Rhino.Geometry.BoundingBox.MakeValid
Ensures that the box is defined in an increasing fashion along X, Y and Z axes.
If the Min or Max points are unset, this function will not change the box.
Returns: true if the box was made valid, false if the box could not be made valid.
Since: 5.0

Rhino.Geometry.BoundingBox.Corner(System.Boolean,System.Boolean,System.Boolean)
Gets one of the eight corners of the box.
minX: true for the minimum on the X axis; false for the maximum.
minY: true for the minimum on the Y axis; false for the maximum.
minZ: true for the minimum on the Z axis; false for the maximum.
Returns: The requested point.
Since: 5.0

Rhino.Geometry.BoundingBox.IsDegenerate(System.Double)
Determines whether a bounding box is degenerate (flat) in one or more directions.
tolerance:
Distances <= tolerance will be considered to be zero.  If tolerance
is negative (default), then a scale invariant tolerance is used.
Returns:
0 = box is not degenerate
1 = box is a rectangle (degenerate in one direction).
2 = box is a line (degenerate in two directions).
3 = box is a point (degenerate in three directions)
4 = box is not valid.
Since: 5.0

Rhino.Geometry.BoundingBox.GetCorners
Gets an array filled with the 8 corner points of this box.
See remarks for the return order.
Returns: An array of 8 corners.
Remarks:
[0] Min.X, Min.Y, Min.Z
[1] Max.X, Min.Y, Min.Z
[2] Max.X, Max.Y, Min.Z
[3] Min.X, Max.Y, Min.Z
[4] Min.X, Min.Y, Max.Z
[5] Max.X, Min.Y, Max.Z
[6] Max.X, Max.Y, Max.Z
[7] Min.X, Max.Y, Max.Z
Since: 5.0

Rhino.Geometry.BoundingBox.GetEdges
Gets an array of the 12 edges of this box.
Returns: If the bounding box IsValid, the 12 edges; otherwise, null.
Since: 5.0

Rhino.Geometry.BoundingBox.Transform(Rhino.Geometry.Transform)
Updates this bounding box to be the smallest axis aligned
bounding box that contains the transformed result of its 8 original corner
points.
xform: A transform.
Returns: true if this operation is successful; otherwise false.
Since: 5.0

Rhino.Geometry.BoundingBox.ToBrep
Constructs a Rhino.Geometry.Brep representation of this bounding box.
Returns: If this operation is successful, a Brep representation of this box; otherwise null.
Since: 5.0

Rhino.Geometry.BoundingBox.Union(Rhino.Geometry.BoundingBox)
Updates this BoundingBox to represent the union of itself and another box.
other: Box to include in this union.
Remarks: If either this BoundingBox or the other BoundingBox is InValid,
the Valid BoundingBox will be the only one included in the union.
Since: 5.0

Rhino.Geometry.BoundingBox.Union(Rhino.Geometry.Point3d)
Updates this BoundingBox to represent the union of itself and a point.
point: Point to include in the union.
Remarks: If this bounding box is InValid then the union will be
the BoundingBox containing only the point. If the point is InValid,
this BoundingBox will remain unchanged.
Since: 5.0

Rhino.Geometry.BoundingBox.Union(Rhino.Geometry.BoundingBox,Rhino.Geometry.BoundingBox)
Returns a new BoundingBox that represents the union of boxes a and b.
a: First box to include in union.
b: Second box to include in union.
Returns: The BoundingBox that contains both a and b.
Remarks: Invalid boxes are ignored and will not affect the union.
Since: 5.0

Rhino.Geometry.BoundingBox.Intersection(Rhino.Geometry.BoundingBox,Rhino.Geometry.BoundingBox)
Computes the intersection of two bounding boxes.
a: A first bounding box.
b: A second bounding box.
Returns: The intersection bounding box.
Since: 5.0

Rhino.Geometry.BoundingBox.Union(Rhino.Geometry.BoundingBox,Rhino.Geometry.Point3d)
Returns a new BoundingBox that represents the union of a bounding box and a point.
box: Box to include in the union.
point: Point to include in the union.
Returns: The BoundingBox that contains both the box and the point.
Remarks: Invalid boxes and points are ignored and will not affect the union.
Since: 5.0