Rhino.Runtime.InteropWrappers.CurveSegment
For internal use only.

Rhino.Runtime.InteropWrappers.CurveSegment.Index
The index of the curve used by this boundary element.
Since: 7.0

Rhino.Runtime.InteropWrappers.CurveSegment.SubDomain
The sub-domain of the curve used by this boundary element.
Since: 7.0

Rhino.Runtime.InteropWrappers.CurveSegment.Reversed
True if this piece of the curve should be reversed.
Since: 7.0