Rhino.ApplicationSettings.ViewSettingsState
Represents a snapshot of Rhino.ApplicationSettings.ViewSettings.
Since: 5.0

Rhino.ApplicationSettings.ViewSettingsState.PanScreenFraction
Gets or sets the faction used as multiplier to pan the screen.
Since: 5.0

Rhino.ApplicationSettings.ViewSettingsState.PanReverseKeyboardAction
Gets or sets if panning with the keyboard is reversed.
false, then Rhino pans the camera in the direction of the arrow key you press.
true, then Rhino pans the scene instead.
Since: 5.0

Rhino.ApplicationSettings.ViewSettingsState.AlwaysPanParallelViews
Gets or sets the 'always pan parallel views' value.
If the view is not looking straight at the construction plane, then
sets parallel viewports so they will not rotate.
Since: 5.0

Rhino.ApplicationSettings.ViewSettingsState.ZoomScale
Gets or sets the step size for zooming with a wheeled mouse or the Page Up and Page Down keys.
Since: 5.0

Rhino.ApplicationSettings.ViewSettingsState.ZoomExtentsParallelViewBorder
Border amount to apply to parallel viewport during zoom extents
Since: 6.3

Rhino.ApplicationSettings.ViewSettingsState.ZoomExtentsPerspectiveViewBorder
Border amount to apply to perspective viewport during zoom extents
Since: 6.3

Rhino.ApplicationSettings.ViewSettingsState.RotateCircleIncrement
Gets or sets the rotation increment.
When the user rotates a view with the keyboard, Rhino rotates the view in steps.
The usual step is 1/60th of a circle, which equals six degrees.
Since: 5.0

Rhino.ApplicationSettings.ViewSettingsState.RotateReverseKeyboard
Gets or sets the rotation direction.
If true, then Rhino rotates the camera around the scene, otherwise, rotates the scene itself.
Since: 5.0

Rhino.ApplicationSettings.ViewSettingsState.RotateToView
Gets or sets the rotation reference.
If true, then the views rotates relative to the view axes; false, than relative to the world x, y, and z axes.
Since: 5.0

Rhino.ApplicationSettings.ViewSettingsState.DefinedViewSetCPlane
Gets or sets the 'named views set CPlane' value.
When true, restoring a named view causes the construction plane saved with that view to also restore.
Since: 5.0

Rhino.ApplicationSettings.ViewSettingsState.DefinedViewSetProjection
Gets or sets the 'named views set projection' value.
When true, restoring a named view causes the viewport projection saved with the view to also restore.
Since: 5.0

Rhino.ApplicationSettings.ViewSettingsState.SingleClickMaximize
Gets or sets the 'single-click maximize' value.
When true, maximizing a viewport needs a single click on the viewport title rather than a double-click.
Since: 5.0

Rhino.ApplicationSettings.ViewSettingsState.LinkedViewports
Gets or sets the 'linked views' activated setting.
true enables real-time view synchronization.
When a standard view is manipulated, the camera lens length of all parallel projection
viewports are set to match the current viewport.
Since: 5.0

Rhino.ApplicationSettings.ViewSettingsState.ViewRotation
Gets or sets the view rotation value.
Since: 8.1

Rhino.ApplicationSettings.ViewSettingsState.ThreePointPerspectiveLensLength
Gets the three point perspective lens length.
The default is 50mm.
Since: 8.20

Rhino.ApplicationSettings.ViewSettingsState.TwoPointPerspectiveLensLength
Gets the two point perspective lens length.
The default is 20mm.
Since: 8.20