Rhino.Render.RenderMaterial.ChildSlotUsage.None
Corresponds to CRhRdkMaterial::ChildSlotUsage::None.

Rhino.Render.RenderMaterial.ChildSlotUsage.Diffuse
Corresponds to CRhRdkMaterial::ChildSlotUsage::Diffuse.

Rhino.Render.RenderMaterial.ChildSlotUsage.Transparency
Corresponds to CRhRdkMaterial::ChildSlotUsage::Transparency

Rhino.Render.RenderMaterial.ChildSlotUsage.Bump
Corresponds to CRhRdkMaterial::ChildSlotUsage::Bump

Rhino.Render.RenderMaterial.ChildSlotUsage.Environment
Corresponds to CRhRdkMaterial::ChildSlotUsage::Environment

Rhino.Render.RenderMaterial.ChildSlotUsage.PbrBaseColor
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_base_color

Rhino.Render.RenderMaterial.ChildSlotUsage.PbrSubsurface
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_subsurface

Rhino.Render.RenderMaterial.ChildSlotUsage.PbrSubSurfaceScattering
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_subsurface_scattering

Rhino.Render.RenderMaterial.ChildSlotUsage.PbrSubsurfaceScatteringRadius
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_subsurface_scattering_radius

Rhino.Render.RenderMaterial.ChildSlotUsage.PbrMetallic
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_metallic

Rhino.Render.RenderMaterial.ChildSlotUsage.PbrSpecular
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_specular

Rhino.Render.RenderMaterial.ChildSlotUsage.PbrSpecularTint
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_specular_tint

Rhino.Render.RenderMaterial.ChildSlotUsage.PbrRoughness
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_roughness

Rhino.Render.RenderMaterial.ChildSlotUsage.PbrAnisotropic
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_anisotropic

Rhino.Render.RenderMaterial.ChildSlotUsage.PbrAnisotropicRotation
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_anisotropic_rotation

Rhino.Render.RenderMaterial.ChildSlotUsage.PbrSheen
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_sheen

Rhino.Render.RenderMaterial.ChildSlotUsage.PbrSheenTint
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_sheen_tint

Rhino.Render.RenderMaterial.ChildSlotUsage.PbrClearcoat
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_clearcoat

Rhino.Render.RenderMaterial.ChildSlotUsage.PbrClearcoatRoughness
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_clearcoat_roughness

Rhino.Render.RenderMaterial.ChildSlotUsage.PbrOpacityIor
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_opacity_ior

Rhino.Render.RenderMaterial.ChildSlotUsage.PbrOpacity
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_opacity

Rhino.Render.RenderMaterial.ChildSlotUsage.PbrOpacityRoughness
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_opacity_roughness

Rhino.Render.RenderMaterial.ChildSlotUsage.PbrEmission
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_emission

Rhino.Render.RenderMaterial.ChildSlotUsage.PbrAmbientOcclusion
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_ambient_occlusion

Rhino.Render.RenderMaterial.ChildSlotUsage.PbrDisplacement
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_smudge
PbrSmudge = 0x400000,
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_displacement

Rhino.Render.RenderMaterial.ChildSlotUsage.PbrClearcoatBump
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_clearcoat_roughness

Rhino.Render.RenderMaterial.ChildSlotUsage.PbrAlpha
Corresponds to CRhRdkMaterial::ChildSlotUsage::PBR_alpha