Rhino.DocObjects.ObjectLinetypeSource
Defines enumerated values for the source of linetype of single objects.
Since: 5.0

Rhino.DocObjects.ObjectLinetypeSource.LinetypeFromLayer
use line style assigned to layer.

Rhino.DocObjects.ObjectLinetypeSource.LinetypeFromObject
use line style assigned to object.

Rhino.DocObjects.ObjectLinetypeSource.LinetypeFromParent
for objects with parents (like objects in instance references, use parent linetype)
if not parent, treat as linetype_from_layer.