Rhino.Geometry.ComponentIndex
Represents an index of an element contained in another object.

Rhino.Geometry.ComponentIndex.#ctor(Rhino.Geometry.ComponentIndexType,System.Int32)
Construct component index with a specific type/index combination
type:
index:
Since: 5.0

Rhino.Geometry.ComponentIndex.ComponentIndexType
The interpretation of Index depends on the Type value.
Type             m_index interpretation (0 based indices)
no_type            used when context makes it clear what array is being index
brep_vertex        Brep.m_V[] array index
brep_edge          Brep.m_E[] array index
brep_face          Brep.m_F[] array index
brep_trim          Brep.m_T[] array index
brep_loop          Brep.m_L[] array index
mesh_vertex        Mesh.m_V[] array index
meshtop_vertex     MeshTopology.m_topv[] array index
meshtop_edge       MeshTopology.m_tope[] array index
mesh_face          Mesh.m_F[] array index
idef_part          InstanceDefinition.m_object_uuid[] array index
polycurve_segment  PolyCurve::m_segment[] array index
dim_linear_point   LinearDimension2::POINT_INDEX
dim_radial_point   RadialDimension2::POINT_INDEX
dim_angular_point  AngularDimension2::POINT_INDEX
dim_ordinate_point OrdinateDimension2::POINT_INDEX
dim_text_point     TextEntity2 origin point.
Since: 5.0

Rhino.Geometry.ComponentIndex.Index
The interpretation of m_index depends on the m_type value.
m_type             m_index interpretation (0 based indices)
no_type            used when context makes it clear what array is being index
brep_vertex        Brep.m_V[] array index
brep_edge          Brep.m_E[] array index
brep_face          Brep.m_F[] array index
brep_trim          Brep.m_T[] array index
brep_loop          Brep.m_L[] array index
mesh_vertex        Mesh.m_V[] array index
meshtop_vertex     MeshTopology.m_topv[] array index
meshtop_edge       MeshTopology.m_tope[] array index
mesh_face          Mesh.m_F[] array index
idef_part          InstanceDefinition.m_object_uuid[] array index
polycurve_segment  PolyCurve::m_segment[] array index
dim_linear_point   LinearDimension2::POINT_INDEX
dim_radial_point   RadialDimension2::POINT_INDEX
dim_angular_point  AngularDimension2::POINT_INDEX
dim_ordinate_point OrdinateDimension2::POINT_INDEX
dim_text_point     TextEntity2 origin point.
Since: 5.0

Rhino.Geometry.ComponentIndex.IsSet
True if Rhino.Geometry.ComponentIndex.ComponentIndexType is set to a value between
Rhino.Geometry.ComponentIndexType.BrepVertex and Rhino.Geometry.ComponentIndexType.DimLeaderPoint.
Since: 8.26

Rhino.Geometry.ComponentIndex.IsUnset
Return true is this component index is the same as the Unset component index
Returns:
Since: 7.0

Rhino.Geometry.ComponentIndex.Equals(Rhino.Geometry.ComponentIndex)
Determines whether the specified Rhino.Geometry.ComponentIndex is equal to the current Rhino.Geometry.ComponentIndex,
comparing by value.
other: The other Rhino.Geometry.ComponentIndex to compare with.
Returns: true if other has the same ComponentIndexType and Index as this; otherwise, false.
Since: 8.0

Rhino.Geometry.ComponentIndex.GetHashCode
Computes the hash code for this Rhino.Geometry.ComponentIndex object.
Returns: A hash value that might be equal for two different Rhino.Geometry.ComponentIndex values.
Since: 8.0

Rhino.Geometry.ComponentIndex.Equals(System.Object)
Determines whether the specified System.Object is equal to the current Rhino.Geometry.ComponentIndex,
comparing by value.
obj: The other object to compare with.
Returns: true if obj is a Rhino.Geometry.ComponentIndex and ComponentIndexType and Index is the same; false otherwise.
Since: 8.0

Rhino.Geometry.ComponentIndex.CompareTo(Rhino.Geometry.ComponentIndex)
Compares this Rhino.Geometry.ComponentIndex with another Rhino.Geometry.ComponentIndex.
other: The other Rhino.Geometry.ComponentIndex to use in comparison
Returns:
0: if this is identical to other
-1: if this.ComponentIndexType < other.ComponentIndexType
-1: if this.ComponentIndexType == other.ComponentIndexType and this.Index < other.Index
+1: otherwise.
Since: 8.0

Rhino.Geometry.ComponentIndex.op_Equality(Rhino.Geometry.ComponentIndex,Rhino.Geometry.ComponentIndex)
Determines whether two ComponentIndexes have equal values.
a: The first Rhino.Geometry.ComponentIndex
b: The second Rhino.Geometry.ComponentIndex
Returns: True if the ComponentIndexes are equal
Since: 8.0

Rhino.Geometry.ComponentIndex.op_Inequality(Rhino.Geometry.ComponentIndex,Rhino.Geometry.ComponentIndex)
Determines whether two ComponentIndexes have different values.
a: The first Rhino.Geometry.ComponentIndex
b: The second Rhino.Geometry.ComponentIndex
Returns: True if the ComponentIndexes are unequal
Since: 8.0

Rhino.Geometry.ComponentIndex.op_LessThan(Rhino.Geometry.ComponentIndex,Rhino.Geometry.ComponentIndex)
Determines whether the first Rhino.Geometry.ComponentIndex comes before
the second.
a: The first Rhino.Geometry.ComponentIndex
b: The second Rhino.Geometry.ComponentIndex
Returns: true if the first comes before the second; otherwise, false.
Since: 8.0

Rhino.Geometry.ComponentIndex.op_GreaterThan(Rhino.Geometry.ComponentIndex,Rhino.Geometry.ComponentIndex)
Determines whether the first Rhino.Geometry.ComponentIndex comes after
the second.
a: The first Rhino.Geometry.ComponentIndex
b: The second Rhino.Geometry.ComponentIndex
Returns: true if the first comes after the second; otherwise, false.
Since: 8.0

Rhino.Geometry.ComponentIndex.op_LessThanOrEqual(Rhino.Geometry.ComponentIndex,Rhino.Geometry.ComponentIndex)
Determines whether the first Rhino.Geometry.ComponentIndex comes before
the second, or it is equal to it.
a: The first Rhino.Geometry.ComponentIndex
b: The second Rhino.Geometry.ComponentIndex
Returns: true if the first is equal to the second or comes before it; otherwise, false
Since: 8.0

Rhino.Geometry.ComponentIndex.op_GreaterThanOrEqual(Rhino.Geometry.ComponentIndex,Rhino.Geometry.ComponentIndex)
Determines whether the first Rhino.Geometry.ComponentIndex comes after
the second, or it is equal to it.
a: The first Rhino.Geometry.ComponentIndex
b: The second Rhino.Geometry.ComponentIndex
Returns: true if the first is equal to the second or comes after it; otherwise, false
Since: 8.0

Rhino.Geometry.ComponentIndex.Unset
The unset value of component index.
Since: 5.0