Rhino.Runtime.InteropWrappers.ClassArrayObjRef
Represents a wrapper to an unmanaged "array" (list) of CRhinoObjRef instances.
Wrapper for a C++ ON_ClassArray of CRhinoObjRef

Rhino.Runtime.InteropWrappers.ClassArrayObjRef.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.
Since: 5.0

Rhino.Runtime.InteropWrappers.ClassArrayObjRef.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.
Since: 5.0

Rhino.Runtime.InteropWrappers.ClassArrayObjRef.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.ClassArrayObjRef instance.
Since: 5.0

Rhino.Runtime.InteropWrappers.ClassArrayObjRef.#ctor(System.IntPtr,System.Boolean)
Construct from a pointer
ptr:
deleteOnDispose:
Since: 8.0

Rhino.Runtime.InteropWrappers.ClassArrayObjRef.#ctor(System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjRef})
Initializes a new instances from a set of ObjRefs
objrefs: An array, a list or any enumerable set of Rhino object references.
Since: 5.0

Rhino.Runtime.InteropWrappers.ClassArrayObjRef.Count
Gets the number of CRhinoObjRef instances in this array.
Since: 5.0

Rhino.Runtime.InteropWrappers.ClassArrayObjRef.Add(Rhino.DocObjects.ObjRef)
Adds an ObjRef to the list.
objref: An ObjRef to add.
Since: 5.0

Rhino.Runtime.InteropWrappers.ClassArrayObjRef.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.ClassArrayObjRef.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0

Rhino.Runtime.InteropWrappers.ClassArrayObjRef.ToNonConstArray
Copies the unmanaged array to a managed counterpart.
Returns: The managed array.
Since: 5.0