Rhino.DocObjects.Tables.HatchPatternTableEventType
HatchPattern event types
Since: 8.15

Rhino.DocObjects.Tables.HatchPatternTableEventType.Added
A hatchpattern was added.

Rhino.DocObjects.Tables.HatchPatternTableEventType.Deleted
A hatchpattern was deleted.

Rhino.DocObjects.Tables.HatchPatternTableEventType.Undeleted
A hatchpattern was undeleted.

Rhino.DocObjects.Tables.HatchPatternTableEventType.Modified
A hatchpattern was modified.

Rhino.DocObjects.Tables.HatchPatternTableEventType.Sorted
The hatchpattern table was sorted.

Rhino.DocObjects.Tables.HatchPatternTableEventType.Current
The current hatchpattern has changed.