Rhino.Geometry.MatchSrfSettings
Settings for matching a surface edge to other edge(s)

Rhino.Geometry.MatchSrfSettings.#ctor(Rhino.Geometry.Continuity,Rhino.Geometry.Continuity)
Constructor
match:
otherEnd:
Since: 8.21

Rhino.Geometry.MatchSrfSettings.EnableRefinement(System.Boolean,System.Double,System.Double,System.Double)
Enable refinement of the surface being edited
enabled: Switch refinement on or off
positionalTolerance: absolute distance
angleToleranceRadians: angle between surface normals
curvatureTolerance: percentage difference in radius of curvature
Since: 8.21

Rhino.Geometry.MatchSrfSettings.Continuity
Match the shape of the edge being edited to the target edge
Rhino.Geometry.Continuity.C0_continuous: edge position only
Rhino.Geometry.Continuity.G1_continuous: edge position and tangency
Rhino.Geometry.Continuity.G2_continuous: edge position, tangency and curvature
Since: 8.21

Rhino.Geometry.MatchSrfSettings.OtherEnd
Maintain the shape of the edge opposite the one being edited
Rhino.Geometry.Continuity.None: opposite edge is free to change
Rhino.Geometry.Continuity.C0_continuous: opposite edge position only
Rhino.Geometry.Continuity.G1_continuous: opposite edge position and tangency
Rhino.Geometry.Continuity.G2_continuous: opposite edge position, tangency and curvature
Since: 8.21

Rhino.Geometry.MatchSrfSettings.Average
If true, change both surfaces
Since: 8.21

Rhino.Geometry.MatchSrfSettings.MatchClosestPoints
Match the edge to the closest points on the target edge
Since: 8.21

Rhino.Geometry.MatchSrfSettings.RefineMatch
Add control point rows to the surface if necessary
Since: 8.21

Rhino.Geometry.MatchSrfSettings.RefinePositionalTolerance
Absolute distance tolerance for refinement
Since: 8.21

Rhino.Geometry.MatchSrfSettings.RefineAngleToleranceRadians
Angle between surface normals during refinement
Since: 8.21

Rhino.Geometry.MatchSrfSettings.RefineCurvatureTolerance
Percentage radius of curvature difference during refinement
Since: 8.21

Rhino.Geometry.MatchSrfSettings.PreserveIso
The way the surface iso-lines align with the target
Since: 8.21

Rhino.Geometry.MatchSrfSettings.ReverseMatchDirection
Reverse the direction of the edge to match.
Since: 8.21

Rhino.Geometry.MatchSrfSettings.ReverseAverageTargetDirection
Reverse the direction of the target for the averaged edge.
Since: 8.21