Rhino.FileIO.File3dmRenderTexture


Rhino.FileIO.File3dmRenderTexture.#ctor(System.Guid,Rhino.FileIO.File3dm)
Constructor for when the object is top-level.

Rhino.FileIO.File3dmRenderTexture.#ctor(System.Guid,Rhino.FileIO.File3dmRenderContent)
Constructor for when the object is a child.

Rhino.FileIO.File3dmRenderTexture.ToTexture
Get a simulated texture that approximates this texture's appearance.
Since: 8.0

Rhino.FileIO.File3dmRenderTexture.Filename
If the texture has a file name, returns that file name. Otherwise returns an empty string.
Since: 8.0