Rhino.Geometry.Continuity
Provides enumerated values for continuity along geometry,
such as continuous first derivative or continuous unit tangent and curvature.
Since: 5.0

Rhino.Geometry.Continuity.None
There is no continuity.

Rhino.Geometry.Continuity.C0_continuous
Continuous Function : Test for parametric continuity. In particular, all types of curves
are considered infinitely continuous at the start/end of the evaluation domain.

Rhino.Geometry.Continuity.C1_continuous
Continuous first derivative : Test for parametric continuity. In particular,
all types of curves are considered infinitely continuous at the start/end
of the evaluation domain.

Rhino.Geometry.Continuity.C2_continuous
Continuous first derivative and second derivative : Test for parametric continuity.
In particular, all types of curves are considered infinitely continuous at the
start/end of the evaluation domain.

Rhino.Geometry.Continuity.G1_continuous
Continuous unit tangent : Test for parametric continuity. In particular, all types of
curves are considered infinitely continuous at the start/end of the evaluation domain.

Rhino.Geometry.Continuity.G2_continuous
Continuous unit tangent and curvature : Test for parametric continuity. In particular,
all types of curves are considered infinitely continuous at the start/end of the
evaluation domain.

Rhino.Geometry.Continuity.C0_locus_continuous
Locus continuous function :
Continuity tests using the following enum values are identical to tests using the
preceding enum values on the INTERIOR of a curve's domain. At the END of a curve
a "locus" test is performed in place of a parametric test. In particular, at the
END of a domain, all open curves are locus discontinuous. At the END of a domain,
all closed curves are at least C0_locus_continuous. By convention all Curves
are considered locus continuous at the START of the evaluation domain. This
convention is not strictly correct, but it was adopted to make iterative kink
finding tools easier to use and so that locus discontinuities are reported once
at the end parameter of a curve rather than twice.

Rhino.Geometry.Continuity.C1_locus_continuous
Locus continuous first derivative :
Continuity tests using the following enum values are identical to tests using the
preceding enum values on the INTERIOR of a curve's domain. At the END of a curve
a "locus" test is performed in place of a parametric test. In particular, at the
END of a domain, all open curves are locus discontinuous. At the END of a domain,
all closed curves are at least C0_locus_continuous. By convention all Curves
are considered locus continuous at the START of the evaluation domain. This
convention is not strictly correct, but it was adopted to make iterative kink
finding tools easier to use and so that locus discontinuities are reported once
at the end parameter of a curve rather than twice.

Rhino.Geometry.Continuity.C2_locus_continuous
Locus continuous first and second derivative :
Continuity tests using the following enum values are identical to tests using the
preceding enum values on the INTERIOR of a curve's domain. At the END of a curve
a "locus" test is performed in place of a parametric test. In particular, at the
END of a domain, all open curves are locus discontinuous. At the END of a domain,
all closed curves are at least C0_locus_continuous. By convention all Curves
are considered locus continuous at the START of the evaluation domain. This
convention is not strictly correct, but it was adopted to make iterative kink
finding tools easier to use and so that locus discontinuities are reported once
at the end parameter of a curve rather than twice.

Rhino.Geometry.Continuity.G1_locus_continuous
Locus continuous unit tangent :
Continuity tests using the following enum values are identical to tests using the
preceding enum values on the INTERIOR of a curve's domain. At the END of a curve
a "locus" test is performed in place of a parametric test. In particular, at the
END of a domain, all open curves are locus discontinuous. At the END of a domain,
all closed curves are at least C0_locus_continuous. By convention all Curves
are considered locus continuous at the START of the evaluation domain. This
convention is not strictly correct, but it was adopted to make iterative kink
finding tools easier to use and so that locus discontinuities are reported once
at the end parameter of a curve rather than twice.

Rhino.Geometry.Continuity.G2_locus_continuous
Locus continuous unit tangent and curvature :
Continuity tests using the following enum values are identical to tests using the
preceding enum values on the INTERIOR of a curve's domain. At the END of a curve
a "locus" test is performed in place of a parametric test. In particular, at the
END of a domain, all open curves are locus discontinuous. At the END of a domain,
all closed curves are at least C0_locus_continuous. By convention all Curves
are considered locus continuous at the START of the evaluation domain. This
convention is not strictly correct, but it was adopted to make iterative kink
finding tools easier to use and so that locus discontinuities are reported once
at the end parameter of a curve rather than twice.

Rhino.Geometry.Continuity.Cinfinity_continuous
Analytic discontinuity. Cinfinity_continuous is a euphemism for "at a knot".

Rhino.Geometry.Continuity.Gsmooth_continuous
Aesthetic discontinuity