Rhino.AntialiasLevel
Provides the anti-alias levels used for render quality
Since: 6.0

Rhino.AntialiasLevel.None
Low quality

Rhino.AntialiasLevel.Draft
Draft quality

Rhino.AntialiasLevel.Good
Good quality

Rhino.AntialiasLevel.High
High quality