Rhino.Input.Custom.GetCircle.#ctor
Since: 6.0

Rhino.Input.Custom.GetCircle.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Input.Custom.GetCircle.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 6.0

Rhino.Input.Custom.GetCircle.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.Input.Custom.GetCircle.AllowDeformable
Allow for deformable options
Since: 6.0

Rhino.Input.Custom.GetCircle.Deformable
Is the deformable option set
Since: 6.0

Rhino.Input.Custom.GetCircle.DeformablePointCount
Since: 6.0

Rhino.Input.Custom.GetCircle.DeformableDegree
Since: 6.0

Rhino.Input.Custom.GetCircle.DefaultSize
Default radius or diameter (based on InDiameterMode)
Since: 6.0

Rhino.Input.Custom.GetCircle.InDiameterMode
Determines if the "size" value is representing a radius or diameter
Since: 6.0

Rhino.Input.Custom.GetCircle.UseActiveLayerLinetypeForCurves
Since: 8.0

Rhino.Input.Custom.GetCircle.Get(Rhino.Geometry.Circle@)
Perform the 'get' operation.
circle:
Returns:
Since: 6.0