Rhino.DocObjects.Tables.LightTableEventArgs.Document
Since: 5.3

Rhino.DocObjects.Tables.LightTableEventArgs.EventType
Since: 5.3

Rhino.DocObjects.Tables.LightTableEventArgs.LightIndex
Since: 5.3

Rhino.DocObjects.Tables.LightTableEventArgs.NewState
Since: 5.3

Rhino.DocObjects.Tables.LightTableEventArgs.OldState
Since: 5.3