Rhino.Runtime.Notifications.IAssemblyRestrictedObject
A class that implements this interface signals its clients that its instances can
only be modified by certain assemblies. This is useful in cases where only
certain assemblies should be able to modify an object. The actual members of an
instance that are restricted are left to the discretion of the instance's class,
and should be documented.

Rhino.Runtime.Notifications.IAssemblyRestrictedObject.Editable
Determines whether an assembly can modify the instance.
Returns: true if the instance can be edited by the assembly, otherwise returns false.
Since: 6.3