Rhino.Render.Fields.Point4dField
Point4d field value class

Rhino.Render.Fields.Point4dField.#ctor(Rhino.Render.RenderContent,System.IntPtr)
Constructor
renderContent: RenderContent whose Fields owns this filed.
attachToPointer: Existing C++ pointer to attach to.

Rhino.Render.Fields.Point4dField.Value
Gets or sets the field value
Since: 5.1

Rhino.Render.Fields.Point4dField.ValueAsObject
Since: 5.7