Rhino.Runtime.CloudHostUtils
Public wrapper exposing the cloud entitlement gate to cross-platform consumers.
Resolves the platform service lazily on first use; falls back to a no-op host
when no platform implementation is registered.

Rhino.Runtime.CloudHostUtils.IsEntitled
True when the running instance is entitled by its cloud provider. See Rhino.Runtime.ICloudHost remarks for tri-state semantics.

Rhino.Runtime.CloudHostUtils.DenyReason
Human-readable reason the entitlement was actively denied. Null both when entitled AND when the gate doesn't apply to this instance.

Rhino.Runtime.CloudHostUtils.Signature
Signed proof of entitlement returned by the cloud provider (null when not applicable).

Rhino.Runtime.CloudHostUtils.CheckEntitlement
Performs the cloud entitlement check (and on AMI-based Marketplace products, also
submits a metering record). Re-callable — each invocation runs the gate independently
and the platform implementation makes no claim of idempotency. On EC2 with a
Marketplace-attached product code and the right IAM role this calls AWS Marketplace
MeterUsage; elsewhere this is a no-op.