Rhino.DocObjects.ModelComponent
Base class for all components in a model (document) and manages the
index, id and other information common to this type of objects.
This class parallels the C++ ON_ModelComponent.

Rhino.DocObjects.ModelComponent.#ctor
Allows construction from inheriting classes.

Rhino.DocObjects.ModelComponent.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor for internal use.
info: Serialization data.
context: Serialization stream.

Rhino.DocObjects.ModelComponent.DataCRC(System.UInt32)
Increments the Cyclic Redundancy Check value by this instance.
currentRemainder: The current remainder value.
Returns: The updated remainder value.
Since: 6.0

Rhino.DocObjects.ModelComponent.IsSystemComponent
True if this model component is a system constant.
An incomplete list of system constant model components is below:
ON_ModelComponent::Unset
ON_InstanceDefinition::Empty
ON_Linetype::Unset
ON_Linetype::Continuous
ON_Linetype::ByLayer
ON_Linetype::ByParent
ON_Layer::Unset
ON_Layer::Default
ON_TextStyle::Unset
ON_TextStyle::Default
ON_TextStyle::ByLayer
ON_TextStyle::ByParent
ON_DimStyle::Unset
ON_DimStyle::Default
ON_DimStyle::DefaultInchDecimal
ON_DimStyle::DefaultInchFractional
ON_DimStyle::DefaultFootInchArchitecture
ON_DimStyle::DefaultMillimeterSmall
ON_DimStyle::DefaultMillimeterLarge
ON_DimStyle::DefaultMillimeterArchitecture
Since: 6.0

Rhino.DocObjects.ModelComponent.IsDeleted
true if the component is deleted.
Deleted components are kept by the document for undo purposes.
Since: 8.0

Rhino.DocObjects.ModelComponent.IsReference
Gets a value indicting whether this component is a referenced component.
Referenced components are part of referenced documents.
Since: 8.0

Rhino.DocObjects.ModelComponent.Id
Gets or sets the ID of the current instance.
Throws System.InvalidOperationException:
When setting the ID failed.
This usually happened because the instance ID is already locked.
Since: 6.0

Rhino.DocObjects.ModelComponent.ClearId
Resets the HasId property of the model component to false, if possible.
Throws System.InvalidOperationException: If the ID is locked.
Since: 6.0

Rhino.DocObjects.ModelComponent.HasId
Returns a value indicating whether the component has an ID.
Since: 6.0

Rhino.DocObjects.ModelComponent.IdIsLocked
Returns a value indicating whether the component ID is already locked.
Since: 6.0

Rhino.DocObjects.ModelComponent.LockId
Locks the component Id property.
Since: 6.0

Rhino.DocObjects.ModelComponent.Index
Gets or sets the model component index attribute.
Throws System.InvalidOperationException:
When setting the Index failed.
This usually happens because the instance Index is already locked.
Since: 6.0

Rhino.DocObjects.ModelComponent.ClearIndex
Resets the HasIndex property of the model component to false, if possible.
Throws System.InvalidOperationException: If the index is locked.
Since: 6.0

Rhino.DocObjects.ModelComponent.HasIndex
Returns a value indicating whether the component has an Index.
Since: 6.0

Rhino.DocObjects.ModelComponent.IndexIsLocked
Returns a value indicating whether the component Index is already locked.
Since: 6.0

Rhino.DocObjects.ModelComponent.LockIndex
Locks the component Index property.
Since: 6.0

Rhino.DocObjects.ModelComponent.ComponentStatus
Gets or sets the component status of the model component.
Since: 6.0

Rhino.DocObjects.ModelComponent.IsComponentStatusLocked
The component status itself can be locked. This returns an indication.
Since: 6.0

Rhino.DocObjects.ModelComponent.IsValidComponentName(System.String)
Tests for a valid model component name.
name: The string to validate.
Returns: true if the string is a valid model component name, false otherwise.
Since: 6.15

Rhino.DocObjects.ModelComponent.Name
Gets or sets the name
Throws System.InvalidOperationException:
When setting the Name failed.
This usually happens because the instance Name is already locked.
Since: 6.0

Rhino.DocObjects.ModelComponent.ClearName
Resets the HasName property of the model component to false, if possible.
Throws System.InvalidOperationException: If the name is locked.
Since: 6.0

Rhino.DocObjects.ModelComponent.HasName
Returns a value indicating whether the component has a Name.
Since: 6.0

Rhino.DocObjects.ModelComponent.NameIsLocked
Returns a value indicating whether the component Name is already locked.
Since: 6.0

Rhino.DocObjects.ModelComponent.LockName
Locks the component Name property.
Since: 6.0

Rhino.DocObjects.ModelComponent.DeletedName
Gets the name of a component that is deleted.
Since: 6.2

Rhino.DocObjects.ModelComponent.NamePathSeparator
Returns the string "::". This is the string Rhino uses in layer full path names to separate the names of individual layers.
Since: 8.0

Rhino.DocObjects.ModelComponent.ModelSerialNumber
A value identifying the model that manages this component.
Remarks:
If the component is being managed by a model, this value identifies the model.
In Rhino, this value is the document runtime serial number.
Typically this value is set and locked by the code that adds a component to a model.
This value is not saved in .3dm archives.
Since: 6.12

Rhino.DocObjects.ModelComponent.ReferenceModelSerialNumber
When a component is in a model for reference, this value identifies the reference model.
Remarks:
Reference components are not saved in .3dm archives.
Typically this value is set and locked by the code that adds a component to a model.
This value is not saved in .3dm archives.
Since: 6.12

Rhino.DocObjects.ModelComponent.InstanceDefinitionModelSerialNumber
When a component is in a model as part of the information required for a linked instance definition,
this value identifies the linked instance definition reference model.
Remarks:
Reference components are not saved in .3dm archives.
Typically this value is set and locked by the code that adds a component to a model.
This value is not saved in .3dm archives.
Since: 6.12

Rhino.DocObjects.ModelComponent.ComponentType
Gets the Rhino.DocObjects.ModelComponentType for this object.
Useful in switch statements.
Since: 6.0

Rhino.DocObjects.ModelComponent.ToString
Returns the name of the model component type, and then its name and index.
Remarks: This is provided as a visual aid. Do not rely on this for serialization.
Returns:

Rhino.DocObjects.ModelComponent.ModelComponentTypeRequiresUniqueName(Rhino.DocObjects.ModelComponentType)
Informs the developer if a particular model component type will require uniqueness within a document.
This is currently true with render materials and model geometry; false otherwise.
type: The type to check.
Returns: true with render materials and model geometry; false otherwise.
Since: 6.0

Rhino.DocObjects.ModelComponent.ModelComponentTypeIgnoresCase(Rhino.DocObjects.ModelComponentType)
Informs the developer if a particular model component type will require case-ignoring searching within a document.
This is currently true with groups; false otherwise.
type: True if the component ignores case.
Since: 6.0

Rhino.DocObjects.ModelComponent.ModelComponentTypeIncludesParent(Rhino.DocObjects.ModelComponentType)
Informs the developer if a particular model component type will include the hash of the parent.
type: True if the component includes parent hash.
Since: 6.0