Rhino.Render.RenderContentStyles
Since: 5.1

Rhino.Render.RenderContentStyles.None
No defined styles

Rhino.Render.RenderContentStyles.TextureSummary
Texture UI includes an auto texture summary section. See AddAutoParameters().

Rhino.Render.RenderContentStyles.QuickPreview
Editor displays an instant preview before preview cycle begins.

Rhino.Render.RenderContentStyles.PreviewCache
Content's preview imagery can be stored in the preview cache.

Rhino.Render.RenderContentStyles.ProgressivePreview
Content's preview imagery can be rendered progressively.

Rhino.Render.RenderContentStyles.LocalTextureMapping
Texture UI includes an auto local mapping section for textures. See AddAutoParameters()

Rhino.Render.RenderContentStyles.GraphDisplay
Texture UI includes a graph section.

Rhino.Render.RenderContentStyles.NameTypeSection
Render content UI includes a 'Name' and 'Type' section.

Rhino.Render.RenderContentStyles.SharedUI
OBSOLETE: The UI is always shared between render contents of the same type id.

Rhino.Render.RenderContentStyles.Adjustment
Texture UI includes an adjustment section.

Rhino.Render.RenderContentStyles.Fields
Render content uses fields to facilitate data storage and undo support. See Fields()

Rhino.Render.RenderContentStyles.ModalEditing
Render content supports editing in a modal editor. OBSOLETE: All contents support modal editing.

Rhino.Render.RenderContentStyles.DynamicFields
The render content's fields are dynamic. OBSOLETE: Dynamic fields can co-exist with static fields.