Rhino.Geometry.ClippingPlaneSurface
Represents a planar surface that is used as clipping plane in viewports.
A clipping plane object maintains a list of viewports that it clips against.

Rhino.Geometry.ClippingPlaneSurface.#ctor
Constructs an empty clipping plane surface
Since: 8.11

Rhino.Geometry.ClippingPlaneSurface.#ctor(Rhino.Geometry.Plane)
Constructs a clipping plane surface from a Plane
plane:
Since: 8.11

Rhino.Geometry.ClippingPlaneSurface.#ctor(Rhino.Geometry.PlaneSurface)
Constructs a ClippingPlaneSurface from a PlaneSurface
planeSurface:
Since: 8.11

Rhino.Geometry.ClippingPlaneSurface.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor for internal use.
info: Serialization data.
context: Serialization stream.

Rhino.Geometry.ClippingPlaneSurface.PlaneDepth
Distance that the clipping has an effect
Since: 8.0

Rhino.Geometry.ClippingPlaneSurface.PlaneDepthEnabled
Determines if the PlaneDepth value should be used
Since: 8.0

Rhino.Geometry.ClippingPlaneSurface.ViewportIds
Returns the ids of RhinoViewport objects that are clipped by this clipping plane.
Returns: The ids of RhinoViewport objects.
Since: 5.0

Rhino.Geometry.ClippingPlaneSurface.AddClipViewportId(System.Guid)
Adds a viewport id to the list of viewports that this clipping plane clips.
viewportId: The id of the RhinoViewport to add.
Returns: true if the viewport was added, false if the viewport is already in the list.
Since: 6.1

Rhino.Geometry.ClippingPlaneSurface.RemoveClipViewportId(System.Guid)
Removes a viewport id that this being clipped by this clipping plane.
viewportId: The id of the RhinoViewport to remove.
Returns: true if the viewport was removed, false if the viewport was not in the list.
Since: 6.1

Rhino.Geometry.ClippingPlaneSurface.ParticipationListsEnabled
Should the object and layer participation lists be used when determining clipping
Since: 8.0

Rhino.Geometry.ClippingPlaneSurface.SetClipParticipation(System.Collections.Generic.IEnumerable{System.Guid},System.Collections.Generic.IEnumerable{System.Int32},System.Boolean)
Set a list of specific object ids and layers that this clipping plane surface clips.
objectIds:
layerIndices:
isExclusionList: Is the list a set of ids to not clip or a set to clip
Since: 8.0

Rhino.Geometry.ClippingPlaneSurface.GetClipParticipation(System.Collections.Generic.IEnumerable{System.Guid}@,System.Collections.Generic.IEnumerable{System.Int32}@,System.Boolean@)
objectIds:
layerIndices:
isExclusionList:

Rhino.Geometry.ClippingPlaneSurface.ClearClipParticipationLists
Remove list of object ids that this clipping plane surface clips. This causes the clipping
plane surface to clip all objects
Since: 8.0