Rhino.Input.Custom.GeometryAttributeFilter
If an object passes the geometry TYPE filter, then the geometry ATTRIBUTE
filter is applied.
Since: 5.0

Rhino.Input.Custom.GeometryAttributeFilter.WireCurve
3d wire curve
If you want to accept only wire or edge curves, then
specify wire_curve or edge_curve, otherwise both wire
and edge curves will pass the attribute filter.

Rhino.Input.Custom.GeometryAttributeFilter.EdgeCurve
3d curve of a surface edge
If you want to accept only wire or edge curves, then
specify wire_curve or edge_curve, otherwise both wire
and edge curves will pass the attribute filter.

Rhino.Input.Custom.GeometryAttributeFilter.ClosedCurve
Closed Curves and Edges are acceptable
If you want to accept only closed or open curves, then
specify either closed_curve or open_curve.  Otherwise both
closed and open curves will pass the attribute filter.

Rhino.Input.Custom.GeometryAttributeFilter.OpenCurve
Open Curves and Edges are acceptable
If you want to accept only closed or open curves, then
specify either closed_curve or open_curve.  Otherwise both
closed and open curves will pass the attribute filter.

Rhino.Input.Custom.GeometryAttributeFilter.SeamEdge
seam edges are acceptable
attributes of acceptable trimming edge objects (associated with an ON_BrepTrim).
If none of these attributes are explicitly specified, then
any kind of trimming edge will pass the attribute filter.

Rhino.Input.Custom.GeometryAttributeFilter.ManifoldEdge
edges with 2 different surfaces pass
attributes of acceptable trimming edge objects (associated with an ON_BrepTrim).
If none of these attributes are explicitly specified, then
any kind of trimming edge will pass the attribute filter.

Rhino.Input.Custom.GeometryAttributeFilter.NonmanifoldEdge
edges with 3 or more surfaces pass
attributes of acceptable trimming edge objects (associated with an ON_BrepTrim).
If none of these attributes are explicitly specified, then
any kind of trimming edge will pass the attribute filter.

Rhino.Input.Custom.GeometryAttributeFilter.MatedEdge
any mated edge passes
attributes of acceptable trimming edge objects (associated with an ON_BrepTrim).
If none of these attributes are explicitly specified, then
any kind of trimming edge will pass the attribute filter.

Rhino.Input.Custom.GeometryAttributeFilter.SurfaceBoundaryEdge
boundary edges on surface sides pass
attributes of acceptable trimming edge objects (associated with an ON_BrepTrim).
If none of these attributes are explicitly specified, then
any kind of trimming edge will pass the attribute filter.

Rhino.Input.Custom.GeometryAttributeFilter.TrimmingBoundaryEdge
boundary edges that trim a surface pass
attributes of acceptable trimming edge objects (associated with an ON_BrepTrim).
If none of these attributes are explicitly specified, then
any kind of trimming edge will pass the attribute filter.

Rhino.Input.Custom.GeometryAttributeFilter.BoundaryEdge
ant boundary edge passes
attributes of acceptable trimming edge objects (associated with an ON_BrepTrim).
If none of these attributes are explicitly specified, then
any kind of trimming edge will pass the attribute filter.

Rhino.Input.Custom.GeometryAttributeFilter.ClosedSurface
If you want to accept only closed or open surfaces, then
specify either closed_surface or open_surface.  Otherwise both
closed and open surfaces will pass the attribute filter.

Rhino.Input.Custom.GeometryAttributeFilter.OpenSurface
If you want to accept only closed or open surfaces, then
specify either closed_surface or open_surface.  Otherwise both
closed and open surfaces will pass the attribute filter.

Rhino.Input.Custom.GeometryAttributeFilter.TrimmedSurface
If you want to accept only trimmed or untrimmed surfaces, then
specify either trimmed_surface or untrimmed_surface.  Otherwise
both trimmed and untrimmed surfaces will pass the attribute filter.

Rhino.Input.Custom.GeometryAttributeFilter.UntrimmedSurface
If you want to accept only trimmed or untrimmed surfaces, then
specify either trimmed_surface or untrimmed_surface.  Otherwise
both trimmed and untrimmed surfaces will pass the attribute filter.

Rhino.Input.Custom.GeometryAttributeFilter.SubSurface
If you want to accept only sub-surfaces of (multi-surface)
polysurface, then specify sub_surface.  If you do not want to
accept sub-surfaces, then specify top_surface.  Otherwise
sub-surfaces and top surfaces will pass the attribute filter.

Rhino.Input.Custom.GeometryAttributeFilter.TopSurface
If you want to accept only sub-surfaces of (multi-surface)
polysurface, then specify sub_surface.  If you do not want to
accept sub-surfaces, then specify top_surface.  Otherwise
sub-surfaces and top surfaces will pass the attribute filter.

Rhino.Input.Custom.GeometryAttributeFilter.ManifoldPolysrf
If you want to accept only manifold or non-manifold polysurfaces,
then specify manifold_polysrf or nonmanifold_polysrf. Otherwise
both manifold and non-manifold polysurfaces will pass the attribute
filter.

Rhino.Input.Custom.GeometryAttributeFilter.NonmanifoldPolysrf
If you want to accept only manifold or non-manifold polysurfaces,
then specify manifold_polysrf or nonmanifold_polysrf. Otherwise
both manifold and non-manifold polysurfaces will pass the attribute
filter.

Rhino.Input.Custom.GeometryAttributeFilter.ClosedPolysrf
If you want to accept only closed or open polysurfaces, then
specify either closed_polysrf or open_polysrf.  Otherwise both
closed and open polysurfaces will pass the attribute filter.

Rhino.Input.Custom.GeometryAttributeFilter.OpenPolysrf
If you want to accept only closed or open polysurfaces, then
specify either closed_polysrf or open_polysrf.  Otherwise both
closed and open polysurfaces will pass the attribute filter.

Rhino.Input.Custom.GeometryAttributeFilter.ClosedMesh
If you want to accept only closed or open meshes, then
specify either closed_mesh or open_mesh.  Otherwise both
closed and open meshes will pass the attribute filter.

Rhino.Input.Custom.GeometryAttributeFilter.OpenMesh
If you want to accept only closed or open meshes, then
specify either closed_mesh or open_mesh.  Otherwise both
closed and open meshes will pass the attribute filter.

Rhino.Input.Custom.GeometryAttributeFilter.BoundaryInnerLoop
all trimming edges are boundary edges.

Rhino.Input.Custom.GeometryAttributeFilter.MatedInnerLoop
all trimming edges are mated.

Rhino.Input.Custom.GeometryAttributeFilter.InnerLoop
any inner loop is acceptable.

Rhino.Input.Custom.GeometryAttributeFilter.BoundaryOuterLoop
all trimming edges are boundary edges.

Rhino.Input.Custom.GeometryAttributeFilter.MatedOuterLoop
all trimming edges are mated.

Rhino.Input.Custom.GeometryAttributeFilter.OuterLoop
any outer loop is acceptable.

Rhino.Input.Custom.GeometryAttributeFilter.SpecialLoop
slit, curve-on-surface, point-on-surface, etc.