Rhino.Geometry.PointFaceRelation
Enumerates the possible point/BrepFace spatial relationships.
Since: 5.0

Rhino.Geometry.PointFaceRelation.Exterior
Point is on the exterior (the trimmed part) of the face.

Rhino.Geometry.PointFaceRelation.Interior
Point is on the interior (the existing part) of the face.

Rhino.Geometry.PointFaceRelation.Boundary
Point is in limbo.