Rhino.Geometry.HiddenLineDrawingPoint
Points generated from source objects which correspond to point and point cloud source objects.

Rhino.Geometry.HiddenLineDrawingPoint.SourceObject
Return the source object that this point came from.
Since: 6.8

Rhino.Geometry.HiddenLineDrawingPoint.SourceObjectComponentIndex
Component of source object part that generated this curve.
Since: 6.8

Rhino.Geometry.HiddenLineDrawingPoint.ClippingPlaneIndex
Index into HiddenLineDrawing.ClippingPlanes when SilhouetteType == SilhouetteType.SectionCut.
Since: 6.8

Rhino.Geometry.HiddenLineDrawingPoint.Location
Returns the location of this object in HiddenLineDrawing coordinates.
Since: 6.8

Rhino.Geometry.HiddenLineDrawingPoint.Index
Index of this object in HiddenLineDrawing.Points.
Since: 6.8

Rhino.Geometry.HiddenLineDrawingPoint.PointVisibility
Returns the point's visibility
Since: 6.8