Rhino.DocObjects.Linetype.#ctor
Since: 5.0

Rhino.DocObjects.Linetype.#ctor(Rhino.DocObjects.Linetype)
Since: 8.0

Rhino.DocObjects.Linetype.DuplicateLinetype
Duplicates a linetype, clears the name, id, and locked bits.
Returns: The duplicated linetype if successful, null otherwise.
Since: 8.0

Rhino.DocObjects.Linetype.CommitChanges
Since: 5.0

Rhino.DocObjects.Linetype.ComponentType
Returns Rhino.DocObjects.ModelComponentType.LinePattern.
Since: 6.0

Rhino.DocObjects.Linetype.IsDeleted
Gets a value indicating whether this linetype has been deleted and is
currently in the Undo buffer.
Since: 5.0

Rhino.DocObjects.Linetype.IsReference
Gets a value indicting whether this linetype is a referenced linetype.
Referenced linetypes are part of referenced documents.
Since: 5.0

Rhino.DocObjects.Linetype.Name
The name of this linetype.
Since: 5.0

Rhino.DocObjects.Linetype.LinetypeIndex
The index of this linetype.
Since: 5.0

Rhino.DocObjects.Linetype.PatternLength
Total length of one repeat of the pattern.
Since: 5.0

Rhino.DocObjects.Linetype.SegmentCount
Number of segments in the pattern.
Since: 5.0

Rhino.DocObjects.Linetype.IsModified
true if this linetype has been modified by LinetypeTable.ModifyLinetype()
and the modifications can be undone.
Since: 5.0

Rhino.DocObjects.Linetype.InUse
Returns true if the linetype is in use by a Rhino object,
a layer, an instance definition, or a section style.
Since: 8.7

Rhino.DocObjects.Linetype.LineCapStyle
Defines how the ends of open curves should be drawn
Since: 8.0

Rhino.DocObjects.Linetype.LineJoinStyle
Defines how the corners of curves should be drawn
Since: 8.0

Rhino.DocObjects.Linetype.Width
Base width for this linetype
Since: 8.0

Rhino.DocObjects.Linetype.WidthUnits
Unit system that widths are defined in. UnitSystem.None is default
and means that the width is defined in pixels.
Since: 8.0

Rhino.DocObjects.Linetype.GetTaperPoints
Taper points are positions/width combinations along the length of a curve
Returns:
Since: 8.0

Rhino.DocObjects.Linetype.SetTaper(System.Double,System.Double)
Set taper to a simple start width / end width
startWidth:
endWidth:
Since: 8.0

Rhino.DocObjects.Linetype.SetTaper(System.Double,Rhino.Geometry.Point2d,System.Double)
Set taper for this linetype width a single internal taper point
startWidth:
taperPoint:
endWidth:
Since: 8.0

Rhino.DocObjects.Linetype.RemoveTaper
Remove taper information for stroke
Since: 8.0

Rhino.DocObjects.Linetype.AlwaysModelDistances
Linetype patterns and widths are typically interpreted as distances on
the printed output when printing. In this case AlwaysModelDistances is
false (default). When set to true, the linetype pattern and width will
be interpreted as being in world distances. This is useful for cases
like modeling a road as a single curve.
Since: 8.6

Rhino.DocObjects.Linetype.IsPatternLocked
Returns true if the pattern is locked and cannot be modified.
Since: 8.0

Rhino.DocObjects.Linetype.Default
Set linetype to default settings.
Since: 5.0

Rhino.DocObjects.Linetype.AppendSegment(System.Double,System.Boolean)
Adds a segment to the pattern.
length: The length of the segment to be added.
isSolid:
If true, the length is interpreted as a line. If false,
then the length is interpreted as a space.
Returns: Index of the added segment.
Since: 5.0

Rhino.DocObjects.Linetype.RemoveSegment(System.Int32)
Removes a segment in the linetype.
index: Zero based index of the segment to remove.
Returns: true if the segment index was removed.
Since: 5.0

Rhino.DocObjects.Linetype.SetSegments(System.Collections.Generic.IEnumerable{System.Double})
Set all segments.
segments:
An array of segments lengths.
Lengths >= 0 are interpreted as a line.
Lengths < 0 are interpreted as a space.
Returns: true if the segments were replaced
Since: 6.8

Rhino.DocObjects.Linetype.SetSegment(System.Int32,System.Double,System.Boolean)
Sets the length and type of the segment at index.
index: Zero based index of the segment.
length: The length of the segment to be added in millimeters.
isSolid:
If true, the length is interpreted as a line. If false,
then the length is interpreted as a space.
Returns: true if the operation was successful; otherwise false.
Since: 5.0

Rhino.DocObjects.Linetype.GetSegment(System.Int32,System.Double@,System.Boolean@)
Gets the segment information at a index.
index: Zero based index of the segment.
length: The length of the segment in millimeters.
isSolid:
If the length is interpreted as a line, true is assigned during the call to this out parameter.
If the length is interpreted as a space, then false is assigned during the call to this out parameter.
Throws System.IndexOutOfRangeException: If the index is unacceptable.
Since: 5.0

Rhino.DocObjects.Linetype.ReadFromFile(System.String)
Reads linetypes from either a Rhino .3dm file or an AutoCAD .lin file.
path: The path to the file to read.
Returns: An array of linetypes if successful, otherwise an empty array.
Since: 6.6

Rhino.DocObjects.Linetype.CreateFromPatternString(System.String,System.Boolean)
Creates a linetype from a pattern string.
Values greater than zero represent line segments,
and values less than or equal to zero represents space segments.
patternString: The pattern string.
millimeters:
Specify true if the pattern is represented in millimeters.
Specify false if the pattern is represented in inches.
Returns: A valid linetype if successful, null otherwise.
Since: 7.4

Rhino.DocObjects.Linetype.PatternString(System.Boolean)
Returns a string that represents the pattern of the linetype, which can be used in user interface.
Values greater than zero represent line segments,
and values less than or equal to zero represent space segments.
millimeters:
If true, the string is formatted in millimeters.
If false, the string is formatted in inches.
Returns: The pattern string.
Since: 7.4

Rhino.DocObjects.Linetype.SetUserString(System.String,System.String)
Attach a user string (key,value combination) to this geometry.
key: id used to retrieve this string.
value: string associated with key.
Returns: true on success.
Since: 8.9

Rhino.DocObjects.Linetype.GetUserString(System.String)
Gets user string from this geometry.
key: id used to retrieve the string.
Returns: string associated with the key if successful. null if no key was found.
Since: 8.9

Rhino.DocObjects.Linetype.UserStringCount
Gets the amount of user strings.
Since: 8.9

Rhino.DocObjects.Linetype.GetUserStrings
Gets a copy of all (user key string, user value string) pairs attached to this geometry.
Returns: A new collection.
Since: 8.9

Rhino.DocObjects.Linetype.DeleteUserString(System.String)
Since: 8.9

Rhino.DocObjects.Linetype.DeleteAllUserStrings
Since: 8.9