Rhino.Geometry.BrepVertex
Brep vertex information

Rhino.Geometry.BrepVertex.Brep
Gets the Brep that owns this vertex.
Since: 5.4

Rhino.Geometry.BrepVertex.VertexIndex
Gets the index of this vertex in the Brep.Vertices collection.
Since: 5.4

Rhino.Geometry.BrepVertex.Tolerance
Accuracy of vertex point, either >=0.0 or Rhino.RhinoMath.UnsetValue.
A value of Rhino.RhinoMath.UnsetValue indicates that the tolerance should be computed.
A value of 0.0 indicates that the distance from the vertex to any applicable
edge or trim end is <= Rhino.RhinoMath.ZeroTolerance.
If an edge begins or ends at this vertex, then the distance from the vertex's
3d point to the appropriate end of the edge's 3d curve must be <= this tolerance.
If a trim begins or ends at this vertex, then the distance from the vertex's
3d point to the 3d point on the surface obtained by evaluating the surface at
the appropriate end of the trimming curve must be  <= this tolerance.
Since: 7.26

Rhino.Geometry.BrepVertex.ProxyBrepSubDVertexId
If this vertex is part of a brep created by SubD.ProxyBrep(),
then the subd component id of the corresponding SubD vertex is returned.
Otherwise 0 is returned.
Since: 7.19

Rhino.Geometry.BrepVertex.EdgeIndices
Gets the indices of all edges associated with this vertex.
Returns: Empty array on failure.
Since: 5.12