Rhino.Runtime.InteropWrappers.SimpleArrayIntPtr
Wrapper for ON_SimpleArray<IntPtr>. If you are not writing C++ code
then this class is not for you.

Rhino.Runtime.InteropWrappers.SimpleArrayIntPtr.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.
Since: 8.0

Rhino.Runtime.InteropWrappers.SimpleArrayIntPtr.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.
Since: 8.0

Rhino.Runtime.InteropWrappers.SimpleArrayIntPtr.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayIntPtr class.
Since: 8.0

Rhino.Runtime.InteropWrappers.SimpleArrayIntPtr.Count
Gets the number of elements in this array.
Since: 8.0

Rhino.Runtime.InteropWrappers.SimpleArrayIntPtr.ToArray
Returns the managed counterpart of the unmanaged array.
Returns: The managed array.
Since: 8.0

Rhino.Runtime.InteropWrappers.SimpleArrayIntPtr.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.SimpleArrayIntPtr.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 8.0