Rhino.Render.RenderTabs.FromRenderSessionId(Rhino.PlugIns.PlugIn,System.Type,System.Guid)
Get the instance of a render tab associated with a specific render
session, this is useful when it is necessary to update a control from a
Rhino.Render.RenderPipeline
plugIn:
The plug-in that registered the custom user interface
tabType:
The type of tab to return
renderSessionId:
The Rhino.Render.RenderPipeline.RenderSessionId of a specific render
session.
Returns:
Returns the custom tab object if found; otherwise null is returned.
Since: 5.11

Rhino.Render.RenderTabs.SidePaneUiIdFromTab(System.Object)
Get the id of the side pane UI that a tab is in.
tab:
Returns:
Since: 8.0

Rhino.Render.RenderTabs.SessionIdFromTab(System.Object)
Get the render session id that created the specified tab object. Only applies to tabs in the context
of a render window, not other contexts like Rhino Options or View Properties. It actually returns
the identifier associated with the side pane UI which is typically the same as the render session id.
tab:
Returns:
Since: 5.11

Rhino.Render.RenderTabs.RegisterTab(Rhino.PlugIns.PlugIn,System.Type,System.String,System.Drawing.Icon)
Register custom render user interface with Rhino.  This should only be
done in Rhino.PlugIns.RenderPlugIn.RegisterRenderTabs(Rhino.Render.RenderTabs).  Panels
registered after Rhino.PlugIns.RenderPlugIn.RegisterRenderTabs(Rhino.Render.RenderTabs) is called
will be ignored.  If the class includes a public method "void DoHelp()"
the method will get called when F1 is pressed and the custom tab is active.
plugin:
The plug-in providing the custom user interface
tabType:
The type of object to be created and added to the render container.
caption:
The caption for the custom user interface.
icon:
Since: 5.11
7.0

Rhino.Render.RenderTabs.RegisterTab(Rhino.PlugIns.PlugIn,System.Type,System.Guid,System.String,System.Drawing.Icon)
Since: 7.0