Rhino.Render.ChangeQueue.Skylight
ChangeQueue skylight

Rhino.Render.ChangeQueue.Skylight.#ctor(System.IntPtr)
Construct a ChangeQueue Skylight
pSkyLight:

Rhino.Render.ChangeQueue.Skylight.Enabled
Return true if skylight is enabled
Since: 6.0

Rhino.Render.ChangeQueue.Skylight.UsesCustomEnvironment
Return true if skylight uses custom environment
Since: 6.0

Rhino.Render.ChangeQueue.Skylight.ShadowIntensity
Get shadow intensity for skylight. This is unused at present.
Since: 6.0

Rhino.Render.ChangeQueue.Skylight.ToString
Textual representation of Skylight
Returns: