Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1
An ordered set that notifies its subscribers whenever one of its INotifyPropertyChanged elements raises its PropertyChanged event.
A class that implements INotifyPropertyChanged as well as IAssemblyRestrictedObject
Remarks: This class prevents the removal of elements by assemblies they cannot be edited by. At the time of removal,
each element's Rhino.Runtime.Notifications.IAssemblyRestrictedObject.Editable method will be invoked, and if false, an
InvalidOperationException will be thrown.

Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1.#ctor(System.Collections.Generic.IEnumerable{`0})
Creates an instance with the given items.
items: Items that the instance will contain. If there are duplicate items, they will be removed.

Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1.#ctor
Creates an empty instance.

Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1.Item(System.Int32)
Gets or replaces an element in the ordered set at the specified index.
index: The index of the element.
Returns: the element at the given index.
Throws System.IndexOutOfRangeException: Thrown if the index passed is out of bounds.
Throws System.InvalidOperationException: Thrown if the item that will be replaced at the specified index cannot be modified by the current assembly.

Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1.Count
Returns the total number of items in the set.

Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1.IsReadOnly
Always returns false.

Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1.Add(`0)
Adds an object to the end of the ordered set if the set does not already contain the item.
item: The item to add.

Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1.Clear
Clears the ordered set.
Throws System.InvalidOperationException: Thrown if at least one item currently in the set cannot be modified by the current assembly.

Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1.Contains(`0)
Determines whether an element is in the set.
item: The item to check for inclusion.
Returns: True if the item is in the set; otherwise false.

Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1.CopyTo(`0[],System.Int32)
Copies the values of the set to an array.
array: The array to copy the values to.
arrayIndex: The index of the array to start the copy.

Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1.GetEnumerator
Returns an enumerator that iterates through the set.
Returns:

Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1.IndexOf(`0)
Searches for the specified object and returns the zero-based index of the first occurrence.
item: The item to locate.
Returns: The zero-based index of the first occurrence of item if found; otherwise -1.

Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1.Insert(System.Int32,`0)
Inserts an element at the specified index.
index: The index to insert the element at.
item: The item to insert.
Throws System.IndexOutOfRangeException: Thrown if the index passed is out of bounds.

Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1.Remove(`0)
Removes an element from the set.
item: The element to remove.
Returns: Returns true if the element was removed; otherwise returns false.
Throws System.InvalidOperationException: Thrown if the item that will be removed cannot be modified by the current assembly.

Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1.RemoveAt(System.Int32)
Removes an element at the specified index from the set.
index: The index of the element to remove.
Throws System.IndexOutOfRangeException: Thrown if the index passed is out of bounds.
Throws System.InvalidOperationException: Thrown if the item that will be removed cannot be modified by the current assembly.

Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1.Sort``1(System.Func{`0,``0},System.Boolean)
Sorts the set.
keySelector:
descending: If true, the sort will happen in descending other; if false, it will happen in ascending order.

Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1.System#Collections#IEnumerable#GetEnumerator
Returns an enumerator that iterates through the dictionary.
Returns:

Rhino.Runtime.Notifications.TrulyObservableOrderedSet`1.CollectionChanged
Triggered whenever the set changes or when one of its elements has its PropertyChanged event triggered.