Rhino.Display.DisplayPipelineAttributes.GridPlaneVisibilityMode
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.GridPlaneVisibilityMode.ShowOnlyIfGridVisible
Show only when grid is on

Rhino.Display.DisplayPipelineAttributes.GridPlaneVisibilityMode.AlwaysShow
Show always