Rhino.FileIO.FileGltf
Support for writing glTF file format
Since: 8.3

Rhino.FileIO.FileGltf.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileGltfWriteOptions)
Write a glTF file based on the contents of a RhinoDoc
filename: path to write a file to
doc: document to get geometry from
options: options used for generating the glTF file
Returns: true on success
Since: 8.3