Rhino.Render.Sun
Represents the Sun on a little portion of Earth.

Rhino.Render.Sun.Changed
This event is raised when a Sun property value is changed.
Since: 5.10

Rhino.Render.Sun.SunDirection(System.Double,System.Double,System.DateTime)
Since: 5.0

Rhino.Render.Sun.#ctor
Create a utility object not associated with any document
Since: 5.0

Rhino.Render.Sun.Dispose
Since: 5.0

Rhino.Render.Sun.Enabled
Turn the sun on/off in this document.
Since: 5.0

Rhino.Render.Sun.ManualControl
Since: 5.10
8.0

Rhino.Render.Sun.ManualControlOn
Manual control 'on' state. When true, allows the user to set the sun
azimuth and altitude directly. When false, the values are computed.
Since: 8.0

Rhino.Render.Sun.Accuracy
Accuracy.
Since: 8.0

Rhino.Render.Sun.SkylightOn
Turn skylight on or off.
Since: 5.10

Rhino.Render.Sun.DaylightSaving
Since: 5.10
8.0

Rhino.Render.Sun.DaylightSavingOn
Daylight saving time 'on' state
Since: 5.10

Rhino.Render.Sun.DaylightSavingMinutes
Daylight saving time in minutes
Since: 6.0

Rhino.Render.Sun.TimeZone
The observer's time zone measured in hours relative to UTC.
Since: 5.10

Rhino.Render.Sun.North
Angle in degrees on world X-Y plane that should be considered north in the model.
The angle is measured starting at the x-axis and increases anti-clockwise. The y-axis
corresponds to a 'north' angle of 90 degrees.
Since: 5.0

Rhino.Render.Sun.Intensity
Sun intensity.
Since: 7.0

Rhino.Render.Sun.Vector
Since: 5.0

Rhino.Render.Sun.Light
Get a Light which represents the sun. If manual control is in effect, no sun calculation
is performed; the function uses the last known values of azimuth and altitude.
If manual control is not in effect, the observer's position, date, time, time zone and
daylight saving values are used to calculate the position of the sun.
Since: 6.0

Rhino.Render.Sun.SetPosition(System.Double,System.Double)
Since: 5.0
8.0
8.0

Rhino.Render.Sun.SetPosition(System.DateTime,System.Double,System.Double)
Since: 5.0
8.0
8.0

Rhino.Render.Sun.Azimuth
The sun's azimuth in degrees. The value increases Eastwards with North as zero.
Setting this value will also set the sun to manual control mode.
Note: This value is not affected by the direction of north.
Since: 5.0

Rhino.Render.Sun.Altitude
The sun's altitude above the horizon in degrees in the range -90 to +90.
Setting this value will also set the sun to manual control mode.
Since: 5.0

Rhino.Render.Sun.Latitude
The observer's latitude.
Since: 5.0

Rhino.Render.Sun.Longitude
The observer's longitude.
Since: 5.0

Rhino.Render.Sun.GetDateTime(System.DateTimeKind)
Get the observer's date and time as a DateTime with kind DateTimeKind.Local.
Param 'kind' specifies the kind of date and time to retrieve from the sun.
- If DateTimeKind.Local, the returned DateTime will contain the local sun time,
i.e., the time you see in the UI under 'Local'.
- If DateTimeKind.Utc, the returned DateTime will contain the UTC sun time,
i.e., the time you see in the UI under 'UTC', which is the Sun's local time adjusted
for its time zone and daylight saving (if any).
**** Local sun time is to do with the Sun's time zone and not the time zone of the computer.
**** The returned DateTime object always has a kind of Local even if you requested the sun's
UTC date and time. This is because the Sun's time zone is nothing to do with the actual
computer's time zone and converting the result would cause further confusion.
Since: 5.0

Rhino.Render.Sun.SetDateTime(System.DateTime,System.DateTimeKind)
Set the observer's date and time.
kind specifies the kind of date and time to set to the sun. Note that this is distinct
from the DateTimeKind of 'time' which has nothing to do with the sun's local/UTC scenario.
- If 'kind' is DateTimeKind.Local, the sun's local time will be set, i.e., the time you see
in the UI under 'Local'. This is the preferred way to use this function.
- If 'kind' is DateTimeKind.Utc, the sun's UTC time will be set, i.e., the time you see
in the UI under 'UTC'. This is only for completeness; it's not likely to be useful,
but if you do use it, be aware that the sun will convert this time to local using its
currently set time zone and daylight saving information (not the locale's information).
Caveat: Local sun time is to do with the Sun's time zone and not the time zone of the computer.
Caveat: If the supplied DateTime object has a kind of Local, it will be used verbatim.
If, however, it has a kind of Utc, it will be converted to local time on the computer
using the computer's time zone and daylight saving locale information before being
passed to the sun. To avoid confusion, it's best to always use DateTimes with Kind
'Local' when setting the sun's date and time. This is because the Sun's time zone
is nothing to do with the actual computer's time zone.
Since: 6.0

Rhino.Render.Sun.ColorFromAltitude(System.Double)
Get sun color based on altitude.
altitudeDegrees: The altitude sun angle in degrees.
Returns:
Returns color for altitude.
Since: 6.0

Rhino.Render.Sun.AltitudeFromValues(System.Double,System.Double,System.Double,System.Int32,System.DateTime,System.Double,System.Boolean)
Since: 6.0

Rhino.Render.Sun.ShowDialog
Show the modal sun dialog.
Since: 5.0
6.0

Rhino.Render.Sun.ShowDialogEx
Helper function for Rhino.UI.Dialogs.ShowSunDialog() to show the modal sun dialog.
Returns:
Returns true if the user clicked OK, or false if the user cancelled.

Rhino.Render.Sun.JulianDay(System.Double,System.Int32,System.DateTime,System.Double)
Since: 6.0

Rhino.Render.Sun.TwilightZone
Since: 6.0

Rhino.Render.Sun.Here(System.Double@,System.Double@)
Since: 6.0

Rhino.Render.Sun.Hash
Get a hash of the sun state.
Since: 8.0

Rhino.Render.Sun.CopyFrom(Rhino.Render.FreeFloatingBase)
Since: 6.0