Rhino.Geometry.PointCloudUnsafeLock
Permits access to the underlying PointCloud raw data structures in an unsafe way.
Remarks: This lock object needs to be disposed before using the PointCloud in other calculations and this can
be achieved with the using keyword (Using in VB.Net).

Rhino.Geometry.PointCloudUnsafeLock.PointArray(System.Int32@)
Retrieves a pointer to the raw point array, which uses coordinates
defined with double precision floating point numbers, or null if none is available.
length: The length of the array. This value is returned by reference (out in C#).
0 is returned when there is no single precision array.
Returns: The beginning of the point array. Item 0 is the first vertex,
and item length-1 is the last valid one. If no array is available, null is returned.
Since: 7.9

Rhino.Geometry.PointCloudUnsafeLock.NormalArray(System.Int32@)
Retrieves a pointer to the raw array of point normals, or null if none is available.
length: The length of the array. This value is returned by reference (out in C#).
0 is returned when there is no single precision array.
Returns: The beginning of the vector array. Item 0 is the first vertex,
and item length-1 is the last valid one. If no array is available, null is returned.
Since: 7.9

Rhino.Geometry.PointCloudUnsafeLock.ColorArray(System.Int32@)
Retrieves a pointer to the raw array of colors, which are represented
as 32-bit integers in ARGB format, or null if none is available.
length: The length of the array. This value is returned by reference (out in C#).
0 is returned when there is no single precision array.
Returns: The beginning of the color array. Item 0 is the first vertex,
and item length-1 is the last valid one. If no array is available, null is returned.
Since: 7.9

Rhino.Geometry.PointCloudUnsafeLock.ValueArray(System.Int32@)
Retrieves a pointer to the raw array of point values, or null if none is available.
length: The length of the array. This value is returned by reference (out in C#).
0 is returned when there is no single precision array.
Returns: The beginning of the value array. Item 0 is the first vertex,
and item length-1 is the last valid one. If no array is available, null is returned.
Since: 7.9

Rhino.Geometry.PointCloudUnsafeLock.Release
Releases the lock and updates the underlying unmanaged data structures.
Since: 6.0