Rhino.Runtime.TextFields
This Class Processes Text Field Functions

Rhino.Runtime.TextFields.Date
Current date
Returns:
Since: 7.0

Rhino.Runtime.TextFields.Date(System.String)
Current date in a specified format
dateFormat:
Returns:
Since: 7.0

Rhino.Runtime.TextFields.Date(System.String,System.String)
Current Date in a specific format and language
dateFormat:
languageId:
Returns:
Since: 7.0

Rhino.Runtime.TextFields.DateModified
Date the document was last edited
Returns:
Since: 7.0

Rhino.Runtime.TextFields.DateModified(System.String)
Date the document was last edited in a specified format
dateFormat:
Returns:
Since: 7.0

Rhino.Runtime.TextFields.DateModified(System.String,System.String)
Date the document was last edited in a specific format and language in local time
dateFormat:
languageId:
Returns:
Since: 7.0

Rhino.Runtime.TextFields.Notes
Notes for a RhinoDoc
Returns:
Since: 7.0

Rhino.Runtime.TextFields.ModelUnits
Returns:
Since: 7.0

Rhino.Runtime.TextFields.FileName
Return full path to the document
Returns:
Since: 7.0

Rhino.Runtime.TextFields.FileName(System.String)
Return path to the document
options:
Returns:
Since: 7.0

Rhino.Runtime.TextFields.LayerName(System.String)
Returns the name of a layer based on the layers guid
layerId:
Returns:
Since: 7.0

Rhino.Runtime.TextFields.ObjectLayer(System.String)
Return an object's layer name
id:
Returns:
Since: 7.0

Rhino.Runtime.TextFields.PaperName
Returns the layouts selected paper name
example Letter / A4 / A6
Returns:
Since: 7.0

Rhino.Runtime.TextFields.PageNumber
Returns the current layouts page number
Returns:
Since: 7.0

Rhino.Runtime.TextFields.PageName
Return the current layout page name
Returns:
Since: 7.0

Rhino.Runtime.TextFields.PageName(System.String)
Return the page name for the specified View ID
id:
Returns:
Since: 7.0

Rhino.Runtime.TextFields.PageWidth
Return the current layout page width in the layout units
Returns:
Since: 7.0

Rhino.Runtime.TextFields.PageHeight
Return the current layout page height in the layout units
Returns:
Since: 7.0

Rhino.Runtime.TextFields.NumPages
Number of layout pages in a document
Returns:
Since: 7.0

Rhino.Runtime.TextFields.DetailScale(System.String,System.String)
Returns a detail views scale
Returns:
Since: 7.0

Rhino.Runtime.TextFields.ReturnValue(System.Int32,System.Double,System.Double,System.String)
Used to trait value before return it back.
dimension: 1 = length, 2 = area, 3 = volume
value:
metersPerUnit: meters per unit value is expressed
unitSystem: desired output unit system
Returns:

Rhino.Runtime.TextFields.Area(System.String)
Returns the area value for a selected object id
id:
Returns:
Since: 7.0

Rhino.Runtime.TextFields.Area(System.String,System.String)
Returns the area value for a selected object id in a specified unit system
id:
unitSystem:
Returns:
Since: 7.0

Rhino.Runtime.TextFields.Volume(System.String)
Returns the volume for the selected object id
open objects return 0 volume
id:
Returns:
Since: 7.0

Rhino.Runtime.TextFields.Volume(System.String,System.String)
Returns a volume;
if the opt param is a bool "true/false" or "1/0" then open objects are inspected or ignored.
if the opt param is a unit system as a string "millimeter" then the volume will be returned if the object is closed and in the specified unit system.
Open objects return 0
id:
opt:
Returns:
Since: 7.0

Rhino.Runtime.TextFields.Volume(System.String,System.String,System.String)
Returns a volume from an object Id.
If allowOpenObjects = false objects which are open will return 0.0 as a volume.
id:
unitSystem:
allowOpenObjects:
Returns:
Since: 7.8

Rhino.Runtime.TextFields.CurveLength(System.String)
Get length of a curve given a string id
id:
Returns:
Since: 7.0

Rhino.Runtime.TextFields.CurveLength(System.String,System.String)
Get length of a curve given a string id in a specified unit system.
UnitSystem enumeration as string
id:
unitSystem:
Returns:
Since: 7.0

Rhino.Runtime.TextFields.ObjectName(System.String)
Return an object's name
id:
Returns:
Since: 7.0

Rhino.Runtime.TextFields.ObjectPageName(System.String)
Returns the layout page name the object resides on
Returns:
Since: 8.0

Rhino.Runtime.TextFields.ObjectPageNumber(System.String)
Returns the layout page number the object resides on
Returns:
Since: 8.0

Rhino.Runtime.TextFields.ObjectName
Returns an attached Text objects attribute name.
Returns:
Since: 7.5

Rhino.Runtime.TextFields.PointCoordinate(System.String,System.String)
returns the location of a 3d point
pointId:
axis:
Returns:
Since: 7.0

Rhino.Runtime.TextFields.GetPointLocation(Rhino.Geometry.Point,System.String)
returns a point location as a string.
pt:
axis:
Returns:

Rhino.Runtime.TextFields.DocumentText(System.String)
Return document user string for a given key
key:
Returns:
Since: 7.0

Rhino.Runtime.TextFields.UserText(System.String,System.String)
User text associated with an object, block or layout
id:
key:
Returns:
Since: 7.0

Rhino.Runtime.TextFields.UserText(System.String,System.String,System.String)
User text associated with an object, block or layout
id:
key:
prompt:
Returns:
Since: 7.0

Rhino.Runtime.TextFields.UserText(System.String,System.String,System.String,System.String)
User text associated with an object, block or layout
id:
key:
prompt:
defaultValue:
Returns:
Since: 7.0

Rhino.Runtime.TextFields.BlockAttributeText(System.String,System.String,System.String)
User text associated with a block
key:
prompt:
defaultValue:
Since: 7.0

Rhino.Runtime.TextFields.LayoutUserText(System.String)
Returns a value from the active layouts user text strings for the specified key.
key:
Returns:
Since: 7.0

Rhino.Runtime.TextFields.LayoutUserText(System.String,System.String)
Returns user text value from a layout id Key
layoutId:
key:
Returns:
Since: 7.0

Rhino.Runtime.TextFields.BlockInstanceName(System.String)
Returns the block definition name of a block instance
Use BlockName Instead
blockId:
Returns:
Since: 7.0

Rhino.Runtime.TextFields.BlockName(System.String)
Returns the block definition name of a block instance
blockId:
Returns:
Since: 8.0

Rhino.Runtime.TextFields.BlockInstanceCount(System.String)
Returns the number of block instances found in the document
with the specified block definition name or the instance reference id.
instanceDefinitionNameOrId:
Returns:
Since: 7.0

Rhino.Runtime.TextFields.BlockDescription(System.String)
Returns a block definition description
definitionNameOrId:
Returns:
Since: 8.0

Rhino.Runtime.TextFields.GetInstanceAttributeFields(System.String)
Gets an array of block attribute definitions associated with a
TextObject.
str:
TextObject to check for block attribute definitions
Returns:
Will return a empty array if text is null or there is no attributes
otherwise; returns a list of one or more attribute definitions embedded
in the text string.
Since: 7.0

Rhino.Runtime.TextFields.GetInstanceAttributeFields(Rhino.DocObjects.TextObject)
Gets an array of block attribute definitions associated with a
TextObject.
text:
TextObject to check for block attribute definitions
Returns:
Will return a empty array if text is null or there is no attributes
otherwise; returns a list of one or more attribute definitions embedded
in the text string.
Since: 7.0

Rhino.Runtime.TextFields.GetInstanceAttributeFields(Rhino.DocObjects.InstanceDefinition)
idef:
Returns:
Since: 7.0

Rhino.Runtime.TextFields.TryParse(System.String,Rhino.RhinoDoc,System.Collections.Generic.List{System.String}@)
Evaluates the contents of a text string with field expressions
and returns the result
text:
The text formula to parse and evaluate
doc:
The Rhino document to evaluate
result:
The result of the evaluated expression. Otherwise, if the text is null
or the evaluation process fails, the result will be empty.
Returns:
Returns True if the expression is evaluated properly; Otherwise False.
Since: 8.0

Rhino.Runtime.TextFields.TryFormat(System.String,Rhino.RhinoDoc,System.String@)
Formats the contents of a text string with field expressions
and returns the result
text:
The text formula to format
doc:
The Rhino document to evaluate
result:
The result of the formatted expression. Otherwise, if the text is null
or the evaluation process fails, the result will be empty.
Returns:
Returns True if the expression is formatted properly; Otherwise False.
Since: 8.0