Rhino.Render.MappingTag
Holds texture mapping information.

Rhino.Render.MappingTag.Id
Gets or sets a map globally unique identifier.
Since: 5.0

Rhino.Render.MappingTag.MappingType
Gets or sets a texture mapping type: linear, cylinder, etc...
Since: 5.0

Rhino.Render.MappingTag.MappingCRC
Gets or sets the cyclic redundancy check on the mapping.
See also Rhino.RhinoMath.CRC32(System.UInt32,System.Byte[]).
Since: 5.0

Rhino.Render.MappingTag.MeshTransform
Gets or sets a 4x4 matrix transform.
Since: 5.0