Rhino.FileIO.FileVda
Support for writing Igs file format

Rhino.FileIO.FileVda.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileVdaWriteOptions)
Write a Vda file based on the contents of a RhinoDoc
path: path to write a file to
doc: document to get geometry from
options: options used for generating the Vda file
Returns: true on success
Since: 8.0