Rhino.Geometry.Point2f
Represents the two coordinates of a point in two-dimensional space,
using System.Single-precision floating point numbers.

Rhino.Geometry.Point2f.#ctor(System.Single,System.Single)
Initializes a new two-dimensional point from two components.
x: X component of vector.
y: Y component of vector.
Since: 5.0

Rhino.Geometry.Point2f.#ctor(System.Double,System.Double)
Initializes a new two-dimensional point from two double-precision floating point numbers as coordinates.
Coordinates will be internally converted to floating point numbers. This might cause precision loss.
x: X component of vector.
y: Y component of vector.
Since: 5.0

Rhino.Geometry.Point2f.Unset
Gets the standard unset point.
Since: 5.0

Rhino.Geometry.Point2f.IsValid
Gets a value indicating whether this point is considered valid.
Since: 5.0

Rhino.Geometry.Point2f.X
Gets or sets the X (first) component of the vector.
Since: 5.0

Rhino.Geometry.Point2f.Y
Gets or sets the Y (second) component of the vector.
Since: 5.0

Rhino.Geometry.Point2f.Equals(System.Object)
Determines whether the specified System.Object is a Rhino.Geometry.Point2f and has the same values as the present point.
obj: The specified object.
Returns: true if obj is Point2f and has the same coordinates as this; otherwise false.

Rhino.Geometry.Point2f.Equals(Rhino.Geometry.Point2f)
Determines whether the specified Rhino.Geometry.Point2f has the same values as the present point.
point: The specified point.
Returns: true if point has the same coordinates as this; otherwise false.
Since: 5.0

Rhino.Geometry.Point2f.EpsilonEquals(Rhino.Geometry.Point2f,System.Single)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:
Since: 5.4

Rhino.Geometry.Point2f.CompareTo(Rhino.Geometry.Point2f)
Compares this Rhino.Geometry.Point2f with another Rhino.Geometry.Point2f.
Coordinates evaluation priority is first X, then Y.
other: The other Rhino.Geometry.Point2f to use in comparison.
Returns:
0: if this is identical to other
-1: if this.X < other.X
-1: if this.X == other.X and this.Y < other.Y
+1: otherwise.
Since: 5.0

Rhino.Geometry.Point2f.GetHashCode
Computes a hash number that represents the current point.
Returns: A hash code that is not unique for each point.

Rhino.Geometry.Point2f.ToString
Constructs the string representation for the current point.
Returns: The point representation in the form X,Y.

Rhino.Geometry.Point2f.ToString(System.String,System.IFormatProvider)
Since: 7.0

Rhino.Geometry.Point2f.Item(System.Int32)
Accesses the coordinates of this point.
index: Either 0 or 1.
Returns: If index is 0, the X (first) coordinate. If index is 1, the Y (second) coordinate.

Rhino.Geometry.Point2f.op_Equality(Rhino.Geometry.Point2f,Rhino.Geometry.Point2f)
Determines whether two Rhino.Geometry.Point2f have equal values.
a: The first point.
b: The second point.
Returns: true if the coordinates of the two points are exactly equal; otherwise false.
Since: 5.0

Rhino.Geometry.Point2f.op_Inequality(Rhino.Geometry.Point2f,Rhino.Geometry.Point2f)
Determines whether two Rhino.Geometry.Point2f have different values.
a: The first point.
b: The second point.
Returns: true if the two points differ in any coordinate; false otherwise.
Since: 5.0

Rhino.Geometry.Point2f.op_LessThan(Rhino.Geometry.Point2f,Rhino.Geometry.Point2f)
Determines whether the first specified Rhino.Geometry.Point2f comes before
(has inferior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y.
a: First point.
b: Second point.
Returns: true if a.X is smaller than b.X, or a.X == b.X and a.Y is smaller than b.Y; otherwise, false.
Since: 5.0

Rhino.Geometry.Point2f.op_LessThanOrEqual(Rhino.Geometry.Point2f,Rhino.Geometry.Point2f)
Determines whether the first specified Rhino.Geometry.Point2f comes before
(has inferior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y.
a: First point.
b: Second point.
Returns: true if a.X is smaller than b.X, or a.X == b.X and a.Y <= b.Y; otherwise, false.
Since: 5.0

Rhino.Geometry.Point2f.op_GreaterThan(Rhino.Geometry.Point2f,Rhino.Geometry.Point2f)
Determines whether the first specified Rhino.Geometry.Point2f comes after
(has superior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y.
a: First point.
b: Second point.
Returns: true if a.X is larger than b.X, or a.X == b.X and a.Y is larger than b.Y; otherwise, false.
Since: 5.0

Rhino.Geometry.Point2f.op_GreaterThanOrEqual(Rhino.Geometry.Point2f,Rhino.Geometry.Point2f)
Determines whether the first specified Rhino.Geometry.Point2f comes after
(has superior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y.
a: First point.
b: Second point.
Returns: true if a.X is larger than b.X, or a.X == b.X and a.Y >= b.Y; otherwise, false.
Since: 5.0

Rhino.Geometry.Point2f.op_Explicit(Rhino.Geometry.Point2d)~Rhino.Geometry.Point2f
Converts a double-precision point in a single-precision point.
Needs explicit casting to help retain precision.
point: A point.
Returns: The resulting point.

Rhino.Geometry.Point2f.op_Addition(Rhino.Geometry.Point2f,Rhino.Geometry.Point2f)
Sums two Rhino.Geometry.Point2fs.
a: First point.
b: Second point.
Returns: An added Vector2f.

Rhino.Geometry.Point2f.op_Subtraction(Rhino.Geometry.Point2f,Rhino.Geometry.Point2f)
Subtracts two Rhino.Geometry.Point2fs.
a: First point.
b: Second point.
Returns: A subtracted Vector2f.
Since: 6.0

Rhino.Geometry.Point2f.op_Multiply(Rhino.Geometry.Point2f,System.Single)
Multiplies a Rhino.Geometry.Point2f by a scalar.
a: First point.
b: Scalar.
Returns: A multiplied Point2f.
Since: 6.0

Rhino.Geometry.Point2f.op_Division(Rhino.Geometry.Point2f,System.Single)
Divides a Rhino.Geometry.Point2f by a scalar.
a: First point.
b: Scalar.
Returns: A divided Point2f.
Since: 6.0

Rhino.Geometry.Point2f.DistanceTo(Rhino.Geometry.Point2f)
Computes the distance between two points.
other: Other point for distance measurement.
Returns: The length of the line between this and the other point; or 0 if any of the points is not valid.

Rhino.Geometry.Point2f.DistanceToSquared(Rhino.Geometry.Point2f)
Computes the squared distance between two points.
other: Other point for distance measurement.
Returns: The squared length of the line between this and the other point; or 0 if any of the points is not valid.
Since: 7.14