Rhino.Input.Custom.GetInteger
Used to get integer numbers.

Rhino.Input.Custom.GetInteger.#ctor
Since: 5.0

Rhino.Input.Custom.GetInteger.Get
Call to get an integer.
Returns: If the user chose a number, then Rhino.Input.GetResult.Number; another enumeration value otherwise.
Since: 5.0

Rhino.Input.Custom.GetInteger.Number
Since: 5.0

Rhino.Input.Custom.GetInteger.SetLowerLimit(System.Int32,System.Boolean)
Sets a lower limit on the number that can be returned.
By default there is no lower limit.
lowerLimit: smallest acceptable number.
strictlyGreaterThan:
If true, then the returned number will be > lower_limit.
Since: 5.0

Rhino.Input.Custom.GetInteger.SetUpperLimit(System.Int32,System.Boolean)
Sets an upper limit on the number that can be returned.
By default there is no upper limit.
upperLimit: largest acceptable number.
strictlyLessThan: If true, then the returned number will be < upper_limit.
Since: 5.0