Rhino.DocObjects.DimensionStyle.LengthDisplayFormat
Obsolete format for length display - use ON_DimStyle::DimensionLengthDisplay instead

Rhino.DocObjects.DimensionStyle.LengthDisplayFormat.Decimal
Obsolete - use ON_DimStyle::DimensionLengthDisplay::ModelUnits.

Rhino.DocObjects.DimensionStyle.LengthDisplayFormat.Fractional
Obsolete - use ON_DimStyle::DimensionLengthDisplay::InchesFractional

Rhino.DocObjects.DimensionStyle.LengthDisplayFormat.FeetInches
Obsolete - use ON_DimStyle::DimensionLengthDisplay::FeetAndInches

Rhino.DocObjects.DimensionStyle.LengthDisplayFormat.FeetDecimalInches
Obsolete - use ON_DimStyle::DimensionLengthDisplay::FeetAndInches enum.