Rhino.UI.MouseCallbackEventArgs.View
Since: 5.0

Rhino.UI.MouseCallbackEventArgs.MouseButton
Since: 6.0

Rhino.UI.MouseCallbackEventArgs.Button
Since: 5.0

Rhino.UI.MouseCallbackEventArgs.ShiftKeyDown
Since: 6.0

Rhino.UI.MouseCallbackEventArgs.CtrlKeyDown
Since: 6.0

Rhino.UI.MouseCallbackEventArgs.ViewportPoint
Since: 5.0

Rhino.UI.MouseCallbackEventArgs.IsOverGumball
Since: 8.8