Rhino.UI.ModifierKey
Keyboard keys typically used in combination with other keys
Since: 6.0

Rhino.UI.ModifierKey.None
No key

Rhino.UI.ModifierKey.Control
Ctrl key on Windows

Rhino.UI.ModifierKey.MacCommand
Command key on Mac. This is treated the same as Control key on Windows

Rhino.UI.ModifierKey.Shift
Shift key

Rhino.UI.ModifierKey.Alt
Alt key

Rhino.UI.ModifierKey.MacControl
Control key on Mac