Rhino.Runtime.InteropWrappers.SimpleArrayCurvePointer
Wrapper for a C++ ON_SimpleArray of ON_Curve* or constant ON_Curve*.  If you are not
writing C++ code, then you can ignore this class.

Rhino.Runtime.InteropWrappers.SimpleArrayCurvePointer.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayCurvePointer.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayCurvePointer.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayCurvePointer instance.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayCurvePointer.#ctor(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayCurvePointer instance, from a set of input curves.
curves: A list, an array or any collection of curves that implements the enumerable interface.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayCurvePointer.ToNonConstArray
Copies the unmanaged array to a managed counterpart.
Returns: The managed array.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayCurvePointer.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.SimpleArrayCurvePointer.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayCurvePointer.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.