Rhino.PlugIns.RenderPlugIn
A Rhino rendering plugin; applies materials, textures, and lights to a scene to produce rendered images.

Rhino.PlugIns.RenderPlugIn.OnCustomRenderSaveFileTypes(System.Int32,System.IntPtr)
Called to add custom file types to the render window save dialog.
serialNumber:
Plug-in runtime serial number
saveFileTypeArray:
Array of CRhRdkCustomRenderSaveFileType objects that describe the
custom file type
Returns:

Rhino.PlugIns.RenderPlugIn.OnUiContentTypes(System.Int32,System.IntPtr)
Called to add custom file types to the render window save dialog.
serialNumber:
Plug-in runtime serial number
contentTypeArray:
Array of UUID objects that describe the
content types
Returns:

Rhino.PlugIns.RenderPlugIn.OnRenderSettingsSections(System.Int32,System.IntPtr)
Called to determine which render settings sections should be displayed for a this renderer.
serialNumber:
Plug-in runtime serial number
renderSettingsArray:
Array of UUID objects that describe the render settings sections
Returns:

Rhino.PlugIns.RenderPlugIn.m_custom_render_save_file_types
Cache the GetCustomRenderSaveFileTypes() result

Rhino.PlugIns.RenderPlugIn.RegisterCustomRenderSaveFileTypes(Rhino.PlugIns.CustomRenderSaveFileTypes)
Override this method to add custom file types to the render window save
file dialog.
Returns:

Rhino.PlugIns.RenderPlugIn.UiContentTypes
Override this method to provide the UUIDs of all content types that
should be presented to the user in the types combo box or the[+] button
types menu.The default implementation adds only RDK's built-in types.
Rhino automatically adds types in the most efficient way to minimize
the list length.  If you override this method, you may call the base
class first to add the built-in types, a separator will be inserted at
the end of the standard list followed by your own types.  You may omit
the base class call and only chosen types yourself, followed by a
separator and your own types.  A 'More Types...' item is automatically
added when needed by Rhino.  Specify a separator by adding
uuidUiContentType_Separator.
Remarks:
You should add \e all types you would want to appear in any context,
regardless of their content kind.  Rhino ensures that only types that
make sense will actually be presented to the user in a given context.
Returns:
Return a Id list of content types to display in content browsers

Rhino.PlugIns.RenderPlugIn.RenderSettingsSections
Override this method to provide the UUIDs of all sections that should be displayed in
the Render Settings tab when this is the current renderer.The default implementation
adds all the RDK's built-in Render Settings sections. These UUIDs start with the prefix
uuidRenderSettingsSection'. They can be found in RhRdkUuids.h
Remarks:
You should add \e all sections you would want to appear in any context.
Returns:
Return a Id list of content types to display in content browsers

Rhino.PlugIns.RenderPlugIn.GetRenderSettingsSections
This function returns a list of Guids for the render settings pages that should be displayed.
Returns:
Return a Id list of the Render settings sections that will be displayed
Since: 6.17

Rhino.PlugIns.RenderPlugIn.RegisterRenderPanels(Rhino.Render.RenderPanels)
Override this method and call Rhino.Render.RenderPanels.RegisterPanel(Rhino.PlugIns.PlugIn,Rhino.Render.RenderPanelType,System.Type,System.String,System.Boolean,System.Boolean)
to add custom render UI to the render output window.

Rhino.PlugIns.RenderPlugIn.RegisterRenderTabs(Rhino.Render.RenderTabs)
Override this method and call Rhino.Render.RenderTabs.RegisterTab(Rhino.PlugIns.PlugIn,System.Type,System.Guid,System.String,System.Drawing.Icon)
to add custom tabs to the render output window

Rhino.PlugIns.RenderPlugIn.RenderContentSerializers
Called by Rhino when it is time to register RenderContentSerializer
derived classes.  Override this method and return an array of an
instance of each serialize custom content object you wish to add.
Returns:
List of RenderContentSerializer objects to register with the Rhino
render content browsers.

Rhino.PlugIns.RenderPlugIn.SupportsFeature(Rhino.PlugIns.RenderPlugIn.RenderFeature)
Determines if your renderer supports a specific feature.
feature: A feature to be controlled.
Returns: true if the renderer indeed supports the feature.

Rhino.PlugIns.RenderPlugIn.SupportedChannels
Override to communicate that the renderer supports more
channels beside the default channels RGBA, Depth, Normal, Albedo. See RenderWindow.StandardChannels. RenderWindow.ChannelId can be used to
get the GUIDs for the channels to support

Rhino.PlugIns.RenderPlugIn.CustomChannelName(System.Guid)
Return the localized name of your custom channel.

Rhino.PlugIns.RenderPlugIn.CurrentRendererSupportsFeature(Rhino.PlugIns.RenderPlugIn.RenderFeature)
Since: 6.1

Rhino.PlugIns.RenderPlugIn.PreviewRenderType
Tell what kind of preview rendering your renderer supports.
Returns: One of PreviewRenderTypes

Rhino.PlugIns.RenderPlugIn.CreatePreview(Rhino.Render.CreatePreviewEventArgs)
Creates the preview bitmap that will appear in the content editor's
thumbnail display when previewing materials and environments. If this
function is not overridden or the PreviewImage is not set on the
arguments, then the internal OpenGL renderer will generate a simulation of
the content.
This function is called with four different preview quality settings.
The first quality level of RealtimeQuick is called on the main thread
and needs to be drawn as fast as possible.  This function is called
with the other three quality settings on a separate thread and are
meant for generating progressively refined preview.
args: Event argument with several preview option state properties.

Rhino.PlugIns.RenderPlugIn.CreateTexture2dPreview(Rhino.Render.CreateTexture2dPreviewEventArgs)
Creates the preview bitmap that will appear in the content editor's
thumbnail display when previewing textures in 2d (UV) mode.
If this function is not overridden or the PreviewImage is not set on the
arguments, then the internal OpenGL renderer will generate a simulation.
args: Event argument with several preview option state properties.

Rhino.PlugIns.RenderPlugIn.AllowChooseContent(Rhino.Render.RenderContent)
Default implementation returns true which means the content can be
picked from the content browser by the user. Override this method and
return false if you don't want to allow a certain content contentType to be
picked from the content browser while your render engine is current.
content: A render context.
Returns: true if the operation was successful.

Rhino.PlugIns.RenderPlugIn.SupportedOutputTypes
Returns a list of output types which your renderer can write.
The default implementation returns BMP, JPG, PNG, TIF, TGA, HDR, EXR and RIMAGE.
Returns: A list of file types.

Rhino.PlugIns.RenderPlugIn.SupportsEditProperties
Override this property and return true if your plug-in supports decals
and overrides Rhino.PlugIns.RenderPlugIn.ShowDecalProperties(System.Collections.Generic.List{Rhino.Render.NamedValue}@)

Rhino.PlugIns.RenderPlugIn.ShowDecalProperties(System.Collections.Generic.List{Rhino.Render.NamedValue}@)
Override this function to handle showing a modal dialog with your plug-in's
custom decal properties.  You will be passed the current properties for the
object being edited.  The defaults will be set in InitializeDecalProperties.
properties: A list of named values that will be stored on the object
the input values are the current ones, you should modify the values after the dialog
closes.
Returns: true if the user pressed "OK", otherwise false.

Rhino.PlugIns.RenderPlugIn.InitializeDecalProperties(System.Collections.Generic.List{Rhino.Render.NamedValue}@)
Initialize your custom decal properties here.  The input list will be empty - add your
default named property values and return.
properties: A list of named values that will be stored on the object
the input values are the current ones, you should modify the values after the dialog
closes.

Rhino.PlugIns.RenderPlugIn.PerferBasicContent
Set to true if you would like Rhino to quickly create a basic render
content in response to 'Create New' commands. Set to false if you would
prefer Rhino to display the render content chooser dialog.
Since: 5.12

Rhino.PlugIns.RenderPlugIn.Render(Rhino.RhinoDoc,Rhino.Commands.RunMode,System.Boolean)
Called by Render and RenderPreview commands if this plug-in is set as the default render engine.
doc: A document.
mode: A command running mode.
fastPreview: If true, lower quality faster render expected.
Returns: If true, then the renderer is required to construct a rapid preview and not the high-quality final result.

Rhino.PlugIns.RenderPlugIn.RenderWindow(Rhino.RhinoDoc,Rhino.Commands.RunMode,System.Boolean,Rhino.Display.RhinoView,System.Drawing.Rectangle,System.Boolean)
This function is obsolete and only exists for legacy purposes.
Do not override this function - prefer overriding the version with the blowup parameter.

Rhino.PlugIns.RenderPlugIn.RenderOptionsDialogPage(Rhino.RhinoDoc)
Override this method to replace the render properties page in the Rhino
document properties dialog.  The default implementation returns null
which means just use the default Rhino page.
doc:
The document properties to edit.
Returns:
Return null to use the default Rhino page or return a page derived from
Rhino.UI.OptionsDialogPage to replace the default page.

Rhino.PlugIns.RenderPlugIn.OnSetCurrent(System.Boolean)
This plug-in (has become)/(is no longer) the current render plug-in
current:
If true then this plug-in is now the current render plug-in otherwise
it is no longer the current render plug-in.

Rhino.PlugIns.RenderPlugIn.OnAssignMaterial(System.IntPtr,Rhino.RhinoDoc,Rhino.DocObjects.Material@)
This function is called by the Object Properties and Layer Control
dialogs when the "Material" button is pressed in the "Render" tab.
This is only called if EnableAssignMaterialButton returns true.
parent:
doc:
material:
Returns:
Since: 5.12

Rhino.PlugIns.RenderPlugIn.EnableAssignMaterialButton
Called to enable/disable the "Material" button located on the
"Material" tab in the Properties and Layer dialog boxes.  The default
return value is false which will disable the button.  If the button is
disabled then the OnAssignMaterial function is never called.
Returns:
Since: 5.12

Rhino.PlugIns.RenderPlugIn.OnEditMaterial(System.IntPtr,Rhino.RhinoDoc,Rhino.DocObjects.Material@)
This function is called by the Object Properties and Layer Control
dialogs when the "Edit" button is pressed in the "Material" tab.  This
is only called if EnableEditMaterialButton returns true. A return value
of true means the material has been updated.
parent:
doc:
material:
Returns:
Since: 5.12

Rhino.PlugIns.RenderPlugIn.EnableEditMaterialButton(Rhino.RhinoDoc,Rhino.DocObjects.Material)
Called to enable/disable the "Edit" button located on the "Material" in
the Properties and Layer dialog boxes.  The default return value is
false  which will disable the button.  If the button is disabled then
the OnEditMaterial function is never called.
doc:
material:
Returns:
Since: 5.12

Rhino.PlugIns.RenderPlugIn.OnCreateMaterial(System.IntPtr,Rhino.RhinoDoc,Rhino.DocObjects.Material@)
This function is called by the Object Properties and Layer Control
dialogs when the "New" button is pressed in the "Material" tab.  This
is only called if EnableCreateMaterialButton returns true.
parent:
doc:
material:
Returns:
Since: 5.12

Rhino.PlugIns.RenderPlugIn.EnableCreateMaterialButton
Called to enable/disable the "New" button located on the "Material" in
the  Properties and Layer dialog boxes.  The default return value is
false which will disable the button.  If the button is disabled then
the OnEditMaterial function is never called.
Returns:
Since: 5.12

Rhino.PlugIns.RenderPlugIn.SunCustomSections(System.Collections.Generic.List{Rhino.UI.Controls.ICollapsibleSection})
Override this function to provide custom sections for the sun panel that are displayed
when your plug-in is the current render plug-in.
sections: Create your sections and return a list of them
Since: 6.0

Rhino.PlugIns.RenderPlugIn.RenderSettingsCustomSections(System.Collections.Generic.List{Rhino.UI.Controls.ICollapsibleSection})
Override this function to provide custom sections for the render settings panel that are displayed
when your plug-in is the current render plug-in.
sections: Create your sections and return a list of them
Since: 6.0