Rhino.RhinoDocUndoRecord
This helper class manages calls to RhinoDoc.BeginUndoRecord and RhinoDoc.UndoRecord.
Use this if you are modifying a document from some modeless user interface.
Do not use this if you are just writing Rhino commands.
ALWAYS call Dispose on this class. It is best if the class is placed in a using block
so Dispose will be called for you.
Use this like so:
using (var undo = new RhinoDocUndoRecord(doc, "Test"))
{
var circle = new Circle(Point3d.Origin, 6.0);
doc.Objects.AddCircle(circle);
doc.Views.Redraw();
}

Rhino.RhinoDocUndoRecord.#ctor(Rhino.RhinoDoc,System.String)
Begin a RhinoDoc undo record.
doc: The active document.
description: A description of the record.
Since: 8.23

Rhino.RhinoDocUndoRecord.#ctor(System.UInt32,System.String)
Begin a RhinoDoc undo record.
docRuntimeSerialNumber: The active document's runtime serial number.
description: A description of the record.
Since: 8.23

Rhino.RhinoDocUndoRecord.Dispose
IDisposable implementaton
Since: 8.23