Rhino.UI.Localization.LogicalSort(System.String,System.String)
Compares two strings. Digits in the strings are considered as numerical content rather than text. This test is not case-sensitive.
string1: First string to be compared.
string2: Second string to be compared.
Returns:
Returns zero if the strings are identical.
Returns 1 if string1 has a greater value than string2.
Returns -1 if string1 has a lesser value than string2.
Throws System.ArgumentNullException:
Since: 8.32

Rhino.UI.Localization.UnitSystemName(Rhino.UnitSystem,System.Boolean,System.Boolean,System.Boolean)
Gets localized unit system name.  Uses current application locale id.
units: The unit system.
capitalize: true if the name should be capitalized.
singular: true if the name is expressed for a singular element.
abbreviate: true if name should be the abbreviation.
Returns: The unit system name.
Since: 5.0

Rhino.UI.Localization.FormatNumber(System.Double,Rhino.UnitSystem,Rhino.UI.DistanceDisplayMode,System.Int32,System.Boolean)
Get a string version of a number in a given unit system / display mode.
x: The number to format into a string.
units: The unit system for the number.
mode: How the number should be formatted.
precision: The precision of the number.
appendUnitSystemName: Adds unit system name to the end of the number.
Returns: The formatted number.
Since: 5.0

Rhino.UI.Localization.FormatNumber(System.Double)
Get a string version of a number.
x: The number to format into a string.
Returns: The formatted number.
Since: 8.0

Rhino.UI.Localization.FormatDistanceAndTolerance(System.Double,Rhino.UnitSystem,Rhino.DocObjects.DimensionStyle,System.Boolean)
distance:
units:
dimStyle:
alternate: primary or alternate
Returns:
Since: 7.0

Rhino.UI.Localization.FormatArea(System.Double,Rhino.UnitSystem,Rhino.DocObjects.DimensionStyle,System.Boolean)
Format an Area string from a number
area:
units:
dimStyle:
alternate:
Returns:
Since: 7.0

Rhino.UI.Localization.FormatVolume(System.Double,Rhino.UnitSystem,Rhino.DocObjects.DimensionStyle,System.Boolean)
Format a Volume string from a number
volume:
units:
dimStyle:
alternate:
Returns:
Since: 7.0

Rhino.UI.Localization.LocalizeString(System.String,System.Int32)
Returns localized version of a given English string. This function should be auto-generated by the
RmaLDotNetLocalizationProcessor application for every function that uses RMASTR.
english: The text in English.
contextId: The context ID.
Returns: The localized string.
Since: 5.0

Rhino.UI.Localization.LocalizeString(System.String,System.Int32,System.Int32)
DO NOT use this function, it is a trap to determine
where context IDs have been copied from other, already extracted,
strings.
english: The text in English.
wrongcontextId: The copied ID.
contextId: The context ID.
Returns: The english string.
Since: 7.0
7.1

Rhino.UI.Localization.LocalizeString(System.String,System.Object,System.Int32)
Returns localized version of a given English string. This function should be auto-generated by the
RmaLDotNetLocalizationProcessor application for every function that uses RMASTR.
english: The text in English.
assemblyOrObject: An assembly or an object from an assembly.
contextId: The context ID.
Returns: The localized string.
Since: 5.0

Rhino.UI.Localization.LocalizeDialogItem(System.Object,System.String,System.String)
Look in the dialog item list for the specified key and return the translated
localized string if the key is found otherwise return the English string.
assemblyOrObject: An assembly or an object from an assembly.
key:
english: The text in English.
Returns:
Look in the dialog item list for the specified key and return the translated
localized string if the key is found otherwise return the English string.
Since: 5.5

Rhino.UI.Localization.GetAssemblyFromObject(System.Object)
Check to see if the passed object is an assembly, if not then get the assembly that owns the object type.
assemblyOrObject: An assembly or an object from an assembly.
Returns: The localized string.
Since: 5.0

Rhino.UI.Localization.LocalizeForm(System.Object)
Look in the dialog item list for the specified key and return the translated
localized string if the key is found otherwise return the English string.
formOrUserControl:
Since: 6.0

Rhino.UI.Localization.LocalizeCommandName(System.String)
Commands that need to be localized should call this function.
The localized command name.
Since: 5.0

Rhino.UI.Localization.LocalizeCommandName(System.String,System.Object)
Since: 5.0

Rhino.UI.Localization.LocalizeCommandOptionName(System.String,System.Int32)
Since: 5.0

Rhino.UI.Localization.LocalizeCommandOptionName(System.String,System.Object,System.Int32)
Since: 5.0

Rhino.UI.Localization.LocalizeCommandOptionName(System.String,System.Int32,System.Int32)
DO NOT use this function, it is a trap to determine
where context IDs have been copied from other, already extracted,
strings.
english: The text in English.
wrongcontextId: The copied ID.
contextId: The context ID.
Returns: The english string.
Since: 7.0
7.1

Rhino.UI.Localization.LocalizeCommandOptionValue(System.String,System.Int32)
Since: 5.0

Rhino.UI.Localization.LocalizeCommandOptionValue(System.String,System.Object,System.Int32)
Since: 5.0

Rhino.UI.Localization.CurrentLanguageId
Since: 6.0

Rhino.UI.Localization.RunningAsEnglish
Since: 6.0

Rhino.UI.Localization.SetLanguageId(System.Int32)
Sets the Id used for Localization in RhinoCommon.  Only useful for when
using RhinoCommon outside of the Rhino process
id:
Returns: true if the language id could be set
Since: 5.0

Rhino.UI.Localization.GetLanguages(Rhino.Runtime.InteropWrappers.SimpleArrayInt@,Rhino.Runtime.InteropWrappers.ClassArrayString@)
Since: 8.0