Rhino.Geometry.BlendType
Blend types used for creating filleted Brep edges
Since: 6.0

Rhino.Geometry.BlendType.Chamfer
Creates a ruled surface between brep edges with varying chamfer distances.

Rhino.Geometry.BlendType.Fillet
Creates a tangent surface between brep edges with varying radius values.

Rhino.Geometry.BlendType.Blend
Creates a curvature-continuous blend surface between brep edges with varying radius values.