Rhino.ApplicationSettings.CursorTooltipSettings
Cursor tooltips place information at the cursor location.
Note: Turning on cursor tooltips turns off object snap cursors.

Rhino.ApplicationSettings.CursorTooltipSettings.GetCurrentState
Gets the current settings.
Returns: A new cursor tooltip state with current settings.
Since: 5.0

Rhino.ApplicationSettings.CursorTooltipSettings.GetDefaultState
Gets the cursor tooltip factory settings.
Returns: A new cursor tooltip state with factory settings.
Since: 5.0

Rhino.ApplicationSettings.CursorTooltipSettings.TooltipsEnabled
Turns on/off cursor tooltips.
Since: 5.0

Rhino.ApplicationSettings.CursorTooltipSettings.Offset
The x and y distances in pixels from the cursor location to the tooltip.
Since: 5.0

Rhino.ApplicationSettings.CursorTooltipSettings.BackgroundColor
Tooltip background color.
Since: 5.0

Rhino.ApplicationSettings.CursorTooltipSettings.TextColor
Tooltip text color.
Since: 5.0

Rhino.ApplicationSettings.CursorTooltipSettings.OsnapPane
Displays the current object snap selection.
Since: 5.0

Rhino.ApplicationSettings.CursorTooltipSettings.DistancePane
Displays the distance from the last picked point.
Since: 5.0

Rhino.ApplicationSettings.CursorTooltipSettings.PointPane
Displays the current construction plane coordinates.
Since: 5.0

Rhino.ApplicationSettings.CursorTooltipSettings.RelativePointPane
Displays the relative construction plane coordinates and angle from the last picked point.
Since: 5.0

Rhino.ApplicationSettings.CursorTooltipSettings.CommandPromptPane
Displays the current command prompt.
Since: 5.0

Rhino.ApplicationSettings.CursorTooltipSettings.AutoSuppress
Attempts to display only the most useful tooltip.
Since: 5.0

Rhino.ApplicationSettings.CursorTooltipSettings.EnableGumballToolTips
Turns on/off gumball tooltips
Since: 8.0