Rhino.Geometry.ShrinkWrapParameters
Parameters for ShrinkWrap method
Since: 8.0

Rhino.Geometry.ShrinkWrapParameters.TargetEdgeLength
The desired target edge length in document units
Smaller values equal more mesh resolution at the expense of larger mesh sizes
Since: 8.0

Rhino.Geometry.ShrinkWrapParameters.Offset
Distance to offset outward or inward
Since: 8.0

Rhino.Geometry.ShrinkWrapParameters.SmoothingIterations
Number of times to apply smoothing
Since: 8.0

Rhino.Geometry.ShrinkWrapParameters.FillHolesInInputObjects
Any input meshes will have "Fill Holes" applied to them before volume creation
This value is ignored when input objects are Point Clouds
Since: 8.0

Rhino.Geometry.ShrinkWrapParameters.PolygonOptimization
0 - 100 the percentage of optimization desired.
Polygons will be reduced in areas of lower curvature
Lower values result in better feature preservation at the cost of more polygons
Since: 8.0

Rhino.Geometry.ShrinkWrapParameters.InflateVerticesAndPoints
Inflate mesh vertices, points and point clouds
Mesh vertices will be inflated as though the mesh were a point cloud
Since: 8.3