Rhino.Runtime.RhinoAccounts.RhinoAccountsOperationInProgressException
Exception thrown when there is already a Rhino Accounts operation taking place.

Rhino.Runtime.RhinoAccounts.RhinoAccountsOperationInProgressException.#ctor(System.String,System.Exception)
Generates a new instance of the exception.
message: The message of the exception.
innerException: The inner exception.
Since: 7.0

Rhino.Runtime.RhinoAccounts.RhinoAccountsOperationInProgressException.#ctor(System.Reflection.Assembly,System.Exception)
Generates a new instance of the exception.
innerException: The inner exception.
assembly: The assembly that is currently performing an operation.
Since: 7.0