Rhino.Render.City
City

Rhino.Render.City.#ctor(System.IntPtr)
Construct a City
pLw:

Rhino.Render.City.Name
Gets name of city.
Since: 6.0

Rhino.Render.City.Latitude
Gets latitude of city.
Since: 6.0

Rhino.Render.City.Longitude
Gets longitude of city.
Since: 6.0

Rhino.Render.City.TimeZone
Gets time zone of city.
Since: 6.0

Rhino.Render.City.FindNearest(System.Double,System.Double)
Finds nearest city of specified input parameters.
latitude: latitude.
longitude: longitude.
Returns: Nearest city.
Since: 6.0

Rhino.Render.City.Cities
Returns number of available cities.
Returns: City count.
Since: 6.0

Rhino.Render.City.CityAt(System.Int32)
Returns city at given index.
index: index.
Returns: City at index.
Since: 6.0