Rhino.PlugIns.PlugIn.UnknownUserDataEventArgs
Event argument passed to the Rhino.PlugIns.PlugIn.UnknownUserData event.

Rhino.PlugIns.PlugIn.UnknownUserDataEventArgs.Document
Since: 7.17

Rhino.PlugIns.PlugIn.UnknownUserDataEventArgs.PlugInId
Since: 7.17