Rhino.Render.CustomRenderMeshProvider
You must call CustomRenderMeshProvider.RegisterProviders() from your
plug-ins OnLoad override for each assembly containing a custom mesh
provider.  Only publicly exported classes derived from
CustomRenderMeshProvider with a public constructor that has no parameters
will get registered.

Rhino.Render.CustomRenderMeshProvider.EdgeSofteningId
Since: 6.0
6.0

Rhino.Render.CustomRenderMeshProvider.DisplacementId
Since: 6.0
6.0

Rhino.Render.CustomRenderMeshProvider.CurvePipingId
Since: 6.0
6.0

Rhino.Render.CustomRenderMeshProvider.ShutLiningId
Since: 6.0
6.0

Rhino.Render.CustomRenderMeshProvider.ThickeningId
Since: 6.0
6.0

Rhino.Render.CustomRenderMeshProvider.#ctor
Default constructor
6.0

Rhino.Render.CustomRenderMeshProvider.Name
The name of the provider for UI display.
Since: 5.7
6.0

Rhino.Render.CustomRenderMeshProvider.WillBuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.RhinoObject,System.Guid,System.Boolean)
Determines if custom render meshes will be built for a particular object.
vp: The viewport being rendered.
obj: The Rhino object of interest.  This can be null in the case where document meshes (not associated with any object) are being requested.
requestingPlugIn: UUID of the RDK plug-in requesting the meshes.
preview: Type of mesh to build.
Returns: true if custom meshes will be built.
Since: 5.7
6.0

Rhino.Render.CustomRenderMeshProvider.BuildCustomMeshes(Rhino.DocObjects.ViewportInfo,Rhino.Render.RenderPrimitiveList,System.Guid,System.Boolean)
Build custom render mesh(es).
vp: The viewport being rendered.
objMeshes: The meshes class to populate with custom meshes.
requestingPlugIn: UUID of the RDK plug-in requesting the meshes.
meshType: Type of mesh to build.
Returns: true if operation was successful.
Since: 5.7
6.0

Rhino.Render.CustomRenderMeshProvider.CreateCppObject(System.Guid)
RegisterProviders calls this method to create a runtime unmanaged
pointer for each custom provider registered.
pluginId:
Returns:

Rhino.Render.CustomRenderMeshProvider.FromSerialNumber(System.Int32)
This method is called by the virtual hooks to get the runtime managed
object from a serial number.
serialNumber:
Returns:

Rhino.Render.CustomRenderMeshProvider.RegisterProviders(System.Reflection.Assembly,System.Guid)
Call this method once from your plug-ins OnLoad override for each
assembly containing a custom mesh provider.  Only publicly exported
classes derived from CustomRenderMeshProvider with a public constructor
that has no parameters will get registered.
assembly:
Assembly to search for valid CustomRenderMeshProvider derived classes.
pluginId:
The plug-in that owns the custom mesh providers.
Since: 5.7
6.0

Rhino.Render.CustomRenderMeshProvider.AllObjectsChanged
Call this method if your render meshes change.
Since: 5.7
6.0

Rhino.Render.CustomRenderMeshProvider.AllObjectsChanged(Rhino.RhinoDoc)
Call this method if your render meshes change.
Since: 6.0
6.0

Rhino.Render.CustomRenderMeshProvider.ObjectChanged(Rhino.RhinoDoc,Rhino.DocObjects.RhinoObject)
obj:
doc:
Since: 6.0
6.0

Rhino.Render.CustomRenderMeshProvider.DocumentBasedMeshesChanged(Rhino.RhinoDoc)
doc:
Since: 6.0
6.0

Rhino.Render.CustomRenderMeshProvider.BoundingBox(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.RhinoObject,System.Guid,System.Boolean)
Returns a bounding box for the custom render meshes for the given object.
vp: The viewport being rendered.
obj: The Rhino object of interest.  This can be null in the case where document meshes (not associated with any object) are being requested.
requestingPlugIn: UUID of the RDK plug-in requesting the meshes.
preview: Type of mesh to build.
Returns: A bounding box value.
Since: 5.7
6.0

Rhino.Render.CustomRenderMeshProvider.BoundingBox(Rhino.DocObjects.ViewportInfo,Rhino.DocObjects.RhinoObject,Rhino.RhinoDoc,System.Guid,Rhino.Display.DisplayPipelineAttributes)
Since: 6.0
6.0