Rhino.Runtime.LicenseStateChangedEventArgs
Passed to LicenseStateChanged event on RhinoApp

Rhino.Runtime.LicenseStateChangedEventArgs.CallingRhinoCommonAllowed
true if RhinoCommon calls will never raise Rhino.Runtime.NotLicensedException.
false otherwise
Since: 7.0

Rhino.Runtime.LicenseStateChangedEventArgs.#ctor(System.Boolean)
LicenseStateChangedEventArgs constructor
callingRhinoCommonAllowed: True when calling RhinoCommon will never raise Rhino.Runtime.NotLicesnedException; false otherwise.
Since: 7.0