Rhino.PlugIns.LicenseLeaseChangedEventArgs
Arguments for OnLeaseChangedDelegate

Rhino.PlugIns.LicenseLeaseChangedEventArgs.#ctor(Rhino.PlugIns.LicenseLease)
Since: 6.0

Rhino.PlugIns.LicenseLeaseChangedEventArgs.Lease
The lease returned by Rhino Accounts server
Since: 6.0