QuadRemeshPrivate.QuadRemeshEngine.QuadRemeshWorker(Rhino.Geometry.Mesh,System.Collections.Generic.IEnumerable{System.Int32},QuadRemeshPrivate.QuadRemeshSettings,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.IProgress{System.Int32},System.Threading.CancellationToken)
Executes the remesh process
inputMesh:
meshGroupBlocks:
remeshSettings:
guideCurves:
progress:
cancelToken:
Returns:

QuadRemeshPrivate.QuadRemeshEngine.QuadRemeshWorker(Rhino.Geometry.Brep,QuadRemeshPrivate.QuadRemeshSettings,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.IProgress{System.Int32},System.Threading.CancellationToken)
Executes the remesh process on a Brep
inputBrep:
remeshSettings:
guideCurves:
progress:
cancelToken:
Returns:

QuadRemeshPrivate.QuadRemeshEngine.CreateBrepMeshWithFaceBlocks(Rhino.Geometry.Brep,System.Int32,System.Collections.Generic.List{System.Int32}@)
Creates a QuadRemesh mesh with supporting Face Block list
for retaining Brep boundaries during remeshing
brep:
edgePreservationMode:
singleFaceBlocks:
Returns: