Rhino.FileIO.FileObjWriteOptions.VertexWelding
Determines how/if vertexes of the mesh in Rhino will be modified in the output
Remarks:
The actual values of any vertex, normal or texture coordinate are not modified, this setting
determines whether they are duplicated or merged.
Since: 6.0

Rhino.FileIO.FileObjWriteOptions.VertexWelding.Normal
Mesh is exported in existing state

Rhino.FileIO.FileObjWriteOptions.VertexWelding.Welded
Mesh topology vertex indexing is used for the v in the OBJ output file
normals and texture coordinates, if they exist, come from the mesh

Rhino.FileIO.FileObjWriteOptions.VertexWelding.Unwelded
Each face gets it's own vertex, and normal and texture coordinates if they exist, in the output