Rhino.Geometry.Collections.BrepTrimList
Provides access to all the Trims in a Brep object

Rhino.Geometry.Collections.BrepTrimList.Count
Gets the number of brep trims.
Since: 5.1

Rhino.Geometry.Collections.BrepTrimList.Item(System.Int32)
Gets the BrepTrim at the given index.
The index must be valid or an IndexOutOfRangeException will be thrown.
index: Index of BrepTrim to access.
Throws System.IndexOutOfRangeException: Thrown when the index is invalid.
Returns: The BrepTrim at [index].

Rhino.Geometry.Collections.BrepTrimList.Add(System.Int32)
Add a new trim that will be part of an inner, outer, or slit loop
to the brep.
curve2dIndex: index of 2d trimming curve
Returns: New Trim
Remarks:
You should set the trim's Tolerance, TrimType, and IsoStatus values.
In general, you should try to use the
Add( edge, bRev3d, loop, c2i ) version of NewTrim.
If you want to add a singular trim, use AddSingularTrim.
If you want to add a curve-on-surface trim, use AddCurveOnFace.
If you want to add a point-on-surface trim, use AddPointOnFace.
Since: 5.4

Rhino.Geometry.Collections.BrepTrimList.Add(System.Boolean,Rhino.Geometry.BrepLoop,System.Int32)
Add a new trim that will be part of an inner, outer, or slit loop
to the brep
rev3d:
true if the edge and trim have opposite directions
loop: trim is appended to this loop
curve2dIndex: index of 2d trimming curve
Returns: new trim
Since: 5.4

Rhino.Geometry.Collections.BrepTrimList.Add(System.Boolean,Rhino.Geometry.BrepEdge,System.Int32)
Add a new trim that will be part of an inner, outer, or slit loop
to the brep
rev3d:
true if the edge and trim have opposite directions
edge: 3d edge associated with this trim
curve2dIndex: index of 2d trimming curve
Returns: new trim
Since: 5.4

Rhino.Geometry.Collections.BrepTrimList.Add(Rhino.Geometry.BrepEdge,System.Boolean,Rhino.Geometry.BrepLoop,System.Int32)
Add a new trim that will be part of an inner, outer, or slit loop
to the brep.
edge: 3d edge associated with this trim
rev3d:
true if the edge and trim have opposite directions
loop: trim is appended to this loop
curve2dIndex: index of 2d trimming curve
Returns: new trim
Since: 5.4

Rhino.Geometry.Collections.BrepTrimList.AddSingularTrim(Rhino.Geometry.BrepVertex,Rhino.Geometry.BrepLoop,Rhino.Geometry.IsoStatus,System.Int32)
Add a new singular trim to the brep.
vertex: vertex along collapsed surface edge
loop: trim is appended to this loop
iso:
curve2dIndex: index of 2d trimming curve
Returns: new trim
Since: 5.4

Rhino.Geometry.Collections.BrepTrimList.AddCurveOnFace(Rhino.Geometry.BrepFace,Rhino.Geometry.BrepEdge,System.Boolean,System.Int32)
Add a new curve on face to the brep
face: face that curve lies on
edge: 3d edge associated with this curve on surface
rev3d:
true if the 3d edge and the 2d parameter space curve have opposite directions.
curve2dIndex: index of 2d curve in face's parameter space
Returns: new trim that represents the curve on surface
Remarks:
You should set the trim's tolerance and iso values.
Since: 5.4

Rhino.Geometry.Collections.BrepTrimList.MatchEnds
Matches the endpoints of all trims in the Brep.
Returns: true if any trim's 2d curve is changed, false otherwise.
Since: 6.19

Rhino.Geometry.Collections.BrepTrimList.MatchEnds(System.Int32)
Match the endpoints of a trim to the next and previous trim.
trimIndex:
Returns: true if any trim's 2d curve is changed, false otherwise.
Since: 6.19

Rhino.Geometry.Collections.BrepTrimList.MatchEnds(Rhino.Geometry.BrepTrim,Rhino.Geometry.BrepTrim)
Match the end of a trim to the start of the next trim.
trim0: The Brep trim.
trim1: Brep trim that comes immediately after trim0 in the same loop.
Returns: true if either trim's 2d curve is changed, false otherwise.
Since: 6.19

Rhino.Geometry.Collections.BrepTrimList.MatchEnds(Rhino.Geometry.BrepLoop)
Match the endpoints of all trims in a loop.
loop: The Brep loop.
Returns: true if any trim's 2d curve is changed, false otherwise.
Since: 6.19

Rhino.Geometry.Collections.BrepTrimList.System#Collections#IEnumerable#GetEnumerator
Gets the same enumerator as Rhino.Geometry.Collections.BrepTrimList.GetEnumerator.
Returns: The enumerator.
Since: 5.1

Rhino.Geometry.Collections.BrepTrimList.GetEnumerator
Gets an enumerator that visits all edges.
Returns: The enumerator.
Since: 5.1