Rhino.ApplicationSettings.CommandAliasList
Contains static methods and properties to access command aliases.

Rhino.ApplicationSettings.CommandAliasList.Count
Returns the number of command alias in Rhino.
Since: 5.0

Rhino.ApplicationSettings.CommandAliasList.GetNames
Returns a list of command alias names.
Returns: An array of strings. This can be empty.
Since: 5.0

Rhino.ApplicationSettings.CommandAliasList.Clear
Removes all aliases from the list.
Since: 5.0

Rhino.ApplicationSettings.CommandAliasList.GetMacro(System.String)
Returns the macro of a command alias.
[in] The name of the command alias.
Since: 5.0

Rhino.ApplicationSettings.CommandAliasList.SetMacro(System.String,System.String)
Modifies the macro of a command alias.
[in] The name of the command alias.
[in] The new command macro to run when the alias is executed.
Returns: true if successful.
Since: 5.0

Rhino.ApplicationSettings.CommandAliasList.Add(System.String,System.String)
Adds a new command alias to Rhino.
[in] The name of the command alias.
[in] The command macro to run when the alias is executed.
Returns: true if successful.
Since: 5.0

Rhino.ApplicationSettings.CommandAliasList.Delete(System.String)
Deletes an existing command alias from Rhino.
[in] The name of the command alias.
Returns: true if successful.
Since: 5.0

Rhino.ApplicationSettings.CommandAliasList.IsAlias(System.String)
Verifies that a command alias exists in Rhino.
[in] The name of the command alias.
Returns: true if the alias exists.
Since: 5.0

Rhino.ApplicationSettings.CommandAliasList.ToDictionary
Constructs a new dictionary that contains: as keys all names and as values all macros.
Modifications to this dictionary do not affect any Rhino command alias.
Returns: The new dictionary.
Since: 5.0

Rhino.ApplicationSettings.CommandAliasList.IsDefault
Computes a value indicating if the current alias list is the same as the default alias list.
Returns: true if the current alias list is exactly equal to the default alias list; false otherwise.
Since: 5.0

Rhino.ApplicationSettings.CommandAliasList.GetDefaults
Constructs a dictionary containing as keys the default names and as value the default macro.
The returned dictionary contains a copy of the settings.
Returns: A new dictionary with the default name/macro combinations.
Since: 5.0