Rhino.Render.PostEffects.PostEffectExecutionControl.#ctor
Since: 8.0

Rhino.Render.PostEffects.PostEffectExecutionControl.ReadyToExecutePostEffect(System.Guid)
Since: 8.13

Rhino.Render.PostEffects.PostEffectExecutionControl.Dispose
Since: 8.13

Rhino.Render.PostEffects.PostEffectExecutionControl.Dispose(System.Boolean)
Since: 8.0

Rhino.Render.PostEffects.PostEffectExecutionControl.Detach
Since: 8.13