Rhino.DocObjects.Group.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Serialization constructor
info: Info.
context: The context.

Rhino.DocObjects.Group.ComponentType
Returns Rhino.DocObjects.ModelComponentType.Group.
Since: 6.0

Rhino.DocObjects.Group.SetUserString(System.String,System.String)
Attach a user string (key,value combination) to this geometry.
key: id used to retrieve this string.
value: string associated with key.
Returns: true on success.
Since: 6.4

Rhino.DocObjects.Group.GetUserString(System.String)
Gets user string from this geometry.
key: id used to retrieve the string.
Returns: string associated with the key if successful. null if no key was found.
Since: 6.4

Rhino.DocObjects.Group.UserStringCount
Gets the amount of user strings.
Since: 6.4

Rhino.DocObjects.Group.GetUserStrings
Gets a copy of all (user key string, user value string) pairs attached to this geometry.
Returns: A new collection.
Since: 6.4

Rhino.DocObjects.Group.DeleteUserString(System.String)
Since: 8.11

Rhino.DocObjects.Group.DeleteAllUserStrings
Since: 8.11