Rhino.Geometry.SubDFromSurfaceMethods
ON_SubDFromSurfaceParameters::Method are ways to create a SubD from a surface.

Rhino.Geometry.SubDFromSurfaceMethods.Unset
Used to indicate the method is not set.

Rhino.Geometry.SubDFromSurfaceMethods.SubDFriendlyFit
The surface is approximated with a SubD friendly NURBS surface and the SubD is created
to match the subd friendly nurbs surface.
If the input surface is a subd friendly NURBS surface, the subd and surface have the same geometry.

Rhino.Geometry.SubDFromSurfaceMethods.FromNurbsControlNet
The surface is converted to a NURBS surface and then a subd with one face per NURBS bispan
is created by using an appropriate subset of the NURBS surface control net.
If the input surface is a subd friendly NURBS surface, the subd and surface have the same geometry.