Rhino.PlugIns.PlugIn
A general purpose utility plug-in that can contain one or more commands.

Rhino.PlugIns.PlugIn.GetLoadedPlugIn(System.Guid)
Only searches through list of RhinoCommon plug-ins.

Rhino.PlugIns.PlugIn.GetLoadedPlugInIcon(System.Guid,System.String,System.Int32)
Gets an icon from a loaded RhinoCommon plug-in and returns it as a bitmap.
5-Jul-2017 Dale Fugier, https://mcneel.myjetbrains.com/youtrack/issue/RH-39494

Rhino.PlugIns.PlugIn.GetUnloadedPlugInIcon(System.String,System.Int32)
Gets an icon from unloaded RhinoCommon plug in and returns it as a bitmap.
5-Jul-2017 Dale Fugier, https://mcneel.myjetbrains.com/youtrack/issue/RH-39494

Rhino.PlugIns.PlugIn.LoadPlugIn(System.String,System.Guid@)
Attempt to load a plug-in at a path. Loaded plug-ins are remembered by
Rhino between sessions, so this function can also be considered a plug-in
installation routine
path: full path to plug-in to attempt to load
plugInId:
If successful (or the plug-in is already loaded), the unique id for the
plug-in is returned here. Guid.Empty on failure
Returns:
Since: 6.0

Rhino.PlugIns.PlugIn.Find(System.Reflection.Assembly)
Finds the plug-in instance that was loaded from a given assembly.
pluginAssembly: The plug-in assembly.
You can get the assembly instance at runtime with the System.Type.Assembly instance property.
Returns: The assembly plug-in instance if successful. Otherwise, null.
Since: 5.0

Rhino.PlugIns.PlugIn.Find(System.Guid)
Finds the plug-in instance that was loaded from a given plug-in Id.
plugInId: The plug-in Id.
Returns: The plug-in instance if successful. Otherwise, null.
Since: 5.5

Rhino.PlugIns.PlugIn.LoadComputeExtensionPlugins
Used by compute's startup code to load plug-ins that have registered custom endpoints
Since: 7.0

Rhino.PlugIns.PlugIn.GetPluginSettings(System.Guid,System.Boolean)
Since: 6.0

Rhino.PlugIns.PlugIn.SavePluginSettings(System.Guid)
Since: 6.0

Rhino.PlugIns.PlugIn.RaiseOnPlugInSettingsSavedEvent
Raise any pending OnPlugInSettingsSaved events, the events are normally
queued while a command is running and fired while Rhino is in an
idle state.  Calling this method will raise any pending changed events
regardless of Rhino's current idle state or if a command is running.
Since: 6.0

Rhino.PlugIns.PlugIn.FlushSettingsSavedQueue
Since: 6.0

Rhino.PlugIns.PlugIn.Assembly
Source assembly for this plug-in.
Since: 5.0

Rhino.PlugIns.PlugIn.Id
Returns the Guid, or unique Id, of the plug-in.
Since: 5.0

Rhino.PlugIns.PlugIn.LicenseId
Since: 6.0

Rhino.PlugIns.PlugIn.Name
Returns the name of the plug-in, as found in the plug-in's assembly attributes.
Since: 5.0

Rhino.PlugIns.PlugIn.Version
Returns the version of the plug-in, as found in the plug-in's assembly attributes.
Since: 5.0

Rhino.PlugIns.PlugIn.Icon(System.Drawing.Size)
Returns the plug-in's icon in bitmap form.
size: The desired size in pixels.
Returns: The icon if successful, null otherwise.
Since: 6.0

Rhino.PlugIns.PlugIn.Description
Returns the description of the plug-in, as found in the plug-in's assembly attributes.
Since: 6.0

Rhino.PlugIns.PlugIn.GetCommands
All of the commands associated with this plug-in.
Since: 5.0

Rhino.PlugIns.PlugIn.LoadAtStartup
Since: 5.0

Rhino.PlugIns.PlugIn.LoadTime
Plug-ins are typically loaded on demand when they are first needed. You can change
this behavior to load the plug-in at during different stages in time by overriding
this property.
Since: 5.0

Rhino.PlugIns.PlugIn.AddToHelpMenu
Called by Rhino to determine if the plug-in name should be added to the Rhino Help/Plug-ins menu.
Since: 8.7

Rhino.PlugIns.PlugIn.DisplayHelp(System.IntPtr)
Called by Rhino if AddToHelpMenu is true and menu item associated with this plug-in is selected.
windowHandle: Native Window handle of the active Rhino interface.
Returns: true  = Help displayed successfully, false = Error displaying help
Since: 8.7

Rhino.PlugIns.PlugIn.UnknownUserData
This event is raised when a 3dm file is loaded with unknown user data, and the plug-in to handle it could not be loaded.
Since: 7.17

Rhino.PlugIns.PlugIn.LocalPlugInName
Optionally override this to provide a localized plug-in name

Rhino.PlugIns.PlugIn.OnLoad(System.String@)
Is called when the plug-in is being loaded.
errorMessage:
If a load error is returned and this string is set. This string is the
error message that will be reported back to the user.
Returns: An appropriate load return code.
The default implementation returns Rhino.PlugIns.LoadReturnCode.Success.

Rhino.PlugIns.PlugIn.CreateCommands
Called right after plug-in is created and is responsible for creating
all of the commands in a given plug-in.  The base class implementation
Constructs an instance of every publicly exported command class in your
plug-in's assembly.

Rhino.PlugIns.PlugIn.GetPlugInObject
Since: 5.0

Rhino.PlugIns.PlugIn.ShouldCallWriteDocument(Rhino.FileIO.FileWriteOptions)
Called whenever a Rhino is about to save a .3dm file.
If you want to save plug-in document data when a model is
saved in a version 5 .3dm file, then you must override this
function to return true and you must override WriteDocument().
options: The file write options, such as "include preview image" and "include render meshes".
Returns:
true if the plug-in wants to save document user data in the
version 5 .3dm file.  The default returns false.

Rhino.PlugIns.PlugIn.WriteDocument(Rhino.RhinoDoc,Rhino.FileIO.BinaryArchiveWriter,Rhino.FileIO.FileWriteOptions)
Called when Rhino is saving a .3dm file to allow the plug-in
to save document user data.
doc: The Rhino document instance that is being saved.
archive:
OpenNURBS file archive object Rhino is using to write the file.
Use BinaryArchiveWriter.Write*() functions to write plug-in data.
OR use the ArchivableDictionary
If any BinaryArchiveWriter.Write*() functions throw an exception,
then archive.WriteErrorOccured will be true and you should immediately return.
Setting archive.WriteErrorOccured to true will cause Rhino to stop saving the file.
options: The file write options, such as "include preview image" and "include render meshes".

Rhino.PlugIns.PlugIn.ReadDocument(Rhino.RhinoDoc,Rhino.FileIO.BinaryArchiveReader,Rhino.FileIO.FileReadOptions)
Called whenever a Rhino document is being loaded and plug-in user data was
encountered written by a plug-in with this plug-in's GUID.
doc: A Rhino document that is being loaded.
archive:
OpenNURBS file archive object Rhino is using to read this file.
Use BinaryArchiveReader.Read*() functions to read plug-in data.
If any BinaryArchive.Read*() functions throws an exception then
archive.ReadErrorOccurve will be true and you should immediately return.
options: Describes what is being written.

Rhino.PlugIns.PlugIn.OptionsDialogPages(System.Collections.Generic.List{Rhino.UI.OptionsDialogPage})
Override this function if you want to extend the options dialog. This function is
called whenever the user brings up the Options dialog.
pages: list of pages to add your custom options dialog page(s) to.

Rhino.PlugIns.PlugIn.DocumentPropertiesDialogPages(Rhino.RhinoDoc,System.Collections.Generic.List{Rhino.UI.OptionsDialogPage})
Override this function if you want to extend the document properties sections
of the options dialog. This function is called whenever the user brings up the
Options dialog.
doc: document that the pages are set up for
pages: list of pages to add your custom options dialog page(s) to.

Rhino.PlugIns.PlugIn.ObjectPropertiesPages(System.Collections.Generic.List{Rhino.UI.ObjectPropertiesPage})
Override this function is you want to extend the object properties dialog
pages:

Rhino.PlugIns.PlugIn.ObjectPropertiesPages(Rhino.UI.ObjectPropertiesPageCollection)
Override this function is you want to extend the object properties dialog.
This method will be called each time a new document is created for each
instance of a object properties panel.  On Windows there will be a single
panel per document but on Mac there may be many properties panel per
document.
collection:
Add custom pages by calling collection.Add

Rhino.PlugIns.PlugIn.GetLicense(Rhino.PlugIns.LicenseBuildType,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate)
Verifies that there is a valid product license for your plug-in, using
the Rhino licensing system. If the plug-in is installed as a standalone
node, the locally installed license will be validated. If the plug-in
is installed as a network node, a loaner license will be requested by
the system's assigned Zoo server. If the Zoo server finds and returns
a license, then this license will be validated. If no license is found,
then the user will be prompted to provide a license key, which will be
validated.
productBuildType:
The product build contentType required by your plug-in.
validateProductKeyDelegate:
Since the Rhino licensing system knows nothing about your product license,
you will need to validate the product license provided by the Rhino
licensing system. This is done by supplying a callback function, or delegate,
that can be called to perform the validation.
leaseChangedDelegate:
Called by the ZooClient when the cloud zoo lease is changed.
Returns:
true if a valid license was found. false otherwise.

Rhino.PlugIns.PlugIn.GetLicense(Rhino.PlugIns.LicenseCapabilities,System.String,Rhino.PlugIns.ValidateProductKeyDelegate,Rhino.PlugIns.OnLeaseChangedDelegate)
Verifies that there is a valid product license for your plug-in, using
the Rhino licensing system. If the plug-in is installed as a standalone
node, the locally installed license will be validated. If the plug-in
is installed as a network node, a loaner license will be requested by
the system's assigned Zoo server. If the Zoo server finds and returns
a license, then this license will be validated. If no license is found,
then the user will be prompted to provide a license key, which will be
validated.
licenseCapabilities:
In the event that a license was not found, or if the user wants to change
the way your plug-in is licenses, then provide what capabilities your
license has by using this enumeration flag.
textMask:
In the event that the user needs to be asked for a license, then you can
provide a text mask, which helps the user to distinguish between proper
and improper user input of your license code. Note, if you do not want
to use a text mask, then pass in a null value for this parameter.
For more information on text masks, search MSDN for the System.Windows.Forms.MaskedTextBox class.
validateProductKeyDelegate:
Since the Rhino licensing system knows nothing about your product license,
you will need to validate the product license provided by the Rhino
licensing system. This is done by supplying a callback function, or delegate,
that can be called to perform the validation.
leaseChangedDelegate:
Called by the ZooClient when the cloud zoo lease is changed.
Returns:
true if a valid license was found. false otherwise.

Rhino.PlugIns.PlugIn.ReturnLicense
Returns, or releases, a product license that was obtained from the Rhino
licensing system. Note, most plug-ins do not need to call this as the
Rhino licensing system will return all licenses when Rhino shuts down.
Since: 5.0

Rhino.PlugIns.PlugIn.GetLicenseOwner(System.String@,System.String@)
Get the customer name and organization used when entering the product
license.
registeredOwner:
registeredOrganization:
Returns:
Since: 5.11

Rhino.PlugIns.PlugIn.SettingsDirectoryAllUsers
Get the plug-in's "all users" settings directory.
This directory will be located in the system's program data folder.
Note, this does not verify the directory exists.
Since: 5.0

Rhino.PlugIns.PlugIn.SettingsDirectory
Get the plug-in's settings directory. This is the directory where the plug-in's persistent settings files are saved.
This directory will be located in the user's profile folder.
Note, this does not verify the directory exists.
Since: 5.0

Rhino.PlugIns.PlugIn.SettingsSaved
This event is raised when an instance of Rhino has modified the
external settings file associated with this plug-in's Rhino.PlugIns.PlugIn.Settings
property.
Rhino.PlugIns.PlugIn.SaveSettings
Since: 6.0

Rhino.PlugIns.PlugIn.InvokeSetingsSaved(System.Object,System.Boolean,System.Boolean)
Call this method to raise the SettingsSaved event.
sender:
writing:
dirty:
Will be true if the settings are in the to be written queue indicating that there is
an additional change that needs to be written.

Rhino.PlugIns.PlugIn.SaveSettings
Write settings to disk which will raise a Rhino.PlugIns.PlugIn.SettingsSaved
event.
Since: 6.0

Rhino.PlugIns.PlugIn.ReadSettings
Read the settings file and return a Rhino.PersistentSettings
instance.
Returns:
If the settings file exists and was successfully read a
Rhino.PersistentSettings object will be returned otherwise null
will be returned.

Rhino.PlugIns.PlugIn.Settings
Persistent plug-in settings.
Since: 5.0

Rhino.PlugIns.PlugIn.WindowPositionSettings
Since: 6.0

Rhino.PlugIns.PlugIn.CommandSettings(System.String)
Since: 5.0

Rhino.PlugIns.PlugIn.GetPlugInInfo(System.Guid)
Returns detailed information about an installed Rhino plug-in.
pluginId: The id of the plug-in.
Returns: Detailed information about an installed Rhino plug-in if successful, null otherwise.
Since: 6.0

Rhino.PlugIns.PlugIn.AskOnLoadProtection
If true, Rhino will display a warning dialog when load-protected plug-ins are attempting to load.
If false, load-protected plug-ins will silently not load.
Since: 6.0

Rhino.PlugIns.PlugIn.InstalledPlugInCount
Returns the number of installed Rhino plug-ins.
Since: 5.0

Rhino.PlugIns.PlugIn.PlugInExists(System.Guid,System.Boolean@,System.Boolean@)
Verifies that a Rhino plug-in is installed.
id: The id of the plug-in.
loaded: The loaded state of the plug-in.
loadProtected: The load protected state of the plug-in.
Returns: Returns true if the plug-in exists, or is installed.
Since: 5.0

Rhino.PlugIns.PlugIn.GetInstalledPlugIns
Get a list of all registered plug-in's regardless of if they are loaded or not.
Returns:
Dictionary with plug-in ID as key and localized plug-in name as value
Since: 5.0

Rhino.PlugIns.PlugIn.GetInstalledPlugIns(System.Boolean)
Get a list of all registered plug-in's regardless of if they are loaded or not.
localizedPlugInName:
If true then the localize plug-in name is returned otherwise; the English name is used.
Returns:
Dictionary with plug-in ID as key and plug-in name as value
Since: 7.5

Rhino.PlugIns.PlugIn.GetInstalledPlugInNames
Returns the names of all installed Rhino plug-ins.
Returns: The names if successful.
Since: 5.0

Rhino.PlugIns.PlugIn.GetInstalledPlugInNames(Rhino.PlugIns.PlugInType,System.Boolean,System.Boolean)
Gets a list of installed plug-in names.  The list can be restricted by some filters.
typeFilter:
The enumeration flags that determine which types of plug-ins are included.
loaded: true if loaded plug-ins are returned.
unloaded: true if unloaded plug-ins are returned.
Returns: An array of installed plug-in names. This can be empty, but not null.
Since: 5.0

Rhino.PlugIns.PlugIn.GetInstalledPlugInNames(Rhino.PlugIns.PlugInType,System.Boolean,System.Boolean,System.Boolean)
Gets a list of installed plug-in names.  The list can be restricted by some filters.
typeFilter:
The enumeration flags that determine which types of plug-ins are included.
loaded: true if loaded plug-ins are returned.
unloaded: true if unloaded plug-ins are returned.
localizedPlugInName:
If true localized plug-in names are returned otherwise; English names are returned.
Returns: An array of installed plug-in names. This can be empty, but not null.
Since: 7.5

Rhino.PlugIns.PlugIn.GetInstalledPlugInFolders
Since: 5.0

Rhino.PlugIns.PlugIn.NameFromPath(System.String)
Gets a plug-in name for an installed plug-in given the path to that plug-in.
pluginPath: The path of the plug-in.
Returns: The plug-in name.
Since: 5.0

Rhino.PlugIns.PlugIn.PathFromName(System.String)
Gets the path to an installed plug-in given the name of that plug-in
pluginName:
Returns:
Since: 5.9

Rhino.PlugIns.PlugIn.PathFromId(System.Guid)
Gets the path to an installed plug-in given the id of that plug-in
pluginId:
Returns:
Since: 5.9

Rhino.PlugIns.PlugIn.IdFromPath(System.String)
Gets the id of an installed plug-in giving the plug-in's file path.
pluginPath: The path to the installed plug-in.
Returns: The id if successful.
Since: 5.0

Rhino.PlugIns.PlugIn.IdFromFileName(System.String)
Attempt to get a plugiin id from just the filename of a plug-in
filename: plug-in filename
Returns: id on success; Guid.Empty if no plug-in could be found
Since: 8.15

Rhino.PlugIns.PlugIn.IdFromName(System.String)
Gets the id of an installed plug-in giving the plug-in's name.
pluginName: The name of the installed plug-in.
Returns: The id if successful.
Since: 5.5

Rhino.PlugIns.PlugIn.LoadPlugIn(System.Guid)
Loads an installed plug-in.
pluginId: The id of the installed plug-in.
Returns: true if successful, false otherwise.
Since: 5.0

Rhino.PlugIns.PlugIn.LoadPlugIn(System.Guid,System.Boolean,System.Boolean)
Loads an installed plug-in.
pluginId: The id of the installed plug-in.
loadQuietly: Load the plug-in quietly.
forceLoad: Load plug-in even if previous attempt to load has failed.
Returns: true if successful, false otherwise.
Since: 6.0

Rhino.PlugIns.PlugIn.GetEnglishCommandNames(System.Guid)
Gets names of all "non-test" commands for a given plug-in.
pluginId: The plug-in ID.
Returns: An array with all plug-in names. This can be empty, but not null.
Since: 5.0

Rhino.PlugIns.PlugIn.SetLoadProtection(System.Guid,System.Boolean)
Set load protection state for a certain plug-in
pluginId:
loadSilently:
Since: 5.5

Rhino.PlugIns.PlugIn.GetLoadProtection(System.Guid,System.Boolean@)
Get load protection state for a plug-in
pluginId:
loadSilently:
Returns:
Since: 5.5

Rhino.PlugIns.PlugIn.BlockedByWindows(System.Exception,UnsafeNativeMethods.LoadPlugInFileReturnCodesConsts@)
True when the exception means Windows refused to load the file, rather than the
plug-in itself failing. blockedCode says which kind of refusal it was: Windows could
not verify the file's signature, which is what a code integrity policy such as Smart
App Control reports and what a damaged or modified file reports; or antivirus
software objected to the contents of the file.

Rhino.PlugIns.PlugIn.IsTextureSupported(Rhino.Render.RenderTexture)
Returns true if this renderer can render the texture natively without needing it to be baked into a bitmap, false otherwise.
By default, returns false for all textures.
Since: 8.6