Rhino.DocObjects.InstanceDefinitionLayerStyle
InstanceDefinition.LayerStyle specifies how model components
(layers, materials, dimension styles, etc.) from linked instance definition files
appear in the active model.
Since: 5.0

Rhino.DocObjects.InstanceDefinitionLayerStyle.None
This is the only valid layer style when the instance definition type is InstanceDefinitionUpdateType.Static
or InstanceDefinitionUpdateType.LinkedAndEmbedded. This style is not valid when the instance definition type
is InstanceDefinitionUpdateType.Linked.

Rhino.DocObjects.InstanceDefinitionLayerStyle.Active
Model components (layers, materials, dimension styles, etc.) from
linked instance definition files are embedded as ordinary components in the active model.
This layer style may be used when the instance definition type is InstanceDefinitionUpdateType.Linked.

Rhino.DocObjects.InstanceDefinitionLayerStyle.Reference
Layers from the linked instance definition are reference components in the model.
This is the default layer style when the instance definition type is InstanceDefinitionUpdateType.Linked.
This layer style may be used when the instance definition type is InstanceDefinitionUpdateType.Linked.