Rhino.Display.ViewCapture.#ctor
Since: 6.0

Rhino.Display.ViewCapture.CaptureToBitmap(Rhino.Display.RhinoView)
Since: 6.0

Rhino.Display.ViewCapture.Width
Width of capture in Pixels
Since: 6.0

Rhino.Display.ViewCapture.Height
Height of capture in Pixels
Since: 6.0

Rhino.Display.ViewCapture.ScaleScreenItems
Since: 6.0

Rhino.Display.ViewCapture.DrawGrid
Since: 6.0

Rhino.Display.ViewCapture.DrawAxes
Since: 6.0

Rhino.Display.ViewCapture.DrawGridAxes
Since: 6.0

Rhino.Display.ViewCapture.TransparentBackground
Since: 6.0

Rhino.Display.ViewCapture.Preview
Since: 6.0

Rhino.Display.ViewCapture.RealtimeRenderPasses
Since: 6.0

Rhino.Display.ViewCapture.CaptureToBitmap(Rhino.Display.ViewCaptureSettings)
Since: 6.0

Rhino.Display.ViewCapture.CaptureToSvg(Rhino.Display.ViewCaptureSettings)
Since: 6.0

Rhino.Display.ViewCapture.SendToPrinter(System.String,Rhino.Display.ViewCaptureSettings[])
Send a list of view capture settings to a printer. Each setting
represents a single page.
printerName:
settings:
Returns: true on success
Since: 8.0

Rhino.Display.ViewCapture.SendToPrinter(System.String,Rhino.Display.ViewCaptureSettings[],System.Int32)
Send a list of view capture settings to a printer. Each setting
represents a single page.
printerName:
settings:
copies: number of copies to print
Returns: true on success
Since: 8.0