Rhino.Render.PostEffects.PostEffectPipeline
This object provides a way for post effects to access the frame buffer channels from a rendering and create
new channels containing post-processed information which can be passed to the next post effect in the chain.
Consider a simple post effect that just modifies the red component of a rendering.It will call GetChannel()
to get the red channel as its input, and it will call NewChannel() to get a new red channel for its output.
It will then read the input channel, do calculations and write to the output channel.When finished, it will
call Commit() passing the new channel.Because both channels have the same identifier, this will replace the
old channel with the new one so that subsequent post effects in the chain will use the new channel instead of the
original.Note that this will only replace the channel used by the pipeline.The original channel will still
exist in the frame buffer.This system allows any post effect to access any number of channels for reading and
create any number of new channels which may or may not replace existing channels depending on the channel
id.The final stage (convert to 8-bit) operates on the channels left in the pipeline by the post effect chain to
produce the final 32-bit RGBA image in a dib.
It is also possible for a post effect to create and use any number of 'scratch' channels.If a post effect needs a
temporary pixel buffer for some intermediate results, it can call NewChannel() with a custom (random) id.
Once it is finished with this scratch channel, it can call Discard() on it.

Rhino.Render.PostEffects.PostEffectPipeline.CppPointer
Since: 7.0

Rhino.Render.PostEffects.PostEffectPipeline.#ctor(System.IntPtr)
Since: 7.0

Rhino.Render.PostEffects.PostEffectPipeline.Dispose
Since: 7.0

Rhino.Render.PostEffects.PostEffectPipeline.RenderingId
Return a UUID that uniquely identifies the rendering being processed.
Returns: Return a UUID that uniquely identifies the rendering being processed.
Since: 7.0

Rhino.Render.PostEffects.PostEffectPipeline.GPUAllowed
Post effect authors should check that GPU use is allowed before using the GPU in a post effect.
Returns: Return true if the pipeline is allowed to use the GPU, else false
Since: 7.0

Rhino.Render.PostEffects.PostEffectPipeline.Dimensions
Get the dimensions of the frame buffer. All channels in the frame buffer have the same dimensions.
Returns: Dimension as Size
Since: 7.0

Rhino.Render.PostEffects.PostEffectPipeline.Rhino#Render#PostEffects#IPostEffects#PostEffectFromId(System.Guid)
Return a pointer to the specified post effect or null if not found.
uuid: uuid of the poest effect plugin
Returns: Return a pointer to the specified post effect or null if not found.
Since: 7.0

Rhino.Render.PostEffects.PostEffectPipeline.ExecutionOrder
Returns a list of the post effects to be executed by this pipeline in order.
Returns: A list of the post effects to be executed by this pipeline in order
Since: 7.0

Rhino.Render.PostEffects.PostEffectPipeline.Execute(System.Drawing.Rectangle,System.Boolean,Rhino.Render.PostEffects.PostEffectExecuteContexts,Rhino.Render.PostEffects.PostEffectHistograms)
Execute the pipeline. This executes all the post effects in order.
Only this rectangle need be modified by the post effects.
p: p is a rectangle within the frame buffer.
renderingInProgress: rendering is true if rendering is in progress.
usageContexts: Context this pipeline is being executed in.
histogramsToUpdate: Bitwise list of histograms to update during the execution of the pipeline
Returns:
Since: 7.0

Rhino.Render.PostEffects.PostEffectPipeline.System#IProgress{System#Int32}#Report(System.Int32)
Post effects should call this during execution to report progress.
A good strategy is to call this once per pixel row (or several rows).
If the function returns \e false, your post effect should exit its pixel loop
as the user has requested that the operation be canceled.
Returns: Return true if the process should continue, else false.
Since: 7.0

Rhino.Render.PostEffects.PostEffectPipeline.GetMaxLuminance
Get the max luminance in the rendering.
Returns: max luminance
Since: 7.0

Rhino.Render.PostEffects.PostEffectPipeline.SetStartTimeInMilliseconds(System.UInt64)
Set the start time of the rendering in milliseconds since some unspecified epoch.
ms: milliseconds

Rhino.Render.PostEffects.PostEffectPipeline.GetStartTimeInMilliseconds
Get the start time of the rendering expressed in milliseconds since some unspecified epoch.
Do not make assumptions about what the epoch is; it might be different on different platforms.
Returns: milliseconds
Since: 7.0

Rhino.Render.PostEffects.PostEffectPipeline.GetEndTimeInMilliseconds
Get the end time of the rendering expressed in milliseconds since some unspecified epoch.
Do not make assumptions about what the epoch is; it might be different on different platforms.
Returns: milliseconds
Since: 7.0

Rhino.Render.PostEffects.PostEffectPipeline.IsRendering
IsRendering
Returns: Return true if rendering is active, else false.
Since: 7.0

Rhino.Render.PostEffects.PostEffectPipeline.GetChannelForRead(System.Guid)
Get a channel for reading. A post effect will use this to get channel data as input to
its process. Output will be written to new channel(s). \see GetChannelForWrite()
This method returns the current state of the channel at this stage in the pipeline.
If the first post effect calls this, it will get the actual frame buffer channel.
Subsequent post effects will get the data left behind by the previous post effect.
A post effect calls GetChannelForRead() to get its input and GetChannelForWrite()
to get the object to which it will write its output. Even when the same channel id
is specified, these are separate, unconnected objects.
id: The channel identifier.
Returns: A pointer to the channel or null if the channel is not available.
Since: 7.0

Rhino.Render.PostEffects.PostEffectPipeline.GetChannelForWrite(System.Guid)
Get a channel for writing. A post effect will use this to get channel(s) to write the output of its
processing to. Input will usually come from existing channels, although a post effect is free to read
its own output channels if needed. See GetChannelForRead()
You are allowed to create one new channel with the same identifier as an existing channel,
in which case IChannel::Commit() will replace the existing channel with the new one in the pipeline.
id: The channel identifier.
Returns: A pointer to the new channel or null if the channel could not be created.
Since: 7.0

Rhino.Render.PostEffects.PostEffectPipeline.ThreadEngine
Get the post effect thread engine.
Since: 7.0