Rhino.Geometry.Collections.MeshNgonList
Provides access to the ngons and ngon-related functionality of a Mesh.
See also the Rhino.Geometry.Mesh.Ngons property for Ngon functionality details.

Rhino.Geometry.Collections.MeshNgonList.Count
Gets or sets the number of mesh ngons.
Since: 6.0

Rhino.Geometry.Collections.MeshNgonList.UnsignedCount
Gets or sets the number of mesh ngons.
Since: 6.0

Rhino.Geometry.Collections.MeshNgonList.Clear
Clears the Ngon list on the mesh.
Since: 6.0

Rhino.Geometry.Collections.MeshNgonList.AddNgon(Rhino.Geometry.MeshNgon)
Appends a new ngon to the end of the mesh ngon list.
ngon: Ngon to add.
Returns: The index of the newly added ngon.
Since: 6.0

Rhino.Geometry.Collections.MeshNgonList.AddNgonBoundary(System.Int32[])
Appends a new ngon to the end of the mesh ngon list.
This override will also add the necessary triangular faces to the respective MeshFaceList of the same mesh class.
If a triangle or a quad is specified, the necessary operation is executed on the face list and no ngon is added to the mesh.
boundary: An array of indices.
Returns:
1 if an ngon was added, along with the necessary triangles.
0 if a triangle or a quad was provided and the necessary faces were added.
-1 if an error other than the two exceptions occurred when tessellating boundary vertices and no ngon was added.
Throws System.ArgumentNullException: If boundary is null.
Throws System.ArgumentOutOfRangeException: If boundary is less than 3 items long.

Rhino.Geometry.Collections.MeshNgonList.AddNgons(System.Collections.Generic.IEnumerable{Rhino.Geometry.MeshNgon})
Appends a list of ngons to the end of the mesh ngon list.
ngons: Ngons to add.
Returns: Indices of the newly created ngons
Since: 6.0

Rhino.Geometry.Collections.MeshNgonList.AddPlanarNgons(System.Double)
Add an ngon for each group of connected coplanar faces.
planarTolerance: 3d distance tolerance for coplanar test.
Returns: Number of ngons added to the mesh.
Since: 6.0

Rhino.Geometry.Collections.MeshNgonList.AddPlanarNgons(System.Double,System.Int32,System.Int32,System.Boolean)
Add an ngon for each group of connected coplanar faces.
planarTolerance: 3d distance tolerance for coplanar test.
minimumNgonVertexCount: Minimum number of vertices for an ngon.
minimumNgonFaceCount: Minimum number of faces for an ngon.
allowHoles: Determines whether the ngon can have inner boundaries.
Returns: Number of ngons added to the mesh.
Since: 6.0

Rhino.Geometry.Collections.MeshNgonList.NgonBoundaryVertexList(Rhino.Geometry.MeshNgon,System.Boolean)
Get an ngon's boundary points.
ngon: ngon.
bAppendStartPoint: If true, the first point in the list is also appended to the end of the list to create a closed polyline.
Returns: A list of ngon boundary points.
Since: 6.0

Rhino.Geometry.Collections.MeshNgonList.OrientNgons(System.Boolean)
If the mesh has ngons with ON_MeshNgon.Orientation() = -1,
then reverse the ngon's boundary orientation.
permitHoles: ngons may contain holes
Returns:
True if all non-empty ngons have ON_MeshNgon.Orientation()=1 after the call.

Rhino.Geometry.Collections.MeshNgonList.Insert(System.Int32,Rhino.Geometry.MeshNgon)
Inserts a mesh ngon at a defined index in this list.
index: An ngon index.
ngon: An ngon.
Throws System.ArgumentOutOfRangeException: If index is negative or >= Count.
Since: 6.0

Rhino.Geometry.Collections.MeshNgonList.SetNgon(System.Int32,Rhino.Geometry.MeshNgon)
Set an ngon in this list.
index: An ngon index.
ngon: An ngon.
Throws System.ArgumentOutOfRangeException: If index is negative or >= Count.
Since: 6.0

Rhino.Geometry.Collections.MeshNgonList.GetNgon(System.Int32)
Returns the mesh ngon at the given index.
index: Index of ngon to get. Must be larger than or equal to zero and
smaller than the Ngon Count of the mesh.
Returns: The mesh ngon at the given index.  This ngon can be MeshNgon.Empty.
Since: 6.0

Rhino.Geometry.Collections.MeshNgonList.NgonIndexFromFaceIndex(System.Int32)
Returns the index of a mesh ngon the face belongs to.
meshFaceIndex: Index of a mesh face.
Returns: The index of the mesh ngon the face belongs to or -1 if the face does not belong to an ngon.
Since: 6.0

Rhino.Geometry.Collections.MeshNgonList.Item(System.Int32)
Returns the mesh ngon at the given index.
index: Index of face to get. Must be larger than or equal to zero and
smaller than the Face Count of the mesh.

Rhino.Geometry.Collections.MeshNgonList.GetNgonBoundingBox(System.Int32)
Gets the bounding box of an ngon.
index: A ngon index.
Returns: A new bounding box, or Rhino.Geometry.BoundingBox.Empty on error.
Since: 6.0

Rhino.Geometry.Collections.MeshNgonList.GetNgonBoundingBox(Rhino.Geometry.MeshNgon)
Gets the bounding box of an ngon.
ngon: An ngon.
Returns: A new bounding box, or Rhino.Geometry.BoundingBox.Empty on error.
Since: 6.0

Rhino.Geometry.Collections.MeshNgonList.GetNgonOuterEdgeCount(System.Int32)
Gets the outer edge count of an ngon.
index: Ngon index.
Returns: Outer edge count or zero on error.
Since: 6.0

Rhino.Geometry.Collections.MeshNgonList.Orientation(System.Int32,System.Boolean)
Determine if the ngon's boundary orientation matches that of the set of faces it is made from.
index: Ngon index.
permitHoles:
true if the ngon is permitted to have interior holes, false otherwise.
Returns:
1: The ngon does not have holes, the ngon's faces are compatibly oriented,
and the ngon's outer boundary orientation matches the faces' orientation.
-1: The ngon does not have holes, the ngon's faces are compatibly oriented,
and the ngon's outer boundary orientation is opposite the faces' orientation.
0: Otherwise.The ngon may be invalid, have holes, the ngon's faces may not be
compatibly oriented, the ngons edges may not have a consistent orientation
with respect to the faces, or some other issue.
Since: 7.0

Rhino.Geometry.Collections.MeshNgonList.ReverseOuterBoundary(System.Int32)
Reverse the order of the m_vi[] array for an ngon
index:
Since: 7.0

Rhino.Geometry.Collections.MeshNgonList.GetNgonEdgeCount(System.Int32)
Gets the complete edge count of an ngon.
index: Ngon index.
Returns: Complete edge count or zero on error.
Since: 6.0

Rhino.Geometry.Collections.MeshNgonList.NgonHasHoles(System.Int32)
Determines whether a ngon has holes.
index: Ngon index.
Returns: true for holes (or malformed ngon, see remarks), false for no holes.
Remarks: A slit, for example, will give an edge count that differs from outer edge count despite the
lack of true "holes" i.e. interior edges that are not shared by more than one face of the ngon in question.
Since: 6.0

Rhino.Geometry.Collections.MeshNgonList.GetNgonCenter(System.Int32)
Gets the center point of an ngon.
This the average of the corner points.
index: A ngon index.
Returns: The center point.
Since: 6.0

Rhino.Geometry.Collections.MeshNgonList.GetNgonCenter(Rhino.Geometry.MeshNgon)
Gets the center point of an ngon.
This the average of the corner points.
ngon: An ngon.
Returns: The center point.
Since: 6.0

Rhino.Geometry.Collections.MeshNgonList.RemoveNgons(System.Collections.Generic.IEnumerable{System.Int32})
Remove one or more ngons from the mesh.
indices: An array of ngon indices.
Returns: The number of deleted ngons.
Since: 6.0

Rhino.Geometry.Collections.MeshNgonList.RemoveAllNgons
Removes all ngons from the mesh.
Returns: The number deleted ngons.
Since: 8.23

Rhino.Geometry.Collections.MeshNgonList.RemoveAt(System.Int32)
Removes an ngon from the mesh.
index: The index of the ngon.
Since: 6.0

Rhino.Geometry.Collections.MeshNgonList.GetNgonBoundary(System.Collections.Generic.IEnumerable{System.Int32})
Get a list of vertices that form the boundary of a face set. This is often use to get ngon boundaries.
ngonFaceIndexList: List of mesh face indices.
Returns: List of mesh vertex indices that form the boundary of the face set.
Since: 6.0

Rhino.Geometry.Collections.MeshNgonList.IsValid(System.Int32)
Tests an ngon to see if the vertex and face references are valid and pass partial boundary validity checks.
index: The index of the ngon to test.
Returns: 0 if the ngon is not valid, otherwise the number of boundary edges.
Remarks: If the return value is > MeshNgon.BoundaryVertexCount, then the ngon has either inner boundaries or duplicate vertices.
Since: 6.0

Rhino.Geometry.Collections.MeshNgonList.IsValid(System.Int32,Rhino.FileIO.TextLog)
Tests an ngon to see if the vertex and face references are valid and pass partial boundary validity checks.
index: The index of the ngon to test.
textLog: A text log for collecting information about problems.
Returns: 0 if the ngon is not valid, otherwise the number of boundary edges.
Remarks: If the return value is > MeshNgon.BoundaryVertexCount, then the ngon has either inner boundaries or duplicate vertices.
Since: 6.0

Rhino.Geometry.Collections.MeshNgonList.System#Collections#Generic#IList{Rhino#Geometry#MeshNgon}#Insert(System.Int32,Rhino.Geometry.MeshNgon)
Since: 6.0

Rhino.Geometry.Collections.MeshNgonList.System#Collections#Generic#IList{Rhino#Geometry#MeshNgon}#RemoveAt(System.Int32)
Since: 6.0

Rhino.Geometry.Collections.MeshNgonList.System#Collections#IList#RemoveAt(System.Int32)
Since: 6.0

Rhino.Geometry.Collections.MeshNgonList.GetEnumerator
Gets an enumerator that yields all ngons in this collection.
Returns: The enumerator.
Since: 6.0

Rhino.Geometry.Collections.MeshNgonList.System#Collections#IEnumerable#GetEnumerator
Since: 6.0