Rhino.Geometry.SubDEdge
Single edge of a SubD

Rhino.Geometry.SubDEdge.ClearSavedSubdivisionPoints(System.Boolean)
Discards the cached subdivision and surface points for this edge, so they are
recomputed on next use.
clearNeighborhood:
If true, the cached points of the neighboring components are discarded too. Moving a
control net point changes the surface around it, not just at it, so pass true after
an edit unless you know only this edge is affected.
Since: 8.36

Rhino.Geometry.SubDEdge.FaceCount
Number of faces for this edge.
Since: 7.0

Rhino.Geometry.SubDEdge.ComponentIndex
Gets the component index of this edge.
Returns: The component index.
Since: 8.12

Rhino.Geometry.SubDEdge.ControlNetLine
Line representing the control net end points.
Since: 7.0

Rhino.Geometry.SubDEdge.VertexFrom
Start vertex for this edge.
Since: 7.0

Rhino.Geometry.SubDEdge.VertexTo
End vertex for this edge.
Since: 7.0

Rhino.Geometry.SubDEdge.Tag
identifies the type of subdivision edge.
Since: 7.0

Rhino.Geometry.SubDEdge.Sharpness
Gets or sets the sharpness of this edge.
The getter reports Rhino.Geometry.SubDEdgeSharpness.Crease for a crease edge; use
GetSharpness(false) to get
Rhino.Geometry.SubDEdgeSharpness.Smooth for creases instead.
Remarks:
Setting this goes through the parent SubD so that the neighboring edges and
vertices are updated too. Assign Rhino.Geometry.SubDEdgeSharpness.Smooth to make the
edge smooth again.
Since: 8.36

Rhino.Geometry.SubDEdge.IsSharp
Gets true if this edge is smooth and has a nonzero sharpness.
A crease edge is not a sharp edge.
Since: 8.36

Rhino.Geometry.SubDEdge.RelativeVertexFrom
The vertex this edge starts at, taking Rhino.Geometry.SubDComponent.ComponentDirection
into account. This is Rhino.Geometry.SubDEdge.VertexFrom for an edge in its natural
orientation and Rhino.Geometry.SubDEdge.VertexTo for a reversed one.
Since: 8.36

Rhino.Geometry.SubDEdge.RelativeVertexTo
The vertex this edge ends at, taking Rhino.Geometry.SubDComponent.ComponentDirection
into account.
Since: 8.36

Rhino.Geometry.SubDEdge.RelativeVertexAt(System.Int32)
Gets one of this edge's two vertices, relative to the direction this edge is
referenced with.
endIndex: 0 for the start of the edge, 1 for the end.
Returns: The vertex, or null if endIndex is out of range.
Since: 8.36

Rhino.Geometry.SubDEdge.RelativeFaceLeft
The face on the left of this edge, with respect to the direction this edge is
referenced with. Null for a boundary edge with no face on that side, and for a
nonmanifold edge.
Since: 8.36

Rhino.Geometry.SubDEdge.RelativeFaceRight
The face on the right of this edge, with respect to the direction this edge is
referenced with.
Since: 8.36

Rhino.Geometry.SubDEdge.RelativeFaceAt(System.Int32)
Gets the face on one side of this edge, relative to the direction this edge is
referenced with.
relativeFaceIndex: 0 for the left side, 1 for the right side.
Returns:
The face, with its Rhino.Geometry.SubDComponent.ComponentDirection set so its boundary
runs the same way as this edge. Null if there is no such face, or if the edge is
nonmanifold.
Since: 8.36

Rhino.Geometry.SubDEdge.GetSharpness
Gets the sharpness of this edge, reporting
Rhino.Geometry.SubDEdgeSharpness.Crease for a crease edge.
Returns: The sharpness of this edge.
Since: 8.36

Rhino.Geometry.SubDEdge.GetSharpness(System.Boolean)
Gets the sharpness of this edge.
useCreaseSharpness:
If this edge is a crease and useCreaseSharpness is true, then
Rhino.Geometry.SubDEdgeSharpness.Crease is returned. If it is a crease and
useCreaseSharpness is false, then Rhino.Geometry.SubDEdgeSharpness.Smooth is
returned.
Returns:
The sharpness of a smooth edge, Rhino.Geometry.SubDEdgeSharpness.Crease for a crease
edge when useCreaseSharpness is true, and Rhino.Geometry.SubDEdgeSharpness.Smooth in
every other case.
Since: 8.36

Rhino.Geometry.SubDEdge.EndSharpness(System.Int32,System.Boolean)
Gets the sharpness of this edge at one of its ends.
endIndex:
0 for the Rhino.Geometry.SubDEdge.VertexFrom end, 1 for the Rhino.Geometry.SubDEdge.VertexTo end.
useCreaseSharpness:
If this edge is a crease and useCreaseSharpness is true, then
Rhino.Geometry.SubDEdgeSharpness.CreaseValue is returned.
Returns: The sharpness at that end, or 0.0 if this edge is not sharp.
Since: 8.36

Rhino.Geometry.SubDEdge.FaceAt(System.Int32)
Retrieve a SubDFace from this edge.
index:
Returns:
Since: 7.0

Rhino.Geometry.SubDEdge.ToNurbsCurve(System.Boolean)
Get a cubic, uniform, non-rational, NURBS curve that is on the
edge's limit curve.
Remarks:
If some edges in your SubD are not able to be converted to NURBS,
you might need to run Rhino.Geometry.SubD.UpdateSurfaceMeshCache(System.Boolean).
clampEnds:
If true, the end knots are clamped.
Otherwise the end knots are(-2,-1,0,...., k1, k1+1, k1+2).
Returns: The Nurbs form of this edge.
Rhino.Geometry.SubD.UpdateSurfaceMeshCache(System.Boolean)
Since: 7.0