Rhino.UI.ToolbarFile
Represents a Rhino toolbar, or .RUI, file.
Since: 5.0

Rhino.UI.ToolbarFile.Id
Gets the id of the toolbar file.
Since: 5.0

Rhino.UI.ToolbarFile.Path
Gets the full path to the toolbar file.
Since: 5.0

Rhino.UI.ToolbarFile.Name
Gets the name, or alias, of the toolbar file.
Since: 5.0

Rhino.UI.ToolbarFile.Close(System.Boolean)
Closes the toolbar file.
prompt: Set true if you want to be prompted to cllose the file.
Returns: True if successful, false otherwie.
Since: 5.0

Rhino.UI.ToolbarFile.Save
Saves the toolbar file.
Since: 5.0

Rhino.UI.ToolbarFile.SaveAs(System.String)
Saves the toolbar file to a different path.
Since: 5.0

Rhino.UI.ToolbarFile.GroupCount
Get the number of toolbar groups in the toolbar file.
Since: 5.0

Rhino.UI.ToolbarFile.ToolbarCount
Get the number of toolbars in the toolbar file.
Since: 5.0

Rhino.UI.ToolbarFile.GetToolbar(System.Int32)
Gets a toolbar.
index: The index of the toolbar.
Returns: The toolbar if successful, null otherwise.

Rhino.UI.ToolbarFile.GetGroup(System.Int32)
Gets a toolbar group.
index: The index of the toolbar group.
Returns: The toolbar group if successful, null otherwise.
Since: 5.0

Rhino.UI.ToolbarFile.GetGroup(System.String)
Gets a toolbar group.
name: The name of the toolbar group.
Returns: The toolbar group if successful, null otherwise.
Since: 5.0