Rhino.ApplicationSettings.KeyboardShortcut
A shortcut is a key plus modifier combination that executes a macro

Rhino.ApplicationSettings.KeyboardShortcut.Modifier
Modifier key used for shortcut
Since: 8.12

Rhino.ApplicationSettings.KeyboardShortcut.Key
Key used for shortcut
Since: 8.12

Rhino.ApplicationSettings.KeyboardShortcut.Macro
Macro to execute when key plus modifier are pressed
Since: 8.12