Rhino.ApplicationSettings.LicenseNode
License node types.
Since: 5.0

Rhino.ApplicationSettings.LicenseNode.Standalone
An independent node.

Rhino.ApplicationSettings.LicenseNode.Network
Network (obtains license from Zoo server)

Rhino.ApplicationSettings.LicenseNode.NetworkCheckedOut
Network (has license checked out from Zoo server)