Rhino.Symbols
Characters used for different 'drafting style' symbols

Rhino.Symbols.DegreeSymbol
Degree symbol used for angles
Since: 6.0

Rhino.Symbols.RadiusSymbol
Radius symbol
Since: 6.0

Rhino.Symbols.DiameterSymbol
Diameter symbol
Since: 6.0

Rhino.Symbols.PlusMinusSymbol
Plus-Minus tolerance symbol
Since: 6.0