Rhino.FileIO.File3dmDisplacement.SweepResolutionFormulas
Formula to use to calculate sweep resolution from initial quality.
Since: 8.0

Rhino.FileIO.File3dmDisplacement.SweepResolutionFormulas.Default
Default formula.

Rhino.FileIO.File3dmDisplacement.SweepResolutionFormulas.AbsoluteToleranceDependent
Formula used in Rhino 5. Dependent on absolute tolerance.