Rhino.Geometry.Morphs.SporphSpaceMorph
Deforms an object from a source surface to a target surface.

Rhino.Geometry.Morphs.SporphSpaceMorph.#ctor(Rhino.Geometry.Surface,Rhino.Geometry.Surface)
Constructs a Sporph space morph.
surface0: Base surface.
surface1: Target surface.
Since: 5.9

Rhino.Geometry.Morphs.SporphSpaceMorph.#ctor(Rhino.Geometry.Surface,Rhino.Geometry.Surface,Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)
Constructs a Sporph space morph.
surface0: Base surface.
surface1: Target surface.
surface0Param: U,V parameter on surface0 used for orienting.
surface1Param: U,V parameter on surface1 used for orienting.
Since: 5.9

Rhino.Geometry.Morphs.SporphSpaceMorph.IsValid
Returns true if the space morph definition is valid, false otherwise.
Since: 5.9

Rhino.Geometry.Morphs.SporphSpaceMorph.ConstrainNormal
Specifies how the normal direction of the base surface is mapped onto the target surface.
To use the target surface normal, set to Rhino.Geometry.Vector3d.Unset.
Since: 7.12

Rhino.Geometry.Morphs.SporphSpaceMorph.MorphPoint(Rhino.Geometry.Point3d)
Morphs an Euclidean point.
point: A point that will be morphed by this object.
Returns: Resulting morphed point.
Since: 5.9

Rhino.Geometry.Morphs.SporphSpaceMorph.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Geometry.Morphs.SporphSpaceMorph.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.9

Rhino.Geometry.Morphs.SporphSpaceMorph.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.