Rhino.FileIO.FileObjReadOptions.UseObjOsAs
Since: 8.5

Rhino.FileIO.FileObjReadOptions.UseObjOsAs.IgnoreObjObjects
OBJ "o"s in the file are ignored

Rhino.FileIO.FileObjReadOptions.UseObjOsAs.ObjObjectsAsLayers
OBJ "o"s in the file will become Rhino layers

Rhino.FileIO.FileObjReadOptions.UseObjOsAs.ObjObjectsAsGroups
OBJ "o"s in the file will become Rhino groups

Rhino.FileIO.FileObjReadOptions.UseObjOsAs.ObjObjectsAsObjects
OBJ "o"s in the file will become Rhino objects