Rhino.Runtime.RhinoAccounts.RhinoAccountsAuthTokenMismatchException
Exception thrown when the currently logged in user is different from the newly logged in user.

Rhino.Runtime.RhinoAccounts.RhinoAccountsAuthTokenMismatchException.#ctor(System.String,System.String,System.Exception)
Generates a new instance of the exception.
currentUsername: The name of the currently logged in user.
newUsername: The name of the newly logged in user.
innerException: The inner exception.
Since: 7.0

Rhino.Runtime.RhinoAccounts.RhinoAccountsAuthTokenMismatchException.#ctor(System.String,System.Exception)
Generates a new instance of the exception.
message: The message of the exception.
innerException: The inner exception.
Since: 7.0

Rhino.Runtime.RhinoAccounts.RhinoAccountsAuthTokenMismatchException.#ctor(System.Exception)
Generates a new instance of the exception.
innerException: The inner exception.
Since: 7.0