Rhino.Render.Fields.IntField
Integer field value class

Rhino.Render.Fields.IntField.#ctor(Rhino.Render.RenderContent,System.IntPtr)
Constructor
renderContent: RenderContent whose Fields owns this filed.
attachToPointer: Existing C++ pointer to attach to.

Rhino.Render.Fields.IntField.Value
Gets or sets the field value
Since: 5.1

Rhino.Render.Fields.IntField.ValueAsObject
Since: 5.7