Rhino.Render.SimulatedTexture.#ctor
Since: 5.1
7.6

Rhino.Render.SimulatedTexture.#ctor(Rhino.RhinoDoc)
Since: 7.6

Rhino.Render.SimulatedTexture.#ctor(Rhino.DocObjects.Texture)
Since: 7.4
7.6

Rhino.Render.SimulatedTexture.#ctor(Rhino.RhinoDoc,Rhino.DocObjects.Texture)
Since: 7.6

Rhino.Render.SimulatedTexture.BitmapSize
Since: 5.1

Rhino.Render.SimulatedTexture.LocalMappingTransform
Since: 5.1

Rhino.Render.SimulatedTexture.Filename
Since: 5.1

Rhino.Render.SimulatedTexture.OriginalFilename
Since: 5.1

Rhino.Render.SimulatedTexture.Repeat
Since: 5.1

Rhino.Render.SimulatedTexture.Offset
Since: 5.1

Rhino.Render.SimulatedTexture.Rotation
Since: 5.1

Rhino.Render.SimulatedTexture.Repeating
Since: 5.1

Rhino.Render.SimulatedTexture.MappingChannel
Since: 5.1

Rhino.Render.SimulatedTexture.ProjectionMode
Since: 5.1

Rhino.Render.SimulatedTexture.SetMappingChannelAndProjectionMode(Rhino.Render.SimulatedTexture.ProjectionModes,System.Int32,Rhino.Render.SimulatedTexture.EnvironmentMappingModes)
Since: 6.0

Rhino.Render.SimulatedTexture.HasTransparentColor
Since: 5.1

Rhino.Render.SimulatedTexture.TransparentColor
Since: 5.1

Rhino.Render.SimulatedTexture.TransparentColorSensitivity
Since: 5.1

Rhino.Render.SimulatedTexture.Filtered
Since: 5.1

Rhino.Render.SimulatedTexture.UnitsToMeters(System.Double)
Since: 5.1
6.0

Rhino.Render.SimulatedTexture.UnitsToMeters(Rhino.RhinoDoc,System.Double)
Since: 6.0

Rhino.Render.SimulatedTexture.MetersToUnits(System.Double)
Since: 5.1
6.0

Rhino.Render.SimulatedTexture.MetersToUnits(Rhino.RhinoDoc,System.Double)
Since: 6.0

Rhino.Render.SimulatedTexture.Texture
Since: 5.1

Rhino.Render.SimulatedTexture.Dispose
Since: 5.1

Rhino.Render.SimulatedTexture.ConstPointer
Since: 5.1