Rhino.Render.PostEffects.PostEffectFactoryBase
To register a pep plugin create factory from PostEffectFactory.
The factory should be public and have a public constructor in order
for it to be able to register itself.
Use Rhino.UI.Controls.FactoryBase.Register() to register it. This will register
all rdk factories that are expoerted and have a public constructor.

Rhino.Render.PostEffects.PostEffectFactoryBase.#ctor
This class allows you to provide a factory for generating a custom post-effect plug-in.
Since: 7.0

Rhino.Render.PostEffects.PostEffectFactoryBase.NewPostEffect
Create the new post effect instance.
Returns: Return an instance to the new post effect object. Do not return null.
Since: 7.0

Rhino.Render.PostEffects.PostEffectFactoryBase.PlugInId
Plugin id
Returns: Plugin id
Since: 7.0