Rhino.UI.Controls.CollapsibleSectionHolderImpl.#ctor(Rhino.UI.Controls.ICollapsibleSectionHolder)
Since: 6.0

Rhino.UI.Controls.CollapsibleSectionHolderImpl.Dispose
Since: 6.0

Rhino.UI.Controls.CollapsibleSectionHolderImpl.CppPointer
Since: 6.0

Rhino.UI.Controls.CollapsibleSectionHolderImpl.Find(System.IntPtr)
Since: 6.0

Rhino.UI.Controls.CollapsibleSectionHolderImpl.IsSameObject(System.IntPtr)
Since: 6.0

Rhino.UI.Controls.CollapsibleSectionHolderImpl.NewNativeWrapper(System.IntPtr)
Since: 6.0