Rhino.DocObjects.MaterialRefCreateParams
Options passed to MaterialRefs.Create

Rhino.DocObjects.MaterialRefCreateParams.PlugInId
Identifies a rendering plug-in
Since: 5.10

Rhino.DocObjects.MaterialRefCreateParams.MaterialSource
Determines if the simple material should come from the object or from
it's layer.
Since: 5.10

Rhino.DocObjects.MaterialRefCreateParams.FrontFaceMaterialId
The Id of the Material used to render the front of an object.
Since: 5.10

Rhino.DocObjects.MaterialRefCreateParams.FrontFaceMaterialIndex
The index of the material used to render the front of an object
Since: 5.10

Rhino.DocObjects.MaterialRefCreateParams.BackFaceMaterialId
The Id of the Material used to render the back of an object.
Since: 5.10

Rhino.DocObjects.MaterialRefCreateParams.BackFaceMaterialIndex
The index of the material used to render the back of an object
Since: 5.10