Rhino.Render.PostEffects.PostEffectsImpl.CopyFrom(Rhino.Render.FreeFloatingBase)
Since: 7.0

Rhino.Render.PostEffects.PostEffectsImpl.PostEffectFromId(System.Guid)
Since: 7.0

Rhino.Render.PostEffects.PostEffectsImpl.GetPostEffects(Rhino.Render.PostEffects.PostEffectType)
Since: 7.0