Rhino.DocObjects.Tables.LightTable.Document
Document that owns this light table.
Since: 5.0

Rhino.DocObjects.Tables.LightTable.Sun
Gets the Sun instance that is applied to the document.
If the RDK is loaded, an instance is always returned.
Throws Rhino.Runtime.RdkNotLoadedException: If the RDK is not loaded.
Since: 5.0

Rhino.DocObjects.Tables.LightTable.Skylight
Since: 6.0

Rhino.DocObjects.Tables.LightTable.Count
Number of lights in the light table.  Does not include Sun or Skylight.
Since: 5.0

Rhino.DocObjects.Tables.LightTable.ComponentType
Since: 6.0

Rhino.DocObjects.Tables.LightTable.Find(System.Guid,System.Boolean)
Since: 5.0

Rhino.DocObjects.Tables.LightTable.FindName(System.String)
Finds the LightObject with a given name.
Deleted lights have no name.
name: Name to search.
Returns:
A layer. If no layer is found, null is returned.
Since: 6.0

Rhino.DocObjects.Tables.LightTable.FindNameHash(Rhino.FileIO.NameHash)
Finds a LightObject given its name hash.
nameHash: The name hash of the LightObject to be searched.
Returns: A LightObject, or null on error.
Since: 6.0

Rhino.DocObjects.Tables.LightTable.FindIndex(System.Int32)
Retrieves a  object based on Index. This search type of search is discouraged.
We are moving towards using only IDs for all tables.
index: The index to search for.
Returns: A  object, or null if none was found.
Since: 6.0

Rhino.DocObjects.Tables.LightTable.Add(Rhino.Geometry.Light)
Since: 5.0

Rhino.DocObjects.Tables.LightTable.Add(Rhino.Geometry.Light,Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.Tables.LightTable.Delete(System.Int32,System.Boolean)
Since: 6.0

Rhino.DocObjects.Tables.LightTable.Delete(Rhino.DocObjects.LightObject)
Since: 6.0

Rhino.DocObjects.Tables.LightTable.Undelete(System.Int32)
Restores a light that has been deleted.
index: A light index to be undeleted.
Returns: true if successful.
Since: 8.8

Rhino.DocObjects.Tables.LightTable.Modify(System.Guid,Rhino.Geometry.Light)
Since: 5.0

Rhino.DocObjects.Tables.LightTable.Modify(System.Int32,Rhino.Geometry.Light)
Since: 5.0

Rhino.DocObjects.Tables.LightTable.GetEnumerator
Since: 5.0