Rhino.FileIO.DracoCompressionOptions
Options for applying Draco compression

Rhino.FileIO.DracoCompressionOptions.#ctor
Initializes to default options
Since: 7.0

Rhino.FileIO.DracoCompressionOptions.CompressionLevel
Compression level. 0 if fastest, but least compression. 10 is slowest, but best compression
Since: 7.0

Rhino.FileIO.DracoCompressionOptions.PositionQuantizationBits
Sets the quantization compression options for position values. The
values will be quantized in a box defined by the maximum extent
of the values. I.e., the actual precision of this option depends
on the scale of the attribute values.
Since: 7.0

Rhino.FileIO.DracoCompressionOptions.TextureCoordintateQuantizationBits
Sets the quantization compression options for texture coordinate
values. The values will be quantized in a box defined by the maximum
extent of the values. I.e., the actual precision of this option depends
on the scale of the attribute values.
Since: 7.0

Rhino.FileIO.DracoCompressionOptions.NormalQuantizationBits
Sets the quantization compression options for normal values. The
values will be quantized in a box defined by the maximum extent
of the values. I.e., the actual precision of this option depends
on the scale of the attribute values.
Since: 7.0

Rhino.FileIO.DracoCompressionOptions.IncludeNormals
Include vertex normals in the compressed data.

Rhino.FileIO.DracoCompressionOptions.IncludeTextureCoordinates
Include texture coordinates in the compressed data.

Rhino.FileIO.DracoCompressionOptions.IncludeVertexColors
Include vertex colors in the compressed data.

Rhino.FileIO.DracoCompressionOptions.VertexColorFormat
Color format of vertex colors in compressed data