Rhino.Geometry.SubDComponent.SubDComponentPtr
An ON_SubDComponentPtr: a component pointer, a direction bit and a component type
packed into one 8 byte integer. This is not a general purpose type; it exists so
that a SubDComponent can hold everything the unmanaged side needs, including the
orientation an edge or face is being referenced with.

Rhino.Geometry.SubDComponent.SubDComponentPtr.BasePointer
The component pointer, with the type and direction bits cleared.

Rhino.Geometry.SubDComponent.SubDComponentPtr.Direction
True when the component is referenced reversed from its natural orientation.

Rhino.Geometry.SubDComponent.SubDComponentPtr.Create(System.IntPtr,Rhino.Geometry.SubDComponent.SubDComponentPtrTypesAndMasks,System.Boolean)
Packs a raw component pointer with a type and a direction.

Rhino.Geometry.SubDComponent.SubDComponentPtr.Reversed
Same component and type, with the direction bit flipped.