Rhino.DocObjects.RhinoObjectSelectionEventArgs.Selected
Returns true if objects are being selected.
Returns false if objects are being deselected.
Since: 5.0

Rhino.DocObjects.RhinoObjectSelectionEventArgs.Document
Since: 5.0

Rhino.DocObjects.RhinoObjectSelectionEventArgs.RhinoObjectCount
Can be faster to call than RhinoObjects.Length
Since: 8.10

Rhino.DocObjects.RhinoObjectSelectionEventArgs.RhinoObjects
Since: 5.0