Rhino.FileIO.SerializationOptions
Contains options for serializing -or storing- data,
such as Rhino version, user data, and meshes.

Rhino.FileIO.SerializationOptions.#ctor
Initializes a new instance of the Rhino.FileIO.SerializationOptions class.
Since: 5.0

Rhino.FileIO.SerializationOptions.MinRhinoVersion
Gets the earliest serialization version available.
Since: 8.19

Rhino.FileIO.SerializationOptions.MaxRhinoVersion
Gets the most recent serialization version available.
Since: 8.19

Rhino.FileIO.SerializationOptions.RhinoVersion
Gets or sets a value indicating the Rhino version.
Since: 5.0

Rhino.FileIO.SerializationOptions.WriteUserData
Gets or sets a value indicating whether to write user data.
Since: 5.0

Rhino.FileIO.SerializationOptions.WriteRenderMeshes
Gets or sets a value indicating whether to write render meshes
Since: 8.4

Rhino.FileIO.SerializationOptions.WriteAnalysisMeshes
Gets or sets a value indicating whether to write analysis meshes
Since: 8.4