Rhino.Runtime.CommonObject
Base class for .NET classes that wrap C++ unmanaged Rhino classes.

Rhino.Runtime.CommonObject.PerformCorruptionTesting
Used to test ON_Object* pointers to see if they are a brep or mesh that is corrupt enough to crash Rhino.
Since: 6.10

Rhino.Runtime.CommonObject.NonConstOperation
For derived classes implementers.
Defines the necessary implementation to free the instance from being constant.

Rhino.Runtime.CommonObject.OnSwitchToNonConst
Is called when a non-constant operation first occurs.

Rhino.Runtime.CommonObject.EnsurePrivateCopy
If you want to keep a copy of this class around by holding onto it in a variable after a command
completes, call EnsurePrivateCopy to make sure that this class is not tied to the document. You can
call this function as many times as you want.
Since: 5.0

Rhino.Runtime.CommonObject.IsDocumentControlled
If true this object may not be modified. Any properties or functions that attempt
to modify this object when it is set to "IsReadOnly" will throw a NotSupportedException.
Since: 5.0

Rhino.Runtime.CommonObject.ReleaseNonConstPointer
Used for "temporary" wrapping of objects that we don't want .NET to destruct
on disposal.

Rhino.Runtime.CommonObject.ConstructConstObject(System.Object,System.Int32)
Assigns a parent object and a sub-object index to this.
parentObject: The parent object.
subobjectIndex: The sub-object index.

Rhino.Runtime.CommonObject.IsValid
Tests an object to see if it is valid.
Since: 5.0

Rhino.Runtime.CommonObject.IsValidWithLog(System.String@)
Determines if an object is valid. Also provides a report on errors if this
object happens not to be valid.
log: A textual log. This out parameter is assigned during this call.
Returns: true if this object is valid; false otherwise.
Since: 5.0

Rhino.Runtime.CommonObject.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.CommonObject.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0

Rhino.Runtime.CommonObject.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.Runtime.CommonObject.Disposed
Indicates if this object has been disposed or the
document it originally belonged to has been disposed.
Since: 6.0

Rhino.Runtime.CommonObject.#ctor
Allows construction from inheriting classes.

Rhino.Runtime.CommonObject.HasUserData
Gets true if this class has any custom information attached to it through UserData.
Since: 5.0

Rhino.Runtime.CommonObject.UserData
List of custom information that is attached to this class.
Since: 5.0

Rhino.Runtime.CommonObject.UserDictionary
Dictionary of custom information attached to this class. The dictionary is actually user
data provided as an easy to use shareable set of information.
Since: 5.0

Rhino.Runtime.CommonObject.EmptyUserString
Returns the string " ". This is the string Rhino uses to empty out a user string entry.

Rhino.Runtime.CommonObject._SetUserString(System.String,System.String)
Attach a user string (key,value combination) to this geometry.
key: id used to retrieve this string.
value: string associated with key.
Returns: true on success.

Rhino.Runtime.CommonObject._GetUserString(System.String)
Gets user string from this geometry.
key: id used to retrieve the string.
Returns: string associated with the key if successful. null if no key was found.

Rhino.Runtime.CommonObject._UserStringCount
Gets the amount of user strings.

Rhino.Runtime.CommonObject._GetUserStrings
Gets a copy of all (user key string, user value string) pairs attached to this geometry.
Returns: A new collection.

Rhino.Runtime.CommonObject.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor for internal use.
info: Serialization data.
context: Serialization stream.

Rhino.Runtime.CommonObject.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Populates a System.Runtime.Serialization.SerializationInfo with the data needed to serialize the target object.
info: The System.Runtime.Serialization.SerializationInfo to populate with data.
context: The destination (see System.Runtime.Serialization.StreamingContext) for this serialization.
Since: 5.0

Rhino.Runtime.CommonObject.FromBase64String(System.Int32,System.Int32,System.String)
Create a CommonObject instance from a Base64 encoded string. This is typically the values
used when passing common objects around as JSON data
archive3dm:
opennurbs:
base64Data:
Returns:
Since: 7.0

Rhino.Runtime.CommonObject.FromJSON(System.String)
Create a CommonObject instance from a JSON string
json:
Returns:
Since: 7.5

Rhino.Runtime.CommonObject.FromJSON(System.Collections.Generic.Dictionary{System.String,System.String})
Create a CommonObject instance from a JSON dictionary
jsonDictionary:
Returns:
Since: 7.0

Rhino.Runtime.CommonObject.ToJSON(Rhino.FileIO.SerializationOptions)
Create a JSON string representation of this object
options:
Returns:
Since: 7.0