Rhino.Geometry.Cylinder
Represents the values of a plane, a radius and two heights -on top and beneath-
that define a right circular cylinder.

Rhino.Geometry.Cylinder.Unset
Gets an invalid Cylinder.
Since: 5.0

Rhino.Geometry.Cylinder.#ctor(Rhino.Geometry.Circle)
Constructs a new cylinder with infinite height.
baseCircle: Base circle for infinite cylinder.
Since: 5.0

Rhino.Geometry.Cylinder.#ctor(Rhino.Geometry.Circle,System.Double)
Constructs a new cylinder with a finite height.
baseCircle: Base circle for cylinder.
height: Height of cylinder (zero for infinite cylinder).
Since: 5.0

Rhino.Geometry.Cylinder.IsValid
Gets a boolean value indicating whether this cylinder is valid.
A valid cylinder is represented by a valid circle and two valid heights.
Since: 5.0

Rhino.Geometry.Cylinder.IsFinite
true if the cylinder is finite (Height0 != Height1)
false if the cylinder is infinite.
Since: 5.0

Rhino.Geometry.Cylinder.Center
Gets the center point of the defining circle.
Since: 5.0

Rhino.Geometry.Cylinder.Axis
Gets the axis direction of the cylinder.
Since: 5.0

Rhino.Geometry.Cylinder.TotalHeight
Gets the height of the cylinder.
Infinite cylinders have a height of zero, not Double.PositiveInfinity.
Since: 5.0

Rhino.Geometry.Cylinder.Height1
Gets or sets the start height of the cylinder.
The center of bottom cap is: BasePlane.Origin + Height1 * BasePlane.ZAxis.
Since: 5.0

Rhino.Geometry.Cylinder.Height2
Gets or sets the end height of the cylinder.
If the end height equals the start height, the cylinder is
presumed to be infinite.
The center of top cap is: BasePlane.Origin + Height2 * BasePlane.ZAxis.
Since: 5.0

Rhino.Geometry.Cylinder.Radius
Gets or sets the radius of the cylinder.
Since: 6.0

Rhino.Geometry.Cylinder.BasePlane
Gets or sets the base plane of the cylinder.
Since: 6.0

Rhino.Geometry.Cylinder.CircleAt(System.Double)
Compute the circle at the given elevation parameter.
linearParameter: Height parameter for circle section.
Since: 5.0

Rhino.Geometry.Cylinder.LineAt(System.Double)
Compute the line at the given angle parameter. This line will be degenerate if the cylinder is infinite.
angularParameter: Angle parameter for line section.
Since: 5.0

Rhino.Geometry.Cylinder.Transform(Rhino.Geometry.Transform)
Transforms this cylinder. Note that non-similarity preserving transformations
cannot be applied to a cylinder.
xform: Transformation matrix to apply.
Returns: true on success, false on failure.
Since: 8.15

Rhino.Geometry.Cylinder.ToBrep(System.Boolean,System.Boolean)
Constructs a Brep representation of this Cylinder.
This is synonymous with calling NurbsSurface.CreateFromCylinder().
capBottom: If true, the bottom of the cylinder will be capped.
capTop: If true, the top of the cylinder will be capped.
Returns: A Brep representation of the cylinder or null.
Since: 5.0

Rhino.Geometry.Cylinder.ToNurbsSurface
Constructs a Nurbs surface representation of this cylinder.
This is synonymous with calling NurbsSurface.CreateFromCylinder().
Returns: A Nurbs surface representation of the cylinder or null.
Since: 5.0

Rhino.Geometry.Cylinder.ToRevSurface
Constructs a RevSurface representation of this Cylinder.
This is synonymous with calling RevSurface.CreateFromCylinder().
Returns: A RevSurface representation of the cylinder or null.
Since: 5.0

Rhino.Geometry.Cylinder.EpsilonEquals(Rhino.Geometry.Cylinder,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:
Since: 5.4