Rhino.DocObjects.DimensionStyle.ArrowType
Defines enumerated values for arrowhead shapes.

Rhino.DocObjects.DimensionStyle.ArrowType.None


Rhino.DocObjects.DimensionStyle.ArrowType.UserBlock


Rhino.DocObjects.DimensionStyle.ArrowType.SolidTriangle


Rhino.DocObjects.DimensionStyle.ArrowType.Dot


Rhino.DocObjects.DimensionStyle.ArrowType.Tick


Rhino.DocObjects.DimensionStyle.ArrowType.ShortTriangle


Rhino.DocObjects.DimensionStyle.ArrowType.OpenArrow


Rhino.DocObjects.DimensionStyle.ArrowType.Rectangle


Rhino.DocObjects.DimensionStyle.ArrowType.LongTriangle


Rhino.DocObjects.DimensionStyle.ArrowType.LongerTriangle
