Rhino.FileIO.ContentHash
Contains information that is useful to uniquely identify an object.
Remarks: This object is immutable.

Rhino.FileIO.ContentHash.#ctor(Rhino.FileIO.ContentHash)
Constructs a copy of a content hash.
other: The other content hash to copy.

Rhino.FileIO.ContentHash.#ctor(System.Byte[],System.UInt64,System.Byte[],System.UInt64,System.UInt64)
Constructs a new instance of the content hash class.
sha1NameHash: Provide an immutable copy of this array or use the public constructor.
byteCount: Length in bytes.
sha1ContentHash: Provide an immutable copy of this array or use the public constructor.
hashTime: Seconds from UNIX epoch.
contentLastModifiedTime: Seconds from UNIX epoch.

Rhino.FileIO.ContentHash.Sha1NameHash
Gets the 20-bytes long SHA1 hash of the name.
Since: 6.0

Rhino.FileIO.ContentHash.ByteCount
Gets the length of the content, in bytes.
Since: 6.0

Rhino.FileIO.ContentHash.Sha1ContentHash
Gets the 20-bytes long SHA1 hash of the content.
Since: 6.0

Rhino.FileIO.ContentHash.HashTime
Gets the hash time, rounded to seconds.
Since: 6.0

Rhino.FileIO.ContentHash.GetDisposableHandle
Be responsible: call Dispose()

Rhino.FileIO.ContentHash.CreateFromFile(System.String)
Creates a new ContentHash, representing the content of a file.
path: A path. This can be null and can refer to a non-existing path.
Returns:
Since: 6.0

Rhino.FileIO.ContentHash.System#ICloneable#Clone
Since: 6.0

Rhino.FileIO.ContentHash.Clone
Creates a copy of this content hash.
Because content hash is immutable, this can be used as a deep copy.
Returns: A different instance of the same content hash.
Since: 6.0

Rhino.FileIO.ContentHash.Equals(Rhino.FileIO.ContentHash)
Determines if another content hash has the same value.
other: The other content hash to compare.
Returns: True if the two hashes are equal.
Since: 6.0

Rhino.FileIO.ContentHash.Equals(System.Object)
Determines if another object is a content hash with same value.
obj: The other content hash to compare.
Returns: True if the two hashes are equal.

Rhino.FileIO.ContentHash.GetHashCode
Gets an hash code for this content hash.
Two equal content hashes have equal hash code. The other way around might not be true.
Returns: An hash code value.

Rhino.FileIO.ContentHash.op_Equality(Rhino.FileIO.ContentHash,Rhino.FileIO.ContentHash)
Determines if two ContentHash instances are equal by value.
left: The first hash.
right: The second hash.
Returns: True if they are equal by value, otherwise false.
Since: 6.0

Rhino.FileIO.ContentHash.op_Inequality(Rhino.FileIO.ContentHash,Rhino.FileIO.ContentHash)
Determines if two ContentHash instances are different by value.
left: The first hash.
right: The second hash.
Returns: True if they are different by value, otherwise false.
Since: 6.0