Rhino.FileIO.FileUsdWriteOptions
Options for writing a USD file

Rhino.FileIO.FileUsdWriteOptions.MeshingParameters
Since: 8.0

Rhino.FileIO.FileUsdWriteOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0