Rhino.Runtime.InteropWrappers.StdVectorGuid
Wrapper for std::vector<ON_UUID>. If you are not writing C++ code
then this class is not for you.

Rhino.Runtime.InteropWrappers.StdVectorGuid.ConstPointer
Gets the constant (immutable) pointer of this vector.
Returns: The constant pointer.
Since: 5.0

Rhino.Runtime.InteropWrappers.StdVectorGuid.NonConstPointer
Gets the non-constant pointer (for modification) of this vector.
Returns: The non-constant pointer.
Since: 5.0

Rhino.Runtime.InteropWrappers.StdVectorGuid.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.StdVectorGuid class.
Since: 5.0

Rhino.Runtime.InteropWrappers.StdVectorGuid.#ctor(System.Collections.Generic.IEnumerable{System.Guid})
Initializes a new Rhino.Runtime.InteropWrappers.StdVectorGuid class
values: initial set of Guids to add to the array
Since: 7.0

Rhino.Runtime.InteropWrappers.StdVectorGuid.Item(System.UInt64)
Get the Guid at index
index:
Returns:

Rhino.Runtime.InteropWrappers.StdVectorGuid.Append(System.Guid)
Appends a new System.Guid at the end of this vector.
Since: 6.0

Rhino.Runtime.InteropWrappers.StdVectorGuid.Count
Gets the amount of elements in this vector.
Since: 5.0

Rhino.Runtime.InteropWrappers.StdVectorGuid.ToArray
Returns the managed counterpart of the unmanaged vector.
Returns: The managed array.
Since: 5.0

Rhino.Runtime.InteropWrappers.StdVectorGuid.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.StdVectorGuid.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0