Rhino.Geometry.NurbsSurface
Represents a Non Uniform Rational B-Splines (NURBS) surface.

Rhino.Geometry.NurbsSurface.Create(System.Int32,System.Boolean,System.Int32,System.Int32,System.Int32,System.Int32)
Constructs a new NURBS surface with internal uninitialized arrays.
dimension: The number of dimensions.>= 1. This value is usually 3.
isRational: true to make a rational NURBS.
order0: The order in U direction.>= 2.
order1: The order in V direction.>= 2.
controlPointCount0: Control point count in U direction.>= order0.
controlPointCount1: Control point count in V direction.>= order1.
Returns: A new NURBS surface, or null on error.
Since: 5.0

Rhino.Geometry.NurbsSurface.CreateFromCone(Rhino.Geometry.Cone)
Constructs a new NURBS surfaces from cone data.
cone: A cone value.
Returns: A new NURBS surface, or null on error.
Since: 5.0

Rhino.Geometry.NurbsSurface.CreateFromCylinder(Rhino.Geometry.Cylinder)
Constructs a new NURBS surfaces from cylinder data.
cylinder: A cylinder value.
Returns: A new NURBS surface, or null on error.
Since: 5.0

Rhino.Geometry.NurbsSurface.CreateFromSphere(Rhino.Geometry.Sphere)
Constructs a new NURBS surfaces from sphere data.
sphere: A sphere value.
Returns: A new NURBS surface, or null on error.
Since: 5.0

Rhino.Geometry.NurbsSurface.CreateFromTorus(Rhino.Geometry.Torus)
Constructs a new NURBS surfaces from torus data.
torus: A torus value.
Returns: A new NURBS surface, or null on error.
Since: 5.0

Rhino.Geometry.NurbsSurface.CreateRuledSurface(Rhino.Geometry.Curve,Rhino.Geometry.Curve)
Constructs a ruled surface between two curves. Curves must share the same knot-vector.
curveA: First curve.
curveB: Second curve.
Returns: A ruled surface on success or null on failure.
Since: 5.0

Rhino.Geometry.NurbsSurface.MakeUniform(System.Int32)
Changes a NURBS surface so each control point affects the surface exactly the same way.
This make the knot vectors uniform without changing the control point locations.
This will change the object shape slightly.
direction:
Specify 0 for "u" direction, 1 for "v" direction, or 2 for both directions.
Returns: True if successful, false otherwise.
Since: 8.24

Rhino.Geometry.NurbsSurface.FindClosestIsoCurve(Rhino.Geometry.Point3d)
Find the closest isoparamentric curve, given a test point.
testPoint: The test point.
Returns: The enumeration.
Since: 8.0

Rhino.Geometry.NurbsSurface.MatchToCurve(Rhino.Geometry.IsoStatus,Rhino.Geometry.Curve,System.Double,System.Double,System.Double,System.Int32)
Constructs a NURBS surface with start and end edge isocurve matching the start and end of targetCurve, and Greville points on targetCurve.
side: The isoparamentric curve direction.
targetCurve: The target curve.
maxEndDistance:
If maxEndDistance dist > 0, the edge isocurve must be within maxEndDistance of targetCurve start.
If maxEndDistance dist > 0, the edge isocurve must be within maxEndDistance of targetCurve end.
maxInteriorDistance:
If maxInteriorDistance > 0, all interior Greville points of the edge isocurve must be within maxInteriorDistance of targetCurve.
matchTolerance: The matching tolerance.
maxLevel:
If maxLevel > 0, the result will be refined up to that many times, attempting to get the result within matchTolerance.
If matchTolerance <= 0, no refinement will be done.
In any case, the parameters closest points on targetCurve of the Greville points of the edge isocurve must be monotonic increasing.
Returns: Surface on success, null on failure.
Since: 8.0

Rhino.Geometry.NurbsSurface.CreateSubDFriendly(Rhino.Geometry.Surface)
Create a bi-cubic SubD friendly surface from a surface.
surface: >Surface to rebuild as a SubD friendly surface.
Returns: A SubD friendly NURBS surface is successful, null otherwise.
Since: 7.0

Rhino.Geometry.NurbsSurface.CreateFromPlane(Rhino.Geometry.Plane,Rhino.Geometry.Interval,Rhino.Geometry.Interval,System.Int32,System.Int32,System.Int32,System.Int32)
Creates a NURBS surface from a plane and additional parameters.
plane: The plane.
uInterval: The interval describing the extends of the output surface in the U direction.
vInterval: The interval describing the extends of the output surface in the V direction.
uDegree: The degree of the output surface in the U direction.
vDegree: The degree of the output surface in the V direction.
uPointCount: The number of control points of the output surface in the U direction.
vPointCount: The number of control points of the output surface in the V direction.
Returns: A NURBS surface if successful, or null on failure.
Since: 7.0

Rhino.Geometry.NurbsSurface.CreateCurveOnSurfacePoints(Rhino.Geometry.Surface,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d},System.Double,System.Boolean,System.Int32,System.Int32)
Computes a discrete spline curve on the surface. In other words, computes a sequence
of points on the surface, each with a corresponding parameter value.
surface:
The surface on which the curve is constructed. The surface should be G1 continuous.
If the surface is closed in the u or v direction and is G1 at the seam, the
function will construct point sequences that cross over the seam.
fixedPoints: Surface points to interpolate given by parameters. These must be distinct.
tolerance: Relative tolerance used by the solver. When in doubt, use a tolerance of 0.0.
periodic: When true constructs a smoothly closed curve.
initCount: Maximum number of points to insert between fixed points on the first level.
levels: The number of levels (between 1 and 3) to be used in multi-level solver. Use 1 for single level solve.
Returns:
A sequence of surface points, given by surface parameters, if successful.
The number of output points is approximately: 2 ^ (level-1) * initCount * fixedPoints.Count.
Remarks:
To create a curve from the output points, use Surface.CreateCurveOnSurface.
Since: 6.3

Rhino.Geometry.NurbsSurface.CreateCurveOnSurface(Rhino.Geometry.Surface,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d},System.Double,System.Boolean)
Fit a sequence of 2d points on a surface to make a curve on the surface.
surface: Surface on which to construct curve.
points: Parameter space coordinates of the points to interpolate.
tolerance: Curve should be within tolerance of surface and points.
periodic: When true make a periodic curve.
Returns: A curve interpolating the points if successful, null on error.
Remarks:
To produce the input points, use Surface.CreateCurveOnSurfacePoints.
Since: 6.3

Rhino.Geometry.NurbsSurface.MakeCompatible(Rhino.Geometry.Surface,Rhino.Geometry.Surface,Rhino.Geometry.NurbsSurface@,Rhino.Geometry.NurbsSurface@)
For expert use only. Makes a pair of compatible NURBS surfaces based on two input surfaces.
surface0: The first surface.
surface1: The second surface.
nurb0: The first output NURBS surface.
nurb1: The second output NURBS surface.
Returns: true if successful, false on failure.
Since: 6.0

Rhino.Geometry.NurbsSurface.CreateFromPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32,System.Int32,System.Int32,System.Int32)
Constructs a NURBS surface from a 2D grid of control points.
points: Control point locations.
uCount: Number of points in U direction.
vCount: Number of points in V direction.
uDegree: Degree of surface in U direction.
vDegree: Degree of surface in V direction.
Returns: A NurbsSurface on success or null on failure.
Remarks: uCount multiplied by vCount must equal the number of points supplied.
Since: 5.0

Rhino.Geometry.NurbsSurface.CreateThroughPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Int32,System.Int32,System.Int32,System.Int32,System.Boolean,System.Boolean)
Constructs a NURBS surface from a 2D grid of points.
points: Control point locations.
uCount: Number of points in U direction.
vCount: Number of points in V direction.
uDegree: Degree of surface in U direction.
vDegree: Degree of surface in V direction.
uClosed: true if the surface should be closed in the U direction.
vClosed: true if the surface should be closed in the V direction.
Returns: A NurbsSurface on success or null on failure.
Remarks: uCount multiplied by vCount must equal the number of points supplied.
Since: 5.0

Rhino.Geometry.NurbsSurface.CreateFromCorners(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Makes a surface from 4 corner points.
This is the same as calling Rhino.Geometry.NurbsSurface.CreateFromCorners(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double) with tolerance 0.
corner1: The first corner.
corner2: The second corner.
corner3: The third corner.
corner4: The fourth corner.
Returns: the resulting surface or null on error.
Since: 5.0

Rhino.Geometry.NurbsSurface.CreateFromCorners(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double)
Makes a surface from 4 corner points.
corner1: The first corner.
corner2: The second corner.
corner3: The third corner.
corner4: The fourth corner.
tolerance: Minimum edge length without collapsing to a singularity.
Returns: The resulting surface or null on error.
Since: 5.0

Rhino.Geometry.NurbsSurface.CreateFromCorners(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Makes a surface from 3 corner points.
corner1: The first corner.
corner2: The second corner.
corner3: The third corner.
Returns: The resulting surface or null on error.
Since: 5.0

Rhino.Geometry.NurbsSurface.CreateRailRevolvedSurface(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Line,System.Boolean)
Constructs a railed Surface-of-Revolution.
profile: Profile curve for revolution.
rail: Rail curve for revolution.
axis: Axis of revolution.
scaleHeight: If true, surface will be locally scaled.
Returns: A NurbsSurface or null on failure.
Since: 5.0

Rhino.Geometry.NurbsSurface.CreateNetworkSurface(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Int32,System.Int32,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Int32,System.Int32,System.Double,System.Double,System.Double,System.Int32@)
Builds a surface from an ordered network of curves/edges.
uCurves: An array, a list or any enumerable set of U curves.
uContinuityStart:
continuity at first U segment, 0 = loose, 1 = position, 2 = tan, 3 = curvature.
uContinuityEnd:
continuity at last U segment, 0 = loose, 1 = position, 2 = tan, 3 = curvature.
vCurves: An array, a list or any enumerable set of V curves.
vContinuityStart:
continuity at first V segment, 0 = loose, 1 = position, 2 = tan, 3 = curvature.
vContinuityEnd:
continuity at last V segment, 0 = loose, 1 = position, 2 = tan, 3 = curvature.
edgeTolerance: tolerance to use along network surface edge.
interiorTolerance: tolerance to use for the interior curves.
angleTolerance: angle tolerance to use.
error:
If the NurbsSurface could not be created, the error value describes where
the failure occurred.  0 = success,  1 = curve sorter failed, 2 = network initializing failed,
3 = failed to build surface, 4 = network surface is not valid.
Returns: A NurbsSurface or null on failure.
Since: 5.0

Rhino.Geometry.NurbsSurface.CreateNetworkSurface(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Int32,System.Double,System.Double,System.Double,System.Int32@)
Builds a surface from an auto-sorted network of curves/edges.
curves: An array, a list or any enumerable set of curves/edges, sorted automatically into U and V curves.
continuity: continuity along edges, 0 = loose, 1 = position, 2 = tan, 3 = curvature.
edgeTolerance: tolerance to use along network surface edge.
interiorTolerance: tolerance to use for the interior curves.
angleTolerance: angle tolerance to use.
error:
If the NurbsSurface could not be created, the error value describes where
the failure occurred.  0 = success,  1 = curve sorter failed, 2 = network initializing failed,
3 = failed to build surface, 4 = network surface is not valid.
Returns: A NurbsSurface or null on failure.
Since: 5.0

Rhino.Geometry.NurbsSurface.UVNDirectionsAt(System.Double,System.Double,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@)
Calculates the U, V, and N directions of a NURBS surface at a u,v parameter similar to the method used by Rhino's MoveUVN command.
u: The u evaluation parameter.
v: The v evaluation parameter.
uDir: The U direction.
vDir: The V direction.
nDir: The N direction.
Returns: true if successful, false otherwise.
Since: 7.0

Rhino.Geometry.NurbsSurface.#ctor(Rhino.Geometry.NurbsSurface)
Initializes a new NURBS surface by copying the values from another surface.
other: Another surface.
Since: 5.0

Rhino.Geometry.NurbsSurface.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor for internal use.
info: Serialization data.
context: Serialization stream.

Rhino.Geometry.NurbsSurface.KnotsU
The U direction knot vector.
Since: 5.0

Rhino.Geometry.NurbsSurface.KnotsV
The V direction knot vector.
Since: 5.0

Rhino.Geometry.NurbsSurface.Points
Gets a collection of surface control points that form this surface.
Since: 5.0

Rhino.Geometry.NurbsSurface.IsRational
Gets a value indicating whether or not the NURBS surface is rational.
Since: 5.0

Rhino.Geometry.NurbsSurface.MakeRational
Makes this surface rational.
Returns: true if the operation succeeded; otherwise, false.
Since: 5.0

Rhino.Geometry.NurbsSurface.MakeNonRational
Makes this surface non-rational.
Returns: true if the operation succeeded; otherwise, false.
Since: 5.0

Rhino.Geometry.NurbsSurface.IncreaseDegreeU(System.Int32)
Increase the degree of this surface in U direction.
desiredDegree: The desired degree.
Degrees should be number between and including 1 and 11.
Returns: true on success, false on failure.
Since: 5.10

Rhino.Geometry.NurbsSurface.IncreaseDegreeV(System.Int32)
Increase the degree of this surface in V direction.
desiredDegree: The desired degree.
Degrees should be number between and including 1 and 11.
Returns: true on success, false on failure.
Since: 5.10

Rhino.Geometry.NurbsSurface.CopyFrom(Rhino.Geometry.NurbsSurface)
Copies this NURBS surface from another NURBS surface.
other: The other NURBS surface to use as source.
Since: 5.0

Rhino.Geometry.NurbsSurface.ConvertSpanToBezier(System.Int32,System.Int32)
Convert a NURBS surface bispan into a Bezier surface.
spanIndex0: Specifies the "u" span
spanIndex1: Specifies the "v" span
Returns: Bezier surface on success
Since: 7.1

Rhino.Geometry.NurbsSurface.EpsilonEquals(Rhino.Geometry.NurbsSurface,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:
Since: 5.4

Rhino.Geometry.NurbsSurface.OrderU
Gets the order in the U direction.
Since: 5.0

Rhino.Geometry.NurbsSurface.OrderV
Gets the order in the V direction.
Since: 5.0