Rhino.ApplicationSettings.SelectionFilterSettings
Selection filter settings restrict any selection mode (SelWindow, SelCrossing, SelAll, etc.) to specified object types.
Note, selection filter settings are not persistent.

Rhino.ApplicationSettings.SelectionFilterSettings.GetDefaultState
Gets the factory settings of the application.
Since: 7.0

Rhino.ApplicationSettings.SelectionFilterSettings.GetCurrentState
Gets the current settings of the application.
Since: 7.0

Rhino.ApplicationSettings.SelectionFilterSettings.RestoreDefaults
Commits the default settings as the current settings.
Since: 7.0

Rhino.ApplicationSettings.SelectionFilterSettings.UpdateFromState(Rhino.ApplicationSettings.SelectionFilterSettingsState)
Sets all settings to a particular defined joined state.
state: The particular state.
Since: 7.0

Rhino.ApplicationSettings.SelectionFilterSettings.GlobalGeometryFilter
The global geometry type filter controls which types of geometry will be filtered.
Note, the filter can be a bitwise combination of multiple object types.
Since: 7.0

Rhino.ApplicationSettings.SelectionFilterSettings.OneShotGeometryFilter
The one-shot geometry type filter controls which types of geometry will be filtered for one selection.
Note, the filter can be a bitwise combination of multiple object types.
Since: 7.0

Rhino.ApplicationSettings.SelectionFilterSettings.Enabled
Enables or disables the global object selection filter.
Since: 7.0

Rhino.ApplicationSettings.SelectionFilterSettings.SubObjectSelect
Enables or disabled sub-object selection.
Since: 7.0