Rhino.Geometry.SubDEdgeSharpness
Sharpness values for the two ends of a SubD edge.
A sharp SubD edge is an edge where the limit surface makes a tighter "fillet radius"
around the edge than a smooth edge would, while still staying smooth, unlike a crease
edge. It is achieved by applying the crease edge subdivision rules for the number of
subdivisions given by the sharpness value, and the smooth edge subdivision rules after
that. Sharpness can differ at the two ends of an edge.
Remarks:
This is a value type wrapping two floats, and the default value is
Rhino.Geometry.SubDEdgeSharpness.Smooth. It is passed to and from the unmanaged library by value.
Rhino.Geometry.SubDEdge.Sharpness

Rhino.Geometry.SubDEdgeSharpness.MaximumValue
The largest valid sharpness value, 4.0.
Valid SubD edge sharpness values are between 0.0 and MaximumValue.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.SmoothValue
The sharpness value of a smooth edge, 0.0.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.CreaseValue
The value used to indicate that an edge is a crease, Rhino.Geometry.SubDEdgeSharpness.MaximumValue + 1.0.
This is deliberately not a valid sharpness value: a crease edge is not a sharp edge.
It exists because it is often convenient to use a single value to describe both.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.Tolerance
If a sharpness is within Tolerance of an integer value, it is snapped to that
integer value. See Rhino.Geometry.SubDEdgeSharpness.Sanitize(System.Double).
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.#ctor(System.Double)
Creates a sharpness with the same value at both ends.
sharpness:
Between 0.0 and Rhino.Geometry.SubDEdgeSharpness.MaximumValue, or Rhino.Geometry.SubDEdgeSharpness.CreaseValue.
Remarks:
If sharpness is not valid, the result is Rhino.Geometry.SubDEdgeSharpness.Nan.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.#ctor(System.Double,System.Double)
Creates a sharpness that varies from one end of the edge to the other.
sharpness0:
Sharpness at the start of the edge, between 0.0 and Rhino.Geometry.SubDEdgeSharpness.MaximumValue.
sharpness1:
Sharpness at the end of the edge, between 0.0 and Rhino.Geometry.SubDEdgeSharpness.MaximumValue.
Remarks:
If either value is not valid, the result is Rhino.Geometry.SubDEdgeSharpness.Nan.
Passing Rhino.Geometry.SubDEdgeSharpness.CreaseValue for both values gives Rhino.Geometry.SubDEdgeSharpness.Crease.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.#ctor(Rhino.Geometry.Interval)
Creates a sharpness that varies from one end of the edge to the other.
sharpnessInterval:
Sharpness at the start and end of the edge. Both values must be between 0.0 and
Rhino.Geometry.SubDEdgeSharpness.MaximumValue.
Remarks:
If either value is not valid, the result is Rhino.Geometry.SubDEdgeSharpness.Nan.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.FromConstantPercentage(System.Double)
Creates a sharpness with the same value at both ends, from a percentage.
This is useful in user interface code that expresses sharpness as a percentage.
percentage:
Between 0.0 and 100.0, or System.Double.MaxValue for a crease.
Returns:
A sharpness with constant value (percentage * Rhino.Geometry.SubDEdgeSharpness.MaximumValue / 100.0),
Rhino.Geometry.SubDEdgeSharpness.Crease if percentage is System.Double.MaxValue,
or Rhino.Geometry.SubDEdgeSharpness.Nan if percentage is out of range.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.FromIntervalPercentage(System.Double,System.Double)
Creates a sharpness that varies from one end of the edge to the other, from percentages.
This is useful in user interface code that expresses sharpness as a percentage.
percentage0:
Percentage at the start of the edge, between 0.0 and 100.0,
or System.Double.MaxValue for a crease.
percentage1:
Percentage at the end of the edge, between 0.0 and 100.0,
or System.Double.MaxValue for a crease.
Returns:
A sharpness running from (percentage0 * Rhino.Geometry.SubDEdgeSharpness.MaximumValue / 100.0) to
(percentage1 * Rhino.Geometry.SubDEdgeSharpness.MaximumValue / 100.0),
Rhino.Geometry.SubDEdgeSharpness.Crease if both percentages are System.Double.MaxValue,
or Rhino.Geometry.SubDEdgeSharpness.Nan otherwise. An edge is either a crease or it is not, so mixing
System.Double.MaxValue with a percentage gives Rhino.Geometry.SubDEdgeSharpness.Nan.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.FromIntervalPercentage(Rhino.Geometry.Interval)
Creates a sharpness that varies from one end of the edge to the other, from percentages.
This is useful in user interface code that expresses sharpness as a percentage.
percentageInterval:
Percentages at the start and end of the edge, each between 0.0 and 100.0,
or System.Double.MaxValue for a crease.
Returns: See Rhino.Geometry.SubDEdgeSharpness.FromIntervalPercentage(System.Double,System.Double).
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.Smooth
A sharpness of 0.0 at both ends, which is what a smooth edge has.
This is also the default value of a Rhino.Geometry.SubDEdgeSharpness.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.Maximum
A sharpness of Rhino.Geometry.SubDEdgeSharpness.MaximumValue at both ends. This is the sharpest an
edge can be without being a crease.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.Crease
A sharpness of Rhino.Geometry.SubDEdgeSharpness.CreaseValue at both ends, used to indicate that an
edge is a crease rather than a sharp edge. Rhino.Geometry.SubDEdgeSharpness.IsValid is false for this
value; see Rhino.Geometry.SubDEdgeSharpness.IsValidOrCrease.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.Nan
A sharpness whose ends are both NaN. This is what the factory methods return when
their input is not valid.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.Item(System.Int32)
Gets the sharpness at the start or the end of the edge.
endIndex: 0 for the start of the edge, 1 for the end.
Returns: The sharpness, or NaN if endIndex is out of range.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.EndSharpness(System.Int32)
Gets the sharpness at the start or the end of the edge.
endIndex: 0 for the start of the edge, 1 for the end.
Returns: The sharpness, or NaN if endIndex is out of range.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.Average
Gets the average of the two end sharpness values.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.MinimumEndSharpness
Gets the smaller of the two end sharpness values.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.MaximumEndSharpness
Gets the larger of the two end sharpness values.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.Delta
Gets EndSharpness(1) - EndSharpness(0),
or NaN if this is neither valid nor a crease.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.Trend
Gets +1 if the sharpness increases along the edge, -1 if it decreases, and 0 if it
is constant. Returns Rhino.RhinoMath.UnsetIntIndex if this is not valid.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.IsConstant
Gets true if both ends have the same valid sharpness value.
Rhino.Geometry.SubDEdgeSharpness.Crease and Rhino.Geometry.SubDEdgeSharpness.Nan are both false; see
Rhino.Geometry.SubDEdgeSharpness.IsConstantOrCrease.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.IsConstantOrCrease
Gets true if both ends have the same valid sharpness value, or if this is
Rhino.Geometry.SubDEdgeSharpness.Crease.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.IsVariable
Gets true if this is valid and the two ends differ.
Rhino.Geometry.SubDEdgeSharpness.Crease and Rhino.Geometry.SubDEdgeSharpness.Nan are both false.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.IsIncreasing
Gets true if EndSharpness(0) is less than
EndSharpness(1).
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.IsDecreasing
Gets true if EndSharpness(0) is greater than
EndSharpness(1).
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.IsZero
Gets true if both ends are 0.0, which is the sharpness of a smooth edge.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.IsSharp
Gets true if both ends are valid and at least one is greater than 0.0.
Rhino.Geometry.SubDEdgeSharpness.Crease and Rhino.Geometry.SubDEdgeSharpness.Nan are both false: a crease edge is not a
sharp edge.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.IsCrease
Gets true if this is Rhino.Geometry.SubDEdgeSharpness.Crease.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.IsCreaseOrSharp
Gets (Rhino.Geometry.SubDEdgeSharpness.IsCrease || Rhino.Geometry.SubDEdgeSharpness.IsSharp).
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.IsValid
Gets true if both ends are between 0.0 and Rhino.Geometry.SubDEdgeSharpness.MaximumValue.
Rhino.Geometry.SubDEdgeSharpness.Crease and Rhino.Geometry.SubDEdgeSharpness.Nan are both false; see
Rhino.Geometry.SubDEdgeSharpness.IsValidOrCrease.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.IsValidOrCrease
Gets true if both ends are between 0.0 and Rhino.Geometry.SubDEdgeSharpness.MaximumValue, or if this
is Rhino.Geometry.SubDEdgeSharpness.Crease.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.IsNotValid
Gets the opposite of Rhino.Geometry.SubDEdgeSharpness.IsValid.
Rhino.Geometry.SubDEdgeSharpness.Crease and Rhino.Geometry.SubDEdgeSharpness.Nan are both true.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.IsNotValidNorCrease
Gets the opposite of Rhino.Geometry.SubDEdgeSharpness.IsValidOrCrease.
Rhino.Geometry.SubDEdgeSharpness.Nan is true and Rhino.Geometry.SubDEdgeSharpness.Crease is false.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.Subdivided(System.Int32)
Gets the sharpness this edge would have after one subdivision.
endIndex: 0 for the start of the edge, 1 for the end.
Returns:
The subdivided sharpness, or Rhino.Geometry.SubDEdgeSharpness.Smooth if endIndex is out of range.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.Reversed
Gets this sharpness with its two end values swapped.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.ToPercentageText(System.Boolean)
Describes this sharpness as a percentage, for user interface code.
A constant sharpness gives a single percentage, a variable one gives a range, and
an invalid one gives a warning sign.
orderMinToMax:
If true, a variable sharpness is formatted as min%-max%. If false, it is formatted
as EndSharpness(0)%-EndSharpness(1)%.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.ToString
Returns a string that represents this sharpness as a percentage.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.ToPercentageText(System.Double)
Describes a single end sharpness value as a percentage, for user interface code.
sharpness:
Between 0.0 and Rhino.Geometry.SubDEdgeSharpness.MaximumValue, or Rhino.Geometry.SubDEdgeSharpness.CreaseValue.
Returns:
A number followed by a percent sign, "crease" for Rhino.Geometry.SubDEdgeSharpness.CreaseValue, or a
warning sign if sharpness is not valid.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.ToPercentage(System.Double,System.Double)
Converts a sharpness value to a percentage between 0.0 and 100.0.
sharpness:
Between 0.0 and Rhino.Geometry.SubDEdgeSharpness.MaximumValue, or Rhino.Geometry.SubDEdgeSharpness.CreaseValue.
creasePercentage:
The value to return when sharpness is Rhino.Geometry.SubDEdgeSharpness.CreaseValue.
Returns:
100.0 * sharpness / Rhino.Geometry.SubDEdgeSharpness.MaximumValue, creasePercentage for
Rhino.Geometry.SubDEdgeSharpness.CreaseValue, or NaN if sharpness is not valid.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.IsValidValue(System.Double,System.Boolean)
Determines whether a value can be used as an edge end sharpness.
candidateValue: The value to check.
creaseResult:
The value to return when candidateValue is Rhino.Geometry.SubDEdgeSharpness.CreaseValue.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.Sanitize(System.Double)
Verifies that sharpness is between 0.0 and Rhino.Geometry.SubDEdgeSharpness.MaximumValue, and snaps it
to an integer when it is within Rhino.Geometry.SubDEdgeSharpness.Tolerance of one.
sharpness: The value to sanitize.
Returns: A usable sharpness value, or 0.0 if sharpness is not valid.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.Sanitize(System.Double,System.Double)
Verifies that sharpness is between 0.0 and Rhino.Geometry.SubDEdgeSharpness.MaximumValue, and snaps it
to an integer when it is within Rhino.Geometry.SubDEdgeSharpness.Tolerance of one.
sharpness: The value to sanitize.
invalidInputResult: The value to return when sharpness is not valid.
Returns: A usable sharpness value, or invalidInputResult if sharpness is not valid.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.SharpnessFromSliderValue(Rhino.Geometry.Interval,System.Double,System.Double)
Converts a user facing slider value to an edge end sharpness value.
sliderDomain:
The non empty domain of the slider, often Rhino.Geometry.Interval.ZeroToOne.
sliderValue:
A value in sliderDomain. sliderDomain.T0 maps to 0.0 and sliderDomain.T1 maps to
Rhino.Geometry.SubDEdgeSharpness.MaximumValue.
invalidInputResult: The value to return when the input is not valid.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.SharpnessFromNormalizedValue(System.Double)
Converts a normalized slider value to an edge end sharpness value.
normalizedSliderValue: Between 0.0 and 1.0.
Returns:
normalizedSliderValue scaled to the range 0.0 to Rhino.Geometry.SubDEdgeSharpness.MaximumValue, or NaN
if it is out of range.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.Union(Rhino.Geometry.SubDEdgeSharpness,Rhino.Geometry.SubDEdgeSharpness)
Gets the union of two sharpness ranges, ignoring the ones that are zero, a crease,
or not valid.
sharpness0: The first sharpness.
sharpness1: The second sharpness.
Returns:
The union of the nonzero valid inputs, or Rhino.Geometry.SubDEdgeSharpness.Smooth if there are none.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.EqualEndSharpness(Rhino.Geometry.SubDEdgeSharpness,Rhino.Geometry.SubDEdgeSharpness)
Determines whether two sharpnesses meet with the same value, that is, whether
s0.EndSharpness(1) equals s1.EndSharpness(0).
s0: The sharpness of the first edge.
s1: The sharpness of the second edge.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.EqualTrend(Rhino.Geometry.SubDEdgeSharpness,Rhino.Geometry.SubDEdgeSharpness)
Determines whether two sharpnesses have the same Rhino.Geometry.SubDEdgeSharpness.Trend and meet with
the same value.
s0: The sharpness of the first edge.
s1: The sharpness of the second edge.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.EqualDelta(Rhino.Geometry.SubDEdgeSharpness,Rhino.Geometry.SubDEdgeSharpness)
Determines whether two sharpnesses have the same Rhino.Geometry.SubDEdgeSharpness.Delta and meet with
the same value.
s0: The sharpness of the first edge.
s1: The sharpness of the second edge.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.CreateEdgeChainSharpness(Rhino.Geometry.Interval,System.Int32)
Builds a sequence of evenly changing sharpnesses for the edges of a chain.
chainSharpnessRange:
The sharpness at the start of the chain and at the end of the chain.
edgeCount: The number of edges in the chain.
Returns:
One sharpness per edge, or an empty array if the input is not valid.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.VertexSharpness(Rhino.Geometry.SubDVertexTag,System.Double,System.UInt32,System.Double)
Calculates the sharpness of a vertex from the sharp edges attached to it.
Vertices tagged as corners always have a sharpness of 0.0.
vertexTag: The vertex tag.
interiorCreaseVertexSharpness:
Only meaningful for an interior crease vertex, where it is the largest sharpness at
this vertex over the smooth edges of both sectors. This matters in low level SubD
evaluation code that only has information about one sector. When in doubt, pass 0.0.
sharpEdgeEndCount:
The number of sharp edges at the vertex whose sharpness at this vertex is nonzero.
maximumEdgeEndSharpness:
The largest sharp edge end sharpness at the vertex.
Returns: The sharpness to use when subdividing the vertex.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.Equals(Rhino.Geometry.SubDEdgeSharpness)
Determines whether this sharpness has the same end values as another one.
other: The sharpness to compare with.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.Equals(System.Object)
Determines whether an object is a sharpness with the same end values as this one.
obj: The object to compare with.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.GetHashCode
Gets a hash code for this sharpness.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.op_Equality(Rhino.Geometry.SubDEdgeSharpness,Rhino.Geometry.SubDEdgeSharpness)
Determines whether two sharpnesses have the same end values.
a: The first sharpness.
b: The second sharpness.
Since: 8.36

Rhino.Geometry.SubDEdgeSharpness.op_Inequality(Rhino.Geometry.SubDEdgeSharpness,Rhino.Geometry.SubDEdgeSharpness)
Determines whether two sharpnesses have different end values.
a: The first sharpness.
b: The second sharpness.
Since: 8.36