Rhino.Render.ICurrentEnvironment_Get.ForBackground
Get the RenderEnvironment used as the 360 degree backdrop environment. Null will be returned
if the background mode is set to 'Solid Color' or 'Gradient' (i.e., not 'Environment').
Since: 6.0

Rhino.Render.ICurrentEnvironment_Get.ForBackground_CheckMode
Since: 6.0

Rhino.Render.ICurrentEnvironment_Get.ForLighting
Get the RenderEnvironment used as custom skylighting environment.
Null will be returned if the custom skylighting environment override is disabled.
Since: 6.0

Rhino.Render.ICurrentEnvironment_Get.ForReflectionAndRefraction
Get the RenderEnvironment used as custom reflection (and refraction) environment.
Null will be returned if the custom reflection override is disabled.
Since: 6.0