Rhino.PlugIns.LicenseCapabilities
Controls the buttons that will appear on the license notification window
that is displayed if a license for the requesting product is not found.
Note, the "Close" button will always be displayed.
Since: 5.5

Rhino.PlugIns.LicenseCapabilities.NoCapabilities
Only the "Close" button will be displayed

Rhino.PlugIns.LicenseCapabilities.CanBePurchased
Shows "Buy a license" button

Rhino.PlugIns.LicenseCapabilities.CanBeSpecified
OBSOLETE: Shows ""Enter a license" and "Use a Zoo" buttons. Use SupportsStandalone | SupportsZoo instead.

Rhino.PlugIns.LicenseCapabilities.CanBeEvaluated
Shows "Evaluate" button

Rhino.PlugIns.LicenseCapabilities.EvaluationIsExpired
Shows "Evaluate" button disabled

Rhino.PlugIns.LicenseCapabilities.SupportsRhinoAccounts
Supports getting a license from a Cloud Zoo / Rhino Account

Rhino.PlugIns.LicenseCapabilities.SupportsStandalone
Supports single-computer licensing

Rhino.PlugIns.LicenseCapabilities.SupportsZooPerUser
Supports getting a license from a Zoo server

Rhino.PlugIns.LicenseCapabilities.SupportsZooPerCore
Supports getting a license from a Zoo server

Rhino.PlugIns.LicenseCapabilities.SupportsLicenseDiscovery
Supports license discovery API flow