Rhino.Display.ShaderLanguage
Graphics Shader Language
https://en.wikipedia.org/wiki/OpenGL_Shading_Language#Versions

Rhino.Display.ShaderLanguage.GLSL_ES100
Used for OpenGL ES 2.0 and WebGL 1.0

Rhino.Display.ShaderLanguage.GLSL_ES300
Used for OpenGL ES 3.0 and WebGL 2.0

Rhino.Display.ShaderLanguage.GLSL_ES310


Rhino.Display.ShaderLanguage.GLSL_120
Used for OpenGL 2.1

Rhino.Display.ShaderLanguage.GLSL_130
Used for OpenGL 3.0

Rhino.Display.ShaderLanguage.GLSL_140
Used for OpenGL 3.1

Rhino.Display.ShaderLanguage.GLSL_150
Used for OpenGL 3.2

Rhino.Display.ShaderLanguage.GLSL_330
Used for OpenGL 3.3

Rhino.Display.ShaderLanguage.GLSL_400
Used for OpenGL 4.0

Rhino.Display.ShaderLanguage.GLSL_410
Used for OpenGL 4.1

Rhino.Display.ShaderLanguage.GLSL_420
Used for OpenGL 4.2

Rhino.Display.ShaderLanguage.GLSL_430
Used for OpenGL 4.3

Rhino.Display.ShaderLanguage.GLSL_440
Used for OpenGL 4.4

Rhino.Display.ShaderLanguage.Metal
Metal for Apple