Rhino.FileIO.FileAiWriteOptions.Units
Since: 8.0

Rhino.FileIO.FileAiWriteOptions.Units.Inches
inches

Rhino.FileIO.FileAiWriteOptions.Units.Centimeters
centimeters

Rhino.FileIO.FileAiWriteOptions.Units.Millimeters
millimeters

Rhino.FileIO.FileAiWriteOptions.Units.Points
points