Rhino.FileIO.FileIgsWriteOptions
Options for writing a Igs file

Rhino.FileIO.FileIgsWriteOptions.Author
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.Organization
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.Sender
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.Receiver
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.Units
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.IgesStringType
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.Tolerance
In model space units specified above
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.NotesInStartSection
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.RenderColorAsIgesColor
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.IgesVersion
Version of IGES spec to write
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.EolType
IGES files are ASCII files.  You need to
specify the flavor of the ASCII end of line
marker.Possibilities are:
TL_LF:   line feed (unix)
TL_CRLF: carriage return, line feed (Microsoft)
TL_CR:   carriage return (Apple)
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.Scale
(model space units)/(real world units)
For example, if unit_system = TL_INCHES
and 1 model space unit = 8 inches,
then scale = 0.125.Note that
model space units are stored
in the IGES file.
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.HideDependentObjects
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.DoublesUseE
Use "E" instead of the correct "D" for double
scientific notation to get around IGES bug in
FastShip.
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.NoZerosInTSection
The GridTool program used at NASA Langly
cannot read IGES files that have leading
zeros in the T section.
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.PointType
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.CurveMaxDegree
d >= 3 means all NURBS curves with degree > d
be fit with degree d non-rational cubics.
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.CompositeCurvesAsSingleBsplines
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.SimplifyCurves
TRUE means NURBS that are lines or arcs will
be written as lines or arcs instead of 126's
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.FitRationalCurves
true means all rational NURBS will be fit
with non-rational cubics.
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.ClampCurveEndKnots
TRUE means all periodic NURBS will have their
end knots clamped.
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.UseParentLabelOnCurves
copy parent label to dependent curves
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.ForceBezierKnotsOnCurves
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.FlagDependentCurvesAs03
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.WriteNonPlanarUnitNormal
true means the UnitNormal will be written regardless,
even if the curve is non planar
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.SurfaceType
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.PolySurfaceType
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.MaxSurfaceDegree
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.SolidType
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.MeshType
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.SimplifySurfaces
true means that NURBS surfaces that are ruled
surfaces or surfaces of revolution will be
written as ruled surfaces or surfaces of
revolution.
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.FitRationalSurfaces
true means non-conic rational surfaces
will be fit with non-rational surfaces
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.ClampSurfaceEndKnots
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.UseParentLabelOnSurfaces
copy parent label to dependent srfs
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.ForceBezierKnotsOnSurfaces
true means all NURBS surfaces will have their
internal knots set to full multiplicity.
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.FlagDependentSurfacesAs03
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.SplitClosedSurfaces
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.SplitBiPolarSurfaces
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.ForceTrimmedSurfaces
true means all surfaces will be exported as 143 or 144s
CATIA may like this better.
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.CatiaVersion
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.CatiaTolsize
Since: 8.0

Rhino.FileIO.FileIgsWriteOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0