Rhino.UI.StackedDialogPage
Base class to inherit from for the addition of stacked dialog pages.

Rhino.UI.StackedDialogPage.#ctor(System.String)
Protected constructor
englishPageTitle:

Rhino.UI.StackedDialogPage.Children
List of child (sub) pages of this page
Since: 5.0

Rhino.UI.StackedDialogPage.HasChildren
Will be true if this page contains sub pages.
Since: 5.0

Rhino.UI.StackedDialogPage.AddChildPage(Rhino.UI.StackedDialogPage)
Currently only supported on Windows.  Call this method to add a child
page to a page after the parent dialog has been created.
pageToAdd:
Since: 6.0

Rhino.UI.StackedDialogPage.Modified
Check to see if the page has been marked as modified or not.  Marking
the page as modified will cause the Apply button to get enabled if this
is currently the visible page and the page includes the Apply button.
Since: 6.0

Rhino.UI.StackedDialogPage.Handle
When running on Windows return the window handle for the parent of this
page otherwise; return IntPtr.Zero.
Since: 6.0

Rhino.UI.StackedDialogPage.RemovePage
Remove this page from the dialog box
Since: 6.0

Rhino.UI.StackedDialogPage.MakeActivePage
Make this page the active, visible page
Since: 6.0

Rhino.UI.StackedDialogPage.PageControl
Return the control that represents this page. Rhino Windows supports
classes that implement the IWin32Windows interface or are derived from
some form of System.Windows.FrameworkElement or Eto.Forms.Control.  Mac
Rhino supports controls that are derived from NSview or
Eto.Forms.Control.
Since: 5.0

Rhino.UI.StackedDialogPage.OnCreateParent(System.IntPtr)
Called when the parent window has been created on Windows platforms
only.
hwndParent:
Since: 5.0

Rhino.UI.StackedDialogPage.OnSizeParent(System.Int32,System.Int32)
Called when the parent window has been resized
width:
height:
Since: 5.0

Rhino.UI.StackedDialogPage.SetEnglishPageTitle(System.String)
Change the title passed to the constructor and, this will cause
LocalPageTitle to get called also.
newPageTile:
Since: 6.0

Rhino.UI.StackedDialogPage.EnglishPageTitle
English string used when scripting this page and a user prefixes a
command option with "_"
Since: 5.0

Rhino.UI.StackedDialogPage.LocalPageTitle
Localized page title that will appear on a tab or other page navigation
control.  This is also uses as a command line option when scripting
this page.
Since: 5.0

Rhino.UI.StackedDialogPage.PageImage
Optionally override to provide a image to display in
the Mac Rhino UI
The page image.
Since: 6.0

Rhino.UI.StackedDialogPage.OnApply
Called when stacked dialog OK button is pressed.
Returns:
If return value is true then the dialog will be closed. A return of false means
there was an error and dialog remains open so page can be properly updated.
Since: 5.0

Rhino.UI.StackedDialogPage.OnCancel
Called when stacked dialog Cancel button is pressed.
Since: 5.0

Rhino.UI.StackedDialogPage.OnActivate(System.Boolean)
Called when this page is activated/deactivated.
active: If true then this page is on top otherwise it is about to be hidden.
Returns:
If true then the page is hidden and the requested page is not
activated otherwise will not allow you to change the current page.
Default returns true
Since: 5.0

Rhino.UI.StackedDialogPage.ShowDefaultsButton
Called when this page is activated.
Returns:
true  : if the page wants the "Defaults" button to appear.
false : if the page does not want the "Defaults" button to appear.
Default returns false
Note: returning false implies that OnDefaults() method will never get called.
Since: 5.0

Rhino.UI.StackedDialogPage.ShowApplyButton
Called when this page is activated
Returns:
true  : if the page wants the "Apply" button to appear.
false : if the page does not want the "Apply" button to appear.
Default returns false
Note: If true is returned OnApply will get called when the button is
clicked.
Since: 6.0

Rhino.UI.StackedDialogPage.OnDefaults
Called when stacked dialog Defaults button is pressed (see ShowDefaultsButton).
Since: 5.0

Rhino.UI.StackedDialogPage.OnHelp
Called when the parent dialog requests help for this page.
Since: 5.0

Rhino.UI.StackedDialogPage.AttachedToTreeControl
RhinoWindows will use reflection to call this method when the page gets
added to a stacked dialog tree control.  When this happens set the
cached item color and bold state as necessary.  This may get hooked up
in Mac Rhino at some point.

Rhino.UI.StackedDialogPage.NavigationTextIsBold
Currently only used by Windows Rhino.  If this is set to true then the
tree control item text will be bold.
Since: 6.0

Rhino.UI.StackedDialogPage.NavigationTextColor
Currently only used by Windows Rhino.  If this is set to true then the
tree control item text be drawn using this color.  Set the color to
System.Drawing.Color.Empty to use the default color.
Since: 6.0

Rhino.UI.StackedDialogPage.SetActivePageTo(System.String,System.Boolean)
pageName:
documentPropertiesPage:
Since: 7.5