Rhino.DocObjects.Tables.InstanceDefinitionTable.Document
Document that owns this table.
Since: 5.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.Count
Number of items in the instance definitions table.
Since: 5.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.ActiveCount
Number of items in the instance definitions table, excluding deleted definitions.
Since: 5.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.ComponentType
Since: 6.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.Item(System.Int32)
Conceptually, the InstanceDefinition table is an array of Instance
definitions. The operator[] can be used to get individual instance
definition. An instance definition is either active or deleted and this
state is reported by IsDeleted or will be null if it has been purged
from the document.
index: zero based array index.
Returns: The instance definition at the specified index.

Rhino.DocObjects.Tables.InstanceDefinitionTable.Find(System.String,System.Boolean)
Finds the instance definition with a given name.
instanceDefinitionName: name of instance definition to search for (ignores case)
ignoreDeletedInstanceDefinitions: true means don't search deleted instance definitions.
Returns: The specified instance definition, or null if nothing matching was found.
Since: 5.0
6.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.Find(System.String)
Finds the instance definition with a given name.
instanceDefinitionName: name of instance definition to search for (ignores case)
Returns: The specified instance definition, or null if nothing matching was found.
Since: 6.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.Find(System.Guid,System.Boolean)
Finds the instance definition with a given id.
instanceId: Unique id of the instance definition to search for.
ignoreDeletedInstanceDefinitions: true means don't search deleted instance definitions.
Returns: The specified instance definition, or null if nothing matching was found.
Since: 5.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.InstanceDefinitionIndex(System.Guid,System.Boolean)
Get the index of the instance definition with a given id.
instanceId: Unique id of the instance definition to search for
ignoreDeletedInstanceDefinitions: true means don't search deleted instance definitions.
Returns: index > -1 if instance definition was found.
Since: 6.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.Add(System.String,System.String,System.String,System.String,Rhino.Geometry.Point3d,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjectAttributes})
Adds an instance definition to the instance definition table.
name: The definition name.
description: The definition description.
url: A URL or hyperlink.
urlTag: A description of the URL or hyperlink.
basePoint: A base point.
geometry: An array, a list or any enumerable set of geometry.
attributes: An array, a list or any enumerable set of attributes.
Returns:
>=0  index of instance definition in the instance definition table. -1 on failure.
Since: 7.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.Add(System.String,System.String,Rhino.Geometry.Point3d,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjectAttributes})
Adds an instance definition to the instance definition table.
name: The definition name.
description: The definition description.
basePoint: A base point.
geometry: An array, a list or any enumerable set of geometry.
attributes: An array, a list or any enumerable set of attributes.
Returns:
>=0  index of instance definition in the instance definition table. -1 on failure.
Since: 5.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.Add(System.String,System.String,Rhino.Geometry.Point3d,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})
Adds an instance definition to the instance definition table.
name: The definition name.
description: The definition description.
basePoint: A base point.
geometry: An array, a list or any enumerable set of geometry.
Returns:
>=0  index of instance definition in the instance definition table. -1 on failure.
Since: 5.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.Add(System.String,System.String,Rhino.Geometry.Point3d,Rhino.Geometry.GeometryBase,Rhino.DocObjects.ObjectAttributes)
Adds an instance definition to the instance definition table.
name: The definition name.
description: The definition description.
basePoint: A base point.
geometry: An element.
attributes: An attribute.
Returns:
>=0  index of instance definition in the instance definition table. -1 on failure.
Since: 5.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.Modify(Rhino.DocObjects.InstanceDefinition,System.String,System.String,System.Boolean)
Modifies the instance definition name and description.
Does not change instance definition ID or geometry.
idef: The instance definition to be modified.
newName: The new name.
newDescription: The new description string.
quiet:
If false, information message boxes pop up when illegal changes are attempted.
Returns:
true if successful.
Since: 5.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.Modify(Rhino.DocObjects.InstanceDefinition,System.String,System.String,System.String,System.String,System.Boolean)
Modifies the instance definition name, description, and url.
Does not change instance definition ID or geometry.
idef: The instance definition to be modified.
newName: The new name.
newDescription: The new description string.
newUrl: The new URL or hyperlink.
newUrlTag: The new description of the URL or hyperlink.
quiet:
If false, information message boxes pop up when illegal changes are attempted.
Returns:
true if successful.
Since: 7.16

Rhino.DocObjects.Tables.InstanceDefinitionTable.Modify(System.Int32,System.String,System.String,System.Boolean)
Modifies the instance definition name and description.
Does not change instance definition ID or geometry.
idefIndex: The index of the instance definition to be modified.
newName: The new name.
newDescription: The new description string.
quiet:
If false, information message boxes pop up when illegal changes are attempted.
Returns:
true if successful.
Since: 5.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.Modify(System.Int32,System.String,System.String,System.String,System.String,System.Boolean)
Modifies the instance definition name, description, and url.
Does not change instance definition ID or geometry.
idefIndex: The index of the instance definition to be modified.
newName: The new name.
newDescription: The new description string.
newUrl: The new URL or hyperlink.
newUrlTag: The new description of the URL or hyperlink.
quiet:
If false, information message boxes pop up when illegal changes are attempted.
Returns:
true if successful.
Since: 7.16

Rhino.DocObjects.Tables.InstanceDefinitionTable.Modify(System.Int32,Rhino.DocObjects.Custom.UserData,System.Boolean)
Modifies the instance definition user data.
Does not change instance definition ID or geometry.
idefIndex: The index of the instance definition to be modified.
userData: The user data to replace.
quiet:
If false, information message boxes pop up when illegal changes are attempted.
Returns:
true if successful.
Since: 8.10

Rhino.DocObjects.Tables.InstanceDefinitionTable.UndoModify(System.Int32)
Restores the instance definition to its previous state,
if the instance definition has been modified and the modification can be undone.
idefIndex: The index of the instance definition to be restored.
Returns: true if operation succeeded.
Since: 5.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.ModifyGeometry(System.Int32,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjectAttributes})
Modifies the instance definition geometry and replaces all references
to the current definition with references to the new definition.
idefIndex: The index of the instance definition to be modified.
newGeometry: The new geometry.
newAttributes: The new attributes.
Returns: true if operation succeeded.
Since: 5.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.ModifyGeometry(System.Int32,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})
Since: 5.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.ModifyGeometry(System.Int32,Rhino.Geometry.GeometryBase,Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.DestroySourceArchive(Rhino.DocObjects.InstanceDefinition,System.Boolean)
Destroys all source archive information.
Specifically:
* Rhino.Geometry.InstanceDefinitionGeometry.SourceArchive is set to the empty string.
* SourceRelativePath is set to false
* The alternative source archive path is set to the empty string.
* Checksum.Zero() is used to private destroy all checksum information.
* Rhino.DocObjects.InstanceDefinition.UpdateType is set to Rhino.DocObjects.InstanceDefinitionUpdateType.Static.
definition: The instance definition to be modified.
quiet: If true, then message boxes about erroneous parameters will not be shown.
Returns:
Returns true if the definition was successfully modified otherwise returns false.
Since: 6.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.ModifySourceArchive(System.Int32,System.String,Rhino.DocObjects.InstanceDefinitionUpdateType,System.Boolean)
If the instance definition is linked or embedded, use SetSource to
specify the source archive.
idefIndex: The index of the instance definition to be modified.
sourceArchive: The new source archive file name.
updateType:
quiet: If true, then message boxes about erroneous parameters will not be shown.
Returns:
Returns true if the definition was successfully modified otherwise returns false.
Since: 6.0
6.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.ModifySourceArchive(System.Int32,Rhino.FileIO.FileReference,Rhino.DocObjects.InstanceDefinitionUpdateType,System.Boolean)
If the instance definition is linked or embedded, use SetSource to
specify the source archive.
idefIndex: The index of the instance definition to be modified.
sourceArchive: The new source archive file name.
updateType:
quiet: If true, then message boxes about erroneous parameters will not be shown.
Returns:
Returns true if the definition was successfully modified otherwise returns false.
Since: 6.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.RefreshLinkedBlock(Rhino.DocObjects.InstanceDefinition)
Reload linked block definitions and update the Rhino display.
definition:
Instance definition to reload.
Returns:
Returns true if the linked file was successfully read and updated.
Since: 6.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.MakeSourcePathRelative(Rhino.DocObjects.InstanceDefinition,System.Boolean,System.Boolean)
Obsolete method that always returns false.
Marks the source path for a linked instance definition as relative or absolute.
idef: The instance definition to be marked.
relative:
If true, the path should be considered as relative.
If false, the path should be considered as absolute.
quiet: If true, then message boxes about erroneous parameters will not be shown.
Returns:
true if the instance definition could be modified.
Since: 5.0
6.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.Delete(System.Int32,System.Boolean,System.Boolean)
Deletes the instance definition.
idefIndex:
zero based index of instance definition to delete.
This must be in the range 0 <= idefIndex < InstanceDefinitionTable.Count.
deleteReferences:
true to delete all references to this definition.
false to delete definition only if there are no references.
quiet:
If true, no warning message box appears if an instance definition cannot be
deleted because it is the current layer or it contains active geometry.
Returns:
true if successful. false if the instance definition has active references and bDeleteReferences is false.
Since: 5.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.Delete(Rhino.DocObjects.InstanceDefinition)
Deletes the instance definition. This deletes all references too.
item: The item to delete.
Returns: True on success.
Since: 6.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.Purge(System.Int32)
Purges an instance definition and its definition geometry.
idefIndex:
zero based index of instance definition to delete.
This must be in the range 0 <= idefIndex < InstanceDefinitionTable.Count.
Returns:
True if successful. False if the instance definition cannot be purged
because it is in use by reference objects or undo information.
Since: 5.9

Rhino.DocObjects.Tables.InstanceDefinitionTable.Compact(System.Boolean)
Purge deleted instance definition information that is not in use.
This function is time consuming and should be used in a thoughtful manner.
ignoreUndoReferences:
If false, then deleted instance definition information that could possibly
be undeleted by the Undo command will not be deleted. If true, then all
deleted instance definition information is deleted.
Since: 5.9

Rhino.DocObjects.Tables.InstanceDefinitionTable.Undelete(System.Int32)
Undeletes an instance definition that has been deleted by Delete()
idefIndex:
zero based index of instance definition to delete.
This must be in the range 0 <= idefIndex < InstanceDefinitionTable.Count.
Returns: true if successful
Since: 5.9

Rhino.DocObjects.Tables.InstanceDefinitionTable.UpdateLinkedInstanceDefinition(System.Int32,System.String,System.Boolean,System.Boolean)
Read the objects from a file and use them as the instance's definition geometry.
idefIndex:
zero based index of instance definition to delete.
This must be in the range 0 <= idefIndex < InstanceDefinitionTable.Count.
filename:
name of file (can be any type of file that Rhino or a plug-in can read)
updateNestedLinks:
If true and the instance definition references to a linked instance definition,
that needs to be updated, then the nested definition is also updated. If
false, nested updates are skipped.
quiet:
Returns:
Since: 5.9

Rhino.DocObjects.Tables.InstanceDefinitionTable.GetList(System.Boolean)
Gets an array of instance definitions.
ignoreDeleted: If true then deleted instance definitions are filtered out.
Returns: An array of instance definitions. This can be empty, but not null.
Since: 5.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.GetUnusedInstanceDefinitionName
Gets unused instance definition name used as default when creating
new instance definitions.
Returns: An unused instance definition name string.
Since: 5.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.GetUnusedInstanceDefinitionName(System.String)
Gets unused instance definition name used as default when creating
new instance definitions.
root:
The returned name is 'root nn'  If root is empty, then 'Block' (localized) is used.
Returns: An unused instance definition name string.
Since: 5.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.GetUnusedInstanceDefinitionName(System.String,System.UInt32)
Gets unused instance definition name used as default when creating
new instance definitions.
root:
The returned name is 'root nn'  If root is empty, then 'Block' (localized) is used.
defaultSuffix:
Unique names are created by appending a decimal number to the
localized term for "Block" as in "Block 01", "Block 02",
and so on.  When defaultSuffix is supplied, the search for an unused
name begins at "Block suffix".
Returns: An unused instance definition name string.
Since: 5.0
6.0

Rhino.DocObjects.Tables.InstanceDefinitionTable.GetEnumerator
Since: 5.0