Rhino.Runtime.InteropWrappers.ClassArrayCurveRegion.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.

Rhino.Runtime.InteropWrappers.ClassArrayCurveRegion.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.

Rhino.Runtime.InteropWrappers.ClassArrayCurveRegion.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.ClassArrayCurveRegion instance.

Rhino.Runtime.InteropWrappers.ClassArrayCurveRegion.RegionCount
Gets the number of curve regions in this array.

Rhino.Runtime.InteropWrappers.ClassArrayCurveRegion.RegionBoundaryCount(System.Int32)
Gets the number of boundaries in a specified region.

Rhino.Runtime.InteropWrappers.ClassArrayCurveRegion.RegionBoundaryElementCount(System.Int32,System.Int32)
Returns the number of boundaries elements in a specified region boundary.

Rhino.Runtime.InteropWrappers.ClassArrayCurveRegion.ToArray
Returns the managed counterpart of the unmanaged array

Rhino.Runtime.InteropWrappers.ClassArrayCurveRegion.CopyRegionBoundaryElements(System.Int32,System.Int32)
Copies the unmanaged array to a managed counterpart.

Rhino.Runtime.InteropWrappers.ClassArrayCurveRegion.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.ClassArrayCurveRegion.Dispose
Actively reclaims unmanaged resources that this instance uses.

Rhino.Runtime.InteropWrappers.ClassArrayCurveRegion.Dispose(System.Boolean)
This method is called with argument true when class user calls Dispose(),
while with argument false when the Garbage Collector invokes the finalizer,
or Finalize() method. You must reclaim all used unmanaged resources in both cases,
and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.