Rhino.FileIO.File3dm.TableTypeFilter
Since: 5.9

Rhino.FileIO.File3dm.TableTypeFilter.None


Rhino.FileIO.File3dm.TableTypeFilter.Properties


Rhino.FileIO.File3dm.TableTypeFilter.Settings


Rhino.FileIO.File3dm.TableTypeFilter.Bitmap


Rhino.FileIO.File3dm.TableTypeFilter.TextureMapping


Rhino.FileIO.File3dm.TableTypeFilter.Material


Rhino.FileIO.File3dm.TableTypeFilter.Linetype


Rhino.FileIO.File3dm.TableTypeFilter.Layer


Rhino.FileIO.File3dm.TableTypeFilter.Group


Rhino.FileIO.File3dm.TableTypeFilter.Font


Rhino.FileIO.File3dm.TableTypeFilter.FutureFont


Rhino.FileIO.File3dm.TableTypeFilter.Dimstyle


Rhino.FileIO.File3dm.TableTypeFilter.Light


Rhino.FileIO.File3dm.TableTypeFilter.Hatchpattern


Rhino.FileIO.File3dm.TableTypeFilter.InstanceDefinition


Rhino.FileIO.File3dm.TableTypeFilter.ObjectTable


Rhino.FileIO.File3dm.TableTypeFilter.Historyrecord


Rhino.FileIO.File3dm.TableTypeFilter.UserTable
