Rhino.FileIO.FileStpWriteOptions.StepSchema
Step schema.
Since: 8.0

Rhino.FileIO.FileStpWriteOptions.StepSchema.SF_203


Rhino.FileIO.FileStpWriteOptions.StepSchema.SF_214


Rhino.FileIO.FileStpWriteOptions.StepSchema.SF_214_CC2


Rhino.FileIO.FileStpWriteOptions.StepSchema.SF_242
