Rhino.Display.ZBufferCapture
Provides functionality for getting the z-buffer values from a viewport
and a given display mode

Rhino.Display.ZBufferCapture.#ctor(Rhino.Display.RhinoViewport)
Since: 5.3

Rhino.Display.ZBufferCapture.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Display.ZBufferCapture.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.3

Rhino.Display.ZBufferCapture.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.Display.ZBufferCapture.SetDisplayMode(System.Guid)
Since: 5.3

Rhino.Display.ZBufferCapture.ShowIsocurves(System.Boolean)
Since: 5.3

Rhino.Display.ZBufferCapture.ShowMeshWires(System.Boolean)
Since: 5.3

Rhino.Display.ZBufferCapture.ShowCurves(System.Boolean)
Since: 5.3

Rhino.Display.ZBufferCapture.ShowPoints(System.Boolean)
Since: 5.3

Rhino.Display.ZBufferCapture.ShowText(System.Boolean)
Since: 5.3

Rhino.Display.ZBufferCapture.ShowAnnotations(System.Boolean)
Since: 5.3

Rhino.Display.ZBufferCapture.ShowLights(System.Boolean)
Since: 5.3

Rhino.Display.ZBufferCapture.HitCount
Since: 5.3

Rhino.Display.ZBufferCapture.MaxZ
Since: 5.3

Rhino.Display.ZBufferCapture.MinZ
Since: 5.3

Rhino.Display.ZBufferCapture.ZValueAt(System.Int32,System.Int32)
Since: 5.3

Rhino.Display.ZBufferCapture.WorldPointAt(System.Int32,System.Int32)
Since: 5.3

Rhino.Display.ZBufferCapture.GrayscaleDib
Since: 5.3