Rhino.FileIO.FileObjReadOptions.UseObjGsAs
Determines how "g"s in the obj file will be interpreted
on import
Since: 6.0

Rhino.FileIO.FileObjReadOptions.UseObjGsAs.IgnoreObjGroups
OBJ "g"s in the file are ignored

Rhino.FileIO.FileObjReadOptions.UseObjGsAs.ObjGroupsAsLayers
OBJ "g"s in the file will become Rhino layers

Rhino.FileIO.FileObjReadOptions.UseObjGsAs.ObjGroupsAsGroups
OBJ "g"s in the file will become Rhino groups

Rhino.FileIO.FileObjReadOptions.UseObjGsAs.ObjGroupsAsObjects
OBJ "g"s in the file will become Rhino objects