Rhino.UI.IPanel
Implement this interface when you want to be notified of when a panel
is shown, hidden or closed.

Rhino.UI.IPanel.PanelShown(System.UInt32,Rhino.UI.ShowPanelReason)
Since: 6.0

Rhino.UI.IPanel.PanelHidden(System.UInt32,Rhino.UI.ShowPanelReason)
Since: 6.0

Rhino.UI.IPanel.PanelClosing(System.UInt32,System.Boolean)
Since: 6.0