Rhino.Geometry.SubDChainType
SubD::ChainType specifies what edge and vertex tag tests are used when creating edge chains.

Rhino.Geometry.SubDChainType.Unset
Unset.

Rhino.Geometry.SubDChainType.MixedTag
All types of edges and vertices can be in the chain.

Rhino.Geometry.SubDChainType.EqualEdgeTag
Every edge in an edge chain has the same smooth/crease property.

Rhino.Geometry.SubDChainType.EqualEdgeAndVertexTag
Every edge in an edge chain has the same smooth/crease edge tag
and interior vertices have the corresponding smooth/crease vertex tag.

Rhino.Geometry.SubDChainType.EqualEdgeTagAndOrdinary
Every edge in an edge chain has the same smooth/crease property
and every edge has the same number of faces.
If the edges have 1 face, then interior vertices have valence = 3.
If the edges have 2 faces, then interior vertices have valence = 4.

Rhino.Geometry.SubDChainType.EqualEdgeAndVertexTagAndOrdinary
Every edge in an edge chain has the same smooth/crease edge tag,
every edge has the same number of faces,
and interior vertices have the corresponding smooth/crease vertex tag.
If the edges have 1 face, then interior vertices have valence = 3.
If the edges have 2 faces, then interior vertices have valence = 4.