Rhino.DocObjects.BrepObject
Represents a Brep in a document.

Rhino.DocObjects.BrepObject.BrepGeometry
Gets the Brep geometry linked with this object.
Since: 5.0

Rhino.DocObjects.BrepObject.DuplicateBrepGeometry
Constructs a new deep copy of the Brep geometry.
Returns: The copy of the geometry.
Since: 5.0