Rhino.DocObjects.Tables.HatchPatternTable
All of the hatch pattern definitions contained in a rhino document.

Rhino.DocObjects.Tables.HatchPatternTable.Item(System.Int32)
Conceptually, the hatch pattern table is an array of hatch patterns.
The operator[] can be used to get individual hatch patterns. A hatch pattern is
either active or deleted and this state is reported by HatchPattern.IsDeleted.
index: zero based array index.
Returns:
If index is out of range, the current hatch pattern is returned.

Rhino.DocObjects.Tables.HatchPatternTable.CurrentHatchPatternIndex
At all times, there is a "current" hatch pattern.  Unless otherwise
specified, new objects are assigned to the current hatch pattern.
The current hatch pattern is never locked, hidden, or deleted.
Since: 5.0

Rhino.DocObjects.Tables.HatchPatternTable.ComponentType
Since: 6.0

Rhino.DocObjects.Tables.HatchPatternTable.Find(System.String,System.Boolean)
Finds the hatch pattern with a given name. Search ignores case.
name: The name of the hatch pattern to be found.
ignoreDeleted: true means don't search deleted hatch patterns.
Returns: Index of the hatch pattern with the given name. -1 if no hatch pattern found.
Since: 5.0
6.0

Rhino.DocObjects.Tables.HatchPatternTable.FindName(System.String)
Finds the hatch pattern with a given name. Search ignores case.
name: The name of the hatch pattern to be found.
Returns: Hatch pattern with the given name. Null if no hatch pattern found.
Since: 6.0

Rhino.DocObjects.Tables.HatchPatternTable.FindNameHash(Rhino.FileIO.NameHash)
Finds a HatchPattern given its name hash.
nameHash: The name hash of the HatchPattern to be searched.
Returns: An Linetype, or null on error.
Since: 6.0

Rhino.DocObjects.Tables.HatchPatternTable.FindIndex(System.Int32)
Retrieves a HatchPattern object based on Index. This search type of search is discouraged.
We are moving towards using only IDs for all tables.
index: The index to search for.
Returns: A HatchPattern object, or null if none was found.
Since: 6.0

Rhino.DocObjects.Tables.HatchPatternTable.Add(Rhino.DocObjects.HatchPattern)
Adds a new hatch pattern with specified definition to the table.
pattern:
definition of new hatch pattern. The information in pattern is copied.
If pattern.Name is empty the a unique name of the form "HatchPattern 01"
will be automatically created.
Returns:
>=0 index of new hatch pattern
-1  not added because a hatch pattern with that name already exists or
some other problem occurred.
Since: 5.0

Rhino.DocObjects.Tables.HatchPatternTable.System#Collections#Generic#ICollection{Rhino#DocObjects#HatchPattern}#Add(Rhino.DocObjects.HatchPattern)
Since: 5.0

Rhino.DocObjects.Tables.HatchPatternTable.Modify(Rhino.DocObjects.HatchPattern,System.Int32,System.Boolean)
Modify hatch pattern settings.
hatchPattern: Definition of new hatch pattern. The information in the hatch pattern is copied.
hatchPatternIndex: Zero based index of the hatch pattern to modify.
quiet: If true, information message boxes pop up when illegal changes are attempted.
Returns: True if successful, or false if hatchPatternIndex is out of range.
Since: 8.0

Rhino.DocObjects.Tables.HatchPatternTable.Delete(Rhino.DocObjects.HatchPattern)
Deletes a hatch pattern from the table.
item: The hatch pattern to delete.
Returns: true if successful, false otherwise.
Since: 6.0

Rhino.DocObjects.Tables.HatchPatternTable.Delete(Rhino.DocObjects.HatchPattern,System.Boolean)
Deletes a hatch pattern from the table.
item: The hatch pattern to delete.
quiet: If true, no warning message box appears if hatch pattern cannot be deleted.
Returns: true if successful, false otherwise.
Since: 6.0

Rhino.DocObjects.Tables.HatchPatternTable.Delete(System.Int32)
Deletes a hatch pattern from the table.
hatchPatternIndex: The index of the hatch pattern to delete.
Returns: true if successful, false otherwise.
Since: 7.0

Rhino.DocObjects.Tables.HatchPatternTable.Delete(System.Int32,System.Boolean)
Deletes a hatch pattern from the table.
hatchPatternIndex: The index of the hatch pattern to delete.
quiet: If true, no warning message box appears if hatch pattern cannot be deleted.
Returns: true if successful, false otherwise.
Since: 7.0

Rhino.DocObjects.Tables.HatchPatternTable.Rename(Rhino.DocObjects.HatchPattern,System.String)
Renames a hatch pattern in the table.
item: The hatch pattern to rename
hatchPatternName: The new hatch pattern name.
Returns: true if successful, false otherwise.
Since: 7.0

Rhino.DocObjects.Tables.HatchPatternTable.Rename(System.Int32,System.String)
Renames a hatch pattern in the table.
hatchPatternIndex: The index of the hatch pattern to rename.
hatchPatternName: The new hatch pattern name.
Returns: true if successful, false otherwise.
Since: 7.0