Rhino.Geometry.SquishFlatteningAlgorithm
Represents the type of flattening to use

Rhino.Geometry.SquishFlatteningAlgorithm.Geometric
geometric flattening algorithm: (scale independent)the "spring" constant is
proportional to 1/L^2 and the result is independent of scale.

Rhino.Geometry.SquishFlatteningAlgorithm.PhysicalStress
physical stress flattening algorithm: (scale dependent) the "spring" constant is
proportional to 1/L.