Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList_Shapes
Since: 6.0
6.6

Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList_Shapes.Square
Square thumbnails.

Rhino.UI.Controls.ThumbnailUI.IRhRdkThumbnailList_Shapes.Wide
Wide thumbnails.