Rhino.Runtime.InteropWrappers.SimpleArrayLine
Wrapper for ON_SimpleArray<ON_Line>. If you are not writing C++ code
then this class is not for you.

Rhino.Runtime.InteropWrappers.SimpleArrayLine.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayLine.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayLine.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayLine instance.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayLine.Count
Gets the amount of lines in this array.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayLine.ToArray
Copies the unmanaged array to a managed counterpart.
Returns: The managed array.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayLine.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.SimpleArrayLine.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0