Rhino.FileIO.FileUsd
Support for writing USD file format

Rhino.FileIO.FileUsd.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileUsdWriteOptions)
Write a USD file based on the contents of a RhinoDoc
path: path to write a file to
doc: document to get geometry from
options: options used for generating the USD file
Returns: true on success
Since: 8.0