Rhino.DocObjects.Tables.GroupTable
Group tables store the list of groups in a Rhino document.

Rhino.DocObjects.Tables.GroupTable.ComponentType
Since: 6.0

Rhino.DocObjects.Tables.GroupTable.Find(System.String)
Finds a group with a given name.
groupName:
Name of group to search for. Ignores case.
Returns:
>=0 index of the group with the given name.
UnsetIntIndex no group found with the given name.
Since: 6.0

Rhino.DocObjects.Tables.GroupTable.Item(System.Int32)
Conceptually, the group table is an array of groups.
The operator[] can be used to get individual groups.
A group is either active or deleted and this state is reported by Group.IsDeleted.
index: zero based array index.
Returns:
Reference to the group. If index is out of range, null is returned.
Note that this reference may become invalid after Add() is called.
Since: 8.5

Rhino.DocObjects.Tables.GroupTable.Find(System.String,System.Boolean)
Finds a group with a given name.
groupName:
Name of group to search for. Ignores case.
ignoreDeletedGroups:
This parameter is ignored. Deleted groups are never searched.
Returns:
>=0 index of the group with the given name.
-1 no group found with the given name.
Since: 5.0
6.0

Rhino.DocObjects.Tables.GroupTable.FindName(System.String)
Finds a group given its name. Returns the instance, rather than the index.
name: The name of the group to be searched.
Returns: An group, or null on error.
Since: 6.0

Rhino.DocObjects.Tables.GroupTable.FindNameHash(Rhino.FileIO.NameHash)
Finds a group given its name hash.
nameHash: The name hash of the group to be searched.
Returns: An group, or null on error.
Since: 6.0

Rhino.DocObjects.Tables.GroupTable.FindIndex(System.Int32)
Retrieves a Group object based on Index. This search type of search is discouraged.
We are moving towards using only IDs for all tables.
index: The index to search for.
Returns: A Group object, or null if none was found.
Since: 6.0

Rhino.DocObjects.Tables.GroupTable.Add(System.String)
Adds a new empty group to the group table.
groupName: name of new group.
Returns:
>=0 index of new group.
-1 group not added because a group with that name already exists.
Remarks:
In some cases, calling Add() can cause the group indices to become invalid.
Since: 5.0

Rhino.DocObjects.Tables.GroupTable.Add
Adds a new empty group to the group table.
Returns:
>=0 index of new group.
-1 group not added because a group with that name already exists.
Remarks:
In some cases, calling Add() can cause the group indices to become invalid.
Since: 5.0

Rhino.DocObjects.Tables.GroupTable.Add(System.String,System.Collections.Generic.IEnumerable{System.Guid})
Adds a new group to the group table with a set of objects.
groupName: Name of new group.
objectIds: An array, a list or any enumerable set of object IDs.
Returns:
>=0 index of new group.
-1 group not added because a group with that name already exists.
Remarks:
In some cases, calling Add() can cause the group indices to become invalid.
Since: 5.0

Rhino.DocObjects.Tables.GroupTable.Add(System.Collections.Generic.IEnumerable{System.Guid})
Adds a new group to the group table with a set of objects.
objectIds: An array, a list or any enumerable set of object IDs.
Returns:
>=0 index of new group.
-1 group not added because a group with that name already exists.
Remarks:
In some cases, calling Add() can cause the group indices to become invalid.
Since: 5.0

Rhino.DocObjects.Tables.GroupTable.AddToGroup(System.Int32,System.Guid)
Adds an object to an existing group.
groupIndex: The group index value.
objectId: An ID of an object.
Returns: true if the operation was successful.
Since: 5.0

Rhino.DocObjects.Tables.GroupTable.AddToGroup(System.Int32,System.Collections.Generic.IEnumerable{System.Guid})
Adds a list of objects to an existing group.
groupIndex: The group index value.
objectIds: An array, a list or any enumerable set of IDs to objects.
Returns: true if at least an operation was successful.
Since: 5.0

Rhino.DocObjects.Tables.GroupTable.Delete(System.Int32)
Deletes a group from this table.
Deleted groups are kept in the runtime group table so that undo
will work with groups. Call IsDeleted() to determine if a group is deleted.
groupIndex: An group index to be deleted.
Returns: true if the operation was successful.
Since: 5.0

Rhino.DocObjects.Tables.GroupTable.Delete(Rhino.DocObjects.Group)
Since: 6.0

Rhino.DocObjects.Tables.GroupTable.Undelete(System.Int32)
Undeletes a previously deleted group.
groupIndex: The index of the group.
Returns: true if successful, false otherwise.
Since: 5.0

Rhino.DocObjects.Tables.GroupTable.IsDeleted(System.Int32)
Verifies a group is deleted.
groupIndex: The index of the group.
Returns: true if the group is deleted, false otherwise.

Rhino.DocObjects.Tables.GroupTable.GroupName(System.Int32)
Returns the name of a group.
groupIndex: The index of the group.
Returns: The group name.
Since: 5.0

Rhino.DocObjects.Tables.GroupTable.ChangeGroupName(System.Int32,System.String)
Changes the name of a group.
groupIndex: The index of the group.
newName: The new group name.
Returns: true if successful, false otherwise.

Rhino.DocObjects.Tables.GroupTable.GroupNames(System.Boolean)
Returns an array of all group names.
ignoreDeletedGroups: Ignore any groups that were deleted.
Returns: An array if group names if successful, null if there are no groups.
Since: 5.0

Rhino.DocObjects.Tables.GroupTable.Hide(System.Int32)
Hides all objects that are members of a group.
groupIndex: The index of the group.
Returns: The number of objects that were hidden.
Since: 5.0

Rhino.DocObjects.Tables.GroupTable.Show(System.Int32)
Shows, or unhides, all objects that are members of a group.
groupIndex: The index of the group.
Returns: The number of objects that were shown.
Since: 5.0

Rhino.DocObjects.Tables.GroupTable.Lock(System.Int32)
Locks all objects that are members of a group.
groupIndex: The index of the group.
Returns: The number of objects that were locked.
Since: 5.0

Rhino.DocObjects.Tables.GroupTable.Unlock(System.Int32)
Unlocks all objects that are members of a group.
groupIndex: The index of the group.
Returns: The number of objects that were unlocked.
Since: 5.0

Rhino.DocObjects.Tables.GroupTable.GroupObjectCount(System.Int32)
Returns the number of objects that are members of a group.
groupIndex: The index of the group.
Returns: The number of objects that are members of the group.
Since: 5.0

Rhino.DocObjects.Tables.GroupTable.GroupMembers(System.Int32)
Gets an array of all of the objects in a group.
groupIndex: The index of the group in this table.
Returns: An array with all the objects in the specified group.
Since: 5.0

Rhino.DocObjects.Tables.GroupTable.RemapObjects(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},System.Collections.Generic.Dictionary{System.Int32,System.Int32}@)
Remaps an enumeration of Rhino objects to new groups.
rhinoObjects: The enumeration of Rhino objects.
indexMap: A map from old group indices to new group indices.
Returns: The number of Rhino objects that were modified.
Remarks:
In some situations, a bunch of Rhino objects are copied, new groups need to be created. This method handles the details.
Since: 8.16

Rhino.DocObjects.Tables.GroupTable.RemapObjects(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject})
Remaps an enumeration of Rhino objects to new groups.
rhinoObjects: The enumeration of Rhino objects.
Returns: The number of Rhino objects that were modified.
Remarks:
In some situations, a bunch of Rhino objects are copied, new groups need to be created. This method handles the details.
Since: 8.16