Rhino.FileIO.FileX3dvWriteOptions
Options for writing a x3dv file

Rhino.FileIO.FileX3dvWriteOptions.ExportTextureCoordinates
Since: 8.0

Rhino.FileIO.FileX3dvWriteOptions.ExportVertexNormals
Since: 8.0

Rhino.FileIO.FileX3dvWriteOptions.ExportVertexColors
Since: 8.0

Rhino.FileIO.FileX3dvWriteOptions.MeshingParameters
Since: 8.0

Rhino.FileIO.FileX3dvWriteOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0