Rhino.Render.RenderMaterialTable.Add(Rhino.Render.RenderMaterial)
Since: 6.0

Rhino.Render.RenderMaterialTable.Remove(Rhino.Render.RenderMaterial)
Since: 6.0

Rhino.Render.RenderMaterialTable.Find(System.Guid)
Since: 8.0

Rhino.Render.RenderMaterialTable.BeginChange(Rhino.Render.RenderContent.ChangeContexts)
Since: 7.0

Rhino.Render.RenderMaterialTable.EndChange
Since: 7.0

Rhino.Render.RenderMaterialTable.GetEnumerator
Since: 5.7

Rhino.Render.RenderMaterialTable.System#Collections#IEnumerable#GetEnumerator
Since: 5.7

Rhino.Render.RenderMaterialTable.Count
Since: 5.7