Rhino.DocObjects.ReplayHistoryResult.ExistingObject
The previously existing object.
Do not attempt to edit this object. It might have been already deleted by, for example, dragging.
Since: 5.0

Rhino.DocObjects.ReplayHistoryResult.UpdateToPoint(Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.ReplayHistoryResult.UpdateToPointCloud(Rhino.Geometry.PointCloud,Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.ReplayHistoryResult.UpdateToPointCloud(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.ReplayHistoryResult.UpdateToClippingPlane(Rhino.Geometry.Plane,System.Double,System.Double,System.Guid,Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.ReplayHistoryResult.UpdateToClippingPlane(Rhino.Geometry.Plane,System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Guid},Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.ReplayHistoryResult.UpdateToLinearDimension(Rhino.Geometry.LinearDimension,Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.ReplayHistoryResult.UpdateToRadialDimension(Rhino.Geometry.RadialDimension,Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.ReplayHistoryResult.UpdateToAngularDimension(Rhino.Geometry.AngularDimension,Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.ReplayHistoryResult.UpdateToLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.ReplayHistoryResult.UpdateToPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.ReplayHistoryResult.UpdateToArc(Rhino.Geometry.Arc,Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.ReplayHistoryResult.UpdateToCircle(Rhino.Geometry.Circle,Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.ReplayHistoryResult.UpdateToEllipse(Rhino.Geometry.Ellipse,Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.ReplayHistoryResult.UpdateToSphere(Rhino.Geometry.Sphere,Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.ReplayHistoryResult.UpdateToCurve(Rhino.Geometry.Curve,Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.ReplayHistoryResult.UpdateToTextDot(Rhino.Geometry.TextDot,Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.ReplayHistoryResult.UpdateToText(System.String,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean,Rhino.Geometry.TextJustification,Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.ReplayHistoryResult.UpdateToText(Rhino.Geometry.TextEntity,Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.ReplayHistoryResult.UpdateToSurface(Rhino.Geometry.Surface,Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.ReplayHistoryResult.UpdateToExtrusion(Rhino.Geometry.Extrusion,Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.ReplayHistoryResult.UpdateToMesh(Rhino.Geometry.Mesh,Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.ReplayHistoryResult.UpdateToSubD(Rhino.Geometry.SubD,Rhino.DocObjects.ObjectAttributes)
Since: 7.18

Rhino.DocObjects.ReplayHistoryResult.UpdateToBrep(Rhino.Geometry.Brep,Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.ReplayHistoryResult.UpdateToLeader(Rhino.Geometry.Leader,Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.ReplayHistoryResult.UpdateToHatch(Rhino.Geometry.Hatch,Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.ReplayHistoryResult.UpdateToInstanceReferenceGeometry(Rhino.Geometry.InstanceReferenceGeometry,Rhino.DocObjects.ObjectAttributes)
Since: 7.30