Rhino.Runtime.IOperatingSystemInformation
Interface for querying information about the operating system Rhino is running on.

Rhino.Runtime.IOperatingSystemInformation.InstallationType
Returns Operating System Installation Type: "Client" | "Server" | "Unknown"

Rhino.Runtime.IOperatingSystemInformation.Edition
Returns Operating System Edition: "Professional" | "ServerDatacenter" | ... | "Unknown"

Rhino.Runtime.IOperatingSystemInformation.ProductName
Returns Operating System Product Name "Windows 10 Pro" | "Windows Server 2008 R2 Datacenter" | ... | "Unknown"

Rhino.Runtime.IOperatingSystemInformation.Version
Returns Operating System Version "6.1" | "6.3" | ... | "Unknown"

Rhino.Runtime.IOperatingSystemInformation.BuildNumber
Returns Operating System Build Number "11763" | "7601" | ... | "Unknown"

Rhino.Runtime.IOperatingSystemInformation.IsRunningInWindowsContainer
Checks if Operating System is running in a Windows Container