Rhino.UI.SaveFileDialog
Similar to the System.Windows.Forms.SaveFileDialog, but with customized
Rhino user interface.

Rhino.UI.SaveFileDialog.#ctor
Since: 5.0

Rhino.UI.SaveFileDialog.DefaultExt
The default file name extension. The returned string does not include the period.
Since: 5.0

Rhino.UI.SaveFileDialog.FileName
Gets or sets a string containing the file name selected in the file dialog box.
Since: 5.0

Rhino.UI.SaveFileDialog.Title
Gets or sets the file dialog box title.
Since: 5.0

Rhino.UI.SaveFileDialog.Filter
Gets or sets the current file name filter string, which determines
the choices that appear in the "Save as file type" or "Files of type"
box in the dialog box. See System.Windows.Forms.FileDialog for details.
Since: 5.0

Rhino.UI.SaveFileDialog.InitialDirectory
Gets or sets the initial directory displayed by the file dialog box.
Since: 5.0

Rhino.UI.SaveFileDialog.ShowDialog
Since: 5.0
6.0

Rhino.UI.SaveFileDialog.ShowSaveDialog
Returns: true if a file was selected. false if the dialog was canceled
Since: 5.10