Rhino.Runtime.InteropWrappers.StdVectorByte
Wrapper for std::vector<unsigned char>. If you are not writing C++ code
then this class is not for you.

Rhino.Runtime.InteropWrappers.StdVectorByte.ConstPointer
Gets the constant (immutable) pointer of this vector.
Returns: The constant pointer.
Since: 7.26

Rhino.Runtime.InteropWrappers.StdVectorByte.NonConstPointer
Gets the non-constant pointer (for modification) of this vector.
Returns: The non-constant pointer.
Since: 7.26

Rhino.Runtime.InteropWrappers.StdVectorByte.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayByte class.
Since: 7.26

Rhino.Runtime.InteropWrappers.StdVectorByte.#ctor(System.UInt64)
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayByte class.
initialSize: Initial size of the array - all values are set to zero.

Rhino.Runtime.InteropWrappers.StdVectorByte.#ctor(Rhino.Runtime.InteropWrappers.StdVectorByte)
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayByte with the contents of another SimpleArrayByte.
Since: 7.26

Rhino.Runtime.InteropWrappers.StdVectorByte.CopyTo(Rhino.Runtime.InteropWrappers.StdVectorByte)
Copies the contents of a Rhino.Runtime.InteropWrappers.StdVectorByte into another StdVectorByte.
Since: 7.26

Rhino.Runtime.InteropWrappers.StdVectorByte.#ctor(System.Collections.Generic.IEnumerable{System.Byte})
Initializes a new Rhino.Runtime.InteropWrappers.StdVectorByte class
values: initial set of integers to add to the array
Since: 7.26

Rhino.Runtime.InteropWrappers.StdVectorByte.Count
Gets the amount of elements in this array.
Since: 7.26

Rhino.Runtime.InteropWrappers.StdVectorByte.Memory
Return the raw data.
Since: 7.26

Rhino.Runtime.InteropWrappers.StdVectorByte.ToArray
Returns the managed counterpart of the unmanaged array.
Returns: The managed array.
Since: 7.26

Rhino.Runtime.InteropWrappers.StdVectorByte.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.StdVectorByte.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 7.0