Rhino.Render.Fields.DateTimeField
DateTime field value class

Rhino.Render.Fields.DateTimeField.#ctor(Rhino.Render.RenderContent,System.IntPtr)
Constructor
renderContent: RenderContent whose Fields owns this filed.
attachToPointer: Existing C++ pointer to attach to.

Rhino.Render.Fields.DateTimeField.Value
Gets or sets the field value
Since: 5.1

Rhino.Render.Fields.DateTimeField.ValueAsObject
Since: 5.7