Rhino.DocObjects.Font.FontWeight
Weight enum values
Avoid casting these values to int.
Use ON_Font::WindowsLogfontWeightFromWeight() or
ON_Font::AppleWeightOfFontFromWeight() or
add another converter.

Rhino.DocObjects.Font.FontWeight.Unset
Not set.

Rhino.DocObjects.Font.FontWeight.Thin
IsLight = true

Rhino.DocObjects.Font.FontWeight.Ultralight
IsLight = true

Rhino.DocObjects.Font.FontWeight.Light
IsLight = true

Rhino.DocObjects.Font.FontWeight.Normal
Default font weight. IsNormalWeight = true  Also called Regular.

Rhino.DocObjects.Font.FontWeight.Medium
IsNormalWeight = true

Rhino.DocObjects.Font.FontWeight.Semibold
IsBold = true

Rhino.DocObjects.Font.FontWeight.Bold
IsBold = true

Rhino.DocObjects.Font.FontWeight.Ultrabold
IsBold = true

Rhino.DocObjects.Font.FontWeight.Heavy
IsBold = true Also called Black