Rhino.Runtime.Notifications.Notification.Severity
Determines the severity of a notification.
Since: 6.0

Rhino.Runtime.Notifications.Notification.Severity.Debug
Least serious.

Rhino.Runtime.Notifications.Notification.Severity.Info
Not serious.

Rhino.Runtime.Notifications.Notification.Severity.Warning
Important.

Rhino.Runtime.Notifications.Notification.Severity.Serious
Very important.

Rhino.Runtime.Notifications.Notification.Severity.Critical
Extremely important.