Rhino.FileIO.File3dmEmbeddedFile
Since: 8.0

Rhino.FileIO.File3dmEmbeddedFile.#ctor
Since: 8.0

Rhino.FileIO.File3dmEmbeddedFile.Filename
the fully-qualified filename of the embedded file. This filename may or may not refer to a
local file depending on the way the embedded file was loaded. For example, if it was loaded from an
archive, the filename could be that of a file on a different computer.
Since: 8.0

Rhino.FileIO.File3dmEmbeddedFile.SaveToFile(System.String)
Saves the contents of the embedded file to a local file.
Returns true if successful, else false.
Since: 8.0

Rhino.FileIO.File3dmEmbeddedFile.ComponentType
Returns Rhino.DocObjects.ModelComponentType.EmbeddedFile.
Since: 8.0