Rhino.Render.MetaDataProxy
ProxyClass for MetaData

Rhino.Render.MetaDataProxy.CppPointer
MetaDataProxy c++ pointer
Since: 6.8

Rhino.Render.MetaDataProxy.#ctor
Constructor for MetaDataProxy
Since: 6.8

Rhino.Render.MetaDataProxy.Finalize
Destructor for MetaDataProxy

Rhino.Render.MetaDataProxy.Dispose
Dispose for MetaDataProxy
Since: 6.8

Rhino.Render.MetaDataProxy.Dispose(System.Boolean)
Dispose for MetaDataProxy

Rhino.Render.MetaDataProxy.SetContentInstanceId(System.Guid)
Set Content instance id for meta data
Since: 6.8