Rhino.Render.Fields.GuidField
Guid field value class

Rhino.Render.Fields.GuidField.#ctor(Rhino.Render.RenderContent,System.IntPtr)
Constructor
renderContent: RenderContent whose Fields owns this filed.
attachToPointer: Existing C++ pointer to attach to.

Rhino.Render.Fields.GuidField.Value
Gets or sets the field value
Since: 5.1

Rhino.Render.Fields.GuidField.ValueAsObject
Since: 5.7