Rhino.ApplicationSettings.SelectionFilterSettingsState
Represents a snapshot of Rhino.ApplicationSettings.SelectionFilterSettings.

Rhino.ApplicationSettings.SelectionFilterSettingsState.#ctor
Internal constructor

Rhino.ApplicationSettings.SelectionFilterSettingsState.GlobalGeometryFilter
The global geometry type filter controls which types of geometry will be filtered.
Note, the filter can be a bitwise combination of multiple object types.
Since: 7.0

Rhino.ApplicationSettings.SelectionFilterSettingsState.OneShotGeometryFilter
The one-shot geometry type filter controls which types of geometry will be filtered for one selection.
Note, the filter can be a bitwise combination of multiple object types.
Since: 7.0

Rhino.ApplicationSettings.SelectionFilterSettingsState.Enabled
Enables or disables the global object selection filter.
Since: 7.0

Rhino.ApplicationSettings.SelectionFilterSettingsState.SubObjectSelect
Enables or disabled sub-object selection.
Since: 7.0