Rhino.Runtime.InProcess.RhinoCore
Represents an instance of RhinoCore.DLL.

Rhino.Runtime.InProcess.RhinoCore.#ctor
Initializes a new instance of the Rhino.Runtime.InProcess.RhinoCore class.
Remarks: This constructor creates a headless instance of Rhino.
No Rhino UI will be created at all.
Since: 7.0

Rhino.Runtime.InProcess.RhinoCore.#ctor(System.String[])
Initializes a new instance of the Rhino.Runtime.InProcess.RhinoCore class.
args: Rhino command line parameters
Remarks: For args documentation see "https://developer.rhino3d.com/guides/cpp/running-rhino-from-command-line/"
Since: 7.0

Rhino.Runtime.InProcess.RhinoCore.#ctor(System.String[],Rhino.Runtime.InProcess.WindowStyle)
Initializes a new instance of the Rhino.Runtime.InProcess.RhinoCore class.
args: Rhino command line parameters
windowStyle: Rhino main window initial style
Remarks: For args documentation see "https://developer.rhino3d.com/guides/cpp/running-rhino-from-command-line/"
Since: 7.0

Rhino.Runtime.InProcess.RhinoCore.#ctor(System.String[],Rhino.Runtime.InProcess.WindowStyle,System.IntPtr)
Initializes a new instance of the Rhino.Runtime.InProcess.RhinoCore class.
args: Rhino command line parameters
windowStyle: Rhino main window initial style
hostWnd: Host main window OS native handle
Remarks: For args documentation see "https://developer.rhino3d.com/guides/cpp/running-rhino-from-command-line/"
Since: 7.0

Rhino.Runtime.InProcess.RhinoCore.StartupOrigin
Gets how RhinoCore was started.

Rhino.Runtime.InProcess.RhinoCore.Run
Runs RhinoApp Message loop
Since: 7.0

Rhino.Runtime.InProcess.RhinoCore.RaiseIdle
Raises the Idle event.
Since: 7.0

Rhino.Runtime.InProcess.RhinoCore.DoIdle
Processes all Rhino Idle tasks.
Returns: True if Idle tasks are still pending.
Since: 7.0

Rhino.Runtime.InProcess.RhinoCore.DoEvents
If a Rhino owned window is active processes all Windows messages currently in the message queue.
Returns: Returns true if a Rhino owned window is still active or Idle tasks are pending.
Since: 7.0

Rhino.Runtime.InProcess.RhinoCore.InvokeInHostContext(System.Action)
Invokes action in Host context
Since: 7.0

Rhino.Runtime.InProcess.RhinoCore.InvokeInHostContext``1(System.Func{``0})
Invokes function in Host context
Returns: Returns argument function return value.
Since: 7.0

Rhino.Runtime.InProcess.RhinoCore.Dispose
IDisposable implementation
Since: 7.0

Rhino.Runtime.InProcess.RhinoCore.Finalize
IDisposable implementation