Rhino.Collections.RhinoListHelpers.GetConstArray``1(System.Collections.Generic.IEnumerable{``0},System.Int32@)
Anything calling this function should not be modifying the contents of the array.
items: A list, an array or any enumerable set of anything.
count: The resulting count of elements.
Returns: An array.