Rhino.UI.Controls.IHeaderButtonHandler
This interface represents a handler for putting custom buttons on the header of IRhinoUiSection.

Rhino.UI.Controls.IHeaderButtonHandler.DeleteThis
Since: 7.4

Rhino.UI.Controls.IHeaderButtonHandler.ButtonDetails(System.Int32,System.Drawing.Bitmap@,System.String@)
Implement this method to describe custom buttons on the section header.
RDK calls this method continually increasing iIndex until it returns \e false
index: index is the button index starting at zero and increasing with each call.
iconOut: iconOut accepts the button's imagery, or 'icon'. If an icon is not required, do not set this parameter.
sToolTipOut: sToolTipOut accepts the button's tool-tip. If a tool-tip is not required, do not set this parameter.
Returns: \e true if button is required, \e false to stop.
Since: 7.4

Rhino.UI.Controls.IHeaderButtonHandler.OnButtonClicked(System.Int32)
Implement this method to handle a button click.
index: index is the index of the button that was clicked
Returns: \e true if handled successfully, else \e false.
Since: 7.4

Rhino.UI.Controls.IHeaderButtonHandler.ButtonRect(System.Int32,System.Drawing.Rectangle)
Implement this method to get the rectangle of a button on the header window.
index: index is the index of the button.
rectHeader: rectHeader is the usable area of the header where the buttons can be placed.
Returns: The rectangle of the button.
Since: 7.4