Rhino.DocObjects.TextOrientation
Method for getting rotation for drawing text

Rhino.DocObjects.TextOrientation.InPlane
Text has fixed rotation on a world coordinate plane

Rhino.DocObjects.TextOrientation.InView
Text is drawn on a plane perpendicular to view direction horizontal to the screen