Rhino.FileIO.File3dmCommonComponentTable`1
Provides a base table type that is shared among all File3dm tables.
A model component.

Rhino.FileIO.File3dmCommonComponentTable`1.Delete(`0)
Flags a component as deleted.
item: The item to flag.
Returns: True on success.

Rhino.FileIO.File3dmCommonComponentTable`1.Delete(System.Int32)
Flags a component as deleted.
index: The index of the item to flag.
Returns: True on success.

Rhino.FileIO.File3dmCommonComponentTable`1.Add(`0)
Adds an item.
item: The item to add.

Rhino.FileIO.File3dmCommonComponentTable`1.Dump
Prepares a text dump of object table.
Returns: A string containing the dump.