Rhino.PrivateMeshCommands.MeshTypes.WeshTopology
Creates a topology that is not welded. Only non-repeated points are considered same.

Rhino.PrivateMeshCommands.MeshTypes.WeshTopology.ComputeIfFacesAreNeighboring(System.Int32,System.Int32)
Egde span index of edge in fB. Or -1 if faces are not adjacent.