Rhino.DocObjects.SnapShots.SnapShotsClient
This is the abstract interface class for all Snapshot clients.

Rhino.DocObjects.SnapShots.SnapShotsClient.CppPointer
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.SerialNumber
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.#ctor
SnapShotsClient constructor
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.Dispose
SnapShotsClient Dispose
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.RegisterSnapShotClient(Rhino.DocObjects.SnapShots.SnapShotsClient)
Function used to register snapshots client
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.ApplicationCategory
Predefined application category
Returns:
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.DocumentCategory
Predefined document category
Returns:
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.RenderingCategory
Predefined rendering category
Returns:
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.ViewsCategory
Predefined views category
Returns:
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.ObjectsCategory
Predefined objects category
Returns:
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.LayersCategory
Predefined layers category
Returns:
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.LightsCategory
Predefined lights category
Returns:
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.PlugInId
The plug-in id that registers this client.
Returns: The plug-in id that registers this client.
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.ClientId
The unique id of this client.
Returns: The unique id of this client.
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.Category
The category of this client. Usually one of the above predefined categories like e.g
object, rendering or application category
Returns:
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.Name
The client's name.
Returns: The client's name.
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.SupportsDocument
Defines if the client supports document user data or not
Returns:  true if the client saves/restores document user data.
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.SaveDocument(Rhino.RhinoDoc,Rhino.FileIO.BinaryArchiveWriter)
Called when the user saves a snapshot and SupportDocument() returns true.
doc: doc is the current document
archive:  archive is the archive to write the data to
Returns: true if successful, otherwise false
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.RestoreDocument(Rhino.RhinoDoc,Rhino.FileIO.BinaryArchiveReader)
Called when the user restores a snapshot and SupportDocument() returns true.
doc: doc is the current document
archive: archive is the archive to read the data from
Returns: true if successful, otherwise false
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.SupportsObjects
Returns true if the client saves/restores object user data.
Returns: true if the client saves/restores object user data.
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.SupportsObject(Rhino.DocObjects.RhinoObject)
Returns true if the client saves/restores object user data for the given object.
doc_object: doc_object is the given object
Returns:  true if the client saves/restores object user data for the given object.
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.SaveObject(Rhino.RhinoDoc,Rhino.DocObjects.RhinoObject,Rhino.Geometry.Transform@,Rhino.FileIO.BinaryArchiveWriter)
Called when the user saves a snapshot and SupportsObjects() and SupportsObject(Rhino.DocObjects.RhinoObject doc_object) returns true.
doc: doc is the current document.
doc_object: doc_obj is the current object.
transform: transform is a transformation matrix. The matrix is set to identity the first time an object is associated with a snapshot.
After that the matrix is updated when the object is transformed(scale, rotate etc.).
archive: archive is the archive to write the data to.
Returns: true if successful, otherwise false.
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.RestoreObject(Rhino.RhinoDoc,Rhino.DocObjects.RhinoObject,Rhino.Geometry.Transform@,Rhino.FileIO.BinaryArchiveReader)
Called when the user restores a snapshot and SupportsObjects() and SupportsObject(Rhino.DocObjects.RhinoObject doc_object) returns true.
doc: doc is the current document.
doc_object: doc_obj is the current object.
transform: transform is a transformation matrix. The matrix is set to identity the first time an object is associated with a snapshot.
After that the matrix is updated when the object is transformed(scale, rotate etc.).
archive: archive is the archive to read the data from.
Returns: true if successful, otherwise false.
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.SnapshotRestored(Rhino.RhinoDoc)
Called after all clients restored their data.
doc:
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.SupportsAnimation
Returns true if the client allows animation.
Returns: true if the client allows animation.
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.AnimationStart(Rhino.RhinoDoc,System.Int32)
Called once at the start of an animation.
doc: doc is the current document.
iFrames: iFrames is the number of frames to be animated.
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.PrepareForDocumentAnimation(Rhino.RhinoDoc,Rhino.FileIO.BinaryArchiveReader,Rhino.FileIO.BinaryArchiveReader)
Called once at the start of an animation.
doc: doc is the current document.
archive_start: archive_start is a archive to the data of the starting position.
archive_stop: archive_stop is a archive to the data of the ending position.
Returns: true if successful, otherwise
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.ExtendBoundingBoxForDocumentAnimation(Rhino.RhinoDoc,Rhino.FileIO.BinaryArchiveReader,Rhino.FileIO.BinaryArchiveReader,Rhino.Geometry.BoundingBox@)
Called once at the start of an animation. This can be used to extend the scene bounding box to avoid clipping.
doc: doc is the current document.
archive_start: archive_start is a archive to the data of the starting position.
archive_stop: archive_stop is a archive to the data of the ending position.
bbox: bbox is the current scene bounding box.
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.AnimateDocument(Rhino.RhinoDoc,System.Double,Rhino.FileIO.BinaryArchiveReader,Rhino.FileIO.BinaryArchiveReader)
Called for each frame. Starting at 0.0.
doc: doc is the current document.
dPos: dPos is the current frame. Starting at 0.0.
archive_start: archive_start is a archive to the data of the starting position.
archive_stop: archive_stop is a archive to the data of the ending position.
Returns: true if successful, otherwise false.
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.PrepareForObjectAnimation(Rhino.RhinoDoc,Rhino.DocObjects.RhinoObject,Rhino.Geometry.Transform@,Rhino.FileIO.BinaryArchiveReader,Rhino.FileIO.BinaryArchiveReader)
Called once at the start of an animation.
doc: doc is the current document.
doc_object: doc_obj is the current object.
transform: transform is a transformation matrix. The matrix is set to identity the first time an object is associated with a snapshot.
After that the matrix is updated when the object is transformed(scale, rotate etc.).
archive_start: archive_start is a archive to the data of the starting position.
archive_stop: archive_stop is a archive to the data of the ending position.
Returns: true if successful, otherwise false.
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.ExtendBoundingBoxForObjectAnimation(Rhino.RhinoDoc,Rhino.DocObjects.RhinoObject,Rhino.Geometry.Transform@,Rhino.FileIO.BinaryArchiveReader,Rhino.FileIO.BinaryArchiveReader,Rhino.Geometry.BoundingBox@)
Called once at the start of an animation. This can be used to extend the scene bounding box to avoid clipping.
doc: doc is the current document.
doc_object: doc_obj is the current object.
transform: transform is a transformation matrix. The matrix is set to identity the first time an object is associated with a snapshot.
After that the matrix is updated when the object is transformed(scale, rotate etc.).
archive_start: archive_start is a archive to the data of the starting position.
archive_stop: archive_stop is a archive to the data of the ending position.
bbox: bbox is the current scene bounding box.
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.AnimateObject(Rhino.RhinoDoc,Rhino.DocObjects.RhinoObject,Rhino.Geometry.Transform@,System.Double,Rhino.FileIO.BinaryArchiveReader,Rhino.FileIO.BinaryArchiveReader)
Called for each frame. Starting at 0.0.
doc: doc is the current document.
doc_object: doc_obj is the current object.
transform: transform is a transformation matrix. The matrix is set to identity the first time an object is associated with a snapshot.
After that the matrix is updated when the object is transformed(scale, rotate etc.).
dPos: dPos is the current frame. Starting at 0.0.
archive_start: archive_start is a archive to the data of the starting position.
archive_stop: archive_stop is a archive to the data of the ending position.
Returns:
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.AnimationStop(Rhino.RhinoDoc)
Called once at the end of an animation.
doc: doc is the current document.
Returns:
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.ObjectTransformNotification(Rhino.RhinoDoc,Rhino.DocObjects.RhinoObject,Rhino.Geometry.Transform@,Rhino.FileIO.BinaryArchiveReader)
Called for every object that is associated with a snapshot and gets transformed in Rhino. This is getting called for each stored snapshot and gives the client the possibility to update the stored data.
doc: doc is the current document.
doc_object: doc_obj is the current object.
transform: transform is a transformation matrix. The matrix is set to identity the first time an object is associated with a snapshot.
After that the matrix is updated when the object is transformed(scale, rotate etc.).
archive: archive is a archive which can be used to update the stored data.
Returns: true if successful, otherwise false.
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.IsCurrentModelStateInAnySnapshot(Rhino.RhinoDoc,Rhino.FileIO.BinaryArchiveReader,Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader,Rhino.FileIO.TextLog)
Called before restoring a snapshot. Warns the user if the current model state is not already saved.
doc: doc is the current document.
archive: archive is the current state of the model.
archive_array: archive_array is a list of client data.
text_log: text_log is used to list the missing items that cannot be found in the current model.
Returns: return true if successful, otherwise false.
Since: 6.0

Rhino.DocObjects.SnapShots.SnapShotsClient.IsCurrentModelStateInAnySnapshot(Rhino.RhinoDoc,Rhino.DocObjects.RhinoObject,Rhino.FileIO.BinaryArchiveReader,Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader,Rhino.FileIO.TextLog)
Called before restoring a snapshot. Warns the user if the current model state is not already saved.
doc: doc is the current document.
doc_object: doc_object is the current object.
archive: archive is the current state of the model.
archive_array: archive_array is a list of client data.
text_log: text_log is used to list the missing items that cannot be found in the current model.
Returns: return true if successful, otherwise false.
Since: 6.0