Rhino.PrivateMeshCommands.MeshTypes.PointSearch.Tree2`2
A lightweight kd-tree implementation that diretly draws from a source using arrays as indirections.
It does not necessarily have to copy the point array.

Rhino.PrivateMeshCommands.MeshTypes.PointSearch.Tree2`2.g_dimensions
Number of dimensions of the underlying point

Rhino.PrivateMeshCommands.MeshTypes.PointSearch.Tree2`2.#ctor(`0[])
Creates a KD-tree with the specified content.
Items must be the same number, or more, than keys.

Rhino.PrivateMeshCommands.MeshTypes.PointSearch.Tree2`2.Add(System.Int32)
Insert a node in a KD-tree. Nothing happens if value is already present.
@Book{GonnetBaezaYates1991,
author =    {G.H. Gonnet and R. Baeza-Yates},
title =     {Handbook of Algorithms and Data Structures},
publisher = {Addison-Wesley},
year =      {1991}}
key: key for KD-tree node

Rhino.PrivateMeshCommands.MeshTypes.PointSearch.Tree2`2.GetEnumerator
Perform breadth-first search of tree, yielding every node found
Returns: An enumerator that can visit all nodes

Rhino.PrivateMeshCommands.MeshTypes.PointSearch.Tree2`2.InnerSearch(`0,System.Int32)
Method srch translated from 352.srch.c of Gonnet & Baeza-Yates

Rhino.PrivateMeshCommands.MeshTypes.PointSearch.Tree2`2.Insert(System.Int32,System.Int32,System.Int32)
Method insert translated from 352.ins.c of Gonnet & Baeza-Yates

Rhino.PrivateMeshCommands.MeshTypes.PointSearch.Tree2`2.Nf(`0,System.Double@)
Nearest fast. Recursively splits the active hyperplane.

Rhino.PrivateMeshCommands.MeshTypes.PointSearch.Tree2`2.Nf(`0,System.Int32,System.Int32@,System.Double@)
Same logic as in nearest method in 352.ins.c of Gonnet & Baeza-Yates,
but rewritten.