Rhino.FileIO.FileGHSReadOptions.ReadViewType
Since: 8.0

Rhino.FileIO.FileGHSReadOptions.ReadViewType.Body
BodyView

Rhino.FileIO.FileGHSReadOptions.ReadViewType.Profile
Profile View

Rhino.FileIO.FileGHSReadOptions.ReadViewType.Plan
Plan View

Rhino.FileIO.FileGHSReadOptions.ReadViewType.Wire
Wireframe

Rhino.FileIO.FileGHSReadOptions.ReadViewType.Solid
Mesh

Rhino.FileIO.FileGHSReadOptions.ReadViewType.Camera
eCAMERA

Rhino.FileIO.FileGHSReadOptions.ReadViewType.Custom
eCUSTOM