Rhino.DocObjects.ObjectPlotWeightSource
Defines enumerated values for the source of plotting/printing weight of single objects.
Since: 5.0

Rhino.DocObjects.ObjectPlotWeightSource.PlotWeightFromLayer
use plot color assigned to layer.

Rhino.DocObjects.ObjectPlotWeightSource.PlotWeightFromObject
use plot color assigned to object.

Rhino.DocObjects.ObjectPlotWeightSource.PlotWeightFromParent
for objects with parents (like objects in instance references, use parent plot color)
if no parent, treat as plot_color_from_layer.