Rhino.Geometry.SweepOneRail
Utility class for generating Breps by sweeping cross section curves over a single rail curve.
Note, this class has been superseded by the Rhino.Geometry.Brep.CreateFromSweep static functions.

Rhino.Geometry.SweepOneRail.#ctor
Since: 5.0

Rhino.Geometry.SweepOneRail.IsFreeform
Since: 5.0

Rhino.Geometry.SweepOneRail.IsRoadlike
Since: 5.0

Rhino.Geometry.SweepOneRail.IsRoadlikeTop
Since: 5.0

Rhino.Geometry.SweepOneRail.IsRoadlikeFront
Since: 5.0

Rhino.Geometry.SweepOneRail.IsRoadlineRight
Since: 5.0

Rhino.Geometry.SweepOneRail.SetToRoadlikeTop
Since: 5.0

Rhino.Geometry.SweepOneRail.SetToRoadlikeFront
Since: 5.0

Rhino.Geometry.SweepOneRail.SetToRoadlikeRight
Since: 5.0

Rhino.Geometry.SweepOneRail.SetRoadlikeUpDirection(Rhino.Geometry.Vector3d)
Since: 5.0

Rhino.Geometry.SweepOneRail.SweepTolerance
Since: 5.0

Rhino.Geometry.SweepOneRail.AngleToleranceRadians
Since: 5.0

Rhino.Geometry.SweepOneRail.MiterType
0: don't miter,  1: intersect surfaces and trim sweeps,  2: rotate shapes at kinks and don't trim.
Since: 5.0

Rhino.Geometry.SweepOneRail.ClosedSweep
If the input rail is closed, ClosedSweep determines if the swept breps will also
be closed.
Since: 5.0

Rhino.Geometry.SweepOneRail.GlobalShapeBlending
If true, the sweep is linearly blended from one end to the other,
creating sweeps that taper from one cross-section curve to the other.
If false, the sweep stays constant at the ends and changes more
rapidly in the middle.
Since: 5.1

Rhino.Geometry.SweepOneRail.PerformSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve)
Since: 5.0

Rhino.Geometry.SweepOneRail.PerformSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double)
Since: 5.0

Rhino.Geometry.SweepOneRail.PerformSweep(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})
Since: 5.0

Rhino.Geometry.SweepOneRail.PerformSweep(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double})
Since: 5.0

Rhino.Geometry.SweepOneRail.PerformSweepRefit(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double)
Since: 5.0

Rhino.Geometry.SweepOneRail.PerformSweepRefit(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double)
Since: 5.0

Rhino.Geometry.SweepOneRail.PerformSweepRefit(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Double)
Since: 5.0

Rhino.Geometry.SweepOneRail.PerformSweepRefit(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Double)
Since: 5.0

Rhino.Geometry.SweepOneRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Int32)
Since: 5.0

Rhino.Geometry.SweepOneRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Int32)
Since: 5.0

Rhino.Geometry.SweepOneRail.PerformSweepRebuild(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Int32)
Since: 5.0

Rhino.Geometry.SweepOneRail.PerformSweepRebuild(Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Int32)
Since: 5.0