Rhino.Input.StringParser
Parse strings to numbers, distances and angles

Rhino.Input.StringParser.ParseLengthExpession(System.String,Rhino.Input.StringParserSettings,Rhino.UnitSystem,System.Double@)
Parse a string for a length value.
Expression can include complex expressions
Simplest version of Length parsing
expression:
[In] The string to parse
parse_settings_in:
[In] Determines what input will be parsed
output_unit_system:
[In] Output value is in this unit system
value_out:
[Out] The length value result
Returns:
Count of characters parsed or 0 for failure
Since: 6.0

Rhino.Input.StringParser.ParseLengthExpession(System.String,System.Int32,System.Int32,Rhino.Input.StringParserSettings,Rhino.UnitSystem,System.Double@,Rhino.Input.StringParserSettings@,Rhino.UnitSystem@)
Parse a string for a length value.
Expression can include complex expressions
Most complex version of length parsing
expression:
[In] The string to parse
start_offset:
[In] Offset position in string to start parsing
expression_length:
[In] Maximum length of string to parse.
-1 means parse to a terminating character or end of string
parse_settings_in:
[In] Determines what input will be parsed
If trig functions are included in the expression,
the angle unit system must be set correctly
output_unit_system:
[In] Output value is returned in this unit system
value_out:
[Out] The length value result
parse_results:
[Out] Describes the results of the parse operation
parsed_unit_system:
[Out] If a unit system name was found in the string, it is returned here.
The output value is in the unit system specified in output_unit_system
Returns:
Returns the count of characters that were parsed or 0 if the operation was unsuccessful
Since: 6.0

Rhino.Input.StringParser.ParseAngleExpressionDegrees(System.String,System.Double@)
Since: 6.0

Rhino.Input.StringParser.ParseAngleExpressionRadians(System.String,System.Double@)
Since: 6.0

Rhino.Input.StringParser.ParseAngleExpession(System.String,System.Int32,System.Int32,Rhino.Input.StringParserSettings,Rhino.AngleUnitSystem,System.Double@,Rhino.Input.StringParserSettings@,Rhino.AngleUnitSystem@)
Since: 6.0

Rhino.Input.StringParser.ParseNumber(System.String,System.Int32,Rhino.Input.StringParserSettings,Rhino.Input.StringParserSettings@,System.Double@)
Parse a string expression to get a number
expression:
String to parse
max_count:
Maximum number of characters to parse
settings_in:
Determines what input will be parsed
settings_out:
Reports the results of the parse operation
answer:
The number result of the parse operation
Returns:
Count of characters in expression parsed
if ParseNumber() returns 0, parse was unsuccessful
Since: 6.0