Rhino.Geometry.Intersect.MeshInterference
Represents an element which is part of a clash or intersection between two meshes.

Rhino.Geometry.Intersect.MeshInterference.IndexA
The index of the first clashing, or interfering object.
Since: 7.0

Rhino.Geometry.Intersect.MeshInterference.IndexB
The index of the second clashing, or interfering object.
Since: 7.0

Rhino.Geometry.Intersect.MeshInterference.HitPoints
Array of hit points where the objects of IndexA and IndexB interfere.
Since: 7.0