Rhino.PlugIns.FileTypeList.#ctor
Since: 5.0

Rhino.PlugIns.FileTypeList.#ctor(System.String,System.String)
Since: 6.0

Rhino.PlugIns.FileTypeList.#ctor(System.String,System.String,System.Boolean)
Since: 6.0

Rhino.PlugIns.FileTypeList.AddFileType(System.String,System.String)
Since: 5.0

Rhino.PlugIns.FileTypeList.AddFileType(System.String,System.String,System.Boolean)
Since: 6.0

Rhino.PlugIns.FileTypeList.AddFileType(System.String,System.String,System.String)
Since: 5.0

Rhino.PlugIns.FileTypeList.AddFileType(System.String,System.String,System.String,System.Boolean)
Since: 6.0

Rhino.PlugIns.FileTypeList.AddFileType(System.String,System.Collections.Generic.IEnumerable{System.String})
Since: 5.0

Rhino.PlugIns.FileTypeList.AddFileType(System.String,System.Collections.Generic.IEnumerable{System.String},System.Boolean)
Since: 6.0