Rhino.Runtime.InteropWrappers.SimpleArrayGuidPointer
Wrapper for ON_SimpleArray<ON_UUID>. If you are not writing C++ code
then this class is not for you.

Rhino.Runtime.InteropWrappers.SimpleArrayGuidPointer.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayGuidPointer.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayGuidPointer.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayGuidPointer class.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayGuidPointer.Item(System.Int32)
Get the Guid at index
index:
Returns:

Rhino.Runtime.InteropWrappers.SimpleArrayGuidPointer.Count
Gets the amount of elements in this array.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayGuidPointer.ToArray
Returns the managed counterpart of the unmanaged array.
Returns: The managed array.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayGuidPointer.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.SimpleArrayGuidPointer.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 6.0