Rhino.DocObjects.Tables.MaterialTable.Item(System.Int32)
Conceptually, the material table is an array of materials.
The operator[] can be used to get individual materials. A material is
either active or deleted and this state is reported by Material.IsDeleted.
index: zero based array index.
Returns:
If index is out of range, the current material is returned.

Rhino.DocObjects.Tables.MaterialTable.FindIndex(System.Int32)
Retrieves a Material object based on Index. This search type of search is discouraged.
We are moving towards using only IDs for all tables.
index: The index to search for.
Returns: A Material object, or null if none was found.
Since: 6.0

Rhino.DocObjects.Tables.MaterialTable.CurrentMaterialIndex
At all times, there is a "current" material.  Unless otherwise
specified, new objects are assigned to the current material.
The current material is never locked, hidden, or deleted.
Since: 5.0

Rhino.DocObjects.Tables.MaterialTable.CurrentMaterialSource
Gets or sets the current material source.
Since: 5.0

Rhino.DocObjects.Tables.MaterialTable.ComponentType
Since: 6.0

Rhino.DocObjects.Tables.MaterialTable.Add
Adds a new material to the table based on the default material.
Returns: The position of the new material in the table.
Since: 5.0

Rhino.DocObjects.Tables.MaterialTable.System#Collections#Generic#ICollection{Rhino#DocObjects#Material}#Add(Rhino.DocObjects.Material)
Since: 5.0

Rhino.DocObjects.Tables.MaterialTable.Add(Rhino.DocObjects.Material)
Adds a new material to the table based on a given material.
material: A model of the material to be added.
Returns: The position of the new material in the table.
Since: 5.0

Rhino.DocObjects.Tables.MaterialTable.Add(Rhino.DocObjects.Material,System.Boolean)
Adds a new material to the table based on a given material.
material: A model of the material to be added.
reference:
true if this material is supposed to be a reference material.
Reference materials are not saved in the file.
Returns: The position of the new material in the table.
Since: 5.0

Rhino.DocObjects.Tables.MaterialTable.Find(Rhino.DocObjects.Material,System.Boolean)
Finds a material index.
material: Material to search for.
ignoreDeletedMaterials: true means don't search deleted materials.
Returns:
>=0 index of the material
-1  no material matchin material.
Since: 8.0

Rhino.DocObjects.Tables.MaterialTable.Find(System.String,System.Boolean)
Finds a material with a given name.
materialName: Name of the material to search for. The search ignores case.
ignoreDeletedMaterials: true means don't search deleted materials.
Returns:
>=0 index of the material with the given name
-1  no material has the given name.
Since: 5.0

Rhino.DocObjects.Tables.MaterialTable.Find(System.Guid,System.Boolean)
Finds a material with a matching id.
materialId: A material ID to be found.
ignoreDeletedMaterials: If true, deleted materials are not checked.
Returns:
>=0 index of the material with the given name
-1  no material has the given name.
Since: 5.0

Rhino.DocObjects.Tables.MaterialTable.Modify(Rhino.DocObjects.Material,System.Int32,System.Boolean)
Modify material settings.
newSettings: This information is copied.
materialIndex:
zero based index of material to set.  This must be in the range 0 <= layerIndex < MaterialTable.Count.
quiet: if true, information message boxes pop up when illegal changes are attempted.
Returns:
true if successful. false if materialIndex is out of range or the settings attempt
to lock or hide the current material.
Since: 5.0

Rhino.DocObjects.Tables.MaterialTable.ResetMaterial(System.Int32)
Since: 5.0

Rhino.DocObjects.Tables.MaterialTable.DeleteAt(System.Int32)
Removes a material at a specific position from this material table.
materialIndex: The position to be removed.
Returns:
true if successful. false if materialIndex is out of range or the
material cannot be deleted because it is the current material or because
it material contains active geometry.
Since: 5.0

Rhino.DocObjects.Tables.MaterialTable.Delete(Rhino.DocObjects.Material)
Since: 6.0