Rhino.Geometry.Point2d
Represents the two coordinates of a point in two-dimensional space,
using System.Double-precision floating point numbers.

Rhino.Geometry.Point2d.X
Gets or sets the X (first) coordinate of the point.
Since: 5.0

Rhino.Geometry.Point2d.Y
Gets or sets the Y (second) coordinate of the point.
Since: 5.0

Rhino.Geometry.Point2d.#ctor(System.Double,System.Double)
Initializes a new instance of Rhino.Geometry.Point2d from coordinates.
x: The X (first) coordinate.
y: The Y (second) coordinate.
Since: 5.0

Rhino.Geometry.Point2d.#ctor(Rhino.Geometry.Vector2d)
Initializes a new instance of Rhino.Geometry.Point2d by converting a vector.
vector: The vector that will be copied.
Since: 5.0

Rhino.Geometry.Point2d.#ctor(Rhino.Geometry.Point2d)
Initializes a new instance of Rhino.Geometry.Point2d by copying another Rhino.Geometry.Point2d.
point: The point that will be copied.
Since: 5.0

Rhino.Geometry.Point2d.#ctor(Rhino.Geometry.Point3d)
Initializes a new instance of Rhino.Geometry.Point3d by copying the first two coordinates of a Rhino.Geometry.Point3d.
point: The point that will be used: the Z (third) coordinate is discarded.
Since: 5.0

Rhino.Geometry.Point2d.op_Multiply(Rhino.Geometry.Point2d,System.Double)
Multiplies a Rhino.Geometry.Point2d by a number.
point: A point.
t: A number.
Returns: A new point that is coordinate-wise multiplied by t.
Since: 5.0

Rhino.Geometry.Point2d.Multiply(Rhino.Geometry.Point2d,System.Double)
Multiplies a Rhino.Geometry.Point2d by a number.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
point: A point.
t: A number.
Returns: A new point that is coordinate-wise multiplied by t.
Since: 5.0

Rhino.Geometry.Point2d.op_Multiply(System.Double,Rhino.Geometry.Point2d)
Multiplies a Rhino.Geometry.Point2d by a number.
t: A number.
point: A point.
Returns: A new point that is coordinate-wise multiplied by t.
Since: 5.0

Rhino.Geometry.Point2d.Multiply(System.Double,Rhino.Geometry.Point2d)
Multiplies a Rhino.Geometry.Point2d by a number.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
t: A number.
point: A point.
Returns: A new point that is coordinate-wise multiplied by t.
Since: 5.0

Rhino.Geometry.Point2d.op_Division(Rhino.Geometry.Point2d,System.Double)
Divides a Rhino.Geometry.Point2d by a number.
t: A number.
point: A point.
Returns: A new point that is coordinate-wise divided by t.
Since: 5.0

Rhino.Geometry.Point2d.Divide(Rhino.Geometry.Point2d,System.Double)
Divides a Rhino.Geometry.Point2d by a number.
(Provided for languages that do not support operator overloading. You can use the / operator otherwise)
point: A point.
t: A number.
Returns: A new point that is coordinate-wise divided by t.
Since: 5.0

Rhino.Geometry.Point2d.op_Addition(Rhino.Geometry.Point2d,Rhino.Geometry.Vector2d)
Adds a point with a vector.
point: A point.
vector: A vector.
Returns: A new point that is coordinate-wise summed with the vector.

Rhino.Geometry.Point2d.Add(Rhino.Geometry.Point2d,Rhino.Geometry.Vector2d)
Adds a point with a vector.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
point: A point.
vector: A vector.
Returns: A new point that is coordinate-wise summed with the vector.
Since: 5.0

Rhino.Geometry.Point2d.op_Addition(Rhino.Geometry.Vector2d,Rhino.Geometry.Point2d)
Adds a vector with a point.
vector: A vector.
point: A point.
Returns: A new point that is coordinate-wise summed with the vector.

Rhino.Geometry.Point2d.Add(Rhino.Geometry.Vector2d,Rhino.Geometry.Point2d)
Adds a vector with a point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
vector: A vector.
point: A point.
Returns: A new point that is coordinate-wise summed with the vector.
Since: 5.0

Rhino.Geometry.Point2d.op_Addition(Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)
Adds a point with a point.
point1: A point.
point2: A point.
Returns: A new point that is coordinate-wise summed with the other point.

Rhino.Geometry.Point2d.Add(Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)
Adds a point with a point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
point1: A point.
point2: A point.
Returns: A new point that is coordinate-wise summed with the other point.
Since: 5.0

Rhino.Geometry.Point2d.op_Subtraction(Rhino.Geometry.Point2d,Rhino.Geometry.Vector2d)
Subtracts a vector from a point.
point: A point.
vector: A vector.
Returns: A new point that is coordinate-wise subtracted by vector.
Since: 5.0

Rhino.Geometry.Point2d.Subtract(Rhino.Geometry.Point2d,Rhino.Geometry.Vector2d)
Subtracts a vector from a point.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
point: A point.
vector: A vector.
Returns: A new point that is coordinate-wise subtracted by vector.
Since: 5.0

Rhino.Geometry.Point2d.op_Subtraction(Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)
Subtracts point2 from point1.
point1: A point (minuend).
point2: A point (subtrahend).
Returns: A new vector that is point1 coordinate-wise subtracted by point2.
Since: 5.0

Rhino.Geometry.Point2d.Subtract(Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)
Subtracts the second point from the first point.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
point1: A point (minuend).
point2: A point (subtrahend).
Returns: A new vector that is point1 coordinate-wise subtracted by point2.
Since: 5.0

Rhino.Geometry.Point2d.op_Equality(Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)
Determines whether two Rhino.Geometry.Point2d have equal values.
a: The first point.
b: The second point.
Returns: true if the coordinates of the two points are exactly equal; otherwise false.
Since: 5.0

Rhino.Geometry.Point2d.op_Inequality(Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)
Determines whether two Rhino.Geometry.Point2d have different values.
a: The first point.
b: The second point.
Returns: true if the two points differ in any coordinate; false otherwise.
Since: 5.0

Rhino.Geometry.Point2d.op_LessThan(Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)
Determines whether the first specified point comes before (has inferior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y.
a: First point.
b: Second point.
Returns: true if a.X is smaller than b.X, or a.X == b.X and a.Y is smaller than b.Y; otherwise, false.
Since: 5.0

Rhino.Geometry.Point2d.op_LessThanOrEqual(Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)
Determines whether the first specified point comes before
(has inferior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y.
a: First point.
b: Second point.
Returns: true if a.X is smaller than b.X, or a.X == b.X and a.Y <= b.Y; otherwise, false.
Since: 5.0

Rhino.Geometry.Point2d.op_GreaterThan(Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)
Determines whether the first specified Rhino.Geometry.Point2d comes after
(has superior sorting value than) the second point.
Coordinates evaluation priority is first X, then Y.
a: First point.
b: Second point.
Returns: true if a.X is larger than b.X, or a.X == b.X and a.Y is larger than b.Y; otherwise, false.
Since: 5.0

Rhino.Geometry.Point2d.op_GreaterThanOrEqual(Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)
Determines whether the first specified Rhino.Geometry.Point2d comes after
(has superior sorting value than) the second point, or it is equal to it.
Coordinates evaluation priority is first X, then Y.
a: First point.
b: Second point.
Returns: true if a.X is larger than b.X, or a.X == b.X and a.Y >= b.Y; otherwise, false.
Since: 5.0

Rhino.Geometry.Point2d.Equals(System.Object)
Determines whether the specified System.Object is a Point2d and has the same values as the present point.
obj: The specified object.
Returns: true if obj is a Point2d and has the same coordinates as this; otherwise false.

Rhino.Geometry.Point2d.Equals(Rhino.Geometry.Point2d)
Determines whether the specified Point2d has the same values as the present point.
point: The specified point.
Returns: true if point has the same coordinates as this; otherwise false.
Since: 5.0

Rhino.Geometry.Point2d.GetHashCode
Computes a hash number that represents the current point.
Returns: A hash code that is not unique for each point.

Rhino.Geometry.Point2d.CompareTo(Rhino.Geometry.Point2d)
Compares this Rhino.Geometry.Point2d with another Rhino.Geometry.Point2d.
Coordinates evaluation priority is first X, then Y.
other: The other Rhino.Geometry.Point2d to use in comparison.
Returns:
0: if this is identical to other
-1: if this.X < other.X
-1: if this.X == other.X and this.Y < other.Y
+1: otherwise.
Since: 5.0

Rhino.Geometry.Point2d.EpsilonEquals(Rhino.Geometry.Point2d,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:
Since: 5.4

Rhino.Geometry.Point2d.ToString
Constructs the string representation for the current point.
Returns: The point representation in the form X,Y.

Rhino.Geometry.Point2d.ToString(System.String,System.IFormatProvider)
Since: 7.0

Rhino.Geometry.Point2d.Item(System.Int32)
Accesses the coordinates of this point.
index: Either 0 or 1.
Returns: If index is 0, the X (first) coordinate. If index is 1, the Y (second) coordinate.

Rhino.Geometry.Point2d.IsValid
If any coordinate of a point is UnsetValue, then the point is not valid.
Since: 5.0

Rhino.Geometry.Point2d.MinimumCoordinate
Gets the smallest (both positive and negative) valid coordinate, or RhinoMath.UnsetValue if no coordinate is valid.
Since: 5.0

Rhino.Geometry.Point2d.MaximumCoordinate
Gets the largest valid coordinate, or RhinoMath.UnsetValue if no coordinate is valid.
Since: 5.0

Rhino.Geometry.Point2d.Origin
Gets a point at 0,0.
Since: 5.0

Rhino.Geometry.Point2d.Unset
Gets a point at RhinoMath.UnsetValue,RhinoMath.UnsetValue.
Since: 5.0

Rhino.Geometry.Point2d.DistanceTo(Rhino.Geometry.Point2d)
Computes the distance between two points.
other: Another point.
Returns: The length of the line between the two points, or 0 if either point is invalid.
Since: 5.0

Rhino.Geometry.Point2d.DistanceToSquared(Rhino.Geometry.Point2d)
Computes the square of the distance between two 2d points.
This method is usually largely faster than DistanceTo().
other: Other point for squared distance measurement.
Returns: The squared length of the line between this and the other point; or 0 if any of the points is not valid.
Since: 8.4

Rhino.Geometry.Point2d.Transform(Rhino.Geometry.Transform)
Transforms the present point in place. The transformation matrix acts on the left of the point. i.e.,
result = transformation*point
xform: Transformation to apply.
Since: 5.1