Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Flags
Flags to be passed into and returned from RenderMeshes and HasCustomRenderMeshes.
Since: 8.0

Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Flags.None
No flags set.

Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Flags.Canceled
If this flag is set when returned, then RenderMeshes was canceled.

Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Flags.DisableCaching
Pass in this flag to bypass any primitive caching that the RenderMeshProviders might do.

Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Flags.Recursive
Pass in this flag to get the render meshes for entire blocks.  Only has an effect if the ObjectId is a block reference, and if it will not produce CRMs of its own.

Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Flags.IsDocumentObject
Pass in this flag to indicate that the object id is a document resident object

Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Flags.AlwaysCopyDocumentContent
Pass in this flag to ensure that materials, environments and textures that refer to document objects are always copied.  This makes the RenderMeshes
object safe to be stored outside of the lifetime of those objects - in caches, or for use in threaded situtations.

Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Flags.ReturnNullForStandardMaterial
Pass in this flag to request that null is returned when the material on a mesh should be the standard material used - in otherwords, not
customized by this RenderMeshes object.  Note that this will require document access to resolve - do not use in threaded situations.

Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Flags.Incomplete
This flag is returned when an asynchronous operation (like Displacement) has not yet completed.