Rhino.Render.RenderMaterial.AssignToBlockChoices
Since: 7.14

Rhino.Render.RenderMaterial.AssignToBlockChoices.Always
Always assign to blocks recursively.

Rhino.Render.RenderMaterial.AssignToBlockChoices.Never
Never assign to blocks recursively.

Rhino.Render.RenderMaterial.AssignToBlockChoices.Ask
Ask the user what to do.