Rhino.FileIO.ImageFile
Support functions for image files

Rhino.FileIO.ImageFile.SupportsAlphaChannel(System.String)
Returns true if file at given path is an image file and that file format supports
an alpha channel
filename:
Returns:
Since: 6.0