Rhino.Input.RhinoGet
Base class for GetObject, GetPoint, GetSphere, etc.
You will never directly create a RhinoGet but you will use its member
functions after calling GetObject::GetObjects(), GetPoint::GetPoint(), and so on.
Provides tools to set command prompt, set command options, and specify
if the "get" can optionally accept numbers, nothing (pressing enter),
and undo.

Rhino.Input.RhinoGet.StringToCommandOptionName(System.String)
Convert some arbitrary string value to a valid command option name
removing any invalid characters.
stringToConvert:
String to convert.
Returns:
Returns null if the string is null or empty or if it contains nothing
but invalid characters.  If the converted string is one or more
characters in length then the converted value is returned.
Since: 6.0

Rhino.Input.RhinoGet.StringToCommandOptionName(System.String,System.String)
Convert some arbitrary string value to a valid command option name
removing any invalid characters.
englishString:
English string to convert.
localizedString:
Optional localized string to convert.
Returns:
Returns null if the strings are null or empty or if they contain
nothing but invalid characters.  If the converted string is one or more
characters in length then a Rhino.UI.LocalizeStringPair is returned
characters the converted string values.  If the localized string is
null or empty then the English string is used as the localized value.
Since: 6.0

Rhino.Input.RhinoGet.InGet(Rhino.RhinoDoc)
Returns true if the document is current in a "Get" operation.
Returns: true if a getter is currently active.
Since: 5.0

Rhino.Input.RhinoGet.InGetPoint(Rhino.RhinoDoc)
Returns true if currently in a GetPoint.Get()
Since: 6.0

Rhino.Input.RhinoGet.InGetObject(Rhino.RhinoDoc)
Returns true if currently in a GetObject.GetObjects()
Since: 6.0

Rhino.Input.RhinoGet.GetPoint(System.String,System.Boolean,Rhino.Geometry.Point3d@)
Gets a point coordinate from the document.
prompt: Prompt to display in command line during the operation.
acceptNothing: if true, the user can press enter.
point: point value returned here.
Returns:
Commands.Result.Success - got point
Commands.Result.Nothing - user pressed enter
Commands.Result.Cancel - user cancel point getting.
Remarks:
If you need options or more advanced user interface, then use GetPoint class.
Since: 5.0

Rhino.Input.RhinoGet.GetPointOnMesh(System.Guid,System.String,System.Boolean,Rhino.Geometry.Point3d@)
Gets a point constrained to an existing mesh in the document.
meshObjectId: An ID of a mesh in the document.
prompt: Text prompt.
acceptNothing: true if nothing else should be accepted.
point: A point value will be assigned to this out parameter during this call.
Returns: A command result based on user choice.
Since: 5.0
7.6

Rhino.Input.RhinoGet.GetPointOnMesh(Rhino.RhinoDoc,System.Guid,System.String,System.Boolean,Rhino.Geometry.Point3d@)
Gets a point constrained to an existing mesh in the document.
doc: Document containing mesh object.
meshObjectId: An ID of a mesh in the document.
prompt: Text prompt.
acceptNothing: true if nothing else should be accepted.
point: A point value will be assigned to this out parameter during this call.
Returns: A command result based on user choice.
Since: 7.6

Rhino.Input.RhinoGet.GetPointOnMesh(Rhino.DocObjects.MeshObject,System.String,System.Boolean,Rhino.Geometry.Point3d@)
Gets a point constrained to an existing mesh in the document.
meshObject: An mesh object in the document.
prompt: Text prompt.
acceptNothing: true if nothing else should be accepted.
point: A point value will be assigned to this out parameter during this call.
Returns: The command result based on user choice.
Since: 5.0
7.6

Rhino.Input.RhinoGet.GetPointOnMesh(Rhino.RhinoDoc,Rhino.DocObjects.MeshObject,System.String,System.Boolean,Rhino.Geometry.Point3d@)
Gets a point constrained to an existing mesh in the document.
doc: The Rhino document
meshObject: An mesh object in the document.
prompt: Text prompt.
acceptNothing: true if nothing else should be accepted.
point: A point value will be assigned to this out parameter during this call.
Returns: The command result based on user choice.
Since: 7.6

Rhino.Input.RhinoGet.GetColor(System.String,System.Boolean,System.Drawing.Color@)
Easy to use color getter.
prompt: Command prompt.
acceptNothing: If true, the user can press enter.
color: Color value returned here. also used as default color.
Returns:
Commands.Result.Success - got color.
Commands.Result.Nothing - user pressed enter.
Commands.Result.Cancel - user cancel color getting.
Remarks:
If you need options or more advanced user interface, then use GetColor class.
Since: 5.0

Rhino.Input.RhinoGet.GetOneObject(System.String,System.Boolean,Rhino.DocObjects.ObjectType,Rhino.DocObjects.ObjRef@)
Easy to use object getter.
prompt: command prompt.
acceptNothing: if true, the user can press enter.
filter: geometry filter to use when getting objects.
rhObject: result of the get. may be null.
Returns:
Commands.Result.Success - got object
Commands.Result.Nothing - user pressed enter
Commands.Result.Cancel - user cancel object getting.
Remarks:
If you need options or more advanced user interface, then use GetObject class.
Since: 5.0

Rhino.Input.RhinoGet.GetOneObject(System.String,System.Boolean,Rhino.Input.Custom.GetObjectGeometryFilter,Rhino.DocObjects.ObjRef@)
Easy to use object getter.
prompt: command prompt.
acceptNothing: if true, the user can press enter.
filter: geometry filter to use when getting objects.
objref: result of the get. may be null.
Returns:
Commands.Result.Success - got object
Commands.Result.Nothing - user pressed enter
Commands.Result.Cancel - user cancel object getting.
Remarks:
If you need options or more advanced user interface, then use GetObject class.
Since: 5.0

Rhino.Input.RhinoGet.GetMultipleObjects(System.String,System.Boolean,Rhino.DocObjects.ObjectType,Rhino.DocObjects.ObjRef[]@)
Easy to use object getter for getting multiple objects.
prompt: command prompt.
acceptNothing: if true, the user can press enter.
filter: geometry filter to use when getting objects.
rhObjects: result of the get. may be null.
Returns:
Commands.Result.Success - got object
Commands.Result.Nothing - user pressed enter
Commands.Result.Cancel - user cancel object getting.
Remarks:
If you need options or more advanced user interface, then use GetObject class.
Since: 5.0

Rhino.Input.RhinoGet.GetMultipleObjects(System.String,System.Boolean,Rhino.Input.Custom.GetObjectGeometryFilter,Rhino.DocObjects.ObjRef[]@)
Easy to use object getter for getting multiple objects.
prompt: command prompt.
acceptNothing: if true, the user can press enter.
filter: geometry filter to use when getting objects.
rhObjects: result of the get. may be null.
Returns:
Commands.Result.Success - got object
Commands.Result.Nothing - user pressed enter
Commands.Result.Cancel - user cancel object getting.
Remarks:
If you need options or more advanced user interface, then use GetObject class.
Since: 5.0

Rhino.Input.RhinoGet.GetString(System.String,System.Boolean,System.String@)
Easy to use string getter.
prompt: command prompt.
acceptNothing: if true, the user can press enter.
outputString: default string set to this value and string value returned here.
Returns:
Commands.Result.Success - got string
Commands.Result.Nothing - user pressed enter
Commands.Result.Cancel - user cancel string getting.
Remarks:
If you need options or more advanced user interface, then use GetString class.
Since: 5.0

Rhino.Input.RhinoGet.GetBool(System.String,System.Boolean,System.String,System.String,System.Boolean@)
Easy to use Boolean getter.
prompt: Command prompt.
acceptNothing: If true, the user can press enter.
offPrompt: The 'false/off' message.
onPrompt: The 'true/on' message.
boolValue: Default Boolean value set to this and returned here.
Returns: The getter result based on user choice.
Commands.Result.Success - got value.
Commands.Result.Nothing - user pressed enter.
Commands.Result.Cancel - user canceled value getting.
Since: 5.0

Rhino.Input.RhinoGet.GetNumber(System.String,System.Boolean,System.Double@,System.Double,System.Double)
Easy to use number getter.
prompt: The command prompt.
acceptNothing: If true, the user can press Enter.
outputNumber:
Default number is set to this value and the return number value is assigned to this variable during the call.
lowerLimit: The minimum allowed value.
upperLimit: The maximum allowed value.
Returns:
Commands.Result.Success - got number.
Commands.Result.Nothing - user pressed enter.
Commands.Result.Cancel - user cancel number getting.
Since: 5.0

Rhino.Input.RhinoGet.GetNumber(System.String,System.Boolean,System.Double@)
Easy to use number getter.
prompt: command prompt.
acceptNothing: if true, the user can press enter.
outputNumber:
default number is set to this value and number value returned here.
Returns:
Commands.Result.Success - got number
Commands.Result.Nothing - user pressed enter
Commands.Result.Cancel - user cancel number getting.
Since: 5.0

Rhino.Input.RhinoGet.GetInteger(System.String,System.Boolean,System.Int32@)
Easy to use number getter.
prompt: command prompt.
acceptNothing: if true, the user can press enter.
outputNumber:
default number is set to this value and number value returned here.
Returns:
Commands.Result.Success - got number
Commands.Result.Nothing - user pressed enter
Commands.Result.Cancel - user cancel number getting.
Since: 5.0

Rhino.Input.RhinoGet.GetInteger(System.String,System.Boolean,System.Int32@,System.Int32,System.Int32)
Easy to use number getter.
prompt: The command prompt.
acceptNothing: If true, the user can press enter.
outputNumber:
default number is set to this value and number value returned here.
lowerLimit: The minimum allowed value.
upperLimit: The maximum allowed value.
Returns:
Commands.Result.Success - got number
Commands.Result.Nothing - user pressed enter
Commands.Result.Cancel - user cancel number getting.
Since: 5.0

Rhino.Input.RhinoGet.GetPlane(Rhino.Geometry.Plane@)
Gets an oriented infinite plane.
plane: The plane result.
Returns:
Commands.Result.Success - got plane.
Commands.Result.Nothing - user pressed enter.
Commands.Result.Cancel - user cancel number getting.
Since: 5.0

Rhino.Input.RhinoGet.GetRectangle(Rhino.Geometry.Point3d[]@)
Gets a 3d rectangle.
corners: corners of the rectangle in counter-clockwise order.
Returns: Commands.Result.Success if successful.
Since: 5.0

Rhino.Input.RhinoGet.GetRectangle(System.String,Rhino.Geometry.Point3d[]@)
Gets a 3d rectangle.
firstPrompt:
corners: corners of the rectangle in counter-clockwise order.
Returns: Commands.Result.Success if successful.
Since: 6.0

Rhino.Input.RhinoGet.GetRectangleWithCounts(System.Int32,System.Int32@,System.Int32,System.Int32@,Rhino.Geometry.Point3d[]@)
Gets a 3d rectangle with prompts for counts in X and Y directions.
xMin: Minimum value allowed for count in the x direction.
xCount: Count in the x direction.
yMin: Minimum value allowed for count in the y direction.
yCount: Count in the y direction.
corners: corners of the rectangle in counter-clockwise order.
Returns: Commands.Result.Success if successful.
Since: 6.0

Rhino.Input.RhinoGet.GetBoxWithCounts(System.Int32,System.Int32@,System.Int32,System.Int32@,System.Int32,System.Int32@,Rhino.Geometry.Point3d[]@)
Gets a 3d box with prompts for counts in X, Y and Z directions.
xMin: Minimum value allowed for count in the x direction.
xCount: Count in the x direction.
yMin: Minimum value allowed for count in the y direction.
yCount: Count in the y direction.
zMin: Minimum value allowed for count in the z direction.
zCount: Count in the z direction.
corners: corners of the bottom rectangle in counter-clockwise order, followed by top rectangle.
Returns: Commands.Result.Success if successful.
Since: 6.0

Rhino.Input.RhinoGet.GetRectangle(Rhino.Input.GetBoxMode,Rhino.Geometry.Point3d,System.Collections.Generic.IEnumerable{System.String},Rhino.Geometry.Point3d[]@)
Gets a 3d rectangle made up of four points.
mode: A get box mode.
firstPoint: The first corner used. Pass Point3d.Unset if you do not want to set this.
prompts: Optional prompts to display while getting points. May be null.
corners: Corners of the rectangle in counter-clockwise order will be assigned to this out parameter during this call.
Returns: Commands.Result.Success if successful.
Since: 5.0

Rhino.Input.RhinoGet.Get2dRectangle(System.Boolean,System.Drawing.Rectangle@,Rhino.Display.RhinoView@)
Gets a rectangle in view window coordinates.
solidPen:
If true, a solid pen is used for drawing while the user selects a rectangle.
If false, a dotted pen is used for drawing while the user selects a rectangle.
rectangle:
user selected rectangle in window coordinates.
rectView:
view that the user selected the window in.
Returns: Success or Cancel.
Since: 5.0

Rhino.Input.RhinoGet.GetBox(Rhino.Geometry.Box@)
Asks the user to select a Box in the viewport.
box: If the result is Success, this parameter will be filled out.
Returns: Commands.Result.Success if successful.
Since: 5.0

Rhino.Input.RhinoGet.GetBox(Rhino.Geometry.Box@,Rhino.Input.GetBoxMode,Rhino.Geometry.Point3d,System.String,System.String,System.String)
Asks the user to select a Box in the viewport.
box: If the result is Success, this parameter will be filled out.
mode: A particular "get box" mode, or Rhino.Input.GetBoxMode.All.
basePoint: Optional base point. Supply Point3d.Unset if you don't want to use this.
prompt1: Optional first prompt. Supply null to use the default prompt.
prompt2: Optional second prompt. Supply null to use the default prompt.
prompt3: Optional third prompt. Supply null to use the default prompt.
Returns: Commands.Result.Success if successful.
Since: 5.0

Rhino.Input.RhinoGet.GetMeshParameters(Rhino.RhinoDoc,Rhino.Geometry.MeshingParameters@,System.Int32@)
Asks the user to specify meshing parameters.
doc: The active document
parameters: The initial meshing parameters. If successful, the updated meshing parameters are returned here.
uiStyle: The user interface style, where: 0 = simple dialog, 1 = details dialog, 2 = script or batch mode.
Returns: Commands.Result.Success if successful.
Since: 7.0

Rhino.Input.RhinoGet.GetGrips(Rhino.DocObjects.GripObject[]@,System.String)
Since: 5.0

Rhino.Input.RhinoGet.GetGrip(Rhino.DocObjects.GripObject@,System.String)
Since: 5.0

Rhino.Input.RhinoGet.GetSpiral(Rhino.Geometry.NurbsCurve@)
Since: 5.0

Rhino.Input.RhinoGet.GetHelix(Rhino.Geometry.NurbsCurve@)
Since: 5.0

Rhino.Input.RhinoGet.GetLine(Rhino.Geometry.Line@)
Since: 5.0

Rhino.Input.RhinoGet.GetPolyline(Rhino.Geometry.Polyline@)
Since: 5.9

Rhino.Input.RhinoGet.GetPolygon(System.Int32@,System.Boolean@,Rhino.Geometry.Polyline@)
Since: 6.0

Rhino.Input.RhinoGet.GetPolygon(System.Boolean,System.Int32@,System.Boolean@,Rhino.Geometry.Polyline@)
Since: 8.0

Rhino.Input.RhinoGet.GetArc(Rhino.Geometry.Arc@)
Since: 5.0

Rhino.Input.RhinoGet.GetCircle(Rhino.Geometry.Circle@)
Since: 5.0

Rhino.Input.RhinoGet.GetLinearDimension(Rhino.Geometry.LinearDimension@)
Since: 5.0

Rhino.Input.RhinoGet.GetView(System.String,Rhino.Display.RhinoView@)
Allows the user to interactively pick a viewport.
commandPrompt: The command prompt during the request.
view: The view that the user picked.
If the operation is successful, then this out parameter is assigned the correct view during this call.
Returns: The result based on user choice.
Since: 5.0

Rhino.Input.RhinoGet.GetAngle(System.String,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double@)
Allows user to interactively pick an angle
commandPrompt: if null, a default prompt will be displayed
basePoint:
referencePoint:
defaultAngleRadians:
angleRadians:
Returns:
Since: 5.2

Rhino.Input.RhinoGet.AllBitmapFileTypes
Since: 6.0

Rhino.Input.RhinoGet.GetFileName(Rhino.Input.Custom.GetFileNameMode,System.String,System.String,System.Object,Rhino.Input.RhinoGet.BitmapFileTypes)
Since: 6.0

Rhino.Input.RhinoGet.GetFileName(Rhino.Input.Custom.GetFileNameMode,System.String,System.String,System.Object)
Since: 6.0

Rhino.Input.RhinoGet.GetFileNameScripted(Rhino.Input.Custom.GetFileNameMode,System.String)
Since: 5.0

Rhino.Input.RhinoGet.GetPrintWindow(Rhino.Display.ViewCaptureSettings@)
Since: 6.1