Rhino.ScaleValue
Represents a scale with associated LengthValues and string representations
of the scale. This allows for going back and forth from numerical
representations of a scale and a string representation without "guessing"
at the initial scale.

Rhino.ScaleValue.#ctor
Default constructor
Since: 6.0

Rhino.ScaleValue.OneToOne
Make a new ScaleValue set to OneToOne
Returns:
Since: 6.0

Rhino.ScaleValue.Create(System.String,Rhino.Input.StringParserSettings)
Create from string
ps:
s:
Since: 6.0

Rhino.ScaleValue.Create(Rhino.LengthValue,Rhino.LengthValue,Rhino.ScaleValue.ScaleStringFormat)
Create from 2 length values
left:
right:
format:
Since: 6.0

Rhino.ScaleValue.Finalize
passively reclaim native allocated ON_ScaleValue*

Rhino.ScaleValue.Dispose
actively reclaim native allocated ON_SacleValue*
Since: 6.0

Rhino.ScaleValue.IsUnset
Test IsUnset
Returns:
Since: 6.0

Rhino.ScaleValue.LeftLengthValue
Get the Left LengthValue from Scale
Returns:
Since: 6.0

Rhino.ScaleValue.RightLengthValue
Get the Right LengthValue from Scale
Returns:
Since: 6.0

Rhino.ScaleValue.LeftToRightScale
LeftLengthValue / RightLengthValue
Since: 6.0

Rhino.ScaleValue.RightToLeftScale
RightLengthValue / LeftLengthValue
Since: 6.0