Rhino.FileIO.File3dmEmbeddedFiles


Rhino.FileIO.File3dmEmbeddedFiles.Add(System.String)
Add a new embedded file and load it from a local file.
Since: 8.0

Rhino.FileIO.File3dmEmbeddedFiles.#ctor(Rhino.FileIO.File3dm)
Since: 8.0

Rhino.FileIO.File3dmEmbeddedFiles.GetEnumerator
Since: 8.0

Rhino.FileIO.File3dmEmbeddedFiles.System#Collections#IEnumerable#GetEnumerator
Since: 8.0