Rhino.DocObjects.ViewType
What a view in a document's view table is: a model view, a layout page, a detail
nested inside a layout, or one of Rhino's special editor views.
Since: 8.36

Rhino.DocObjects.ViewType.ModelView
A standard 3d model space view.

Rhino.DocObjects.ViewType.PageView
A layout, a.k.a. "paper space". Must be an orthographic top view.

Rhino.DocObjects.ViewType.NestedView
A model view nested inside another view - a layout detail.

Rhino.DocObjects.ViewType.UVEditorView
The UV editor's special view port.

Rhino.DocObjects.ViewType.BlockEditorView
The block editor's special view port.