Rhino.Render.DataSources.RhinoSettings.CppPointer
Since: 6.0

Rhino.Render.DataSources.RhinoSettings.#ctor(System.IntPtr)
Since: 6.0

Rhino.Render.DataSources.RhinoSettings.Dispose
Since: 6.0

Rhino.Render.DataSources.RhinoSettings.GetCurrentRenderer
Since: 8.17

Rhino.Render.DataSources.RhinoSettings.SetCurrentRenderer(System.Guid)
Since: 8.17

Rhino.Render.DataSources.RhinoSettings.GetRenderSettings
Since: 6.0

Rhino.Render.DataSources.RhinoSettings.SetRenderSettings(Rhino.Render.RenderSettings)
Since: 6.0

Rhino.Render.DataSources.RhinoSettings.ActiveView
Since: 6.0

Rhino.Render.DataSources.RhinoSettings.RenderingView
Since: 6.12

Rhino.Render.DataSources.RhinoSettings.GetCustomRenderSizes
Since: 6.0

Rhino.Render.DataSources.RhinoSettings.ViewSupportsShading(Rhino.Display.RhinoView)
Since: 6.14

Rhino.Render.DataSources.RhinoSettings.GroundPlaneOnInViewDisplayMode(Rhino.Display.RhinoView)
Since: 6.14

Rhino.Render.DataSources.RhinoSettings.SetGroundPlaneOnInViewDisplayMode(Rhino.Display.RhinoView,System.Boolean)
Since: 6.14

Rhino.Render.DataSources.RhinoSettings.CustomImageSizeIsPreset
Since: 7.0