Rhino.Runtime.Notifications.NonNullableDictionary`2
An IDictionary implementation where null keys are not allowed. In addition, key lookups
return null instad of throwing an exception.
The key type of the dictionary.
The value type of the dictionary. Must be a class type.

Rhino.Runtime.Notifications.NonNullableDictionary`2.#ctor
Creates a new instance.

Rhino.Runtime.Notifications.NonNullableDictionary`2.#ctor(System.Collections.Generic.IDictionary{`0,`1})
Creates a new instance with a shallow copy of an IDictionary as its contents.
dictionary:

Rhino.Runtime.Notifications.NonNullableDictionary`2.Item(`0)
Looks up an object by key.
key: The key to use to lookup an object.
Returns: null if the key does not map to an object; otherwise returns the object.

Rhino.Runtime.Notifications.NonNullableDictionary`2.Count
Returns the number of elements contained in the dictionary.

Rhino.Runtime.Notifications.NonNullableDictionary`2.IsReadOnly
Always returns false.

Rhino.Runtime.Notifications.NonNullableDictionary`2.Keys
Returns an ICollection containing all the keys in the dictionary.

Rhino.Runtime.Notifications.NonNullableDictionary`2.Values
Returns an ICollection containing all the values in the dictionary.

Rhino.Runtime.Notifications.NonNullableDictionary`2.Add(System.Collections.Generic.KeyValuePair{`0,`1})
Adds a value to the dictionary.
item: a KVP containing a key and a value to add to the dictionary.

Rhino.Runtime.Notifications.NonNullableDictionary`2.Add(`0,`1)
Adds a value to the dictionary.
key: The key that maps to the value.
value: The value to add to the dictionary.

Rhino.Runtime.Notifications.NonNullableDictionary`2.Clear
Removes all items from the dictionary.

Rhino.Runtime.Notifications.NonNullableDictionary`2.ContainsKey(`0)
Checks for inclusion of a particular key.
key: The key to lookup.
Returns: true if the dictionary contains the key; otherwise false.

Rhino.Runtime.Notifications.NonNullableDictionary`2.CopyTo(System.Collections.Generic.KeyValuePair{`0,`1}[],System.Int32)
Copies the values of the dictionary to an array.
array: The array to copy the values to.
arrayIndex: The index of the array to start the copy.

Rhino.Runtime.Notifications.NonNullableDictionary`2.GetEnumerator
Returns an enumerator that iterates through the dictionary.
Returns:

Rhino.Runtime.Notifications.NonNullableDictionary`2.Remove(System.Collections.Generic.KeyValuePair{`0,`1})
Removes the first occurrence of the item from the dictionary.
item: The KVP to remove from the dictionary.
Returns: true if the item was removed; otherwise false.

Rhino.Runtime.Notifications.NonNullableDictionary`2.Remove(`0)
Removes the element with the specified key from the dictionary.
key: The key of the lement to remove.
Returns: true if the element was removed; otherwise false.

Rhino.Runtime.Notifications.NonNullableDictionary`2.TryGetValue(`0,`1@)
Gets the value associated with the key.
key: The key of the element to get.
value: The value associated with the key.
Returns: True if an element exists, otherwise returns false.

Rhino.Runtime.Notifications.NonNullableDictionary`2.System#Collections#IEnumerable#GetEnumerator
Returns an enumerator that iterates through the collection.
Returns: The enumerator that iterates through the collection.

Rhino.Runtime.Notifications.NonNullableDictionary`2.Equals(System.Object)
Tests an instance for equality.
obj: The object to test for equality with this instance.
Returns: true if the objects are equal; otherwise false.
Remarks: An object is considered equal if obj is a NonNullableDictionary and
obj contains the same KeyValuePairs as this instance.

Rhino.Runtime.Notifications.NonNullableDictionary`2.GetHashCode
Returns the hash code of this dictionary.
Returns: