Rhino.Render.RenderWindow.Channel.PixelSize
Returns the size of the data in one pixel in the channel. For RDK standard channels, this value is always sizeof(float).
For the special chanRGBA collective channel,
this value is 4 * sizeof(float).
Returns: The size of a pixel.
Since: 5.0

Rhino.Render.RenderWindow.Channel.SetValue(System.Int32,System.Int32,System.Single)
Assign value to a pixel at coordinate (x, y).
x: The horizontal pixel position. No validation is done on this value.
The caller is responsible for ensuring that it is within the frame buffer.
y: the vertical pixel position. No validation is done on this value.
The caller is responsible for ensuring that it is within the frame buffer.
value: The value to store in the channel at the specified position.
Since: 5.0

Rhino.Render.RenderWindow.Channel.SetValues(System.Drawing.Rectangle,Rhino.Display.Color4f[])
Set a rectangle of values into the channel. The input parameters are checked for validity.
If the rectangle is not fully inside the frame buffer, the function will fail.
rectangle: The horizontal pixel position. No validation is done on this value.
The caller is responsible for ensuring that it is within the frame buffer.
colors: the vertical pixel position. No validation is done on this value.
The caller is responsible for ensuring that it is within the frame buffer.
Since: 5.0

Rhino.Render.RenderWindow.Channel.SetValues(System.Drawing.Rectangle,System.Drawing.Size,Rhino.Render.PixelBuffer)
Set a pixel buffer
rectangle:
bufferResolution:
colorBuffer: PixelBuffer to a color buffer of floats in RGBA format.
Since: 6.0

Rhino.Render.RenderWindow.Channel.SetValuesFlipped(System.Drawing.Rectangle,System.Drawing.Size,Rhino.Render.PixelBuffer)
Set a pixel buffer y-flipped.
rectangle:
bufferResolution:
colorBuffer: PixelBuffer to a color buffer of floats in RGBA format.
Since: 7.7

Rhino.Render.RenderWindow.Channel.SetValue(System.Int32,System.Int32,Rhino.Display.Color4f)
If x or y are out of range, the function will fail and may crash Rhino.
x: The horizontal pixel position. No validation is done on this value.
The caller is responsible for ensuring that it is within the frame buffer.
y: The vertical pixel position. No validation is done on this value.
The caller is responsible for ensuring that it is within the frame buffer.
value: The color to store in the channel at the specified position.
Since: 5.0

Rhino.Render.RenderWindow.Channel.AddValue(System.Int32,System.Int32,Rhino.Display.Color4f)
Add value to existing values at point x, y.
If x or y are out of range, the function will fail and may crash Rhino.
x: The horizontal pixel position. No validation is done on this value.
The caller is responsible for ensuring that it is within the frame buffer.
y: The vertical pixel position. No validation is done on this value.
The caller is responsible for ensuring that it is within the frame buffer.
value: The color to store in the channel at the specified position.
Since: 6.0

Rhino.Render.RenderWindow.Channel.Id
Return the channel id.
Since: 7.0

Rhino.Render.RenderWindow.Channel.Width
Return the channel width.
Since: 7.0

Rhino.Render.RenderWindow.Channel.Height
Return the channel height.
Since: 7.0

Rhino.Render.RenderWindow.Channel.GetValue(System.Int32,System.Int32,Rhino.Render.ComponentOrders,System.Single[]@)
Get values from the channel.
Since: 7.0

Rhino.Render.RenderWindow.Channel.GetValues(System.Drawing.Rectangle,System.Int32,Rhino.Render.ComponentOrders,System.Single[]@)
Get a rectangle of values from the channel. The input parameters are checked for validity.
If the rectangle is not fully inside the frame buffer, the function will fail.
Since: 7.0

Rhino.Render.RenderWindow.Channel.Clone
Return a clone of the channel.
Since: 7.0

Rhino.Render.RenderWindow.Channel.GetMinMaxValues(System.Single@,System.Single@)
Get the minimum and maximum values in the channel.
minThe channel's minimum value.
maxThe channel's maximum value.
Since: 7.0

Rhino.Render.RenderWindow.Channel.Dispose
Since: 5.0