Rhino.Render.LightManagerSupport
Base class for implementing custom light managers in .NET

Rhino.Render.LightManagerSupport.#ctor
Default constructor

Rhino.Render.LightManagerSupport.FromSerialNumber(System.Int32)
The C++ callbacks call FromSerialNumber method in order to call the
correct C# LightManagerSupport instance.
Returns:

Rhino.Render.LightManagerSupport.RegisterLightManager(Rhino.PlugIns.PlugIn)
Find and register classes that derive from LightManagerSupport
from the given plug-in.
plugin:
Returns:
Since: 6.0

Rhino.Render.LightManagerSupport.CreateCppObject
RegisterProviders calls this method to create a runtime unmanaged
pointer for each custom light manager registered.
Returns:

Rhino.Render.LightManagerSupport.RegisterProviders(System.Reflection.Assembly,System.Guid)
Find and register classes that derive from RealtimeDisplayMode
from the given plug-in. The plug-in is found in the given assembly
assembly:
pluginId:
Returns:
Since: 6.0

Rhino.Render.LightManagerSupport.PluginId
The Guid of the plugin
Returns: Returns the Guid of the plugin
Since: 6.0

Rhino.Render.LightManagerSupport.RenderEngineId
The Guid of the render engine
Returns: Returns the Guid of the render engine that is associated with this light manager
Since: 6.0

Rhino.Render.LightManagerSupport.ModifyLight(Rhino.RhinoDoc,Rhino.Geometry.Light)
Modify properties of the light
doc:
light:
Returns:
Since: 6.0

Rhino.Render.LightManagerSupport.DeleteLight(Rhino.RhinoDoc,Rhino.Geometry.Light,System.Boolean)
Delete light
doc:
light:
bUndelete:
Returns: If delete is successful, then return true, else return false
Since: 6.0

Rhino.Render.LightManagerSupport.GetLights(Rhino.RhinoDoc,Rhino.Render.LightArray@)
Get all the lights that are associated to the light manager. The lights are added
to the LightArray parameter passed to the GetLights method
doc:
light_array:
Since: 6.0

Rhino.Render.LightManagerSupport.LightFromId(Rhino.RhinoDoc,System.Guid,Rhino.Geometry.Light@)
Get Rhino.Geometry.Light object associated to Guig uuid
doc:
uuid:
light:
If found, then return true, else return false
Since: 6.0

Rhino.Render.LightManagerSupport.ObjectSerialNumberFromLight(Rhino.RhinoDoc,Rhino.Geometry.Light@)
Get the object serial number of the light
doc:
light:
returns the object serial number of light
Since: 6.0

Rhino.Render.LightManagerSupport.OnEditLight(Rhino.RhinoDoc,Rhino.Render.LightArray@)
The default implementation of OnEditLight selects the lights and opens
the Lights Properties page
doc:
light_array:
Returns: Returns true if successful, else false
Since: 6.0

Rhino.Render.LightManagerSupport.GroupLights(Rhino.RhinoDoc,Rhino.Render.LightArray@)
Creates a new group with the lights
doc:
light_array:
Since: 6.0

Rhino.Render.LightManagerSupport.UnGroup(Rhino.RhinoDoc,Rhino.Render.LightArray@)
UnGroups the lights
doc:
light_array:
Since: 6.0

Rhino.Render.LightManagerSupport.LightDescription(Rhino.RhinoDoc,Rhino.Geometry.Light@)
Gets the string representation of the light description
doc:
light:
Returns: Returns the string representation of the light description
Since: 6.0

Rhino.Render.LightManagerSupport.SetLightSolo(Rhino.RhinoDoc,System.Guid,System.Boolean)
First checks to see if we are in "solo mode" - which means that there are any lights that respond "true" to IsInSoloStorage.
If in solo mode:
If bSolo = true
Sets this light on.
If bSolo = false
If this is the last light "on", forces all lights out of solo mode.
If there are other lights on, turns this light off.
If not in solo mode:
If bSolo = true
Forces all lights into solo storage and sets this light on.
If bSolo = false
This shouldn't happen.  Will cause an ASSERT
doc:
uuid_light:
bSolo:
Returns: Returns true if action is successful
Since: 6.0

Rhino.Render.LightManagerSupport.GetLightSolo(Rhino.RhinoDoc,System.Guid)
Returns the value of "ON_LIght::m_bOn" if the light is in solo storage, or
false if not in solo storage (ie - this is the checkbox state on the light manager dialog)
doc:
uuid_light:
Returns: Returns true if the light is in solo storage, or false if not in solo storage
Since: 6.0

Rhino.Render.LightManagerSupport.LightsInSoloStorage(Rhino.RhinoDoc)
Returns the number of lights in solo storage - any number other than 0 means "in solo mode"
doc:
Returns: Returns the number of lights in solo storage - any number other than 0 means "in solo mode"
Since: 6.0

Rhino.Render.LightManagerSupport.OnCustomLightEvent(Rhino.RhinoDoc,Rhino.Render.LightMangerSupportCustomEvent,Rhino.Geometry.Light@)
Generates LightMangerSupportCustomEvent:
light_added,
light_deleted,
light_undeleted,
light_modified,
light_sorted,
The event triggers a Light table event that the rdk lightmanager listens too
doc:
le:
light:
Returns: Returns the string representation of the light description
Since: 6.0