Rhino.Render.RenderContentChangeReason
Enumeration denoting type of change for attach or detach.
Since: 6.0

Rhino.Render.RenderContentChangeReason.None
No attach or detach change

Rhino.Render.RenderContentChangeReason.Attach
Content is being attached by the RhinoDoc.AttachContent() or RenderContent.AttachChild() methods.

Rhino.Render.RenderContentChangeReason.Detach
Content is being detached by the RenderContent.DeleteContent() method.

Rhino.Render.RenderContentChangeReason.ChangeAttach
Content is being attached while changing.

Rhino.Render.RenderContentChangeReason.ChangeDetach
Content is being detached while changing.

Rhino.Render.RenderContentChangeReason.AttachUndo
Content is being attached during undo/redo

Rhino.Render.RenderContentChangeReason.DetachUndo
Content is being detached during undo/redo.

Rhino.Render.RenderContentChangeReason.Open
Content is being attached during open document

Rhino.Render.RenderContentChangeReason.Delete
Content is being detached during normal deletion.