Rhino.Runtime.InteropWrappers.ArrayOfTArrayMarshal.Create``1(System.Collections.Generic.IEnumerable{System.Collections.Generic.IEnumerable{``0}},Rhino.Runtime.InteropWrappers.NullItemsResponse)
Helper method to construct the marshal.
arrayOfArray: This parameter can be null. Then, the marshaler will act accordingly.
nestedFirstLevelNulls: Behavior for null nested items.