Rhino.Runtime.IZooClientUtilities2
Additions to Rhino.Runtime.IZooClientUtilities. Implemented in ZooClient alongside
that interface and discovered by casting the injected service.
New members go here rather than on Rhino.Runtime.IZooClientUtilities: that interface
is public, so adding to it is a breaking change for anything else that implements it.
Since: 8.34

Rhino.Runtime.IZooClientUtilities2.ValidateStandaloneLicense(System.Object,Rhino.Runtime.ZooClientParameters,System.String,System.String)
RH-92777: Validates a stand-alone license key for the given account email
against the validation server, asking the user for no input (progress and
any server-reported problems are shown by the validation wizard).
Returns true on success.
Since: 8.34