Rhino.UI.PanelSystem
Static class which provides access to the Rhino panel system

Rhino.UI.PanelSystem.Register(System.Guid,System.Type,System.String,System.Drawing.Icon,Rhino.UI.PanelType)
Call once to register a panel type which will get dynamically created
and embedded in a Rhino docking/floating location.
plugInId:
Plug-in restringing the panel
type:
Type of the control object to be displayed in the panel
caption:
Panel caption also used as a tool-tip.  On Windows the panel may be
displayed using the icon, caption or both.  On Mac the icon will be
used and the caption will be the tool-tip.
icon:
The panel icon.  On Windows the panel may be displayed using the icon,
caption or both.  On Mac the icon will be used and the caption will be
the tool-tip.
panelType:
See Rhino.UI.PanelType

Rhino.UI.PanelSystem.Register(Rhino.PlugIns.PlugIn,System.Type,System.String,System.Drawing.Icon,Rhino.UI.PanelType)
Call once to register a panel type which will get dynamically created
and embedded in a Rhino docking/floating location.
plugIn:
Plug-in restringing the panel
type:
Type of the control object to be displayed in the panel
caption:
Panel caption also used as a tool-tip.  On Windows the panel may be
displayed using the icon, caption or both.  On Mac the icon will be
used and the caption will be the tool-tip.
icon:
The panel icon.  On Windows the panel may be displayed using the icon,
caption or both.  On Mac the icon will be used and the caption will be
the tool-tip.
panelType:
See Rhino.UI.PanelType

Rhino.UI.PanelSystem.ChangePanelIcon(System.Type,System.String)
Update the icon used for a panel tab.
panelType:
fullPathToResource: New icon resource path

Rhino.UI.PanelSystem.ChangePanelIcon(System.Type,System.Drawing.Icon)
Update the icon used for a panel tab.
panelType:
icon: New icon to use

Rhino.UI.PanelSystem.OnCreatePanelCallback(System.Guid,System.Guid,System.UInt32,System.IntPtr,System.Single@,System.Single@)
Called to create the actual panel
panelTypeGuid:
hostId:
documentSerailNumber:
hParent:
minimumWidth:
minimumHeight:
Returns:

Rhino.UI.PanelSystem.OnVisiblePanelCallback(System.Guid,System.Guid,System.UInt32,System.UInt32)
Called when the Rhino control bars visibility state changes, this will
try to make the visibility state of the host match
panelTypeGuid:
hostId:
documentSerailNumber:
state:
Returns:

Rhino.UI.PanelSystem.OnShowPanelCallback(System.Guid,System.Guid,System.UInt32,System.UInt32)
This has morphed into a message procedure, was originally a call back for
the OnShow virtual method but was enhanced to handle IsCreated as well
panelTypeGuid:
hostId:
documentSerailNumber:
state:
Returns:

Rhino.UI.PanelSystem.Instance(System.Guid,System.UInt32,System.Guid)
panelTypeGuid:
documentSerailNumber:
dockBarId:
Returns:

Rhino.UI.PanelSystem.Definition(System.Guid)
Find a panel with a specific type Id
id:
Search for registered panel definition with this type Id.
Returns:

Rhino.UI.PanelSystem.Definition(System.Type)
Find a panel using the panel type, will extract the GUID from the type
and search based on the GUID.
type:
Search for registered panel definition with this type Id.
Returns:

Rhino.UI.PanelSystem.Add(System.Guid,System.Type,System.String,System.Drawing.Icon,System.Reflection.Assembly,System.String,Rhino.UI.PanelType)
Add a class Type to the definition
plugInId:
type:
caption:
icon:
iconAssembly:
iconResourceId:
panelType:
Returns:

Rhino.UI.PanelSystem.Definitions
Lazily create the Definitions dictionary

Rhino.UI.PanelSystem.g_panel_definitions
The one and only Definitions dictionary