Rhino.UI.RhinoPageHooks.AddNewIOptionsPageToCollection(System.IntPtr,Rhino.UI.StackedDialogPage,System.UInt32,System.Boolean)
Allocate new IRhinoOptionsPage unmanaged pointers for a OptionsDialogPage
and all of its children.
collection:
page:
rhinoDocSn:
isChild:
Returns:

Rhino.UI.RhinoPageHooks.ConstructIChildren(System.IntPtr,Rhino.UI.StackedDialogPage,System.UInt32)
Construct IRhinoOptionsPage unmanaged pointers for OptionsDialogPage
child pages.
collectionItem:
page:
rhinoDocSn: