Rhino.Geometry.SerializableExtensions
Call used to extend SerializationInfo and encode/decode serialized string

Rhino.Geometry.SerializableExtensions.ToEncodedString(System.Runtime.Serialization.ISerializable)
Returns a encoded string that represents the MeshingParameters.
Returns:
A encoded string that represents the MeshingParameters.
Since: 8.0

Rhino.Geometry.SerializableExtensions.FromEncodedString``1(System.String)
Converts encoded serialized string into a MeshingParameters
value:
Encoded string returned by MeshingParameters.ToString()
Returns:
Returns a new MeshingParameters created by decoding and deserializing
the string or null if value is invalid.
Since: 8.0