Rhino.Display.ColorConverter
Exposes static color conversion methods.

Rhino.Display.ColorConverter.RGB_To_HSV(System.Double,System.Double,System.Double,System.Double@,System.Double@,System.Double@)
Converts RGB space colors to HSV.
r: Red channel (0.0~1.0)
g: Green channel (0.0~1.0)
b: Blue channel (0.0~1.0)
h: Hue channel (0.0~1.0)
s: Saturation channel (0.0~1.0)
v: Value (Brightness) channel (0.0~1.0)

Rhino.Display.ColorConverter.HSV_To_RGB(System.Double,System.Double,System.Double,System.Double@,System.Double@,System.Double@)
Converts HSV space colors to RGB.
h: Hue channel (0.0~1.0)
s: Saturation channel (0.0~1.0)
v: Value (Brightness) channel (0.0~1.0)
r: Red channel (0.0~1.0)
g: Green channel (0.0~1.0)
b: Blue channel (0.0~1.0)

Rhino.Display.ColorConverter.XYZ_To_RGB(System.Double,System.Double,System.Double,System.Double@,System.Double@,System.Double@)
Converts XYZ space colors to RGB.
x: X channel (0.0~1.0)
y: Y channel (0.0~1.0)
z: Z channel (0.0~1.0)
r: Red channel (0.0~1.0)
g: Green channel (0.0~1.0)
b: Blue channel (0.0~1.0)

Rhino.Display.ColorConverter.RGB_To_XYZ(System.Double,System.Double,System.Double,System.Double@,System.Double@,System.Double@)
Converts RGB space colors to XYZ.
r: Red channel (0.0~1.0)
g: Green channel (0.0~1.0)
b: Blue channel (0.0~1.0)
x: X channel (0.0~1.0)
y: Y channel (0.0~1.0)
z: Z channel (0.0~1.0)

Rhino.Display.ColorConverter.XYZ_To_CIELAB(System.Double,System.Double,System.Double,System.Double@,System.Double@,System.Double@)
Converts XYZ space colors to CIE-L*ab.
x: X channel (0.0~1.0)
y: Y channel (0.0~1.0)
z: Z channel (0.0~1.0)
l: Luminance channel (0.0~1.0)
a: A channel (0.0~1.0)
b: B channel (0.0~1.0)

Rhino.Display.ColorConverter.CIELAB_To_XYZ(System.Double,System.Double,System.Double,System.Double@,System.Double@,System.Double@)
Converts CIE-L*ab space colors to XYZ.
l: Luminance channel (0.0~1.0)
a: A channel (0.0~1.0)
b: B channel (0.0~1.0)
x: X channel (0.0~1.0)
y: Y channel (0.0~1.0)
z: Z channel (0.0~1.0)

Rhino.Display.ColorConverter.CIELAB_To_CIELCH(System.Double,System.Double,System.Double,System.Double@,System.Double@,System.Double@)
Converts CIE-L*ab space colors to CIE-L*CH.
l: Luminance channel (0.0~1.0)
a: A channel (0.0~1.0)
b: B channel (0.0~1.0)
lum: Luminance channel (0.0~1.0)
c: Chroma channel (0.0~1.0)
h: Hue channel (0.0~1.0)

Rhino.Display.ColorConverter.CIELCH_To_CIELAB(System.Double,System.Double,System.Double,System.Double@,System.Double@,System.Double@)
Converts CIE-L*CH space colors to CIE-L*ab.
lum: Luminance channel (0.0~1.0)
c: Chroma channel (0.0~1.0)
h: Hue channel (0.0~1.0)
l: Luminance channel (0.0~1.0)
a: A channel (0.0~1.0)
b: B channel (0.0~1.0)

Rhino.Display.ColorConverter.RGB_To_HSL(System.Double,System.Double,System.Double,System.Double@,System.Double@,System.Double@)
Converts RGB space colors to HSL.
r: Red channel (0.0~1.0)
g: Green channel (0.0~1.0)
b: Blue channel (0.0~1.0)
h: Hue channel (0.0~1.0)
s: Saturation channel (0.0~1.0)
l: Luminance channel (0.0~1.0)

Rhino.Display.ColorConverter.HSL_To_RGB(System.Double,System.Double,System.Double,System.Double@,System.Double@,System.Double@)
Converts HSL space colors to RGB.
h: Hue channel (0.0~1.0)
s: Saturation channel (0.0~1.0)
l: Luminance channel (0.0~1.0)
r: Red channel (0.0~1.0)
g: Green channel (0.0~1.0)
b: Blue channel (0.0~1.0)

Rhino.Display.ColorConverter.RGB_To_CMY(System.Byte,System.Byte,System.Byte,System.Double@,System.Double@,System.Double@)
Converts RGB space colors to CMY.
r: Red channel (0~255)
g: Green channel (0~255)
b: Blue channel (0~255)
c: Cyan channel (0.0~1.0)
m: Magenta channel (0.0~1.0)
y: Yellow channel (0.0~1.0)

Rhino.Display.ColorConverter.CMY_To_RGB(System.Double,System.Double,System.Double,System.Byte@,System.Byte@,System.Byte@)
Converts CMY space colors to RGB.
c: Cyan channel (0.0~1.0)
y: Yellow channel (0.0~1.0)
m: Magenta channel (0.0~1.0)
r: Red channel (0~255)
g: Green channel (0~255)
b: Blue channel (0~255)

Rhino.Display.ColorConverter.CMY_To_CMYK(System.Double,System.Double,System.Double,System.Double@,System.Double@,System.Double@,System.Double@)
Converts CMY space colors to CMYK.
c: Cyan channel (0.0~1.0)
y: Yellow channel (0.0~1.0)
m: Magenta channel (0.0~1.0)
cyan: Cyan channel (0.0~1.0)
magenta: Magenta channel (0.0~1.0)
yellow: Yellow channel (0.0~1.0)
k: Key channel (0.0~1.0)

Rhino.Display.ColorConverter.CMYK_To_CMY(System.Double,System.Double,System.Double,System.Double,System.Double@,System.Double@,System.Double@)
Converts CMYK space colors to CMY.
cyan: Cyan channel (0.0~1.0)
magenta: Magenta channel (0.0~1.0)
yellow: Yellow channel (0.0~1.0)
key: Key channel (0.0~1.0)
c: Cyan channel (0.0~1.0)
y: Yellow channel (0.0~1.0)
m: Magenta channel (0.0~1.0)