Rhino.FileIO.FileObjWriteOptions.CurveType
Type of curve used for trimmed surfaces
Since: 6.0

Rhino.FileIO.FileObjWriteOptions.CurveType.Polyline
Polyline approximation, see comments for AngleTolRadians