Rhino.Geometry.Vector3f
Represents the three components of a vector in three-dimensional space,
using System.Single-precision floating point numbers.

Rhino.Geometry.Vector3f.#ctor(System.Single,System.Single,System.Single)
Constructs a new vector from 3 single precision numbers.
x: X component of vector.
y: Y component of vector.
z: Z component of vector.
Since: 5.0

Rhino.Geometry.Vector3f.Zero
Gets the value of the vector with components 0,0,0.
Since: 5.0

Rhino.Geometry.Vector3f.XAxis
Gets the value of the vector with components 1,0,0.
Since: 5.0

Rhino.Geometry.Vector3f.YAxis
Gets the value of the vector with components 0,1,0.
Since: 5.0

Rhino.Geometry.Vector3f.ZAxis
Gets the value of the vector with components 0,0,1.
Since: 5.0

Rhino.Geometry.Vector3f.Unset
Gets the value of the vector with each component set to RhinoMath.UnsetValue.
Since: 5.0

Rhino.Geometry.Vector3f.X
Gets or sets the X (first) component of this vector.
Since: 5.0

Rhino.Geometry.Vector3f.Y
Gets or sets the Y (second) component of this vector.
Since: 5.0

Rhino.Geometry.Vector3f.Z
Gets or sets the Z (third) component of this vector.
Since: 5.0

Rhino.Geometry.Vector3f.IsZero
Gets a value indicating whether the X, Y, and Z values are all equal to 0.0.
Since: 6.0

Rhino.Geometry.Vector3f.IsUnitVector
Gets a value indicating whether or not this is a unit vector.
A unit vector has length 1.
Since: 6.0

Rhino.Geometry.Vector3f.IsValid
Returns an indication regarding the validity of this vector.
Since: 6.0

Rhino.Geometry.Vector3f.Equals(System.Object)
Determines whether the specified System.Object is a Vector3f and has the same values as the present vector.
obj: The specified object.
Returns: true if obj is Vector3f and has the same components as this; otherwise false.

Rhino.Geometry.Vector3f.Equals(Rhino.Geometry.Vector3f)
Determines whether the specified vector has the same values as the present vector.
vector: The specified vector.
Returns: true if vector has the same components as this; otherwise false.
Since: 5.0

Rhino.Geometry.Vector3f.EpsilonEquals(Rhino.Geometry.Vector3f,System.Single)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:
Since: 5.4

Rhino.Geometry.Vector3f.CompareTo(Rhino.Geometry.Vector3f)
Compares this Rhino.Geometry.Vector3f with another Rhino.Geometry.Vector3f.
Component evaluation priority is first X, then Y, then Z.
other: The other Rhino.Geometry.Vector3f to use in comparison.
Returns:
0: if this is identical to other
-1: if this.X < other.X
-1: if this.X == other.X and this.Y < other.Y
-1: if this.X == other.X and this.Y == other.Y and this.Z < other.Z
+1: otherwise.
Since: 5.0

Rhino.Geometry.Vector3f.GetHashCode
Computes a hash number that represents the current vector.
Returns: A hash code that is not unique for each vector.

Rhino.Geometry.Vector3f.ToString
Constructs the string representation of the current vector.
Returns: The vector representation in the form X,Y,Z.

Rhino.Geometry.Vector3f.ToString(System.String,System.IFormatProvider)
Since: 7.0

Rhino.Geometry.Vector3f.Unitize
Unitizes the vector in place. A unit vector has length 1 unit.
An invalid or zero length vector cannot be unitized.
Returns: true on success or false on failure.
Since: 5.0

Rhino.Geometry.Vector3f.Transform(Rhino.Geometry.Transform)
Transforms the vector in place.
The transformation matrix acts on the left of the vector; i.e.,
result = transformation*vector
transformation: Transformation matrix to apply.
Since: 5.0

Rhino.Geometry.Vector3f.Rotate(System.Double,Rhino.Geometry.Vector3f)
Rotates this vector around a given axis.
angleRadians: Angle of rotation (in radians).
rotationAxis: Axis of rotation.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Vector3f.Reverse
Reverses this vector in place (reverses the direction).
If this vector contains RhinoMath.UnsetValue, the
reverse will also be invalid and false will be returned.
Remarks: Similar to Negate, that is only provided for CLR language compliance.
Returns: true on success or false if the vector is invalid.
Since: 5.0

Rhino.Geometry.Vector3f.PerpendicularTo(Rhino.Geometry.Vector3f)
Sets this vector to be perpendicular to another vector.
Result is not unitized.
other: Vector to use as guide.
Returns: true on success, false if input vector is zero or invalid.
Since: 5.0

Rhino.Geometry.Vector3f.op_Equality(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)
Determines whether two vectors have equal values.
a: The first vector.
b: The second vector.
Returns: true if the components of the two vectors are exactly equal; otherwise false.
Since: 5.0

Rhino.Geometry.Vector3f.op_Inequality(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)
Determines whether two vectors have different values.
a: The first vector.
b: The second vector.
Returns: true if the two vectors differ in any component; false otherwise.
Since: 5.0

Rhino.Geometry.Vector3f.op_LessThan(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)
Determines whether the first specified vector comes before
(has inferior sorting value than) the second vector.
Components evaluation priority is first X, then Y, then Z.
a: The first vector.
b: The second vector.
Returns: true if a.X is smaller than b.X,
or a.X == b.X and a.Y is smaller than b.Y,
or a.X == b.X and a.Y == b.Y and a.Z is smaller than b.Z;
otherwise, false.
Since: 5.0

Rhino.Geometry.Vector3f.op_LessThanOrEqual(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)
Determines whether the first specified vector comes before
(has inferior sorting value than) the second vector, or it is equal to it.
Components evaluation priority is first X, then Y, then Z.
a: The first vector.
b: The second vector.
Returns: true if a.X is smaller than b.X,
or a.X == b.X and a.Y is smaller than b.Y,
or a.X == b.X and a.Y == b.Y and a.Z <= b.Z;
otherwise, false.
Since: 5.0

Rhino.Geometry.Vector3f.op_GreaterThan(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)
Determines whether the first specified vector comes after (has superior sorting value than)
the second vector.
Components evaluation priority is first X, then Y, then Z.
a: The first vector.
b: The second vector.
Returns: true if a.X is larger than b.X,
or a.X == b.X and a.Y is larger than b.Y,
or a.X == b.X and a.Y == b.Y and a.Z is larger than b.Z;
otherwise, false.
Since: 5.0

Rhino.Geometry.Vector3f.op_GreaterThanOrEqual(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)
Determines whether the first specified vector comes after (has superior sorting value than)
the second vector, or it is equal to it.
Components evaluation priority is first X, then Y, then Z.
a: The first vector.
b: The second vector.
Returns: true if a.X is larger than b.X,
or a.X == b.X and a.Y is larger than b.Y,
or a.X == b.X and a.Y == b.Y and a.Z >= b.Z;
otherwise, false.
Since: 5.0

Rhino.Geometry.Vector3f.op_Addition(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)
Sums up two vectors.
vector1: A vector.
vector2: A second vector.
Returns: A new vector that results from the component-wise addition of the two vectors.

Rhino.Geometry.Vector3f.Add(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)
Sums up two vectors.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
vector1: A vector.
vector2: A second vector.
Returns: A new vector that results from the component-wise addition of the two vectors.
Since: 6.0

Rhino.Geometry.Vector3f.op_Addition(Rhino.Geometry.Point3f,Rhino.Geometry.Vector3f)
Sums up a point and a vector, and returns a new point.
point: A point.
vector: A vector.
Returns: A new point that results from the addition of point and vector.

Rhino.Geometry.Vector3f.op_UnaryNegation(Rhino.Geometry.Vector3f)
Computes the opposite vector.
vector: A vector to negate.
Returns: A new vector where all components were multiplied by -1.
Since: 6.0

Rhino.Geometry.Vector3f.op_Subtraction(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)
Subtracts the second vector from the first one.
vector1: A vector.
vector2: A second vector.
Returns: A new vector that results from the component-wise difference of vector1 - vector2.
Since: 6.0

Rhino.Geometry.Vector3f.Subtract(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)
Subtracts the second vector from the first one.
(Provided for languages that do not support operator overloading. You can use the - operator otherwise)
vector1: A vector.
vector2: A second vector.
Returns: A new vector that results from the component-wise difference of vector1 - vector2.
Since: 6.0

Rhino.Geometry.Vector3f.Negate(Rhino.Geometry.Vector3f)
Computes the reversed vector.
(Provided for languages that do not support operator overloading. You can use the - unary operator otherwise)
Remarks: This is similar to Reverse(), but is static for CLR compliance, and with default name.
vector: A vector to negate.
Returns: A new vector where all components were multiplied by -1.
Since: 6.0

Rhino.Geometry.Vector3f.Add(Rhino.Geometry.Point3f,Rhino.Geometry.Vector3f)
Sums up a point and a vector, and returns a new point.
(Provided for languages that do not support operator overloading. You can use the + operator otherwise)
point: A point.
vector: A vector.
Returns: A new point that results from the addition of point and vector.
Since: 5.0

Rhino.Geometry.Vector3f.op_Multiply(Rhino.Geometry.Vector3f,System.Single)
Multiplies a vector by a number, having the effect of scaling it.
vector: A vector.
t: A number.
Returns: A new vector that is the original vector coordinate-wise multiplied by t.
Since: 5.0

Rhino.Geometry.Vector3f.op_Multiply(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)
Multiplies two Rhino.Geometry.Vector3f together, returning the dot (internal) product of the two.
This is not the cross product.
point1: The first point.
point2: The second point.
Returns: A value that results from the coordinate-wise multiplication of point1 and point2.
Since: 5.0

Rhino.Geometry.Vector3f.Multiply(Rhino.Geometry.Vector3f,System.Single)
Multiplies a vector by a number, having the effect of scaling it.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
vector: A vector.
t: A number.
Returns: A new vector that is the original vector coordinate-wise multiplied by t.
Since: 5.0

Rhino.Geometry.Vector3f.op_Multiply(System.Single,Rhino.Geometry.Vector3f)
Multiplies a vector by a number, having the effect of scaling it.
t: A number.
vector: A vector.
Returns: A new vector that is the original vector coordinate-wise multiplied by t.
Since: 5.0

Rhino.Geometry.Vector3f.Multiply(System.Single,Rhino.Geometry.Vector3f)
Multiplies a vector by a number, having the effect of scaling it.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
t: A number.
vector: A vector.
Returns: A new vector that is the original vector coordinate-wise multiplied by t.
Since: 5.0

Rhino.Geometry.Vector3f.Multiply(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)
Multiplies two Rhino.Geometry.Vector3f together, returning the dot (internal) product of the two.
This is not the cross product.
(Provided for languages that do not support operator overloading. You can use the * operator otherwise)
point1: The first point.
point2: The second point.
Returns: A value that results from the coordinate-wise multiplication of point1 and point2.
Since: 6.0

Rhino.Geometry.Vector3f.op_Division(Rhino.Geometry.Vector3f,System.Double)
Divides a Rhino.Geometry.Vector3f by a number, having the effect of shrinking it, t times.
vector: A vector.
t: A number.
Returns: A new vector that is component-wise divided by t.
Since: 6.0

Rhino.Geometry.Vector3f.op_Division(Rhino.Geometry.Vector3f,System.Single)
Divides a Rhino.Geometry.Vector3f by a number, having the effect of shrinking it, t times.
vector: A vector.
t: A number.
Returns: A new vector that is component-wise divided by t.
Since: 6.0

Rhino.Geometry.Vector3f.Divide(Rhino.Geometry.Vector3f,System.Double)
Divides a Rhino.Geometry.Vector3f by a number, having the effect of shrinking it, t times.
(Provided for languages that do not support operator overloading. You can use the / operator otherwise)
vector: A vector.
t: A number.
Returns: A new vector that is component-wise divided by t.
Since: 6.0

Rhino.Geometry.Vector3f.Divide(Rhino.Geometry.Vector3f,System.Single)
Divides a Rhino.Geometry.Vector3f by a number, having the effect of shrinking it, t times.
(Provided for languages that do not support operator overloading. You can use the / operator otherwise)
vector: A vector.
t: A number.
Returns: A new vector that is component-wise divided by t.
Since: 6.0

Rhino.Geometry.Vector3f.CrossProduct(Rhino.Geometry.Vector3f,Rhino.Geometry.Vector3f)
Computes the cross product (or vector product, or exterior product) of two vectors.
This operation is not commutative.
a: First vector.
b: Second vector.
Returns: A new vector that is perpendicular to both a and b,
has Length == a.Length * b.Length and
with a result that is oriented following the right hand rule.
Since: 5.0

Rhino.Geometry.Vector3f.SquareLength
Returns the square length of the vector.
This property does not check for the validity of the inputs.
Since: 6.0

Rhino.Geometry.Vector3f.Length
Computes the length (or magnitude, or size) of this vector.
This is an application of Pythagoras' theorem.
If this vector is invalid, its length is considered 0.
Since: 5.0

Rhino.Geometry.Vector3f.op_Explicit(Rhino.Geometry.Vector3d)~Rhino.Geometry.Vector3f
Converts a double-precision vector in a single-precision vector.
Needs explicit casting to help retain precision.
vector: A vector.
Returns: The resulting vector.