Rhino.Collections.IResizableList`1
Provides the ability to resize a generic list by setting the Count property.

Rhino.Collections.IResizableList`1.Count
Gets or sets the length of the list.
This hides (Shadows in Vb.Net) the read-only Count property of the generic list.