Rhino.DocObjects.Custom.CustomObjectGrips.RegisterGripsEnabler(Rhino.DocObjects.Custom.TurnOnGripsEventHandler,System.Type)
Since: 5.0

Rhino.DocObjects.Custom.CustomObjectGrips.#ctor(Rhino.DocObjects.Custom.ObjectGripsType)
Creates grips that present themselves to Rhino as gripsType.
gripsType:
What the grips control. Fixed for the life of the object.

Rhino.DocObjects.Custom.CustomObjectGrips.GripsType
What these grips control. Set at construction.

Rhino.DocObjects.Custom.CustomObjectGrips.GripCount
Since: 5.0

Rhino.DocObjects.Custom.CustomObjectGrips.Grip(System.Int32)
Since: 5.0

Rhino.DocObjects.Custom.CustomObjectGrips.Dragging
Determines if grips are currently being dragged.
Returns: true if grips are dragged.
Since: 5.0

Rhino.DocObjects.Custom.CustomObjectGrips.NewLocation
true if some of the grips have been moved. GripObject.NewLocation() sets
NewLocation=true.  Derived classes can set NewLocation to false after
updating temporary display information.
Since: 5.0

Rhino.DocObjects.Custom.CustomObjectGrips.GripsMoved
If GripsMoved is true if some of the grips have ever been moved
GripObject.NewLocation() sets GripsMoved=true.
Since: 5.0

Rhino.DocObjects.Custom.CustomObjectGrips.OwnerObject
Owner of the grips.
Since: 5.0

Rhino.DocObjects.Custom.CustomObjectGrips.OnReset
Resets location of all grips to original spots and cleans up stuff that
was created by dynamic dragging.  This is required when dragging is
canceled or in the Copy command when grips are "copied". The override
should clean up dynamic workspace stuff.

Rhino.DocObjects.Custom.CustomObjectGrips.OnResetMeshes
Just before Rhino turns off object grips, it calls this function.
If grips have modified any display meshes, they must override
this function and restore the meshes to their original states.

Rhino.DocObjects.Custom.CustomObjectGrips.OnUpdateMesh(Rhino.Geometry.MeshType)
Just before Rhino shades an object with grips on, it calls this method
to update the display meshes.  Grips that modify surface or mesh objects
must override this function and modify the display meshes here.
meshType: The mesh type being updated.

Rhino.DocObjects.Custom.CustomObjectGrips.NewGeometry
If the grips control just one object, then override NewGeometry(). When
NewGeometry() is called, return new geometry calculated from the current
grip locations. This happens once at the end of a grip drag.
Returns: The new geometry. The default implementation returns null.

Rhino.DocObjects.Custom.CustomObjectGrips.OnDraw(Rhino.DocObjects.Custom.GripsDrawEventArgs)
Draws the grips. In your implementation, override this if you need to draw
dynamic elements and then call this base implementation to draw the grips themselves.
args: The grips draw event arguments.

Rhino.DocObjects.Custom.CustomObjectGrips.NeighborGrip(System.Int32,System.Int32,System.Int32,System.Int32,System.Boolean)
Get neighbors.
gripIndex: index of grip where the search begins.
dr:
1 = next grip in the first parameter direction.
-1 = previous grip in the first parameter direction.
ds:
1 = next grip in the second parameter direction.
-1 = previous grip in the second parameter direction.
dt:
1 = next grip in the third parameter direction.
-1 = rev grip in the third parameter direction.
wrap: If true and object is "closed", the search will wrap.
Returns: Pointer to the desired neighbor or NULL if there is no neighbor.

Rhino.DocObjects.Custom.CustomObjectGrips.NurbsSurfaceGrip(System.Int32,System.Int32)
If the grips are control points of a NURBS surface, then this gets the
index of the grip that controls the (i,j)-th CV.
i: The index in the first dimension.
j: The index in the second dimension.
Returns: A grip controlling a NURBS surface CV or null.

Rhino.DocObjects.Custom.CustomObjectGrips.NurbsSurface
If the grips control a NURBS surface, this returns a pointer to that
surface.  You can look at but you must NEVER change this surface.
Return a surface held in a field, never a temporary: Rhino keeps the underlying
pointer after this call returns.
Returns: A pointer to a NURBS surface or null.

Rhino.DocObjects.Custom.CustomObjectGrips.NurbsCurveGrip(System.Int32)
If the grips are control points of a NURBS curve, then this gets the
grip that controls the i-th CV.
i: The control point index.
Returns: A grip controlling a NURBS curve CV or null.

Rhino.DocObjects.Custom.CustomObjectGrips.NurbsCurve
If the grips control a NURBS curve, this returns a pointer to that
curve.  You can look at but you must NEVER change this curve.
Return a curve held in a field, never a temporary: Rhino keeps the underlying
pointer after this call returns.
Returns: A pointer to a NURBS curve or null.

Rhino.DocObjects.Custom.CustomObjectGrips.Dispose
Since: 5.0