Rhino.Render.RenderContentSerializer
Used to import and export custom render content such as
materials, environments and textures.  You must override
RenderPlugIn.RenderContentSerializers() and return an array of
derived RenderContentSerializer class types to add to the content
browsers.

Rhino.Render.RenderContentSerializer.#ctor(System.String,Rhino.Render.RenderContentKind,System.Boolean,System.Boolean)
Protected constructor to be called from derived class
fileExtension:
File extension associated with this serialize object
contentKind:
Kind of content created when importing or exporting this file type.
canRead:
If true then the file type can be imported and will be included in the
file open box when importing the specified render content kind.
canWrite:
If true then the file type can be exported and will be included in the
file save box when exporting the specified render content kind.

Rhino.Render.RenderContentSerializer.RegisterSerializer(System.Guid)
Register the RenderContentSerializer
id:
Plug-in id
True if registered successful and false if unsuccessful
Since: 6.0

Rhino.Render.RenderContentSerializer.FileExtension
File extension associated with this serialize object
Since: 5.7

Rhino.Render.RenderContentSerializer.ContentType
Kind of content created when importing or exporting this file type.  Obsolete - use ContentKind
Since: 5.7

Rhino.Render.RenderContentSerializer.ContentKind
Kind of content created when importing or exporting this file type - ie, Material, Texture or Environment
Since: 7.0

Rhino.Render.RenderContentSerializer.CanRead
If true then the file type can be imported and will be included in the
file open box when importing the specified render content kind.
Since: 5.7

Rhino.Render.RenderContentSerializer.CanWrite
If true then the file type can be exported and will be included in the
file save box when exporting the specified render content kind.
Since: 5.7

Rhino.Render.RenderContentSerializer.Read(System.String)
Called to when importing a file, file should be parsed and converted to
a valid RenderContent object.
pathToFile:
Full path of the file to load.
Returns:
Returns a valid RenderContent object such as RenderMaterial if the file
was successfully parsed otherwise returns null.
Since: 5.7

Rhino.Render.RenderContentSerializer.Write(System.String,Rhino.Render.RenderContent,Rhino.Render.CreatePreviewEventArgs)
Called to save a custom RenderContent object as an external file.
pathToFile:
Full path of file to write
renderContent:
Render content to save
previewArgs:
Parameters used to generate a preview image which may be embedded in
the exported file.
Returns:
Since: 5.7

Rhino.Render.RenderContentSerializer.EnglishDescription
English string describing this plug-in
Since: 5.7

Rhino.Render.RenderContentSerializer.LocalDescription
Localized plug-in description
Since: 5.7

Rhino.Render.RenderContentSerializer.CanLoadMultiple
If true the plug-in is capable of loading multiple contents.
Since: 7.0

Rhino.Render.RenderContentSerializer.LoadMultiple(Rhino.RhinoDoc,System.Collections.Generic.IEnumerable{System.String},Rhino.Render.RenderContentKind,Rhino.Render.RenderContentSerializer.LoadMultipleFlags)
Create any number of new render contents loaded from any number of files.
Rhino document
A list of filenames to load from. Each file can contain any number of render contents.
Only used by I/O plug-ins that support multiple kinds. It tells the plug-in which
content kind to create. If the plug-in only supports a single content kind, it can ignore this parameter.
A set of flags from the enum above.
True if all contents loaded successfully, false if any one failed.
Since: 7.0

Rhino.Render.RenderContentSerializer.ReportContentAndFile(Rhino.Render.RenderContent,System.String,System.Int32)
This is called from your implementation of LoadMultiple() to add a content and the file it was
loaded from when the LoadMultipleFlags.Preload flag is NOT set.
See LoadMultiple() for an explanation of this method's use.
renderContent:
Render content that was loaded from the file.
pathToFile:
Full path of the file that the render content was loaded from.
flags:
Flags for future use; should be passed as zero.
Since: 7.0

Rhino.Render.RenderContentSerializer.ReportDeferredContentAndFile(Rhino.Render.RenderContent,System.String,System.Int32)
This is called from your implementation of LoadMultiple() to add a 'deferred' content and the
file it will be loaded from when the LoadMultipleFlags.Preload flag is set.
See LoadMultiple() for an explanation of this method's use.
\param c is the deferred content.
\param wszFullPath is the full path to the file that 'c' will be loaded from.
\param flags is reserved for future use; you should pass zero.
\param pReserved is reserved for future use; you should pass nullptr. */
renderContent:
Deferred render content - represents all contents that will be loaded from the file.
pathToFile:
Full path of the file that render contents will be loaded from.
flags:
Flags for future use; should be passed as zero.
Since: 7.0