Rhino.Geometry.MeshExtruderParameterMode
Parameter mode for creating texture coordinates and surface parameters

Rhino.Geometry.MeshExtruderParameterMode.CoverWalls
Stretch parameters slightly on extruded faces to cover walls

Rhino.Geometry.MeshExtruderParameterMode.KeepAndStretch
Keep parameters on extruded faces and stretch on walls