Rhino.DocObjects.ObjectEnumeratorSettings
Settings used for getting an enumerator of objects in a document.
See Rhino.DocObjects.Tables.ObjectTable.FindByFilter(Rhino.DocObjects.ObjectEnumeratorSettings),
Rhino.DocObjects.Tables.ObjectTable.GetObjectsByType``1(Rhino.DocObjects.ObjectEnumeratorSettings),
and Rhino.DocObjects.Tables.ObjectTable.GetEnumerator(Rhino.DocObjects.ObjectEnumeratorSettings).

Rhino.DocObjects.ObjectEnumeratorSettings.#ctor
Constructs object enumerator settings that will iterate the document looking for
normal object and locked object that are active, or part of current model and saved in file.
Since: 5.0

Rhino.DocObjects.ObjectEnumeratorSettings.NormalObjects
When true, normal objects (e.g. not locked and not hidden) are returned.
Since: 5.0

Rhino.DocObjects.ObjectEnumeratorSettings.LockedObjects
When true, locked objects or objects on locked layers are returned.
Since: 5.0

Rhino.DocObjects.ObjectEnumeratorSettings.HiddenObjects
When true, hidden objects or objects on hidden layers are returned.
Since: 5.0

Rhino.DocObjects.ObjectEnumeratorSettings.IdefObjects
When true, objects in instance definitions (not the instance references) are returned.
Since: 5.0

Rhino.DocObjects.ObjectEnumeratorSettings.DeletedObjects
When true, deleted objects are returned.
Since: 5.0

Rhino.DocObjects.ObjectEnumeratorSettings.SubObjectSelected
If true then objects which only have a sub object selected
will be included. This is false by default.
Since: 7.3

Rhino.DocObjects.ObjectEnumeratorSettings.ActiveObjects
When true, objects that are part of current model and saved in file are returned.
Since: 5.0

Rhino.DocObjects.ObjectEnumeratorSettings.ReferenceObjects
When true, objects that are for reference and not saved in file are returned.
Since: 5.0

Rhino.DocObjects.ObjectEnumeratorSettings.IncludeLights
The default object enumerator settings will not iterate through render light objects.
If you want the iterator to include lights, then set this property to true.
Since: 5.0

Rhino.DocObjects.ObjectEnumeratorSettings.IncludeGrips
The default object enumerator settings will not iterate through grip objects.
If you want the iterator to include grips, then set this property to true.
Since: 5.0

Rhino.DocObjects.ObjectEnumeratorSettings.IncludePhantoms
The default object enumerator settings will not iterate through phantom objects.
If you want the iterator to include phantom objects, then set this property to true.
Since: 5.0

Rhino.DocObjects.ObjectEnumeratorSettings.SelectedObjectsFilter
The default object enumerator settings ignore the selected state of objects.
If you want the iterator to limit itself to selected objects, then set this property to true.
Since: 5.0

Rhino.DocObjects.ObjectEnumeratorSettings.VisibleFilter
The default object enumerator settings ignore the visibility state of objects.
If you want the iterator to limit itself to visible objects, then set this property to true.
Since: 5.0

Rhino.DocObjects.ObjectEnumeratorSettings.ObjectTypeFilter
The object type filter property can be used to limit the iteration to specific types of geometry.
The default is to iterate all objects types.
Since: 5.0

Rhino.DocObjects.ObjectEnumeratorSettings.ClassTypeFilter
Since: 5.0

Rhino.DocObjects.ObjectEnumeratorSettings.LayerIndexFilter
The layer filter property can be used to limit the iteration to objects on a specific layer.
The default is to iterate through all layers.
Since: 5.0

Rhino.DocObjects.ObjectEnumeratorSettings.MaterialIndexFilter
The material filter property can be used to limit the iteration to objects that use a specific material.
The default is to iterate through all objects no matter the material assignment.
Since: 8.25

Rhino.DocObjects.ObjectEnumeratorSettings.NameFilter
The name filter property can be used to limit the iteration to objects with a specific name.
Since: 5.0

Rhino.DocObjects.ObjectEnumeratorSettings.ViewportFilter
The viewport filter property can be used to limit the iteration to objects that are active in a specific viewport.
Since: 5.6