Rhino.Geometry.SubDToBrepOptions
Options used for converting a SubD to a Brep

Rhino.Geometry.SubDToBrepOptions.#ctor
Create default options
Since: 7.0

Rhino.Geometry.SubDToBrepOptions.#ctor(System.Boolean,Rhino.Geometry.SubDToBrepOptions.ExtraordinaryVertexProcessOption)
Create options from the given packFaces and vertexProcess values.
packFaces: Sets the pack faces options.
vertexProcess: Sets the extraordinary vertex process option.
Since: 7.1

Rhino.Geometry.SubDToBrepOptions.Default
Default SubDToBrepOptions settings.
Currently selects the same options as DefaultUnpacked:
Locally-G1 smoothing of extraordinary vertices, unpacked faces.
Remarks:
These are the settings used by ON_SubD::BrepForm()
Since: 7.0

Rhino.Geometry.SubDToBrepOptions.DefaultPacked
Default ON_SubDToBrepParameters settings for creating a packed brep.
Locally-G1 smoothing of extraordinary vertices, packed faces.
Since: 7.0

Rhino.Geometry.SubDToBrepOptions.DefaultUnpacked
Default ON_SubDToBrepParameters settings for creating an unpacked brep.
Locally-G1 smoothing of extraordinary vertices, unpacked faces.
Since: 7.0

Rhino.Geometry.SubDToBrepOptions.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Geometry.SubDToBrepOptions.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 7.0

Rhino.Geometry.SubDToBrepOptions.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.Geometry.SubDToBrepOptions.PackFaces
Get or sets the pack faces option.
Since: 7.0

Rhino.Geometry.SubDToBrepOptions.ExtraordinaryVertexProcess
Get or sets the extraordinary vertex process option.
Since: 7.0