Rhino.PlugIns.CustomRenderSaveFileTypes.SaveFileHandler
Called when a user chooses to save a rendered scene as this custom
file type.
fileName:
Name of the file to write.
includeAlpha:
Only meaningful if the custom file type optionally supports alpha
channel.
renderWindow:
The Rhino.Render.RenderWindow to save.
Returns:
Return true if the file was written successfully otherwise return
false.