Rhino.DocObjects.ViewInfo
Represents the name and orientation of a View (and named view).
views can be thought of as cameras.

Rhino.DocObjects.ViewInfo.#ctor
Create a default ViewInfo instance
Since: 8.2

Rhino.DocObjects.ViewInfo.#ctor(Rhino.Display.RhinoViewport)
Access to the ViewInfo for given RhinoViewport
rhinoViewPort:
Since: 6.0

Rhino.DocObjects.ViewInfo.#ctor(System.UInt32)
Construct the ViewInfo for active viewport of given doc.
docRuntimeSerialNumber: Runtime serial number of the
document to query for the active viewport
Since: 6.0

Rhino.DocObjects.ViewInfo.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.DocObjects.ViewInfo.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0

Rhino.DocObjects.ViewInfo.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.DocObjects.ViewInfo.Name
Gets or sets the name of the view.
Since: 5.0

Rhino.DocObjects.ViewInfo.Maximized
Gets or sets whether the view window is maximized in the frame window.
Together with the window position (see Rhino.DocObjects.ViewInfo.GetWindowPosition(System.Double@,System.Double@,System.Double@,System.Double@)) this
is stored in the 3dm file and controls the viewport layout when the file is
opened.
Since: 9.0

Rhino.DocObjects.ViewInfo.GetWindowPosition(System.Double@,System.Double@,System.Double@,System.Double@)
Gets the position of the view window in the frame window, expressed as
fractions (0 to 1) of the frame window size.
left: Left edge fraction.
right: Right edge fraction.
top: Top edge fraction.
bottom: Bottom edge fraction.
Since: 9.0

Rhino.DocObjects.ViewInfo.SetWindowPosition(System.Double,System.Double,System.Double,System.Double)
Sets the position of the view window in the frame window, expressed as
fractions (0 to 1) of the frame window size. The Rhino.DocObjects.ViewInfo.Maximized
state is preserved.
left: Left edge fraction.
right: Right edge fraction.
top: Top edge fraction.
bottom: Bottom edge fraction.
Since: 9.0

Rhino.DocObjects.ViewInfo.GetConstructionPlane
Gets the view's construction plane, including its grid settings: grid and snap
spacing, grid line count, thick-line frequency, and depth buffering.
Returns: A copy of the view's construction plane.
Since: 8.35

Rhino.DocObjects.ViewInfo.SetConstructionPlane(Rhino.DocObjects.ConstructionPlane)
Sets the view's construction plane, including its grid settings.
constructionPlane: The construction plane to store on the view.
Since: 8.35

Rhino.DocObjects.ViewInfo.NamedViewId
Returns a unique id if this is a named view otherwise an empty Guid.
Since: 7.28

Rhino.DocObjects.ViewInfo.DisplayModeId
The id of the display mode this view opens in - wireframe, shaded, rendered, or any
custom display mode. Rhino.Display.DisplayModeDescription holds the
standard ids. A nil id means the view has no display mode of its own and opens in
wireframe, which is what every template generated without this property did.
Since: 8.36

Rhino.DocObjects.ViewInfo.ViewType
Whether this view is a model view, a layout page, a nested (detail) view, or one of
the special editor views. A page view must be an orthographic top view; see
Rhino.DocObjects.PageSettings for its paper size.
Since: 8.36

Rhino.DocObjects.ViewInfo.ShowConstructionGrid
Whether the construction plane grid is drawn in this view.
Since: 8.36

Rhino.DocObjects.ViewInfo.ShowConstructionAxes
Whether the construction plane x and y axes are drawn in this view.
Since: 8.36

Rhino.DocObjects.ViewInfo.ShowConstructionZAxis
Whether the construction plane z axis is drawn in this view.
Since: 8.36

Rhino.DocObjects.ViewInfo.ShowWorldAxes
Whether the world axes icon is drawn in the corner of this view.
Since: 8.36

Rhino.DocObjects.ViewInfo.LockedProjection
Whether the view's projection is locked against changes.
Since: 8.36

Rhino.DocObjects.ViewInfo.RenderingSize
The pixel size this view renders at.
Since: 8.36

Rhino.DocObjects.ViewInfo.GetPageSettings
Gets the paper size and margins of this view. Only meaningful when
Rhino.DocObjects.ViewInfo.ViewType is Rhino.DocObjects.ViewType.PageView.
Since: 8.36

Rhino.DocObjects.ViewInfo.SetPageSettings(Rhino.DocObjects.PageSettings)
Sets the paper size and margins of this view. Set Rhino.DocObjects.ViewInfo.ViewType to
Rhino.DocObjects.ViewType.PageView as well, or the page settings are ignored.
Since: 8.36

Rhino.DocObjects.ViewInfo.WallpaperFilename
Get filename for wallpaper set to this view, if any.
Since: 6.0

Rhino.DocObjects.ViewInfo.ShowWallpaperInGrayScale
True if wallpaper (if any) is to be shown in gray scale in this view.
Since: 6.0

Rhino.DocObjects.ViewInfo.WallpaperHidden
True if wallpaper (if any) is to be hidden from this view.
Since: 6.0

Rhino.DocObjects.ViewInfo.FocalBlurDistance
Gets or sets the Focal blur distance of the active viewport
Since: 6.0

Rhino.DocObjects.ViewInfo.FocalBlurAperture
Gets or sets the Focal blur aperture of the active viewport
Since: 6.0

Rhino.DocObjects.ViewInfo.FocalBlurJitter
Gets or sets the Focal blur jitter of the active viewport
Since: 6.0

Rhino.DocObjects.ViewInfo.FocalBlurSampleCount
Gets or sets the Focal blur sample count of the active viewport
Since: 6.0

Rhino.DocObjects.ViewInfo.FocalBlurMode
Gets or sets the Focal blur mode of the active viewport
Since: 6.0

Rhino.DocObjects.ViewInfo.SectionBehavior
How a view will interact with clipping planes
Since: 8.0

Rhino.DocObjects.ViewInfo.ClippingPlanesIds
Returns a list of clipping plane Ids associated with this view.
Since: 8.15

Rhino.DocObjects.ViewInfo.ClippingPlaneSurfaces
Returns a list of ClippingPlaneSurfaces for this view.
Returns:
Since: 8.17

Rhino.DocObjects.ViewInfo.Viewport
Gets the viewport, or viewing frustum, associated with this view.
Since: 5.0