Rhino.Render.CustomRenderMeshes.RenderMeshProviderProgress
Expresses the progress of a custom render mesh provider.

Rhino.Render.CustomRenderMeshes.RenderMeshProviderProgress.Text
Return a textural progress report
Since: 8.0

Rhino.Render.CustomRenderMeshes.RenderMeshProviderProgress.Amount
The amount of progress towards the target
Since: 8.0

Rhino.Render.CustomRenderMeshes.RenderMeshProviderProgress.Target
Target progress
Since: 8.0

Rhino.Render.CustomRenderMeshes.RenderMeshProviderProgress.IsComplete
true if complete, otherwise false.
Since: 8.0

Rhino.Render.CustomRenderMeshes.RenderMeshProviderProgress.ProviderId
The Id of the RenderMeshProvider that this report came from.
Since: 8.0