Rhino.Geometry.RefitTrimSectionMode
The mode for dividing the surface into sections

Rhino.Geometry.RefitTrimSectionMode.NoSections
just output one "upper" and one "lower" surface

Rhino.Geometry.RefitTrimSectionMode.DivideAtInputKnots
divide into sections at each of the input surface's existing knots

Rhino.Geometry.RefitTrimSectionMode.DivideAtAddedKnots
Yes, divide into sections at each of the "nKnot" added knot values

Rhino.Geometry.RefitTrimSectionMode.DivideAtAllKnots
Yes, divide into sections at ALL knot values (i.e. both 1 and 2)