Rhino.Geometry.MeshUnwrapMethod
Unwrapping method used

Rhino.Geometry.MeshUnwrapMethod.LSCM
Least squares conformal map, Rhino 7 standard method

Rhino.Geometry.MeshUnwrapMethod.ABFPP
ABF++, angle based flattening

Rhino.Geometry.MeshUnwrapMethod.ARAP
ARAP, as rigid as possible