Rhino.Runtime.InteropWrappers.SimpleArrayInt
Wrapper for ON_SimpleArray<int>. If you are not writing C++ code
then this class is not for you.

Rhino.Runtime.InteropWrappers.SimpleArrayInt.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayInt.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayInt.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayInt class.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayInt.#ctor(System.Collections.Generic.IEnumerable{System.Int32})
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayInt class
values: initial set of integers to add to the array
Since: 5.9

Rhino.Runtime.InteropWrappers.SimpleArrayInt.Count
Gets the amount of elements in this array.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayInt.ToArray
Returns the managed counterpart of the unmanaged array.
Returns: The managed array.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayInt.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.SimpleArrayInt.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0