Rhino.FileIO.FileStlWriteOptions
Options for writing a STL file

Rhino.FileIO.FileStlWriteOptions.BinaryFile
Since: 8.0

Rhino.FileIO.FileStlWriteOptions.ExportOpenObjects
Since: 8.0

Rhino.FileIO.FileStlWriteOptions.MeshingParameters
Since: 8.0

Rhino.FileIO.FileStlWriteOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0