Rhino.Geometry.RibbonOffsetParameters
Advanced parameters for RibbonOffset
Parameters mimic the RibbonOffset Command.

Rhino.Geometry.RibbonOffsetParameters.OffsetDistance
Offset curve distance from input curve.
Since: 8.9

Rhino.Geometry.RibbonOffsetParameters.OffsetLocation
Inside or Outside point location
Since: 8.9

Rhino.Geometry.RibbonOffsetParameters.OffsetTolerance
Used to determine self-intersections of offset curve, not offset error.
Since: 8.9

Rhino.Geometry.RibbonOffsetParameters.OffsetPlaneVector3d
A vector that indicates the normal of the plane in which the offset will occur.
This vector is typically similar to a logical extrude direction for the closed input curve.
Since: 8.9

Rhino.Geometry.RibbonOffsetParameters.BlendRadius
Positive, typically the same as distance. When the offset results in a self-intersection
that gets trimmed off at a kink, the kink will be blended out using this radius.
Since: 8.9

Rhino.Geometry.RibbonOffsetParameters.RebuildPointCount
Rebuild offset curve with defined number of control points
0 for disabled
Since: 8.9

Rhino.Geometry.RibbonOffsetParameters.RefitTolerance
Refit the offset curve to a specified tolerance
0 for disabled
Since: 8.9

Rhino.Geometry.RibbonOffsetParameters.AlignCrossSections
When false: cross section slashes between input and output curve are located at the ends of ruled spans.
When true: cross section slashes between input and output curve are located at the mid points of ruled spans and blends.
Since: 8.9

Rhino.Geometry.RibbonOffsetParameters.RibbonSurfaceGenerationMethod
0 - no surfaces will be created, curves only
1 - Simple Sweep 2
2 - Sweep 2 mixed with NetworkSrf corners
Since: 8.9