Rhino.Render.ContentList`1
Base class that provides access to the document lists of RenderContent instances
ie - the Material, Environment and Texture tables.

Rhino.Render.ContentList`1.Count
The number of top level content objects in this list.

Rhino.Render.ContentList`1.Id
The unique identifier for this list.

Rhino.Render.ContentList`1.Find(System.Guid)
Finds a content by its instance id.
instanceId: Instance id of the content to find.
Returns: The found content or null if not found