Rhino.Geometry.Collections.SubDFaceList
All faces in a SubD

Rhino.Geometry.Collections.SubDFaceList.Count
Gets the number of SubD faces.
Since: 7.0

Rhino.Geometry.Collections.SubDFaceList.Find(System.UInt32)
Find a face in this SubD with a given id
id:
Returns:
Since: 7.0

Rhino.Geometry.Collections.SubDFaceList.Find(System.Int32)
Find a face in this SubD with a given id
id:
Returns:
Since: 7.0

Rhino.Geometry.Collections.SubDFaceList.HasPerFaceColors
True if one or more faces on the active level have per face color overrides.
Remarks:
Per face colors are a mutable property on Rhino.Geometry.SubDFace and are set with  Rhino.Geometry.SubDFace.PerFaceColor.
Since: 8.18

Rhino.Geometry.Collections.SubDFaceList.ClearPerFaceColors
Removes all per face color overrides on the active level.
Returns: Number of changed faces.
Remarks:
Per face colors are a mutable property on Rhino.Geometry.SubDFace and are set with  Rhino.Geometry.SubDFace.PerFaceColor.
Since: 8.18

Rhino.Geometry.Collections.SubDFaceList.GetEnumerator
Implementation of IEnumerable
Returns:
Since: 7.0

Rhino.Geometry.Collections.SubDFaceList.System#Collections#IEnumerable#GetEnumerator
Since: 7.0

Rhino.Geometry.Collections.SubDFaceList.Add(Rhino.Geometry.SubDEdge[],System.Boolean[])
Adds a new edge to the end of the edge list.
edges: edges to add
directions: The direction each of these edges has, related to the face.
True means that the edge is reversed compared to the counter-clockwise order of the face.
This argument can be null. In this case, no edge is considered reversed.
Throws System.ArgumentOutOfRangeException: If tag is unset or non-defined.

Rhino.Geometry.Collections.SubDFaceList.Add(System.Collections.Generic.IEnumerable{Rhino.Geometry.SubDEdge})
Adds a face bounded by the given edges.
edges:
The edges of the new face, in order around its boundary. There must be at least
three. Each edge is traversed according to its
Rhino.Geometry.SubDComponent.ComponentDirection, so consecutive edges have to meet:
the end vertex of one is the start vertex of the next. Set ComponentDirection on the
edges before calling this to orient the loop.
Returns: The new face, or null if the edges do not form a usable boundary.
Since: 8.36