Rhino.Render.RenderPrimitive.Dispose
Since: 5.7

Rhino.Render.RenderPrimitive.RhinoObject
The Rhino object associated with this render primitive.
Since: 5.7

Rhino.Render.RenderPrimitive.PrimitiveType
Call this before extracting meshes if you support render primitives to
get the Rhino.Render.RenderPrimitiveType of this mesh then call the
associated Rhino.Render.RenderPrimitive.TryGetSphere(Rhino.Geometry.Sphere@), Rhino.Render.RenderPrimitive.TryGetPlane(Rhino.Geometry.PlaneSurface@), Rhino.Render.RenderPrimitive.TryGetCone(Rhino.Geometry.Cone@,Rhino.Geometry.Plane@), or
Rhino.Render.RenderPrimitive.TryGetBox(Rhino.Geometry.Box@) method.  Calling the Rhino.Render.RenderPrimitive.Mesh property
will mesh the primitive and return a mesh always.
Since: 5.7

Rhino.Render.RenderPrimitive.Mesh
Returns the mesh associated with the object, this will mesh primitives
and always return a mesh.
Returns:
Since: 5.7

Rhino.Render.RenderPrimitive.TryGetSphere(Rhino.Geometry.Sphere@)
Call this method to get a sphere primitive for this mesh.  If this
meshes Rhino.Render.RenderPrimitive.PrimitiveType is not a Rhino.Render.RenderPrimitiveType.Sphere
then the sphere parameter is set to Rhino.Geometry.Sphere.Unset.
sphere:
Gets set to the primitive sphere for this object on success.
Returns:
Returns true if Rhino.Render.RenderPrimitive.PrimitiveType is Rhino.Render.RenderPrimitiveType.Sphere and
the sphere parameter was initialized otherwise returns false.
Since: 5.7

Rhino.Render.RenderPrimitive.TryGetBox(Rhino.Geometry.Box@)
Call this method to get a Rhino.Geometry.Box primitive for this mesh.  If this
meshes Rhino.Render.RenderPrimitive.PrimitiveType is not a Rhino.Render.RenderPrimitiveType.Box
then the box parameter is set to Rhino.Geometry.Box.Empty.
box:
Gets set to the box primitive for this object on success or Rhino.Geometry.Box.Empty on error.
Returns:
Returns true if Rhino.Render.RenderPrimitive.PrimitiveType is Rhino.Render.RenderPrimitiveType.Box and
the box parameter was initialized otherwise returns false.
Since: 5.7

Rhino.Render.RenderPrimitive.TryGetPlane(Rhino.Geometry.PlaneSurface@)
Call this method to get a Rhino.Geometry.Plane primitive for this mesh.  If this
meshes Rhino.Render.RenderPrimitive.PrimitiveType is not a Rhino.Render.RenderPrimitiveType.Plane
then the plane parameter is set to null.
plane:
Gets set to the plane primitive for this object on success or null on error.
Returns:
Returns true if Rhino.Render.RenderPrimitive.PrimitiveType is Rhino.Render.RenderPrimitiveType.Plane and
the plane parameter was initialized otherwise returns false.
Since: 5.7

Rhino.Render.RenderPrimitive.TryGetCone(Rhino.Geometry.Cone@,Rhino.Geometry.Plane@)
Call this method to get a Rhino.Geometry.Cone primitive for this mesh.  If this
meshes Rhino.Render.RenderPrimitive.PrimitiveType is not a Rhino.Render.RenderPrimitiveType.Cone
then the cone parameter is set to Rhino.Geometry.Cone.Unset and the truncation
parameter is set to Rhino.Geometry.Plane.Unset.
cone:
Gets set to the cone primitive for this object on success or Rhino.Geometry.Cone.Unset on error.
truncation:
Gets set to the truncation plane for this object on success or Rhino.Geometry.Plane.Unset on error.
Returns:
Returns true if Rhino.Render.RenderPrimitive.PrimitiveType is Rhino.Render.RenderPrimitiveType.Cone and
the cone and truncation parameters were initialized otherwise returns false.
Since: 5.7

Rhino.Render.RenderPrimitive.InstanceTransform
Instance reference transform or Identity if not an instance reference.
Since: 5.7

Rhino.Render.RenderPrimitive.RenderMaterial
The Rhino.Render.RenderPrimitive.RenderMaterial associated with this mesh or null if there is not one.
Since: 5.7

Rhino.Render.RenderPrimitive.Material
The Rhino.Render.RenderPrimitive.Materialassociated with this mesh or null if the
Rhino.Render.RenderPrimitive property has a value.
Since: 5.7

Rhino.Render.RenderPrimitive.BoundingBox
The bounding box for this primitive.
Since: 5.7