Rhino.DocObjects.ReplayHistoryData
Provides history information to commands that will repeat history construction.
Generally, a developer using this class will not construct a new instance, but receive one.

Rhino.DocObjects.ReplayHistoryData.Dispose
Since: 5.0

Rhino.DocObjects.ReplayHistoryData.GetRhinoObjRef(System.Int32)
In ReplayHistory, use GetRhinoObjRef to convert the information
in a history record into the ObjRef that has up to date
RhinoObject pointers
id: HistoryRecord value id
Returns: ObjRef on success, null if not successful
Since: 5.0

Rhino.DocObjects.ReplayHistoryData.Document
The document this record belongs to
Since: 5.0

Rhino.DocObjects.ReplayHistoryData.HistoryVersion
ReplayHistory overrides check the version number to ensure the information
saved in the history record is compatible with the current implementation
of ReplayHistory
Since: 5.0

Rhino.DocObjects.ReplayHistoryData.RecordId
Each history record has a unique id that Rhino assigns when it adds the
history record to the history record table
Since: 5.0

Rhino.DocObjects.ReplayHistoryData.Results
Provides access to BOTH inputs and outputs of the replay history operation.
Use this property to then call an appropriate UpdateToX() method and make your
custom history support work.
Since: 5.0

Rhino.DocObjects.ReplayHistoryData.AppendHistoryResult
Create an empty history result and add it to the end of the Results array.
Note that you should call Results again if you need them as the old Results
array will be out of sync with this class.
Returns:
Since: 8.0

Rhino.DocObjects.ReplayHistoryData.UpdateResultArray(System.Collections.Generic.IEnumerable{Rhino.DocObjects.ReplayHistoryResult})
Update the Results array with a different set of values. Null entries in the newResults
will result in empty ReplayHistoryResult elements
newResults:
Since: 8.0

Rhino.DocObjects.ReplayHistoryData.TryGetBool(System.Int32,System.Boolean@)
Since: 5.0

Rhino.DocObjects.ReplayHistoryData.TryGetInt(System.Int32,System.Int32@)
Since: 5.0

Rhino.DocObjects.ReplayHistoryData.TryGetDouble(System.Int32,System.Double@)
Since: 5.0

Rhino.DocObjects.ReplayHistoryData.TryGetPoint3d(System.Int32,Rhino.Geometry.Point3d@)
Since: 5.0

Rhino.DocObjects.ReplayHistoryData.TryGetGuids(System.Int32,System.Guid[]@)
Since: 8.0

Rhino.DocObjects.ReplayHistoryData.TryGetVector3d(System.Int32,Rhino.Geometry.Vector3d@)
Since: 5.0

Rhino.DocObjects.ReplayHistoryData.TryGetTransform(System.Int32,Rhino.Geometry.Transform@)
Since: 5.0

Rhino.DocObjects.ReplayHistoryData.TryGetColor(System.Int32,System.Drawing.Color@)
Since: 5.0

Rhino.DocObjects.ReplayHistoryData.TryGetPoint3dOnObject(System.Int32,Rhino.Geometry.Point3d@)
Since: 6.0

Rhino.DocObjects.ReplayHistoryData.TryGetGuid(System.Int32,System.Guid@)
Since: 5.0

Rhino.DocObjects.ReplayHistoryData.TryGetString(System.Int32,System.String@)
Since: 5.0

Rhino.DocObjects.ReplayHistoryData.TryGetDoubles(System.Int32,System.Double[]@)
Since: 6.10