Rhino.Geometry.BrepTrimType
Each brep trim has a defined type.
Since: 5.1

Rhino.Geometry.BrepTrimType.Unknown
Unknown type

Rhino.Geometry.BrepTrimType.Boundary
Trim is connected to an edge, is part of an outer, inner or
slit loop, and is the only trim connected to the edge.

Rhino.Geometry.BrepTrimType.Mated
Trim is connected to an edge, is part of an outer, inner or slit loop,
no other trim from the same loop is connected to the edge, and at least
one trim from a different loop is connected to the edge.

Rhino.Geometry.BrepTrimType.Seam
trim is connected to an edge, is part of an outer, inner or slit loop,
and one other trim from the same loop is connected to the edge.
(There can be other mated trims that are also connected to the edge.
For example, the non-manifold edge that results when a surface edge lies
in the middle of another surface.)  Non-manifold "cuts" have seam trims too.

Rhino.Geometry.BrepTrimType.Singular
Trim is part of an outer loop, the trim's 2d curve runs along the singular
side of a surface, and the trim is NOT connected to an edge. (There is
no 3d edge because the surface side is singular.)

Rhino.Geometry.BrepTrimType.CurveOnSurface
Trim is connected to an edge, is the only trim in a curve-on-surface loop, and
is the only trim connected to the edge.

Rhino.Geometry.BrepTrimType.PointOnSurface
Trim is a point on a surface, trim.m_pbox is records surface parameters,
and is the only trim in a point-on-surface loop.  This trim is not connected to
an edge and has no 2d curve.

Rhino.Geometry.BrepTrimType.Slit
