Rhino.DocObjects.DimensionStyle.LeaderCurveStyle
Type of leader curve

Rhino.DocObjects.DimensionStyle.LeaderCurveStyle.None


Rhino.DocObjects.DimensionStyle.LeaderCurveStyle.Polyline


Rhino.DocObjects.DimensionStyle.LeaderCurveStyle.Spline
