Rhino.DocObjects.Tables.LayerTableEventType
Since: 5.0

Rhino.DocObjects.Tables.LayerTableEventType.Sorted
LayerTable.Sort() potentially changed sort order.

Rhino.DocObjects.Tables.LayerTableEventType.Current
Current layer change.