Rhino.Render.IRhRdkPreviewSceneServer_eRotationType
c# version of IRhRdkPreviewSceneServer eRotationType enum
Since: 6.0

Rhino.Render.IRhRdkPreviewSceneServer_eRotationType.Camera
Camera

Rhino.Render.IRhRdkPreviewSceneServer_eRotationType.Object
Object