Rhino.Runtime.LicenseManager.ValidatorHelper
Helper class used by GetLicenseHelper and GetCustomLicenseHelper
methods when calling back into UnsafeNativeMethods.RHC_GetLicense

Rhino.Runtime.LicenseManager.ValidatorHelper.#ctor(System.IntPtr)
Constructor
validator: CRhinoLicenseValidator unmanaged pointer

Rhino.Runtime.LicenseManager.ValidatorHelper.ValidateProductKey(System.String,Rhino.PlugIns.LicenseData@)
Passed as a delegate to LicenseUtils.GetLicense(), will call the C++
ValidateProductKey() method then and copy CRhinoLicenseValidator C++
data to the LicenseData output object.
productKey:
licenseData:
Key information is coppied to this object
Returns:

Rhino.Runtime.LicenseManager.ValidatorHelper._validator
CRhinoLicenseValidator pointer passed to the constructor