Rhino.ApplicationSettings.OsnapModes
Defines several bit masks for each of the OSnap that are defined.
Refer to the Rhino Help file for further information.
Since: 5.0

Rhino.ApplicationSettings.OsnapModes.None
No OSnap.

Rhino.ApplicationSettings.OsnapModes.Near
Near OSnap.

Rhino.ApplicationSettings.OsnapModes.Focus
Focus OSnap.

Rhino.ApplicationSettings.OsnapModes.Center
Center OSnap.

Rhino.ApplicationSettings.OsnapModes.Vertex
Vertex OSnap.

Rhino.ApplicationSettings.OsnapModes.Knot
Knot OSnap.

Rhino.ApplicationSettings.OsnapModes.Quadrant
Quadrant OSnap.

Rhino.ApplicationSettings.OsnapModes.Midpoint
Midpoint OSnap.

Rhino.ApplicationSettings.OsnapModes.Intersection
Intersection OSnap.

Rhino.ApplicationSettings.OsnapModes.End
End OSnap.

Rhino.ApplicationSettings.OsnapModes.Perpendicular
Perpendicular OSnap.

Rhino.ApplicationSettings.OsnapModes.Tangent
Tangent OSnap.

Rhino.ApplicationSettings.OsnapModes.Point
Point OSnap.