Rhino.DocObjects.Tables.NamedLayerStateTable
All named layer states in a Rhino document.

Rhino.DocObjects.Tables.NamedLayerStateTable.Document
Document that owns this table.
Since: 6.14

Rhino.DocObjects.Tables.NamedLayerStateTable.Count
Returns the number of named layers states in the document.
Since: 6.14

Rhino.DocObjects.Tables.NamedLayerStateTable.Names
Returns the names of named layer states in the document.
Since: 6.14

Rhino.DocObjects.Tables.NamedLayerStateTable.FindName(System.String)
Returns the index of an existing named layer state.
name: The name of the layer state.
Returns:
>0 if successful, -1 if not found.
Since: 6.14

Rhino.DocObjects.Tables.NamedLayerStateTable.Save(System.String)
Saves or updates a named layer state.
name: The name of the layer state. If the named layer state already exists, it will be updated.
Returns: The index of the newly added, or updated, layer state.
Since: 6.14

Rhino.DocObjects.Tables.NamedLayerStateTable.Save(System.String,System.Guid)
Saves or updates a named layer state.
name: The name of the layer state. If the named layer state already exists, it will be updated.
viewportId: The id of the layout or detail viewport, required to save per viewport layer state properties.
Returns: The index of the newly added, or updated, layer state.
Since: 6.14

Rhino.DocObjects.Tables.NamedLayerStateTable.Restore(System.String,Rhino.DocObjects.Tables.RestoreLayerProperties)
Restores a named layer state.
name: The name of the layer state.
properties: The layer properties to restore.
Returns: True if successful, false otherwise.
Since: 6.14

Rhino.DocObjects.Tables.NamedLayerStateTable.Restore(System.String,Rhino.DocObjects.Tables.RestoreLayerProperties,System.Guid)
Restores a named layer state.
name: The name of the layer state.
properties: The layer properties to restore.
viewportId: The id of the layout or detail viewport to restore the per-viewport layer properties.
Returns:
Since: 6.14

Rhino.DocObjects.Tables.NamedLayerStateTable.Rename(System.String,System.String)
Renames an existing named layer state.
oldName: The name of the layer state.
newName: The new name
Returns: True if successful, false otherwise.
Since: 6.14

Rhino.DocObjects.Tables.NamedLayerStateTable.Delete(System.String)
Deletes an existing named layer state.
name: The name of the layer state.
Returns: True if successful, false otherwise.
Since: 6.14

Rhino.DocObjects.Tables.NamedLayerStateTable.Import(System.String)
Imports named layer states from a 3dm file.
filename: The name of the file to import.
Returns: The number of named layers states imported.
Since: 6.15