Rhino.Input.Custom.GetEllipsoid
Class provides user interface to define an ellipsoid.
Since: 7.0

Rhino.Input.Custom.GetEllipsoid.#ctor
Since: 7.0

Rhino.Input.Custom.GetEllipsoid.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Input.Custom.GetEllipsoid.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 7.0

Rhino.Input.Custom.GetEllipsoid.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.Input.Custom.GetEllipsoid.MarkFoci
Indicates the user wants the ellipsoid foci marked with point objects.
Since: 7.0

Rhino.Input.Custom.GetEllipsoid.IsModeFromFoci
Indicates the ellipsoid was created from foci.
Since: 7.0

Rhino.Input.Custom.GetEllipsoid.FirstPoint
Returns the first point. If in "from foci" mode, then this is the first foci point.
Since: 7.0

Rhino.Input.Custom.GetEllipsoid.SecondPoint
Returns the second point. If in "from foci" mode, then this is the second foci point.
Since: 7.0

Rhino.Input.Custom.GetEllipsoid.Plane
The plane the ellipsoid was created in.
Since: 8.29

Rhino.Input.Custom.GetEllipsoid.Get(Rhino.Geometry.NurbsSurface@)
Prompt for the getting of an ellipsoid.
ellipsoid: The ellipsoid in NURB form.
Returns: The result of the getting operation.
Since: 7.0

Rhino.Input.Custom.GetEllipsoid.GetMesh(System.Int32@,System.Int32@,Rhino.Geometry.Mesh@)
Prompt for the getting of a mesh ellipsoid.
verticalFaces: The number of faces in the vertical direction.
aroundFaces: The number of faces in the around direction
ellipsoid: The ellipsoid in Mesh form.
Returns: The result of the getting operation.
Since: 7.0

Rhino.Input.Custom.GetEllipsoid.GetMesh(System.Int32@,System.Int32@,System.Boolean@,Rhino.Geometry.Mesh@)
Prompt for the getting of a mesh ellipsoid.
verticalFaces: The number of faces in the vertical direction.
aroundFaces: The number of faces in the around direction
quadCaps: Set true to create quad faces at the caps, false for triangles.
ellipsoid: The ellipsoid in Mesh form.
Returns: The result of the getting operation.
Since: 7.0