Rhino.DocObjects.TextObject
Rhino Object that represents text geometry and attributes

Rhino.DocObjects.TextObject.TextGeometry
Get the text geometry for this object.
Since: 5.0

Rhino.DocObjects.TextObject.GetTextCorners(Rhino.Display.RhinoViewport)
Gets the world 3D corner points of the whole text object.
viewport: The viewport in which to make the calculation.
Returns: The four corner points if successful, an empty array on failure.
Since: 7.21
Throws System.ArgumentNullException: