Rhino.FileIO.FileDwg
Support for writing DWG file format

Rhino.FileIO.FileDwg.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileDwgWriteOptions)
Write a DWG file based on the contents of a RhinoDoc
path: path to write a file to
doc: document to get geometry from
options: options used for generating the DWG file
Returns: true on success
Since: 8.0

Rhino.FileIO.FileDwg.Read(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileDwgReadOptions)
Read a DWG file into a RhinoDoc
path: path to read a file from
doc: document to import geometry into
options: options used for importing the DWG file
Returns: true on success
Since: 8.0