Rhino.Render.DecalCreateParams
Used by RhinoObject.AddDecal() to create and add a decal

Rhino.Render.DecalCreateParams.TextureInstanceId
Since: 6.0

Rhino.Render.DecalCreateParams.DecalMapping
Since: 6.0

Rhino.Render.DecalCreateParams.DecalProjection
Since: 6.0

Rhino.Render.DecalCreateParams.MapToInside
Since: 6.0

Rhino.Render.DecalCreateParams.Transparency
Since: 6.0

Rhino.Render.DecalCreateParams.Origin
Since: 6.0

Rhino.Render.DecalCreateParams.VectorUp
Since: 6.0

Rhino.Render.DecalCreateParams.VectorAcross
Since: 6.0

Rhino.Render.DecalCreateParams.Height
Since: 6.0

Rhino.Render.DecalCreateParams.Radius
Since: 6.0

Rhino.Render.DecalCreateParams.StartLatitude
Since: 6.0

Rhino.Render.DecalCreateParams.EndLatitude
Since: 6.0

Rhino.Render.DecalCreateParams.StartLongitude
Since: 6.0

Rhino.Render.DecalCreateParams.EndLongitude
Since: 6.0

Rhino.Render.DecalCreateParams.MinU
Since: 6.0

Rhino.Render.DecalCreateParams.MinV
Since: 6.0

Rhino.Render.DecalCreateParams.MaxU
Since: 6.0

Rhino.Render.DecalCreateParams.MaxV
Since: 6.0