Rhino.Runtime.RhinoAccounts.RhinoAccountsServerNotReachableException
Exception thrown when the Rhino Accounts server cannot be reached due to a network problem.

Rhino.Runtime.RhinoAccounts.RhinoAccountsServerNotReachableException.#ctor(System.String,System.Exception)
Generates a new instance of the exception.
message: The message of the exception.
innerException: The inner exception.
Since: 7.0

Rhino.Runtime.RhinoAccounts.RhinoAccountsServerNotReachableException.#ctor(System.Exception)
Generates a new instance of the exception.
innerException: The inner exception.
Since: 7.0