Rhino.FileIO.FileSvg
Support for writing Svg file format

Rhino.FileIO.FileSvg.Read(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileSvgReadOptions)
Read a Svg file into a RhinoDoc
path: path to read a file from
doc: document to import geometry into
options: options used for importing the Svg file
Returns: true on success
Since: 8.0