Rhino.Render.ProxyTypes
Defines the proxy type of the render content
Since: 6.0

Rhino.Render.ProxyTypes.None
No proxy type specified.

Rhino.Render.ProxyTypes.Single
A proxy that represents a single material in the CRhinoDoc::m_material_table

Rhino.Render.ProxyTypes.Multi
A proxy that represents multiple materials - all similar.

Rhino.Render.ProxyTypes.Texture
A proxy that represents textures, either in the texture table, or attached to materials or environments.