Rhino.Geometry.Circle
Represents a circle in 3D.
The values used are a radius and an orthonormal frame	of the plane containing the circle,
with origin at the center.
The circle is parameterized by radians from 0 to 2 Pi given by
t -> center + cos(t)*radius*xaxis + sin(t)*radius*yaxis
where center, xaxis and yaxis define the orthonormal frame of the circle plane.
Remarks: >An IsValid circle has positive radius and an IsValid plane defining the frame.

Rhino.Geometry.Circle.TryFitCircleTT(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double)
Try to fit a circle to two curves using tangent relationships.
c1: First curve to touch.
c2: Second curve to touch.
t1: Parameter on first curve close to desired solution.
t2: Parameter on second curve closet to desired solution.
Returns: Valid circle on success, Circle.Unset on failure.
Since: 5.0

Rhino.Geometry.Circle.TryFitCircleTTT(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double,System.Double)
Try to fit a circle to three curves using tangent relationships.
c1: First curve to touch.
c2: Second curve to touch.
c3: Third curve to touch.
t1: Parameter on first curve close to desired solution.
t2: Parameter on second curve closet to desired solution.
t3: Parameter on third curve close to desired solution.
Returns: Valid circle on success, Circle.Unset on failure.
Since: 5.0

Rhino.Geometry.Circle.Unset
Gets a circle with Unset components.
Since: 5.0

Rhino.Geometry.Circle.#ctor(System.Double)
Initializes a circle with center (0,0,0) in the world XY plane.
radius: Radius of circle, should be a positive number.
Since: 5.0

Rhino.Geometry.Circle.#ctor(Rhino.Geometry.Plane,System.Double)
Initializes a circle on a plane with a given radius.
plane: Plane of circle. Plane origin defines the center of the circle.
radius: Radius of circle (should be a positive value).
Since: 5.0

Rhino.Geometry.Circle.#ctor(Rhino.Geometry.Point3d,System.Double)
Initializes a circle parallel to the world XY plane with given center and radius.
center: Center of circle.
radius: Radius of circle (should be a positive value).
Since: 5.0

Rhino.Geometry.Circle.#ctor(Rhino.Geometry.Arc)
Initializes a circle from an arc.
arc: Arc that defines the plane and radius.
Since: 5.0

Rhino.Geometry.Circle.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Initializes a circle through three 3d points.
point1: The start/end of the circle is at point1.
point2: Second point on the circle.
point3: Third point on the circle.
Since: 5.0

Rhino.Geometry.Circle.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double)
Initializes a circle parallel to a given plane with given center and radius.
plane: Plane for circle.
center: Center point override.
radius: Radius of circle (should be a positive value).
Since: 5.0

Rhino.Geometry.Circle.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Initializes a circle from two 3d points and a tangent at the first point.
The start/end of the circle is at point "startPoint".
startPoint: Start point of circle.
tangentAtP: Tangent vector at start.
pointOnCircle: Point coincident with desired circle.
Remarks: May create an Invalid circle
Since: 5.0

Rhino.Geometry.Circle.IsValid
A valid circle has radius larger than 0.0 and a base plane which is must also be valid.
Since: 5.0

Rhino.Geometry.Circle.Radius
Gets or sets the radius of this circle.
Radii should be positive values.
Since: 5.0

Rhino.Geometry.Circle.Diameter
Gets or sets the diameter (radius * 2.0) of this circle.
Diameters should be positive values.
Since: 5.0

Rhino.Geometry.Circle.Plane
Gets or sets the plane of the circle.
Since: 5.0

Rhino.Geometry.Circle.Center
Gets or sets the center point of this circle.
Since: 5.0

Rhino.Geometry.Circle.Normal
Gets the normal vector for this circle.
Since: 5.0

Rhino.Geometry.Circle.Circumference
Gets or sets the circumference of this circle.
Since: 5.0

Rhino.Geometry.Circle.BoundingBox
Gets the circle's 3d axis aligned bounding box.
Returns: 3d bounding box.
Since: 5.0

Rhino.Geometry.Circle.IsInPlane(Rhino.Geometry.Plane,System.Double)
Evaluates whether or not this circle is co-planar with a given plane.
plane: Plane.
tolerance: Tolerance to use.
Returns: true if the circle plane is co-planar with the given plane within tolerance.
Since: 5.0

Rhino.Geometry.Circle.PointAt(System.Double)
Circles use trigonometric parameterization:
t -> center + cos(t)*radius*xaxis + sin(t)*radius*yaxis.
t: Parameter of point to evaluate.
Returns: The point on the circle at the given parameter.
Since: 5.0

Rhino.Geometry.Circle.TangentAt(System.Double)
Circles use trigonometric parameterization:
t -> center + cos(t)*radius*xaxis + sin(t)*radius*yaxis.
t: Parameter of tangent to evaluate.
Returns: The tangent at the circle at the given parameter.
Since: 5.0

Rhino.Geometry.Circle.DerivativeAt(System.Int32,System.Double)
Determines the value of the Nth derivative at a parameter.
derivative: Which order of derivative is wanted.
t: Parameter to evaluate derivative. Valid values are 0, 1, 2 and 3.
Returns: The derivative of the circle at the given parameter.
Since: 5.0

Rhino.Geometry.Circle.ClosestParameter(Rhino.Geometry.Point3d,System.Double@)
Gets the parameter on the circle which is closest to a test point.
testPoint: Point to project onto the circle.
t: Parameter on circle closes to testPoint.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Circle.ClosestPoint(Rhino.Geometry.Point3d)
Gets the point on the circle which is closest to a test point.
testPoint: Point to project onto the circle.
Returns:
The point on the circle that is closest to testPoint or
Point3d.Unset on failure.
Since: 5.0

Rhino.Geometry.Circle.Transform(Rhino.Geometry.Transform)
Transforms this circle using an transformation matrix.
xform: Transformation to apply.
Returns: true on success, false on failure.
Remarks:
Circles may not be transformed accurately if the transformation defines a
non-euclidean transformation.
Since: 5.0

Rhino.Geometry.Circle.Rotate(System.Double,System.Double,Rhino.Geometry.Vector3d)
Rotates the circle around an axis that starts at the base plane origin.
sinAngle: The value returned by Math.Sin(angle) to compose the rotation.
cosAngle: The value returned by Math.Cos(angle) to compose the rotation.
axis: A rotation axis.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Circle.Rotate(System.Double,System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Rotates the circle around an axis that starts at the provided point.
sinAngle: The value returned by Math.Sin(angle) to compose the rotation.
cosAngle: The value returned by Math.Cos(angle) to compose the rotation.
axis: A rotation direction.
point: A rotation base point.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Circle.Rotate(System.Double,Rhino.Geometry.Vector3d)
Rotates the circle through a given angle.
angle: Angle (in radians) of the rotation.
axis: Rotation axis.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Circle.Rotate(System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Rotates the circle through a given angle.
angle: Angle (in radians) of the rotation.
axis: Rotation axis.
point: Rotation anchor point.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Circle.Translate(Rhino.Geometry.Vector3d)
Moves the circle.
delta: Translation vector.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Circle.Reverse
Reverse the orientation of the circle. Changes the domain from [a,b]
to [-b,-a].
Since: 5.0

Rhino.Geometry.Circle.ToNurbsCurve
Constructs a nurbs curve representation of this circle.
This amounts to the same as calling NurbsCurve.CreateFromCircle().
Returns: A nurbs curve representation of this circle or null if no such representation could be made.
Since: 5.0

Rhino.Geometry.Circle.ToNurbsCurve(System.Int32,System.Int32)
Create a uniform non-rational cubic NURBS approximation of a circle.
degree: >=1
cvCount: cv count >=5
Returns: NURBS curve approximation of a circle on success
Since: 6.0

Rhino.Geometry.Circle.TryFitCircleToPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.Geometry.Circle@)
Attempt to fit a circle through a set of points.
points: The points through which to fit.
circle: The resulting circle on success.
Returns: true on success, false on failure.
Since: 6.2

Rhino.Geometry.Circle.TrySmallestEnclosingCircle(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d},System.Double,Rhino.Geometry.Circle@,System.Int32[]@)
Attempt to create the smallest circle enclosing a set of planar points.
points: The points to enclose.
tolerance: The tolerance to use
circle: The resulting circle on success.
indicesOnCircle: If possible, indices of two or three points that define the circle
Returns: true on success, false on failure.
Since: 8.4

Rhino.Geometry.Circle.EpsilonEquals(Rhino.Geometry.Circle,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:
Since: 5.4