Rhino.PrivateMeshCommands.MeshTypes.EdgeAddress
An edge, or the connection between two nodes or endpoints.
A and B are the indices as in CurveTopology NodeAt() or VertexAt()

Rhino.PrivateMeshCommands.MeshTypes.EdgeAddress.#ctor(System.Int32,System.Int32)
Constructs an edge from start and end
a: Start index
b: End index

Rhino.PrivateMeshCommands.MeshTypes.EdgeAddress.A
The start index of this edge

Rhino.PrivateMeshCommands.MeshTypes.EdgeAddress.B
The end index of this edge

Rhino.PrivateMeshCommands.MeshTypes.EdgeAddress.Item(System.Boolean)
Returns the A index (start, true) or the B index (end, false) of this vertex
start: A if start is true, B if start is false
Returns: The Node index as in the edge

Rhino.PrivateMeshCommands.MeshTypes.EdgeAddress.OtherVertex(System.Int32)
Discovers the other index given one end of this edge
eitherAorB: The known index
Returns: The opposite index (e.g., A if B was input)
Throws System.InvalidOperationException: If neither A or B were given as inputs

Rhino.PrivateMeshCommands.MeshTypes.EdgeAddress.ToString
A textual representation of the edge
Returns: a string with "{A}, {B}"