Rhino.Render.ICurrentEnvironment.ForBackground
Get or set the RenderEnvironment used as the 360 degree backdrop environment.
If getting, null will be returned if the background mode is set to 'Solid Color'
or 'Gradient' (i.e., not 'Environment').
If setting, passing null will not work because this environment usage can't be turned off.
Since: 6.0

Rhino.Render.ICurrentEnvironment.ForBackground_CheckMode
Since: 6.0

Rhino.Render.ICurrentEnvironment.ForLighting
Get or set the RenderEnvironment used as custom skylighting environment.
If getting, null will be returned if the custom skylighting environment override is disabled.
If setting, passing null will turn the custom skylighting environment override off but it will
not actually set its id to null. Setting to a valid environment will also turn the custom
skylighting environment override on.
Since: 6.0

Rhino.Render.ICurrentEnvironment.ForReflectionAndRefraction
Get or set the RenderEnvironment used as custom reflection (and refraction) environment.
If getting, null will be returned if the custom reflection override is disabled.
If setting, passing null will turn the custom reflection environment override off but it will
not actually set its id to null. Setting to a valid environment will also turn the custom
reflection environment override on.
Since: 6.0

Rhino.Render.ICurrentEnvironment.ForAnyUsage
Since: 6.0