Rhino.Runtime.InteropWrappers.SimpleArraySurfacePointer
Wrapper for a C++ ON_SimpleArray of ON_Surface* or constant ON_Surface*.  If
you are not writing C++ code then this class is not for you.

Rhino.Runtime.InteropWrappers.SimpleArraySurfacePointer.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArraySurfacePointer.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArraySurfacePointer.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArraySurfacePointer instance.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArraySurfacePointer.ToNonConstArray
Copies the unmanaged array to a managed counterpart.
Elements are made non-constant.
Returns: The managed array.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArraySurfacePointer.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.SimpleArraySurfacePointer.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArraySurfacePointer.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.