Rhino.DocObjects.LineCapStyle
Shape to be used at the ends of open curves

Rhino.DocObjects.LineCapStyle.Round
Ends are extended by a half circle with diameter equal to the curve width

Rhino.DocObjects.LineCapStyle.Flat
Also known as butt. Ends are flat and do not extend

Rhino.DocObjects.LineCapStyle.Square
Ends are flat and extended by half of the curve width