Rhino.DocObjects.ObjectColorSource
Defines enumerated values for the source of display color of single objects.
Since: 5.0

Rhino.DocObjects.ObjectColorSource.ColorFromLayer
use color assigned to layer.

Rhino.DocObjects.ObjectColorSource.ColorFromObject
use color assigned to object.

Rhino.DocObjects.ObjectColorSource.ColorFromMaterial
use diffuse render material color.

Rhino.DocObjects.ObjectColorSource.ColorFromParent
for objects with parents (like objects in instance references, use parent linetype)
if no parent, treat as color_from_layer.