Rhino.UI.Toolbar
Represents a toolbar in a Rhino toolbar, or .RUI, file.
Since: 5.0

Rhino.UI.Toolbar.Id
Gets the id of the toolbar.
Since: 5.0

Rhino.UI.Toolbar.Name
Gets the name of the toolbar.
Since: 5.0

Rhino.UI.Toolbar.BitmapSize
Gets and sets the size of the toolbar image.
Since: 6.0

Rhino.UI.Toolbar.TabSize
Gets and sets the size of the toolbar tab.
Since: 6.0