Rhino.Geometry.SweepBlend
Blend types for creating swept surfaces
Since: 7.0

Rhino.Geometry.SweepBlend.Local
The sweep stays constant at the ends and changes more rapidly in the middle.

Rhino.Geometry.SweepBlend.Global
The sweep is linearly blended from one end to the other, creating sweeps that taper from one cross-section curve to the other.