Rhino.DocObjects.Environment
Represents an environment.

Rhino.DocObjects.Environment.#ctor
Initializes a new environment.
Since: 8.0

Rhino.DocObjects.Environment.BackgroundColor
Returns: The background color.
Since: 8.0

Rhino.DocObjects.Environment.BackgroundImage
Returns: The background image texture.
Since: 8.0

Rhino.DocObjects.Environment.BackgroundProjection
Returns: The background projection.
Since: 8.0