Rhino.Collections.TransformObjectList
A collection of Rhino object, grip objects, and the Rhino objects that owns the grips.
Used by the TransformCommand and GetTransform classes.

Rhino.Collections.TransformObjectList.#ctor
Since: 5.0

Rhino.Collections.TransformObjectList.Dispose
Since: 5.0

Rhino.Collections.TransformObjectList.GetBoundingBox(System.Boolean,System.Boolean)
Gets the bounding box of all of the objects that this list contains.
regularObjects: true if any object except grips should be included; otherwise false.
grips: true if grips should be included; otherwise false.
Returns:
Unset BoundingBox if this list is empty.
Since: 5.0

Rhino.Collections.TransformObjectList.DisplayFeedbackEnabled
Since: 5.0

Rhino.Collections.TransformObjectList.UpdateDisplayFeedbackTransform(Rhino.Geometry.Transform)
Since: 5.0

Rhino.Collections.TransformObjectList.Clear
Remove all elements from this list
Since: 5.10

Rhino.Collections.TransformObjectList.Count
Number of elements in this list
Since: 5.10

Rhino.Collections.TransformObjectList.GripCount
Number of elements in grip list
Since: 6.0

Rhino.Collections.TransformObjectList.GripOwnerCount
Number of elements in grip owner list
Since: 6.0

Rhino.Collections.TransformObjectList.Add(Rhino.DocObjects.RhinoObject)
Add a RhinoObject to this list
rhinoObject:
Since: 5.10

Rhino.Collections.TransformObjectList.Add(Rhino.DocObjects.ObjRef)
Add an ObjRef to this list. Use this to add polyedges so the references are properly counted
objref:
Since: 5.10

Rhino.Collections.TransformObjectList.AddObjects(Rhino.Input.Custom.GetObject,System.Boolean)
Add objects to list with a GetObject
go: Setup the GetObject, i.e. prompt, geometry filter, allow pre/post select
before passing it as an argument.
allowGrips: Specifically allow grips to be selected.  if true, grips must also be included in geometry filter
of the GetObject in order to be selected.
Returns: Number of objects selected.
Since: 6.0

Rhino.Collections.TransformObjectList.ObjectArray
Gets access to the internal RhinoObject array of the TransformObjectList object.
Returns: An array of Rhino objects, or an empty array if there were no Rhino objects.
Since: 7.0

Rhino.Collections.TransformObjectList.GripArray
Gets access to the internal GripObject array of the TransformObjectList object.
Returns: An array of grip objects, or an empty array if there were no grip objects.
Since: 6.0

Rhino.Collections.TransformObjectList.GripOwnerArray
Gets access to the internal GripOwner array of the TransformObjectList object.
Returns: A
n array of Rhino objects that are the owners of the grip objects the collection,
or an empty array if there were no Rhino objects.
Since: 6.0