Rhino.Runtime.RiskyAction
Defines risky actions that need to be reported in crash exceptions

Rhino.Runtime.RiskyAction.#ctor(System.String,System.String,System.String,System.Int32)
Always create this in a using block
description:
file:
member:
line:
Since: 6.0

Rhino.Runtime.RiskyAction.Dispose
IDisposable implementation
Since: 6.0