Rhino.UI.Controls.ICollapsibleSection.Height
Since: 6.0

Rhino.UI.Controls.ICollapsibleSection.Hidden
Since: 6.0

Rhino.UI.Controls.ICollapsibleSection.InitiallyExpanded
Since: 6.0

Rhino.UI.Controls.ICollapsibleSection.Id
Since: 6.0

Rhino.UI.Controls.ICollapsibleSection.SettingsTag
Since: 6.0

Rhino.UI.Controls.ICollapsibleSection.Collapsible
Since: 6.0

Rhino.UI.Controls.ICollapsibleSection.BackgroundColor
Since: 6.0

Rhino.UI.Controls.ICollapsibleSection.ViewModel
Since: 6.0

Rhino.UI.Controls.ICollapsibleSection.PlugInId
Since: 6.0

Rhino.UI.Controls.ICollapsibleSection.CommandOptionName
Since: 6.0

Rhino.UI.Controls.ICollapsibleSection.RunScript(Rhino.UI.Controls.IRdkViewModel)
Since: 6.0

Rhino.UI.Controls.ICollapsibleSection.ViewModelId
Since: 6.0