Rhino.UI.ShowPanelReason
OnShowDockbar event type

Rhino.UI.ShowPanelReason.Show
Dock bar shown or made visible

Rhino.UI.ShowPanelReason.Hide
Dock bar hidden, no longer visible

Rhino.UI.ShowPanelReason.HideOnDeactivate
Dock bar temporarily hidden because the main Rhino application is no
longer active.

Rhino.UI.ShowPanelReason.ShowOnDeactivate
Dock bar that was temporarily hidden when the main Rhino application
was deactivated is now being shown.