Rhino.UI.Gumball.GumballDisplayConduit.#ctor
Since: 5.0
8.0

Rhino.UI.Gumball.GumballDisplayConduit.#ctor(Rhino.DocObjects.ActiveSpace)
Since: 8.0

Rhino.UI.Gumball.GumballDisplayConduit.Dispose
Since: 5.0

Rhino.UI.Gumball.GumballDisplayConduit.Enabled
Since: 5.0

Rhino.UI.Gumball.GumballDisplayConduit.InRelocate
Since: 5.0

Rhino.UI.Gumball.GumballDisplayConduit.PreTransform
The pre-transform is a transformation that needs to be applied before
the gumball transformation.
Since: 5.0

Rhino.UI.Gumball.GumballDisplayConduit.GumballTransform
The gumball transformation is the transformation calculated by comparing
the current gumball to the starting BaseGumball.
Since: 5.0

Rhino.UI.Gumball.GumballDisplayConduit.TotalTransform
The total transformation is GumballTransform * PreTransform.
Since: 5.0

Rhino.UI.Gumball.GumballDisplayConduit.BaseGumball
Starting location.
Since: 5.0

Rhino.UI.Gumball.GumballDisplayConduit.Gumball
Since: 5.0

Rhino.UI.Gumball.GumballDisplayConduit.SetBaseGumball(Rhino.UI.Gumball.GumballObject)
Contents of the gumball are copied to the base gumball of this class.
gumball: The gumball source.
Since: 5.0

Rhino.UI.Gumball.GumballDisplayConduit.SetBaseGumball(Rhino.UI.Gumball.GumballObject,Rhino.UI.Gumball.GumballAppearanceSettings)
Contents of the gumball are copied to the base gumball of this class.
gumball: The gumball source.
appearanceSettings: The gumball appearance and behavior settings. Argument can be null.
Since: 5.0

Rhino.UI.Gumball.GumballDisplayConduit.UpdateGumball(Rhino.Geometry.Point3d,Rhino.Geometry.Line)
Since: 5.0

Rhino.UI.Gumball.GumballDisplayConduit.UpdateGumball(Rhino.Geometry.Plane)
Since: 8.19

Rhino.UI.Gumball.GumballDisplayConduit.PickResult
The initial mouse down event sets PickResult.
Since: 5.0

Rhino.UI.Gumball.GumballDisplayConduit.PickGumball(Rhino.Input.Custom.PickContext,Rhino.Input.Custom.GetPoint)
Since: 5.0

Rhino.UI.Gumball.GumballDisplayConduit.CheckShiftAndControlKeys
Since: 5.0