Rhino.FileIO.File3dmDimStyleTable
Provides access to annotation styles in the 3dm file.

Rhino.FileIO.File3dmDimStyleTable.ComponentType
Returns Rhino.DocObjects.ModelComponentType.DimStyle.
Since: 6.0

Rhino.FileIO.File3dmDimStyleTable.FindName(System.String)
Finds a DimensionStyle given its name.
name: The name of the DimensionStyle to be searched.
Returns: An DimensionStyle, or null on error.
Since: 6.0

Rhino.FileIO.File3dmDimStyleTable.FindNameHash(Rhino.FileIO.NameHash)
Finds a DimensionStyle given its name hash.
nameHash: The name hash of the DimensionStyle to be searched.
Returns: An DimensionStyle, or null on error.
Since: 6.0

Rhino.FileIO.File3dmDimStyleTable.FindIndex(System.Int32)
Retrieves a DimensionStyle object based on Index. This search type of search is discouraged.
We are moving towards using only IDs for all tables.
index: The index to search for.
Returns: A DimensionStyle object, or null if none was found.
Since: 6.0