Rhino.FileIO.FileSat
Support for writing Sat file format

Rhino.FileIO.FileSat.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileSatWriteOptions)
Write a Sat file based on the contents of a RhinoDoc
filename: path to write a file to
doc: document to get geometry from
options: options used for generating the Sat file
Returns: true on success
Since: 7.0