Rhino.Render.RenderPanelInstances
Base class used by both main side pane tabs and extra side panes to manage instances of them.
The ui_id is typically the same as the render session id, but it doesn't have to be (e.g., in Rhino Options, it's not).