Rhino.Render.RdkUndo
RdkUndo class, which is used to get the
RdkUndoRecord

Rhino.Render.RdkUndo.#ctor(System.IntPtr)
Constructor for RdkUndo
Since: 6.11

Rhino.Render.RdkUndo.Finalize
Destructor for RdkUndo

Rhino.Render.RdkUndo.Dispose
Dispose for RdkUndo
Since: 6.11

Rhino.Render.RdkUndo.NewUndoRecord
Get a new UndoRecord
Since: 6.11