Rhino.FileIO.FileLwo
Support for writing lwo file format

Rhino.FileIO.FileLwo.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileLwoWriteOptions)
Write a lwo file based on the contents of a RhinoDoc
path: path to write a file to
doc: document to get geometry from
options: options used for generating the Lwo file
Returns: true on success
Since: 8.0

Rhino.FileIO.FileLwo.Read(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileLwoReadOptions)
Read a lwo file into a RhinoDoc
path: path to read a file from
doc: document to import geometry into
options: options used for importing the Lwo file
Returns: true on success
Since: 8.0