Rhino.Display.DisplayMaterial.#ctor
Constructs a default material.
Since: 5.0

Rhino.Display.DisplayMaterial.#ctor(Rhino.Display.DisplayMaterial)
Duplicate another material.
Since: 5.0

Rhino.Display.DisplayMaterial.#ctor(Rhino.DocObjects.Material)
Since: 5.0

Rhino.Display.DisplayMaterial.#ctor(System.Drawing.Color)
Constructs a default material with a specific diffuse color.
diffuse: Diffuse color of material. The alpha component of the Diffuse color is ignored.
Since: 5.0

Rhino.Display.DisplayMaterial.#ctor(System.Drawing.Color,System.Double)
Constructs a default material with a specific diffuse color and transparency.
diffuse: Diffuse color of material. The alpha component of the Diffuse color is ignored.
transparency: Transparency factor (0.0 = opaque, 1.0 = transparent)
Since: 5.0

Rhino.Display.DisplayMaterial.#ctor(System.Drawing.Color,System.Drawing.Color,System.Drawing.Color,System.Drawing.Color,System.Double,System.Double)
Constructs a material with custom properties.
diffuse: Diffuse color of material. The alpha component of the Diffuse color is ignored.
specular: Specular color of material. The alpha component of the Specular color is ignored.
ambient: Ambient color of material. The alpha component of the Ambient color is ignored.
emission: Emission color of material. The alpha component of the Emission color is ignored.
shine: Shine (highlight size) of material.
transparency: Transparency of material (0.0 = opaque, 1.0 = transparent)
Since: 5.0

Rhino.Display.DisplayMaterial.Dispose
Since: 5.0

Rhino.Display.DisplayMaterial.Diffuse
Gets or sets the Diffuse color of the Material.
The alpha component of the color will be ignored.
Since: 5.0

Rhino.Display.DisplayMaterial.BackDiffuse
Gets or sets the Diffuse color of the back side of the Material.
The alpha component of the color will be ignored.
Since: 5.0

Rhino.Display.DisplayMaterial.Specular
Gets or sets the Specular color of the Material.
The alpha component of the color will be ignored.
Since: 5.0

Rhino.Display.DisplayMaterial.BackSpecular
Gets or sets the Specular color of the back side of the Material.
The alpha component of the color will be ignored.
Since: 5.0

Rhino.Display.DisplayMaterial.Ambient
Gets or sets the Ambient color of the Material.
The alpha component of the color will be ignored.
Since: 5.0

Rhino.Display.DisplayMaterial.BackAmbient
Gets or sets the Ambient color of the back side of the Material.
The alpha component of the color will be ignored.
Since: 5.0

Rhino.Display.DisplayMaterial.Emission
Gets or sets the Emissive color of the Material.
The alpha component of the color will be ignored.
Since: 5.0

Rhino.Display.DisplayMaterial.BackEmission
Gets or sets the Emissive color of the back side of the Material.
The alpha component of the color will be ignored.
Since: 5.0

Rhino.Display.DisplayMaterial.Shine
Gets or sets the shine factor of the material (0.0 to 1.0)
Since: 5.0

Rhino.Display.DisplayMaterial.BackShine
Gets or sets the shine factor of the back side of the material (0.0 to 1.0)
Since: 5.0

Rhino.Display.DisplayMaterial.Transparency
Gets or sets the transparency of the material (0.0 = opaque to 1.0 = transparent)
Since: 5.0

Rhino.Display.DisplayMaterial.BackTransparency
Gets or sets the transparency of the back side material (0.0 = opaque to 1.0 = transparent)
Since: 5.0

Rhino.Display.DisplayMaterial.IsTwoSided
Since: 5.0

Rhino.Display.DisplayMaterial.GetBitmapTexture(System.Boolean)
Since: 5.0

Rhino.Display.DisplayMaterial.SetBitmapTexture(System.String,System.Boolean)
Since: 5.0

Rhino.Display.DisplayMaterial.SetBitmapTexture(Rhino.DocObjects.Texture,System.Boolean)
Since: 5.0

Rhino.Display.DisplayMaterial.GetBumpTexture(System.Boolean)
Gets the bump texture for this display material.
Returns: The texture, or null if no bump texture has been added to this material.
Since: 5.0

Rhino.Display.DisplayMaterial.SetBumpTexture(System.String,System.Boolean)
Since: 5.0

Rhino.Display.DisplayMaterial.SetBumpTexture(Rhino.DocObjects.Texture,System.Boolean)
Since: 5.0

Rhino.Display.DisplayMaterial.GetEnvironmentTexture(System.Boolean)
Since: 5.0

Rhino.Display.DisplayMaterial.SetEnvironmentTexture(System.String,System.Boolean)
Since: 5.0

Rhino.Display.DisplayMaterial.SetEnvironmentTexture(Rhino.DocObjects.Texture,System.Boolean)
Since: 5.0

Rhino.Display.DisplayMaterial.GetTransparencyTexture(System.Boolean)
Since: 5.0

Rhino.Display.DisplayMaterial.SetTransparencyTexture(System.String,System.Boolean)
Since: 5.0

Rhino.Display.DisplayMaterial.SetTransparencyTexture(Rhino.DocObjects.Texture,System.Boolean)
Since: 5.0