Rhino.DocObjects.Tables.GroupTableEventArgs
Contains group table event data.

Rhino.DocObjects.Tables.GroupTableEventArgs.Document
The document in which the event occurred.
Since: 5.0

Rhino.DocObjects.Tables.GroupTableEventArgs.EventType
The event type.
Since: 5.0

Rhino.DocObjects.Tables.GroupTableEventArgs.GroupIndex
The index of the Group that has changed.
Since: 6.10

Rhino.DocObjects.Tables.GroupTableEventArgs.NewState
The Group that has changed.
Since: 6.10

Rhino.DocObjects.Tables.GroupTableEventArgs.OldState
If the event is GroupTableEventType.Modified, then the old Group.
Since: 6.10