Rhino.RhinoMath
Provides constants and static methods that are additional to
System.Math.

Rhino.RhinoMath.HalfPI
Quarter of a rotation. 90 degrees. 1.57...

Rhino.RhinoMath.QuarterPI
One eigth of a rotation. 45 degrees. 0.78...

Rhino.RhinoMath.TwoPI
Full rotation. 360 degrees. 6.28...

Rhino.RhinoMath.Tau
Ratio of circumference divided by radius. Full rotation. 360 degrees. 6.28...

Rhino.RhinoMath.ZeroTolerance
Gets Rhino's Zero Tolerance constant, which is 2^-32. In cases when an
absolute "zero" tolerance is required to compare model space coordinates,
ZeroTolerance is used. The value of ZeroTolerance should be no smaller than
Rhino.RhinoMath.Epsilon and should be several orders of magnitude smaller than Rhino.RhinoMath.SqrtEpsilon.
Remarks:
This is equivalent to openNURBS ON_ZERO_TOLERANCE.

Rhino.RhinoMath.UnsetValue
Gets the Rhino standard Unset value. Use this value rather than Double.NaN when
a bogus floating point value is required.
Remarks:
This is equivalent to openNURBS ON_UNSET_VALUE.

Rhino.RhinoMath.Epsilon
Gets the value of DBL_EPSILON, which is the smallest positive floating point number x such that 1 + x != 1.
This is different than Double.Epsilon which is the smallest positive Double value that is greater than zero.
Remarks:
This is equivalent to openNURBS ON_EPSILON.

Rhino.RhinoMath.SqrtEpsilon
Represents a default value that is used when comparing square roots.
This value is several orders of magnitude larger than Rhino.RhinoMath.ZeroTolerance.
Remarks:
This is equivalent to openNURBS ON_SQRT_EPSILON.

Rhino.RhinoMath.DefaultAngleTolerance
Represents the default angle tolerance, used when no other values are provided.
This is one degree, expressed in radians.
Remarks:
This is equivalent to openNURBS ON_DEFAULT_ANGLE_TOLERANCE.

Rhino.RhinoMath.DefaultDistanceToleranceMillimeters
Get Rhino's default distance tolerance in millimeters.
Remarks:
This is equivalent to openNURBS ON_DEFAULT_DISTANCE_TOLERANCE_MM.

Rhino.RhinoMath.UnsetSingle
Gets the single precision floating point number that is considered 'unset' in Rhino.
Remarks:
This is equivalent to openNURBS ON_UNSET_FLOAT.

Rhino.RhinoMath.UnsetIntIndex
When signed int values are used in a context where
0 and small negative values are valid indices and there needs
to be a value that indicates the index is not set.
Remarks:
This is equivalent to openNURBS ON_UNSET_INT_INDEX.

Rhino.RhinoMath.ToRadians(System.Double)
Convert an angle from degrees to radians.
degrees: Degrees to convert (180 degrees equals pi radians).
Since: 5.0

Rhino.RhinoMath.ToDegrees(System.Double)
Convert an angle from radians to degrees.
radians: Radians to convert (180 degrees equals pi radians).
Since: 5.0

Rhino.RhinoMath.IsValidDouble(System.Double)
Determines whether a System.Double value is valid within the RhinoCommon context.
Rhino does not use Double.NaN by convention, so this test evaluates to true if:
x is not equal to RhinoMath.UnsetValue
System.Double.IsNaN(x) evaluates to false
System.Double.IsInfinity(x) evaluates to false
x: System.Double number to test for validity.
Returns: true if the number if valid, false if the number is NaN, Infinity or Unset.
Since: 5.0

Rhino.RhinoMath.IsValidSingle(System.Single)
Determines whether a System.Single value is valid within the RhinoCommon context.
Rhino does not use Single.NaN by convention, so this test evaluates to true if:
x is not equal to RhinoMath.UnsetValue,
System.Single.IsNaN(x) evaluates to false
System.Single.IsInfinity(x) evaluates to false
x: System.Single number to test for validity.
Returns: true if the number if valid, false if the number is NaN, Infinity or Unset.
Since: 5.0

Rhino.RhinoMath.IntIndexToString(System.Int32)
Portrays an System.Int32 index in text.
index: System.Int32 number express as string.
Returns: The text representation of the int index.
Since: 6.0

Rhino.RhinoMath.UnitScale(Rhino.UnitSystem,Rhino.UnitSystem)
Computes the scale factor for changing the measurements unit systems.
from: The system to convert from.
to: The system to convert measurements into.
Returns: A scale multiplier.
Since: 5.0

Rhino.RhinoMath.UnitScale(Rhino.UnitSystem,System.Double,Rhino.UnitSystem,System.Double)
Computes the scale factor for changing the measurements unit systems.
from: The system to convert from.
fromMetersPerUnit: For custom units, specify the meters per unit.
to: The system to convert measurements into.
toMetersPerUnit: For custom units, specify the meters per unit.
Returns: A scale multiplier.
Since: 8.0

Rhino.RhinoMath.MetersPerUnit(Rhino.UnitSystem)
Return number of meters per one unit of a given unit system
units:
Returns:
Since: 7.1

Rhino.RhinoMath.Clamp(System.Int32,System.Int32,System.Int32)
Restricts a System.Int32 to be specified within an interval of two integers.
value: An integer.
bound1: A first bound.
bound2: A second bound. This does not necessarily need to be larger or smaller than bound1.
Returns: The clamped value.
Since: 5.0

Rhino.RhinoMath.Clamp(System.Double,System.Double,System.Double)
Limits a System.Double to be specified within an interval of two numbers, by specifying a fixed minimum and maximum.
value: A number.
bound1: A first bound.
bound2: A second bound. This does not necessarily need to be larger or smaller than bound1.
Returns: The clamped value.
Since: 5.0

Rhino.RhinoMath.Wrap(System.Double,System.Double,System.Double)
Limits a System.Double to be specified within an interval of two numbers by repeating the available interval cyclically.
value: A number.
bound1: A first bound.
bound2: A second bound. This does not necessarily need to be larger or smaller than bound1.
Returns:
Since: 7.1

Rhino.RhinoMath.CRC32(System.UInt32,System.Byte[])
Advances the cyclic redundancy check value remainder given a byte array.
http://en.wikipedia.org/wiki/Cyclic_redundancy_check.
currentRemainder: The remainder from which to start.
buffer: The value to add to the current remainder.
Returns: The new current remainder.
Since: 5.0

Rhino.RhinoMath.CRC32(System.UInt32,System.Double)
Advances the cyclic redundancy check value remainder given a System.Double.
http://en.wikipedia.org/wiki/Cyclic_redundancy_check.
currentRemainder: The remainder from which to start.
value: The value to add to the current remainder.
Returns: The new current remainder.
Since: 5.0

Rhino.RhinoMath.CRC32(System.UInt32,System.Int32)
Advances the cyclic redundancy check value remainder given a System.Int32.
http://en.wikipedia.org/wiki/Cyclic_redundancy_check.
currentRemainder: The remainder from which to start.
value: The value to add to the current remainder.
Returns: The new current remainder.
Since: 5.0

Rhino.RhinoMath.ParseNumber(System.String)
Evaluates command line math expression.
expression:
Returns: result
Throws System.ArgumentNullException: expression is null.
Throws System.FormatException: expression cannot be parsed.
Since: 6.0

Rhino.RhinoMath.TryParseNumber(System.String,System.Double@)
Evaluates command line math expression.
expression:
result:
Returns: true if successful otherwise false
Since: 6.0

Rhino.RhinoMath.EpsilonEquals(System.Double,System.Double,System.Double)
Compare two doubles for equality within some "epsilon" range
x:
y:
epsilon:
Returns:
Since: 5.4

Rhino.RhinoMath.EpsilonEquals(System.Single,System.Single,System.Single)
Compare to floats for equality within some "epsilon" range
x:
y:
epsilon:
Returns:
Since: 5.4

Rhino.RhinoMath.EvaluateNormal(System.Int32,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d@)
Expert tool to evaluate surface unit normal.
limitDirection: Determines which direction is used to compute the limit, where:
0 = default, 1 = from quadrant I, 2 = from quadrant II, etc.
ds: First partial derivative.
dt: First partial derivative.
dss: Second partial derivative.
dst: Second partial derivative.
dtt: Second partial derivative.
n: Unit normal.
Returns: True if successful, false otherwise.
Since: 7.0

Rhino.RhinoMath.EvaluateNormalPartials(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@)
Expert tool to evaluate partial derivatives of surface unit normal.
ds: First partial derivative.
dt: First partial derivative.
dss: Second partial derivative.
dst: Second partial derivative.
dtt: Second partial derivative.
ns: First partial derivative of unit normal. If the Jacobian is degenerate, ns is set to zero.
nt: First partial derivative of unit normal. If the Jacobian is degenerate, nt is set to zero.
Returns: true if Jacobian is non-degenerate, false if Jacobian is degenerate.
Since: 7.0

Rhino.RhinoMath.EvaluateSectionalCurvature(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d@)
Expert tool to evaluate sectional curvature from surface derivatives and section plane normal.
ds: First partial derivative.
dt: First partial derivative.
dss: Second partial derivative.
dst: Second partial derivative.
dtt: Second partial derivative.
planeNormal: Unit normal to section plane.
k:
Sectional curvature.
Curvature of the intersection curve of the surface and plane through the surface point where the partial derivatives were evaluated.
Returns:
True if successful.
False if first partials are not linearly independent, in which case the k is set to zero.
Since: 8.16