Rhino.FileIO.FileObjReadOptions
Options used when reading an obj file.

Rhino.FileIO.FileObjReadOptions.UseObjGroupsAs
Since: 6.0

Rhino.FileIO.FileObjReadOptions.UseObjObjectsAs
Since: 8.0

Rhino.FileIO.FileObjReadOptions.MapYtoZ
Setting to transform OBJ's Y axis to Rhino's Z axis
Since: 6.0

Rhino.FileIO.FileObjReadOptions.MorphTargetOnly
TODO
Since: 6.0

Rhino.FileIO.FileObjReadOptions.ReverseGroupOrder
Determines how groups/layers are nested when reading an obj file.
Left to Right (default = false) or Right to Left (true)
Since: 6.0

Rhino.FileIO.FileObjReadOptions.IgnoreTextures
Determines whether textures are read from the .mtl file, if it exists.
Since: 6.0

Rhino.FileIO.FileObjReadOptions.DisplayColorFromObjMaterial
Determines whether textures are read from the .mtl file, if it exists.
Since: 6.5

Rhino.FileIO.FileObjReadOptions.Split32BitTextures
Since: 6.0

Rhino.FileIO.FileObjReadOptions.ReadOptions
Rhino's FileReadOptions passed into ReadFile

Rhino.FileIO.FileObjReadOptions.#ctor(Rhino.FileIO.FileReadOptions)
readOptions:
Since: 6.0

Rhino.FileIO.FileObjReadOptions.GetTransform
Calculates the YToZ transform.
Returns:
Since: 6.0