Rhino.FileIO.FileDgn
Support for writing Dgn file format

Rhino.FileIO.FileDgn.Read(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileDgnReadOptions)
Read a dgn file into a RhinoDoc
path: path to read a file from
doc: document to import geometry into
options: options used for importing the dgn file
Returns: true on success
Since: 8.0