Rhino.UI.IPanelsService
For internal use, the IPanels service is implemented in RhinoWindows
or RhinoMac as appropriate and handles the communication with core
Rhino

Rhino.UI.IPanelsService.SupportedType(System.Type,System.String@)
Since: 6.1

Rhino.UI.IPanelsService.DestroyNativeWindow(System.Object,System.Object,System.Boolean)
Since: 6.1

Rhino.UI.IPanelsService.SetF1Hook(System.Object,System.EventHandler)
Since: 6.1

Rhino.UI.IPanelsService.CreateDockBar(System.Object)
Since: 8.0

Rhino.UI.IPanelsService.StartDraggingDockBar(System.Guid,System.Drawing.Point,System.Drawing.Point)
Since: 8.0

Rhino.UI.IPanelsService.ResizeFloating(System.Guid,System.Drawing.Size)
Since: 8.0

Rhino.UI.IPanelsService.ToggleDocking(System.Guid)
Since: 8.0

Rhino.UI.IPanelsService.ShowDockBar(System.Guid,System.Boolean)
Since: 8.0

Rhino.UI.IPanelsService.DockBarIdInUse(System.Guid)
Since: 8.0

Rhino.UI.IPanelsService.DockBarIsVisible(System.Guid)
Since: 8.0

Rhino.UI.IPanelsService.Float(System.Guid,System.Drawing.Point)
Since: 8.0

Rhino.UI.IPanelsService.UnhookDeleteAndDestroyDockBar(System.Guid)
Since: 8.0

Rhino.UI.IPanelsService.FactoryResetSettings
Since: 8.0