Rhino.ApplicationSettings.CurvatureAnalysisSettings.CurvatureStyle
Curvature analysis styles
Since: 6.0

Rhino.ApplicationSettings.CurvatureAnalysisSettings.CurvatureStyle.Gaussian
Gaussian curvature

Rhino.ApplicationSettings.CurvatureAnalysisSettings.CurvatureStyle.Mean
Mean curvature

Rhino.ApplicationSettings.CurvatureAnalysisSettings.CurvatureStyle.MinRadius
Minimum radius curvature

Rhino.ApplicationSettings.CurvatureAnalysisSettings.CurvatureStyle.MaxRadius
Maximum radius curvature