Rhino.Render.ChangeQueue.ClippingPlane
ChangeQueue clipping plane

Rhino.Render.ChangeQueue.ClippingPlane.IsEnabled
True if clipping plane is enabled
Since: 6.0

Rhino.Render.ChangeQueue.ClippingPlane.Plane
Get the plane that represents this clipping plane
Since: 6.0

Rhino.Render.ChangeQueue.ClippingPlane.Attributes
Get the ClippingPlaneObject for this clipping plane
Since: 6.0

Rhino.Render.ChangeQueue.ClippingPlane.Id
Get Guid for this clipping plane
Since: 6.0

Rhino.Render.ChangeQueue.ClippingPlane.ViewIds
Get list of Viewport IDs this clipping plane is supposed to clip.
Since: 6.0

Rhino.Render.ChangeQueue.ClippingPlane.ClipViewports
Get an array of RhinoViewports this clipping plane is supposed to clip.
Since: 8.13