Rhino.Render.TextureMapping
Represents a texture mapping.

Rhino.Render.TextureMapping.MappingType
Texture mapping type associated with this Mapping object.
Since: 5.10

Rhino.Render.TextureMapping.Capped
// The m_bCapped applies to planar, cylinder and box mappings.
If m_bCapped is false, the cylinder or box is "infinite", if m_bCapped is true, they are finite.
In planar mappings, m_bCapped=false means "the Z texture coordinate will always be 0.0"
this is now the default behaviour in Rhino 5.0 - it's what users expect apparently.
Since: 8.15

Rhino.Render.TextureMapping.TextureSpace
See TextureSpace
Since: 8.15

Rhino.Render.TextureMapping.Projection
See Projection
Since: 8.15

Rhino.Render.TextureMapping.Id
The unique Id for this texture mapping object.
Since: 5.10

Rhino.Render.TextureMapping.UvwTransform
Transform applied to mapping coordinate (u,v,w) to convert it into a
texture coordinate.
Since: 5.10

Rhino.Render.TextureMapping.PrimativeTransform
For primitive based mappings, these transformations are used to map
the world coordinate (x,y,z) point P and  surface normal N before it is
projected to the normalized mapping primitive. The surface normal
transformation, m_Nxyz, is always calculated from m_Pxyz.  It is a
runtime setting that is not saved in 3dm files. If m_type is
srfp_mapping, then m_Pxyz and m_Nxyz are ignored.
Since: 5.10

Rhino.Render.TextureMapping.PrimitiveTransform
For primitive based mappings, these transformations are used to map
the world coordinate (x,y,z) point P and  surface normal N before it is
projected to the normalized mapping primitive. The surface normal
transformation, m_Nxyz, is always calculated from m_Pxyz.  It is a
runtime setting that is not saved in 3dm files. If m_type is
srfp_mapping, then m_Pxyz and m_Nxyz are ignored.
Since: 7.5

Rhino.Render.TextureMapping.NormalTransform
For primitive based mappings, these transformations are used to map
the world coordinate (x,y,z) point P and  surface normal N before it is
projected to the normalized mapping primitive. The surface normal
transformation, m_Nxyz, is always calculated from m_Pxyz.  It is a
runtime setting that is not saved in 3dm files. If m_type is
srfp_mapping, then m_Pxyz and m_Nxyz are ignored.
Since: 5.10

Rhino.Render.TextureMapping.ComponentType
Returns Rhino.DocObjects.ModelComponentType.TextureMapping.
Since: 6.0

Rhino.Render.TextureMapping.Evaluate(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d@)
Evaluate the mapping to get a texture coordinate
p: Vertex location
n: If the mapping projection is ray_projection, then this
is the vertex unit normal.  Otherwise n is ignored.
t: Texture coordinate (u,v,w)
Returns:
Nonzero if evaluation is successful.  When the mapping is a box or
capped cylinder mapping, the value indicates which side was evaluated.
Cylinder mapping: 1 = cylinder wall, 2 = bottom cap, 3 = top cap
Box mapping: 1 = front, 2 = right, 3 = back, 4 = left, 5 = bottom, 6 = top
Since: 6.17

Rhino.Render.TextureMapping.Evaluate(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d@,Rhino.Geometry.Transform,Rhino.Geometry.Transform)
Evaluate the mapping to get a texture coordinate
p: Vertex location
n: If the mapping projection is ray_projection, then this
is the vertex unit normal.  Otherwise n is ignored.
t: Texture coordinate (u,v,w)
pXform:
Transformation to be applied to P before performing the mapping calculation.
nXform:
Transformation to be applied to N before performing the mapping
calculation. One way to calculate nXxform is to use the call
pXform::GetVectorTransform(nXform).
Returns:
Nonzero if evaluation is successful.  When the mapping is a box or
capped cylinder mapping, the value indicates which side was evaluated.
Cylinder mapping: 1 = cylinder wall, 2 = bottom cap, 3 = top cap
Box mapping: 1 = front, 2 = right, 3 = back, 4 = left, 5 = bottom, 6 = top
Since: 6.17

Rhino.Render.TextureMapping.TryGetMappingBox(Rhino.Geometry.Plane@,Rhino.Geometry.Interval@,Rhino.Geometry.Interval@,Rhino.Geometry.Interval@)
Get a box projection from the texture mapping.
plane:
The center of the box is at plane.origin and the sides of the box are
parallel to the plane's coordinate planes.
dx:
The "front" and "back" sides of the box are in spanned by the vectors
plane.yaxis and plane.zaxis.  The back plane contains the point
plane.PointAt(dx[0],0,0) and the front plane contains the point
plane.PointAt(dx[1],0,0).
dy:
The "left" and "right" sides of the box are in spanned by the vectors
plane.zaxis and plane.xaxis.  The left plane contains the point
plane.PointAt(0,dx[0],0) and the back plane contains the point
plane.PointAt(0,dy[1],0).
dz:
The "top" and "bottom" sides of the box are in spanned by the vectors
plane.xaxis and plane.yaxis.  The bottom plane contains the point
plane.PointAt(0,0,dz[0]) and the top plane contains the point
plane.PointAt(0,0,dz[1]).
Returns:
Returns true if a valid box is returned.
Remarks:
Generally, GetMappingBox will not return the same parameters passed to
SetBoxMapping.  However, the location of the box will be the same.
Since: 5.10

Rhino.Render.TextureMapping.TryGetMappingBox(Rhino.Geometry.Plane@,Rhino.Geometry.Interval@,Rhino.Geometry.Interval@,Rhino.Geometry.Interval@,System.Boolean@)
Get a box projection from the texture mapping, including capped information
plane:
The center of the box is at plane.origin and the sides of the box are
parallel to the plane's coordinate planes.
dx:
The "front" and "back" sides of the box are in spanned by the vectors
plane.yaxis and plane.zaxis.  The back plane contains the point
plane.PointAt(dx[0],0,0) and the front plane contains the point
plane.PointAt(dx[1],0,0).
dy:
The "left" and "right" sides of the box are in spanned by the vectors
plane.zaxis and plane.xaxis.  The left plane contains the point
plane.PointAt(0,dx[0],0) and the back plane contains the point
plane.PointAt(0,dy[1],0).
dz:
The "top" and "bottom" sides of the box are in spanned by the vectors
plane.xaxis and plane.yaxis.  The bottom plane contains the point
plane.PointAt(0,0,dz[0]) and the top plane contains the point
plane.PointAt(0,0,dz[1]).
capped: true if box mapping is capped.
Returns:
Returns true if a valid box is returned.
Remarks:
Generally, GetMappingBox will not return the same parameters passed to
SetBoxMapping.  However, the location of the box will be the same.
Since: 6.7

Rhino.Render.TextureMapping.TryGetMappingSphere(Rhino.Geometry.Sphere@)
Get a spherical projection parameters from this texture mapping.
sphere: ///
Returns:
Returns true if a valid sphere is returned.
Remarks:
Generally, GetMappingShere will not return the same parameters passed
to SetSphereMapping.  However, the location of the sphere will be the
same.  If this mapping is not cylindrical, the cylinder will
approximate the actual mapping primitive.
Since: 5.10

Rhino.Render.TextureMapping.TryGetMappingCylinder(Rhino.Geometry.Cylinder@)
Get a cylindrical projection parameters from this texture mapping.
cylinder:
Returns:
Returns true if a valid cylinder is returned.
Remarks:
Generally, GetMappingCylinder will not return the same parameters passed
to SetCylinderMapping.  However, the location of the cylinder will be
the same.  If this mapping is not cylindrical, the cylinder will
approximate the actual mapping primitive.
Since: 5.10

Rhino.Render.TextureMapping.TryGetMappingCylinder(Rhino.Geometry.Cylinder@,System.Boolean@)
Get a cylindrical projection parameters from this texture mapping.
cylinder:
capped: will be true if capped
Returns:
Returns true if a valid cylinder is returned.
Remarks:
Generally, GetMappingCylinder will not return the same parameters passed
to SetCylinderMapping.  However, the location of the cylinder will be
the same.  If this mapping is not cylindrical, the cylinder will
approximate the actual mapping primitive.
Since: 6.7

Rhino.Render.TextureMapping.TryGetMappingPlane(Rhino.Geometry.Plane@,Rhino.Geometry.Interval@,Rhino.Geometry.Interval@,Rhino.Geometry.Interval@)
Get plane mapping parameters from this texture mapping.
plane:
dx:
Portion of the plane's x axis that is mapped to [0,1]
dy:
Portion of the plane's y axis that is mapped to [0,1]
dz:
Portion of the plane's z axis that is mapped to [0,1]
Returns:
Return true if valid plane mapping parameters were returned.
Remarks:
NOTE WELL:
Generally, GetMappingPlane will not return the same parameters passed
to SetPlaneMapping.  However, the location of the plane will be the
same.
Since: 5.10

Rhino.Render.TextureMapping.TryGetMappingPlane(Rhino.Geometry.Plane@,Rhino.Geometry.Interval@,Rhino.Geometry.Interval@,Rhino.Geometry.Interval@,System.Boolean@)
Get plane mapping parameters from this texture mapping, including capping information
plane:
dx:
Portion of the plane's x axis that is mapped to [0,1]
dy:
Portion of the plane's y axis that is mapped to [0,1]
dz:
Portion of the plane's z axis that is mapped to [0,1]
capped:
Returns:
Return true if valid plane mapping parameters were returned.
Remarks:
NOTE WELL:
Generally, GetMappingPlane will not return the same parameters passed
to SetPlaneMapping.  However, the location of the plane will be the
same.
Since: 6.7

Rhino.Render.TextureMapping.TryGetMappingMesh(Rhino.Geometry.Mesh@)
Get custom mapping mesh from this texture mapping.
mesh:
Returns: True if custom mapping mesh was returned.
Since: 6.18

Rhino.Render.TextureMapping.CreateSurfaceParameterMapping
Create a mapping that will convert surface parameters into normalized(0,1)x(0,1) texture coordinates.
Returns: TextureMapping instance or null if failed.
Since: 7.5

Rhino.Render.TextureMapping.CreatePlaneMapping(Rhino.Geometry.Plane,Rhino.Geometry.Interval,Rhino.Geometry.Interval,Rhino.Geometry.Interval)
Create a planar UV projection texture mapping
plane: A plane to use for mapping.
dx: portion of the plane's x axis that is mapped to [0,1] (can be a decreasing interval)
dy: portion of the plane's y axis that is mapped to [0,1] (can be a decreasing interval)
dz: portion of the plane's z axis that is mapped to [0,1] (can be a decreasing interval)
Returns: TextureMapping instance if input is valid
Since: 5.0

Rhino.Render.TextureMapping.CreatePlaneMapping(Rhino.Geometry.Plane,Rhino.Geometry.Interval,Rhino.Geometry.Interval,Rhino.Geometry.Interval,System.Boolean)
Create a planar projection texture mapping
plane: A plane to use for mapping.
dx: portion of the plane's x axis that is mapped to [0,1] (can be a decreasing interval)
dy: portion of the plane's y axis that is mapped to [0,1] (can be a decreasing interval)
dz: portion of the plane's z axis that is mapped to [0,1] (can be a decreasing interval)
capped: set to true if planar UVW is meant, false for planar UV
Returns: TextureMapping instance if input is valid
Since: 6.7

Rhino.Render.TextureMapping.CreateOcsMapping(Rhino.Geometry.Plane)
Create a Ocs texture mapping.  Note that OCS mappings must be placed on mapping channel ON_ObjectRenderingAttributes::OCSMappingChannelId()
otherwise they will not work.
plane: A plane to use for mapping.
Returns:
Since: 7.17

Rhino.Render.TextureMapping.CreateCylinderMapping(Rhino.Geometry.Cylinder,System.Boolean)
Create a cylindrical projection texture mapping.
cylinder:
cylinder in world space used to define a cylindrical coordinate system.
The angular parameter maps (0,2pi) to texture "u" (0,1), The height
parameter maps (height[0],height[1]) to texture "v" (0,1), and the
radial parameter maps (0,r) to texture "w" (0,1).
capped:
If true, the cylinder is treated as a finite capped cylinder
Remarks:
When the cylinder is capped and m_texture_space = divided, the
cylinder is mapped to texture space as follows:
The side is mapped to 0 <= "u" <= 2/3.
The bottom is mapped to 2/3 <= "u" <= 5/6.
The top is mapped to 5/6 <= "u" <= 5/6.
This is the same convention box mapping uses.
Returns: TextureMapping instance if input is valid
Since: 5.0

Rhino.Render.TextureMapping.CreateSphereMapping(Rhino.Geometry.Sphere)
Create a spherical projection texture mapping.
sphere:
sphere in world space used to define a spherical coordinate system.
The longitude parameter maps (0,2pi) to texture "u" (0,1).
The latitude parameter maps (-pi/2,+pi/2) to texture "v" (0,1).
The radial parameter maps (0,r) to texture "w" (0,1).
Returns: TextureMapping instance if input is valid
Since: 5.0

Rhino.Render.TextureMapping.CreateBoxMapping(Rhino.Geometry.Plane,Rhino.Geometry.Interval,Rhino.Geometry.Interval,Rhino.Geometry.Interval,System.Boolean)
Create a box projection texture mapping.
plane:
The sides of the box the box are parallel to the plane's coordinate
planes.  The dx, dy, dz intervals determine the location of the sides.
dx:
Determines the location of the front and back planes. The vector
plane.xaxis is perpendicular to these planes and they pass through
plane.PointAt(dx[0],0,0) and plane.PointAt(dx[1],0,0), respectively.
dy:
Determines the location of the left and right planes. The vector
plane.yaxis is perpendicular to these planes and they pass through
plane.PointAt(0,dy[0],0) and plane.PointAt(0,dy[1],0), respectively.
dz:
Determines the location of the top and bottom planes. The vector
plane.zaxis is perpendicular to these planes and they pass through
plane.PointAt(0,0,dz[0]) and plane.PointAt(0,0,dz[1]), respectively.
capped:
If true, the box is treated as a finite capped box.
Remarks:
When m_texture_space = divided, the box is mapped to texture space as follows:
If the box is not capped, then each side maps to 1/4 of the texture map.
v=1+---------+---------+---------+---------+
| x=dx[1] | y=dy[1] | x=dx[0] | y=dy[0] |
| Front   | Right   | Back    | Left    |
| --y->   | <-x--   | <-y--   | --x->   |
v=0+---------+---------+---------+---------+
0/4 <=u<= 1/4 <=u<= 2/4 <=u<= 3/4 <=u<= 4/4
If the box is capped, then each side and cap gets 1/6 of the texture map.
v=1+---------+---------+---------+---------+---------+---------+
| x=dx[1] | y=dy[1] | x=dx[0] | y=dy[0] | z=dx[1] | z=dz[0] |
| Front   | Right   | Back    | Left    | Top     |  Bottom |
| --y->   | <x--   | <-y--   | --x->   | --x->   | --x->   |
v=0+---------+---------+---------+---------+---------+---------+
0/6 <=u<= 1/6 <=u<= 2/6 <=u<= 3/6 <=u<= 4/6 <=u<= 5/6 <=u<= 6/6
Returns: TextureMapping instance if input is valid
Since: 5.0

Rhino.Render.TextureMapping.CreateCustomMeshMapping(Rhino.Geometry.Mesh)
Create custom mesh mapping
mesh: Mesh with texture coordinates
Returns: TextureMapping instance
Since: 6.15