Rhino.Geometry.Centermark
Represents a center mark dimension.

Rhino.Geometry.Centermark.#ctor
Constructs a new center mark dimension.
Since: 6.0

Rhino.Geometry.Centermark.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor used in serialization.

Rhino.Geometry.Centermark.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double)
Constructs a new center mark dimension.
plane: Dimension's plane.
centerPoint: Dimension's center point.
radius: Center mark's radius.
Since: 8.0

Rhino.Geometry.Centermark.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.Curve,System.Double)
Constructs a new center mark dimension.
plane: Dimension's plane.
curve: Curve used to determine the center mark's radius.
curveParameter: Parameter on curve used to determine the center mark's radius.
Since: 8.0

Rhino.Geometry.Centermark.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,System.Double)
Creates a new center mark dimension.
dimStyle: Dimension's dimension style.
plane: Dimension's plane.
centerPoint: Dimension's center point.
radius: Center mark's radius.
Returns: A new center mark if successful, null otherwise.
Since: 6.0

Rhino.Geometry.Centermark.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.Curve,System.Double)
Creates a new center mark dimension.
dimStyle: Dimension's dimension style.
plane: Dimension's plane.
curve: Curve used to determine the center mark's radius.
curveParameter: Parameter on curve used to determine the center mark's radius.
Returns: A new center mark if successful, null otherwise.
Throws System.ArgumentNullException:
Since: 8.0

Rhino.Geometry.Centermark.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d)
Update dimension geometry from point locations.
plane: Dimension's plane.
centerPoint: Dimension's center point.
Returns: True if successful, false otherwise.
Since: 8.0

Rhino.Geometry.Centermark.Radius
Gets or sets the center mark's radius.
Since: 8.0