Rhino.Geometry.MeshRefinements.LoopFormula
Enumerates the alternative Loop implementations.
Since: 6.0

Rhino.Geometry.MeshRefinements.LoopFormula.Loop
The original Loop formula.

Rhino.Geometry.MeshRefinements.LoopFormula.Warren
Warren's improved formula.

Rhino.Geometry.MeshRefinements.LoopFormula.WarrenWeimer
The formula as explained by Weimer, improving over Warren's.