Rhino.Runtime.InteropWrappers.SimpleArrayBrepPointer
Wrapper for a C++ ON_SimpleArray<ON_Brep*> or ON_SimpleArray<constant ON_Brep*>
If you are not writing C++ code then this class is not for you.

Rhino.Runtime.InteropWrappers.SimpleArrayBrepPointer.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayBrepPointer.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayBrepPointer.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayBrepPointer instance.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayBrepPointer.Count
Gets the amount of breps in this array.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayBrepPointer.Add(Rhino.Geometry.Brep,System.Boolean)
Adds a brep to the list.
brep: A brep to add.
asConst: Whether this brep should be treated as non-modifiable.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayBrepPointer.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.SimpleArrayBrepPointer.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayBrepPointer.Dispose(System.Boolean)
disposing:

Rhino.Runtime.InteropWrappers.SimpleArrayBrepPointer.ToNonConstArray
Copies the unmanaged array to a managed counterpart.
Returns: The managed array.
Since: 5.0