Rhino.FileIO.DracoCompression
Google Draco compression for mesh and point cloud data

Rhino.FileIO.DracoCompression.Finalize
Finalizer for DracoCompression

Rhino.FileIO.DracoCompression.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 7.0

Rhino.FileIO.DracoCompression.Compress(Rhino.Geometry.Mesh)
Compress a mesh using default compression options.
mesh: mesh to compress
Returns: instance of class representing the compressed data
Since: 7.0

Rhino.FileIO.DracoCompression.Compress(Rhino.Geometry.Mesh,Rhino.FileIO.DracoCompressionOptions)
Compress a mesh
mesh: mesh to compress
options: options used to determine how the compression will occur
Returns: instance of class representing the compressed data
Since: 7.0

Rhino.FileIO.DracoCompression.Compress(Rhino.Geometry.PointCloud)
Compress a point cloud
pointCloud: point cloud to compress
Returns: instance of class representing the compressed data
Since: 8.0

Rhino.FileIO.DracoCompression.Compress(Rhino.Geometry.PointCloud,Rhino.FileIO.DracoCompressionOptions)
Compress a point cloud
pointCloud: point cloud to compress
options: options used to determine how the compression will occur
Returns: instance of class representing the compressed data
Since: 8.0

Rhino.FileIO.DracoCompression.Write(System.String)
Write the compressed data to disk
path: path to write to
Returns: true on success
Since: 7.0

Rhino.FileIO.DracoCompression.DecompressFile(System.String)
Read compressed data from disk and decompress to RhinoCommon geometry
path: path to read from
Returns: Mesh or point cloud on success. null on failure
Since: 7.0

Rhino.FileIO.DracoCompression.DecompressByteArray(System.Byte[])
Decompress data into either a mesh or point cloud.
bytes: compressed Draco data
Returns: Mesh or point cloud on success. null on failure
Since: 7.0

Rhino.FileIO.DracoCompression.DecompressBase64String(System.String)
Decompress base64 encoded version of Draco data into either a mesh or point cloud
encoded: compressed Draco data
Returns: Mesh or point cloud on success. null on failure
Since: 7.0

Rhino.FileIO.DracoCompression.ToBase64String
Convert byte array of Draco compressed data into a base64 encoded string
Returns:
Since: 7.0

Rhino.FileIO.DracoCompression.ToByteArray
Gets the Draco compressed data as a byte array
Returns:
Since: 8.0

Rhino.FileIO.DracoCompression.VertexAttributePosition
The attribute position for vertices when compressed
Since: 7.7

Rhino.FileIO.DracoCompression.NormalAttributePosition
The attribute position for normals when compressed
Since: 7.7

Rhino.FileIO.DracoCompression.TextureCoordinatesAttributePosition
The attribute position for texture coordinates when compressed
Since: 7.7

Rhino.FileIO.DracoCompression.VertexColorAttributePosition
The attribute position for vertex colors when compressed
Since: 7.7