Rhino.Runtime.InteropWrappers.SimpleArrayPlane
Wrapper for ON_SimpleArray<ON_Plane>. If you are not writing C++ code
then this class is not for you.

Rhino.Runtime.InteropWrappers.SimpleArrayPlane.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayPlane.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayPlane.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayLine instance.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayPlane.Count
Gets the amount of lines in this array.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayPlane.ToArray
Copies the unmanaged array to a managed counterpart.
Returns: The managed array.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayPlane.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.SimpleArrayPlane.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 6.0