Rhino.DocObjects.ObjectMode
Defines enumerated values for the display and behavior of single objects.
Since: 5.0

Rhino.DocObjects.ObjectMode.Normal
Object mode comes from layer.

Rhino.DocObjects.ObjectMode.Hidden
Not visible, object cannot be selected or changed.

Rhino.DocObjects.ObjectMode.Locked
Visible, object cannot be selected or changed.

Rhino.DocObjects.ObjectMode.InstanceDefinitionObject
Object is part of an InstanceDefinition. The InstanceDefinition
m_object_uuid[] array will contain this object attribute's id.