Rhino.Display.ColorRGBA
Represents a sRGBA (Red, Green, Blue, Alpha) color with double precision floating point channel.

Rhino.Display.ColorRGBA.R
Gets or sets the red channel value.
Red channels are limited to a 0~1 range.
Since: 7.0

Rhino.Display.ColorRGBA.G
Gets or sets the green channel value.
Green channels are limited to a 0~1 range.
Since: 7.0

Rhino.Display.ColorRGBA.B
Gets or sets the blue channel value.
Blue channels are limited to a 0~1 range.
Since: 7.0

Rhino.Display.ColorRGBA.A
Gets or sets the alpha channel value.
Alpha channels are limited to a 0~1 range.
Since: 7.0

Rhino.Display.ColorRGBA.#ctor(Rhino.Display.ColorRGBA)
Since: 7.0

Rhino.Display.ColorRGBA.#ctor(Rhino.Display.ColorRGBA,System.Double)
Since: 8.0

Rhino.Display.ColorRGBA.#ctor(System.Double,System.Double,System.Double)
Since: 7.0

Rhino.Display.ColorRGBA.#ctor(System.Double,System.Double,System.Double,System.Double)
Since: 7.0

Rhino.Display.ColorRGBA.#ctor(System.Drawing.Color)
Constructs a new instance of ColorRGBA that is equivalent to an ARGB color.
color: ARGB color to mimic.
Since: 7.0

Rhino.Display.ColorRGBA.#ctor(System.Int32)
Constructs a new instance of ColorRGBA that is equivalent to an ARGB color.
argb: ARGB color to mimic.
Since: 7.0

Rhino.Display.ColorRGBA.ToArgb
Converts this color to a 32-bit ARGB value.
Returns: The 32-bit ARGB value that corresponds to this color
Since: 7.35

Rhino.Display.ColorRGBA.CreateFromArgb(System.Byte,System.Byte,System.Byte)
Constructs a RGBA color from the specified 8-bit components (red, green, and blue) values.
The alpha value is implicitly 1.0 (fully opaque).
red: The red component. Valid values are 0 through 255.
green: The green component. Valid values are 0 through 255.
blue: The blue component. Valid values are 0 through 255.
Returns: A RGBA color with the specified component values.
Since: 8.0

Rhino.Display.ColorRGBA.CreateFromArgb(System.Byte,System.Byte,System.Byte,System.Byte)
Constructs a RGBA color from the four ARGB components (alpha, red, green, and blue) values.
alpha: The alpha component. Valid values are 0 through 255.
red: The red component. Valid values are 0 through 255.
green: The green component. Valid values are 0 through 255.
blue: The blue component. Valid values are 0 through 255.
Returns: A RGBA color with the specified component values.
Since: 8.0

Rhino.Display.ColorRGBA.CreateFromHSV(Rhino.Display.ColorHSV)
Constructs the nearest RGBA equivalent of an HSL color.
hsv: Target color in HSL space.
Returns: The RGBA equivalent of the HSL color.
Since: 7.0

Rhino.Display.ColorRGBA.CreateFromHSL(Rhino.Display.ColorHSL)
Constructs the nearest RGBA equivalent of an HSV color.
hsl: Target color in HSL space.
Returns: The RGBA equivalent of the HSL color.
Since: 7.0

Rhino.Display.ColorRGBA.CreateFromCMYK(Rhino.Display.ColorCMYK)
Create the nearest RGBA equivalent of a CMYK color.
cmyk: Target color in CMYK space.
Returns: The RGBA equivalent of the CMYK color.
Since: 7.0

Rhino.Display.ColorRGBA.CreateFromXYZ(Rhino.Display.ColorXYZ)
Create the nearest RGBA equivalent of an XYZ color.
xyz: Target color in XYZ space.
Returns: The RGBA equivalent of the XYZ color.
Since: 7.0

Rhino.Display.ColorRGBA.CreateFromLAB(Rhino.Display.ColorLAB)
Create the nearest RGBA equivalent of a LAB color.
lab: Target color in LAB space.
Returns: The RGBA equivalent of the LAB color.
Since: 7.0

Rhino.Display.ColorRGBA.CreateFromLCH(Rhino.Display.ColorLCH)
Create the nearest RGBA equivalent of a LCH color.
lch: Target color in LCH space.
Returns: The RGBA equivalent of the LCH color.
Since: 7.0

Rhino.Display.ColorRGBA.ToString
Since: 7.0

Rhino.Display.ColorRGBA.ToString(System.String,System.IFormatProvider)
Since: 7.0

Rhino.Display.ColorRGBA.CompareTo(Rhino.Display.ColorRGBA)
Compares this Rhino.Display.ColorRGBA with another Rhino.Display.ColorRGBA.
Channels evaluation priority is first A, then R, then G, then B.
other: The other Rhino.Display.ColorRGBA to use in comparison.
Returns:
0: if this is identical to other
-1: if this < other
+1: if this > other
Since: 7.0

Rhino.Display.ColorRGBA.EpsilonEquals(Rhino.Display.ColorRGBA,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:
Since: 7.0

Rhino.Display.ColorRGBA.Equals(Rhino.Display.ColorRGBA)
Determines whether the specified ColorRGBA has the same values as the present color.
other: The specified color.
Returns: true if color has the same channel values as this; otherwise false.
Since: 7.0

Rhino.Display.ColorRGBA.Equals(System.Object)
Since: 7.0

Rhino.Display.ColorRGBA.GetHashCode
Since: 7.0

Rhino.Display.ColorRGBA.Black
Since: 7.0

Rhino.Display.ColorRGBA.White
Since: 7.0

Rhino.Display.ColorRGBA.Red
Since: 7.0

Rhino.Display.ColorRGBA.Green
Since: 7.0

Rhino.Display.ColorRGBA.Blue
Since: 7.0

Rhino.Display.ColorRGBA.op_Equality(Rhino.Display.ColorRGBA,Rhino.Display.ColorRGBA)
Since: 7.0

Rhino.Display.ColorRGBA.op_Inequality(Rhino.Display.ColorRGBA,Rhino.Display.ColorRGBA)
Since: 7.0

Rhino.Display.ColorRGBA.BlendTo(Rhino.Display.ColorRGBA,System.Double)
Since: 7.0

Rhino.Display.ColorRGBA.ApplyGamma(Rhino.Display.ColorRGBA,System.Double)
Since: 7.0

Rhino.Display.ColorRGBA.op_Explicit(Rhino.Display.ColorRGBA)~System.Drawing.Color
Converts a ColorRGBA in a System.Drawing.Color.
value: A RGBA color.
Returns: An ARGB System.Drawing.Color.
Since: 7.0

Rhino.Display.ColorRGBA.op_Implicit(System.Drawing.Color)~Rhino.Display.ColorRGBA
Since: 7.0