Rhino.Geometry.Triangle3d
Represents a triangle, modeled using double three points that use double-precision floating point numbers.

Rhino.Geometry.Triangle3d.#ctor(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Instantiates a new triangle.
a: First point.
b: Second point.
c: Third point.
Since: 7.1

Rhino.Geometry.Triangle3d.A
Gets the first triangle corner.
Since: 7.1

Rhino.Geometry.Triangle3d.B
Gets the second triangle corner.
Since: 7.1

Rhino.Geometry.Triangle3d.C
Gets the third triangle corner.
Since: 7.1

Rhino.Geometry.Triangle3d.Circumcircle
Gets the circumcircle of this triangle.
Since: 7.1

Rhino.Geometry.Triangle3d.BoundingBox
Gets the bounding box of this triangle.
Since: 7.1

Rhino.Geometry.Triangle3d.AngleA
Gets the angle at the A corner.
Since: 7.1

Rhino.Geometry.Triangle3d.AngleB
Gets the angle at the B corner.
Since: 7.1

Rhino.Geometry.Triangle3d.AngleC
Gets the angle at the C corner.
Since: 7.1

Rhino.Geometry.Triangle3d.AB
Gets the triangle edge connecting the A and B corners.
Since: 7.1

Rhino.Geometry.Triangle3d.BC
Gets the triangle edge connecting the B and C corners.
Since: 7.1

Rhino.Geometry.Triangle3d.CA
Gets the triangle edge connecting the C and A corners.
Since: 7.1

Rhino.Geometry.Triangle3d.MedianA
Gets the median line starting at corner A.
Since: 7.1

Rhino.Geometry.Triangle3d.MedianB
Gets the median line starting at corner B.
Since: 7.1

Rhino.Geometry.Triangle3d.MedianC
Gets the median line starting at corner C.
Since: 7.1

Rhino.Geometry.Triangle3d.AltitudeA
Gets the altitude line starting at corner A.
Since: 7.1

Rhino.Geometry.Triangle3d.AltitudeB
Gets the altitude line starting at corner B.
Since: 7.1

Rhino.Geometry.Triangle3d.AltitudeC
Gets the altitude line starting at corner C.
Since: 7.1

Rhino.Geometry.Triangle3d.PerpendicularAB
Gets the perpendicular bisector for edge AB.
Since: 7.1

Rhino.Geometry.Triangle3d.PerpendicularBC
Gets the perpendicular bisector for edge BC.
Since: 7.1

Rhino.Geometry.Triangle3d.PerpendicularCA
Gets the perpendicular bisector for edge CA.
Since: 7.1

Rhino.Geometry.Triangle3d.Perimeter
Gets the perimeter of this triangle. This is the sum of the lengths of all edges.
Since: 7.1

Rhino.Geometry.Triangle3d.Area
Gets the area inside this triangle.
Since: 7.1

Rhino.Geometry.Triangle3d.AreaCenter
Gets the triangle area centroid.
Since: 7.1

Rhino.Geometry.Triangle3d.Orthocenter
Gets the triangle orthocenter.
Since: 7.1

Rhino.Geometry.Triangle3d.Circumcenter
Gets the triangle circumcenter.
Since: 7.1

Rhino.Geometry.Triangle3d.TripleLineIntersect(Rhino.Geometry.Line,Rhino.Geometry.Line,Rhino.Geometry.Line)
Compute the average point of three lines intersecting.
This method assumes the lines all intersect at a single point,
though performs additional work to reduce the error.

Rhino.Geometry.Triangle3d.Transform(Rhino.Geometry.Transform)
Transform this triangle.
Since: 7.1

Rhino.Geometry.Triangle3d.ToPolyline
Create a polyline from this triangle.
Since: 7.1

Rhino.Geometry.Triangle3d.ToMesh
Create a mesh from this triangle.
Since: 7.1

Rhino.Geometry.Triangle3d.WithA(Rhino.Geometry.Point3d)
Replace the A corner.
Since: 7.1

Rhino.Geometry.Triangle3d.WithB(Rhino.Geometry.Point3d)
Replace the B corner.
Since: 7.1

Rhino.Geometry.Triangle3d.WithC(Rhino.Geometry.Point3d)
Replace the C corner.
Since: 7.1

Rhino.Geometry.Triangle3d.PointAtBarycentricCoords(Rhino.Geometry.Point2d)
Gets a point within this triangle using barycentric coordinates.
coords: Barycentric mass for vertex B and C. A is valued as (1 - B - C).
Returns: Point at barycentric mass.
Since: 7.1

Rhino.Geometry.Triangle3d.BarycentricCoordsAt(Rhino.Geometry.Point3d,System.Double@)
Gets the projection of a point onto the barycentric coordinates.
point: Point to project.
signedHeight: A value indicating the height of the intersection in world units,
negative if the point is situated under the triangle.
Returns: The computed barycentric mass values relating to B and C for point.
Since: 7.1

Rhino.Geometry.Triangle3d.PointAlongBoundary(System.Double)
Gets the point along the boundary of the triangle.
The triangle boundary has a domain [0, 3] where each
subsequent unit domain maps to a different edge.
t: Parameter along boundary.
Since: 7.1

Rhino.Geometry.Triangle3d.ClosestParameterOnBoundary(Rhino.Geometry.Point3d)
Gets the parameter on the triangle boundary closest to a test point.
Since: 7.1

Rhino.Geometry.Triangle3d.ClosestPointOnBoundary(Rhino.Geometry.Point3d)
Gets the point on the triangle boundary closest to a test point.
Since: 7.1

Rhino.Geometry.Triangle3d.PointOnInterior(System.Double,System.Double)
Gets the point on the triangle using the AB and AC primary axes.
u: Parameter along the AB edge.
v: Parameter along the AC edge.
Returns: Point at parameter.
Since: 7.1

Rhino.Geometry.Triangle3d.TrySmallestEnclosingTriangle(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d},System.Double,Rhino.Geometry.Triangle3d@)
Attempt to create the smallest triangle containing a set of planar points.
points: The points to enclose.
tolerance: The tolerance to use
triangle: The resulting triangle on success.
Returns: true on success, false on failure.
Since: 8.4