Rhino.FileIO.FileDstReadOptions
Options for reading a Dst file

Rhino.FileIO.FileDstReadOptions.ImportJumps
Since: 8.0

Rhino.FileIO.FileDstReadOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0