RibbonOffsets.RibbonOffsetSurfacing.CreateRibbonOffset(Rhino.Geometry.Curve,Rhino.Geometry.RibbonOffsetParameters,Rhino.Geometry.Curve[]@,Rhino.Geometry.Curve[]@,Rhino.Geometry.Brep[]@)
Creates the ribbon offset curve and any surfaces

RibbonOffsets.RibbonOffsetSurfacing.SimpleSweep2Surfaces
Simple Sweep 2 tries to generate a brep sweep using the input curve and the offset curve using a single
cross section at the input curve start and offset curve start location

RibbonOffsets.RibbonOffsetSurfacing.SplitRibbonSections
This will split the input curve and offset curve at each cross section location and then perform surface construction on each group of splits.
The resulting segments will be either sweep 2 sections or NetworkSrf patches in areas where there are only 3 input curves (corners)