Rhino.Geometry.Collections.BrepLoopList
Provides access to all the Loops in a Brep object.

Rhino.Geometry.Collections.BrepLoopList.Count
Gets the number of brep loops.
Since: 5.0

Rhino.Geometry.Collections.BrepLoopList.Item(System.Int32)
Gets the BrepLoop at the given index.
The index must be valid or an IndexOutOfRangeException will be thrown.
index: Index of BrepLoop to access.
Throws System.IndexOutOfRangeException: Thrown when the index is invalid.
Returns: The BrepLoop at [index].

Rhino.Geometry.Collections.BrepLoopList.Add(Rhino.Geometry.BrepLoopType)
Create a new empty boundary loop. The new loop will not be part of a face and
will not include any trim curves.
loopType:
Returns:
Since: 5.4

Rhino.Geometry.Collections.BrepLoopList.Add(Rhino.Geometry.BrepLoopType,Rhino.Geometry.BrepFace)
Create a new boundary loop on a face.  After you get this
BrepLoop, you still need to create the vertices, edges,
and trims that define the loop.
loopType:
face:
Returns: New loop that needs to be filled in
Since: 5.4

Rhino.Geometry.Collections.BrepLoopList.AddOuterLoop(System.Int32)
Create a new outer boundary loop that runs along the sides
of the face's surface.  All the necessary trims, edges,
and vertices are created and added to the brep.
faceIndex:
index of face that needs an outer boundary
that runs along the sides of its surface.
Returns: New outer boundary loop that is complete.
Since: 5.4

Rhino.Geometry.Collections.BrepLoopList.AddPlanarFaceLoop(System.Int32,Rhino.Geometry.BrepLoopType,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})
Add a planar trimming loop to a planar face
faceIndex:
index of planar face.  The underlying surface must be a PlaneSurface
loopType:
type of loop to add.  If loopType is Unknown, then the loop direction
is tested and the new loops type will be set to Outer or Inner.
If the loopType is Outer, then the direction of the new loop is tested
and flipped if it is clockwise. If the loopType is Inner, then the
direction of the new loop is tested and flipped if it is counter-clockwise.
boundaryCurves:
list of 3d curves that form a simple (no self intersections) closed
curve.  These curves define the 3d edge geometry and should be near
the planar surface.
Returns: new loop if successful
Since: 5.4

Rhino.Geometry.Collections.BrepLoopList.System#Collections#IEnumerable#GetEnumerator
Gets the same enumerator as Rhino.Geometry.Collections.BrepLoopList.GetEnumerator.
Returns: The enumerator.
Since: 5.0

Rhino.Geometry.Collections.BrepLoopList.GetEnumerator
Gets an enumerator that visits all edges.
Returns: The enumerator.
Since: 5.0