Rhino.Geometry.Intersect.LineSphereIntersection
Represents all possible cases of a Line|Sphere intersection event.
Since: 5.0

Rhino.Geometry.Intersect.LineSphereIntersection.None
No intersections.

Rhino.Geometry.Intersect.LineSphereIntersection.Single
One intersection.

Rhino.Geometry.Intersect.LineSphereIntersection.Multiple
Two intersections.