Rhino.UI.Dialogs.ShowAboutDialog(System.Boolean)
Since: 6.0

Rhino.UI.Dialogs.ShowContextMenu(System.Collections.Generic.IEnumerable{System.String},System.Drawing.Point,System.Collections.Generic.IEnumerable{System.Int32})
Creates an ETO ContextMenu from an array of strings. Use the modes array to enable/disable menu items
items:
screenPoint:
modes:
Returns:
Since: 5.0

Rhino.UI.Dialogs.SetCustomColorDialog(System.EventHandler{Rhino.UI.GetColorEventArgs})
Since: 5.0

Rhino.UI.Dialogs.KillSplash
Destroy the splash screen if it is being displayed.
Since: 5.0

Rhino.UI.Dialogs.ShowSemiModal(System.Windows.Forms.Form)
Show a windows form that is modal in the sense that this function does not return until
the form is closed, but also allows for interaction with other elements of the Rhino
user interface.
form:
The form must have buttons that are assigned to the "AcceptButton" and "CancelButton".
Returns: One of the System.Windows.Forms.DialogResult values.
Since: 5.0
6.0

Rhino.UI.Dialogs.ShowTextDialog(System.String,System.String)
Display a text dialog similar to the dialog used for the "What" command.
message: Text to display as the message content.
title: Test to display as the form title.
Since: 5.0

Rhino.UI.Dialogs.ShowMessageBox(System.String,System.String)
Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
message:
title:
Returns:
Since: 5.0
6.0

Rhino.UI.Dialogs.ShowMessageBox(System.String,System.String,System.Windows.Forms.MessageBoxButtons,System.Windows.Forms.MessageBoxIcon)
Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
message:
title:
buttons:
icon:
Returns:
Since: 5.0
6.0

Rhino.UI.Dialogs.ShowMessage(System.String,System.String)
Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
message: Message box text content.
title: Message box title text.
Returns: One of the ShowMessageBoxResult values.
Since: 6.0

Rhino.UI.Dialogs.ShowMessage(System.String,System.String,Rhino.UI.ShowMessageButton,Rhino.UI.ShowMessageIcon)
Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
message: Message box text content.
title: Message box title text.
buttons: Which buttons to display in the message box.
icon: Which icon to display in the message box.
Returns: One of the ShowMessageBoxResult values.
Since: 6.0

Rhino.UI.Dialogs.ShowMessage(System.Object,System.String,System.String,Rhino.UI.ShowMessageButton,Rhino.UI.ShowMessageIcon,Rhino.UI.ShowMessageDefaultButton,Rhino.UI.ShowMessageOptions,Rhino.UI.ShowMessageMode)
Same as System.Windows.Forms.MessageBox.Show but using a message box tailored to Rhino.
parent: Parent window
message: Message box text content.
title: Message box title text.
buttons: Which buttons to display in the message box.
icon: Which icon to display in the message box.
defaultButton: Which button is the default button.
mode: The modality of the message box.
options: Additional message box options.
Returns: One of the ShowMessageBoxResult values.
Since: 6.0

Rhino.UI.Dialogs.ShowColorDialog(System.Drawing.Color@)
Display Rhino's color selection dialog.
color:
[in/out] Default color for dialog, and will receive new color if function returns true.
Returns: true if the color changed. false if the color has not changed or the user pressed cancel.
Since: 5.0

Rhino.UI.Dialogs.ShowColorDialog(System.Drawing.Color@,System.Boolean,System.String)
Display Rhino's color selection dialog.
color:
[in/out] Default color for dialog, and will receive new color if function returns true.
includeButtonColors:
Display button face and text options at top of named color list.
dialogTitle: The title of the dialog.
Returns: true if the color changed. false if the color has not changed or the user pressed cancel.
Since: 5.0

Rhino.UI.Dialogs.ShowColorDialog(System.Drawing.Color@,System.Boolean,System.String,Rhino.UI.NamedColorList)
Display Rhino's color selection dialog.
color:
[in/out] Default color for dialog, and will receive new color if function returns true.
includeButtonColors:
Display button face and text options at top of named color list.
dialogTitle: The title of the dialog.
namedColorList:
If not null and contains one or more named colors the Rhino color dialog named color list will
be replaces with this list.
Returns: true if the color changed. false if the color has not changed or the user pressed cancel.
Since: 5.0

Rhino.UI.Dialogs.ShowColorDialog(System.Windows.Forms.IWin32Window,Rhino.Display.Color4f@,System.Boolean)
Displays the standard modal color picker dialog for floating point colors.
parent: Parent window for this dialog, should always pass this if calling from a form or user control.
color: The initial color to set the picker to and also accepts the user's choice.
allowAlpha: Specifies if the color picker should allow changes to the alpha channel or not.
Returns: true if a color was picked, false if the user canceled the picker dialog.
Since: 5.0
6.0

Rhino.UI.Dialogs.ShowColorDialog(System.Object,Rhino.Display.Color4f@,System.Boolean)
Displays the standard modal color picker dialog for floating point colors.
parent: Parent window for this dialog, should always pass this if calling from a form or user control.
color: The initial color to set the picker to and also accepts the user's choice.
allowAlpha: Specifies if the color picker should allow changes to the alpha channel or not.
Returns: true if a color was picked, false if the user canceled the picker dialog.
Since: 6.0

Rhino.UI.Dialogs.ShowColorDialog(System.Object,Rhino.Display.Color4f@,System.Boolean,Rhino.UI.Dialogs.OnColorChangedEvent)
Displays the standard modal color picker dialog for floating point colors.
parent: Parent window for this dialog, should always pass this if calling from a form or user control.
color: The initial color to set the picker to and also accepts the user's choice.
allowAlpha: Specifies if the color picker should allow changes to the alpha channel or not.
colorCallback:
May be optionally passed to ShowColorDialog and will get called when
the color value changes in the color dialog.
Returns: true if a color was picked, false if the user canceled the picker dialog.
Since: 6.0

Rhino.UI.Dialogs.ShowColorDialog(System.Object,Rhino.Display.Color4f@,System.Boolean,Rhino.UI.NamedColorList,Rhino.UI.Dialogs.OnColorChangedEvent)
Displays the standard modal color picker dialog for floating point colors.
parent: Parent window for this dialog, should always pass this if calling from a form or user control.
color: The initial color to set the picker to and also accepts the user's choice.
allowAlpha: Specifies if the color picker should allow changes to the alpha channel or not.
namedColorList:
If not null and contains at least one named color this list will replace the standard Rhino Color list displayed by
the rhino color dialog.
colorCallback:
May be optionally passed to ShowColorDialog and will get called when
the color value changes in the color dialog.
Returns: true if a color was picked, false if the user canceled the picker dialog.
Since: 6.0

Rhino.UI.Dialogs.ShowColorDialog(Rhino.Display.Color4f@,System.Boolean)
Displays the standard modal color picker dialog for floating point colors.
color: The initial color to set the picker to and also accepts the user's choice.
allowAlpha: Specifies if the color picker should allow changes to the alpha channel or not.
Returns: true if a color was picked, false if the user canceled the picker dialog.
Since: 5.0

Rhino.UI.Dialogs.ShowSunDialog(Rhino.Render.Sun)
Show the modal sun dialog.
Returns:
Returns true if the user clicked OK, or false if the user canceled.
Since: 6.0

Rhino.UI.Dialogs.ShowSelectLayerDialog(System.Int32@,System.String,System.Boolean,System.Boolean,System.Boolean@)
Displays Rhino's single layer selection dialog.
layerIndex:
Initial layer for the dialog, and will receive selected
layer if function returns DialogResult.OK.
dialogTitle: The dialog title.
showNewLayerButton: true if the new layer button will be visible.
showSetCurrentButton: true if the set current button will be visible.
initialSetCurrentState: true if the current state will be initially set.
Returns:
True if the dialog was closed with the OK button. False if the dialog was closed with escape.
Since: 5.0

Rhino.UI.Dialogs.ShowSelectMultipleLayersDialog(System.Collections.Generic.IEnumerable{System.Int32},System.String,System.Boolean,System.Int32[]@)
Returns:
True if the dialog was closed with the OK button. False if the dialog was closed with escape.
Since: 5.9

Rhino.UI.Dialogs.ShowLayerMaterialDialog(Rhino.RhinoDoc,System.Collections.Generic.IEnumerable{System.Int32})
Show a modal dialog to edit the material in the layer specified in layerIndices.
doc: Rhino document
layerIndices: true if the new layer button will be visible.
Returns:
True if the dialog was closed with the OK button. False if the dialog was closed with escape.
Since: 8.0

Rhino.UI.Dialogs.ShowSelectLinetypeDialog(System.Int32@,System.Boolean)
Displays Rhino's single linetype selection dialog.
linetypeIndex:
Initial linetype for the dialog, and will receive selected
linetype if function returns true.
displayByLayer: Displays the "ByLayer" linetype in the list. Defaults to false.
Returns:
True if the dialog was closed with the OK button. False if the dialog was closed with escape.
Since: 6.0

Rhino.UI.Dialogs.ShowComboListBox(System.String,System.String,System.Collections.IList)
Displays Rhino's combo list box.
title: The dialog title.
message: The dialog message.
items: A list of items to show.
Returns:
selected item.
null if the user canceled.
Since: 5.0

Rhino.UI.Dialogs.ShowListBox(System.String,System.String,System.Collections.IList)
Displays Rhino's list box.
title: The dialog title.
message: The dialog message.
items: A list of items to show.
Returns: The selected item if successful, null on cancel.
Since: 5.0

Rhino.UI.Dialogs.ShowListBox(System.String,System.String,System.Collections.IList,System.Object)
Displays Rhino's list box.
title: The dialog title.
message: The dialog message.
items: A list of items to show.
selectedItem: The item to preselect.
Returns: The selected item if successful, null on cancel.
Since: 5.0

Rhino.UI.Dialogs.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc)
Displays Rhino's LineType list box.
title: The dialog title.
message: The dialog message.
doc: The active document.
Returns: The id of the selected item if successful, null on cancel.
Since: 6.7

Rhino.UI.Dialogs.ShowLineTypes(System.String,System.String,Rhino.RhinoDoc,System.Guid)
title:
message:
doc:
selectedLineTypeId:
Returns:
Since: 8.0

Rhino.UI.Dialogs.ShowPrintWidths(System.String,System.String)
Shows the print widths dialogs
title:
message:
Returns: The selected print width
Since: 8.0

Rhino.UI.Dialogs.ShowPrintWidths(System.String,System.String,System.Double)
Shows the print widths dialogs
title:
message:
selectedWidth:
Returns: The selected print width
Since: 8.0

Rhino.UI.Dialogs.ShowCheckListBox(System.String,System.String,System.Collections.IList,System.Collections.Generic.IList{System.Boolean})
Displays Rhino's check list box.
title: The dialog title.
message: The dialog message.
items: A list of items to show.
checkState: A list of true/false boolean values.
Returns: An array or boolean values determining if the user checked the corresponding box. On error, null.
Since: 5.0

Rhino.UI.Dialogs.ShowEditBox(System.String,System.String,System.String,System.Boolean,System.String@)
Displays Rhino's string edit box.
title: The dialog title.
message: The dialog message.
defaultText: The default text.
multiline: Set true for multi line editing.
text: The modified text.
Returns: true of OK was clicked, false otherwise.
Since: 5.0

Rhino.UI.Dialogs.ShowNumberBox(System.String,System.String,System.Double@)
Displays Rhino's number edit box.
title: The dialog title.
message: The dialog message.
number: The default and return value.
Returns: true of OK was clicked, false otherwise.
Since: 5.0

Rhino.UI.Dialogs.ShowNumberBox(System.String,System.String,System.Double@,System.Double,System.Double)
Displays Rhino's number edit box.
title: The dialog title.
message: The dialog message.
number: The default and return value.
minimum: The minimum allowable value.
maximum: The maximum allowable value.
Returns: true of OK was clicked, false otherwise.
Since: 5.0

Rhino.UI.Dialogs.ShowPropertyListBox(System.String,System.String,System.Collections.Generic.List{System.Collections.Generic.KeyValuePair{System.String,System.String}})
Displays Rhino's property list box.
title: The dialog title.
message: The dialog message.
items: A list of key value pairs
Returns: A list of property values if successful, null otherwise.
Since: 8.0

Rhino.UI.Dialogs.ShowPropertyListBox(System.String,System.String,System.Collections.IList,System.Collections.Generic.IList{System.String})
Displays Rhino's property list box.
title: The dialog title.
message: The dialog message.
items: A list of property names.
values: A list of property values.
Returns: A list of property values if successful, null otherwise.
Since: 5.0

Rhino.UI.Dialogs.ShowMultiListBox(System.String,System.String,System.Collections.Generic.IList{System.String},System.Collections.Generic.IList{System.String})
Displays Rhino's multiple selection list box.
title: The dialog title.
message: The dialog message.
items: A list of items to show.
defaults: The items to preselect.
Returns: The selected items if successful, null on cancel.
Since: 5.12