Rhino.Geometry.SweepMiter
Miter types for creating swept surfaces
Since: 7.0

Rhino.Geometry.SweepMiter.None
No mitering

Rhino.Geometry.SweepMiter.Trimmed
If the sweep creates a polysurface with kinks, the component surfaces will be trimmed.

Rhino.Geometry.SweepMiter.Untrimmed
If the sweep creates a polysurface with kinks, the component surfaces will be untrimmed.