Rhino.FileIO.FileX_T
Support for writing X_T file format

Rhino.FileIO.FileX_T.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileX_TWriteOptions)
Write a X_T file based on the contents of a RhinoDoc
filename: path to write a file to
doc: document to get geometry from
options: options used for generating the X_T file
Returns: true on success
Since: 7.0