Rhino.UI.PanelInstance
Represents a specific instance of a panel type.  Uses by Panels,
Rhino.Render.RenderTabs and Rhino.Render.RenderPanels.  Manages interface
instance, host instance and platform specific instance of a panel object.

Rhino.UI.PanelInstance.CreateInstance(System.Guid,System.Type,System.UInt32,System.Boolean)
Dynamically create an instance of the panelType and a managed host
as necessary.  If the object and host are created successfully than
a new PanelInstance is returned which can be used to reference the
panel object.
runtimeId:
The runtime Id for this panel
panelType:
The class type to create an instance of
documentSerailNumber:
This is not saved, it is simply used to pass to the panel class
constructor if the class has a constructor that takes  document serial
number
createUnmangedHost:
If true then a unmanaged window or NSView is created to host the .NET
control otherwise only the .NET control is created.
Returns:
If the panel and native host pointer were created then return a new
PanelInstance otherwise return null on error.

Rhino.UI.PanelInstance.#ctor(System.Object,System.IntPtr,System.Object,System.UInt32)
Information regarding a specific instance of a panel object
panelObject:
nativePointer:
host:
documentSerailNumber:

Rhino.UI.PanelInstance.Dispose
IDispose implementation

Rhino.UI.PanelInstance.F1Pressed(System.Object,System.EventArgs)
Passed to Panels.Service.SetF1Hook, used for providing F1 help to a
panel if the panel implements Rhino.UI.IHelp.
sender:
e:

Rhino.UI.PanelInstance.SetBackColor
Set the host background color to the Rhino panel background color

Rhino.UI.PanelInstance.PanelObject
The dynamically created panel type object

Rhino.UI.PanelInstance.NativePointer
The native pointer associated with (hosting) the panel object

Rhino.UI.PanelInstance.Host
Placeholder for managed control host to avoid it getting garbage
collected.