Rhino.Geometry.CurveBooleanRegions
Represents the results of a Curve.CreateBooleanRegions calculation.

Rhino.Geometry.CurveBooleanRegions.#ctor(Rhino.Geometry.Curve[],Rhino.Geometry.CurveRegion[],System.Int32[],System.Double)
Internal constructor

Rhino.Geometry.CurveBooleanRegions.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor used in serialization.
info: Serialization data.
context: Serialization stream.

Rhino.Geometry.CurveBooleanRegions.RegionCount
Returns the number of curve regions. A curve region is a collection of
curves that bound a single connected region of the plane.
Since: 7.0

Rhino.Geometry.CurveBooleanRegions.RegionCurves(System.Int32)
Returns the boundary curves in a curve region. A curve region is a collection of
curves that bound a single connected region of the plane. Note, the first curve
is always the outer boundary.
regionIndex: The curve region index.
Returns: An array of boundary curves if successful, an empty array if not successful.
Since: 7.0

Rhino.Geometry.CurveBooleanRegions.PointCount
If this object were created using the Curve.CreateBooleanRegions override that
accepts a collection of points as input, then this value will be equal to the length
of the points collection.
Since: 7.0

Rhino.Geometry.CurveBooleanRegions.RegionPointIndex(System.Int32)
If this object were created using the Curve.CreateBooleanRegions override that
accepts a collection of points as input, then you this method to retrieve the
index of the point contained in a curve region.
If this.RegionPointIndex(i) = n, then points[i] is contained in this.RegionCurves(n).
If points[i] is not in any region, then this.RegionPointIndex(i) = -1.
pointIndex: The point index.
Returns:
The index of the input point contained in the specified region if successful,
or -1 if points[i] was not used in any region or if not successful.
Since: 7.0

Rhino.Geometry.CurveBooleanRegions.BoundaryCount(System.Int32)
Returns the number of boundary curves in a curve region.
regionIndex: The curve region index.
Returns: The number of boundary curves in the curve region.
Since: 7.0

Rhino.Geometry.CurveBooleanRegions.SegmentCount(System.Int32,System.Int32)
Returns the number of segments in a boundary curve in a curve region.
regionIndex: The curve region index.
boundaryIndex: The boundary curve index.
Returns: The number of curve segments in th boundary curves.
Since: 7.0

Rhino.Geometry.CurveBooleanRegions.SegmentDetails(System.Int32,System.Int32,System.Int32,Rhino.Geometry.Interval@,System.Boolean@)
Returns the details of a segment in a boundary curve in a curve region.
regionIndex: The curve region index.
boundaryIndex: The boundary curve index.
segmmentIndex: The segment index.
subDomain: The sub-domain of the planar curve used by the segment.
reversed: true if the piece of the planar curve should be reversed.
Returns: The index of the planar curve used by the specified segment if successful, -1 if not successful.
Since: 7.0

Rhino.Geometry.CurveBooleanRegions.PlanarCurveCount
Returns number of planar curves that were calculated by Curve.CreateBooleanRegions.
Since: 7.0

Rhino.Geometry.CurveBooleanRegions.PlanarCurve(System.Int32)
Returns a planar curve that was calculated by Curve.CreateBooleanRegions.
planarCurveIndex:
Returns: The planar curve if successful, null if not successful.
Since: 7.0

Rhino.Geometry.CurveBooleanRegions.IsValid
Internal validator

Rhino.Geometry.CurveBooleanRegions.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 7.0

Rhino.Geometry.CurveBooleanRegions.Dispose(System.Boolean)
This method is called with argument true when class user calls Dispose(),
while with argument false when the Garbage Collector invokes the finalizer,
or Finalize() method. You must reclaim all used unmanaged resources in both cases,
and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.