Rhino.Runtime.RhinoAccounts.SecretKey
An instance of this of this class is given to the function you pass to ExceuteProtectedCodeAsync and
must be passed to any method of the RhinoAccountsManager that requires it. Failure to do so will throw an System.InvalidOperationException.