Rhino.RhinoDoc
Represents an active model.

Rhino.RhinoDoc.ActiveDocTolerances(System.Double@,System.Double@)
Do not make this public; it is used for legacy functions that assumed
an ActiveDoc.  This gives me a single location to fix things since I
can probably figure out a "scoped" document in many cases
tolerance:
angleTolerance:

Rhino.RhinoDoc.Open(System.String,System.Boolean@)
Opens a 3dm file and makes it the active document. If called on
windows the active document will be saved and closed and the new
document will be opened and become the active document.  If called
on the Mac the file will be opened in a new document window.
filePath: Full path to the 3dm file to open
wasAlreadyOpen:
Will get set to true if there is a currently open document with the
specified path; otherwise it will get set to false.
Returns:
Returns the newly opened document on success or null on error.
Since: 6.0

Rhino.RhinoDoc.FromFilePath(System.String)
Search the open document list for a document with a Path equal
to the specified file path.
Returns: The file name to search for
filePath: The full path to the file to search for.
Since: 6.0

Rhino.RhinoDoc.OpenFile(System.String)
Since: 5.0
6.0

Rhino.RhinoDoc.ReadFile(System.String,Rhino.FileIO.FileReadOptions)
Since: 5.0

Rhino.RhinoDoc.IsReverting
MAC ONLY, always returns false on Windows.
Check to see if this document is in the process of being reverted
indicating it will get closed when the revert is completed.
Returns:
MAC ONLY, always returns false on Windows.
Returns true if running on Mac and the document is being reverted to a
previous revision.

Rhino.RhinoDoc.IsHeadless
Since: 7.0

Rhino.RhinoDoc.Dispose
Since: 7.0

Rhino.RhinoDoc.CreateHeadless(System.String)
Create a new headless RhinoDoc from a template file
file3dmTemplatePath:
Name of a Rhino model to use as a template to initialize the document.
If null, an empty document is created
Returns:
New RhinoDoc on success. Note that this is a "headless" RhinoDoc and it's
lifetime is under your control.
Since: 7.0

Rhino.RhinoDoc.OpenHeadless(System.String)
Opens a 3DM file into a new headless RhinoDoc.
file3dmPath:
Path of a Rhino model to load.
Returns:
Since: 7.0

Rhino.RhinoDoc.OpenHeadless(System.String,Rhino.Collections.ArchivableDictionary)
Opens a file into a new headless RhinoDoc.
filePath: Path of a Rhino model to load.
options:
Returns:
Since: 8.21

Rhino.RhinoDoc.Import(System.String)
Import geometry into a RhinoDoc from a file. This can be any file format
that Rhino can import
filePath:
Returns: true on success
Since: 7.0

Rhino.RhinoDoc.Import(System.String,Rhino.Collections.ArchivableDictionary)
Import geometry into a RhinoDoc from a file. This can be any file format
that Rhino can import
filePath:
options:
Returns:
Throws System.IO.FileNotFoundException:
Since: 8.0

Rhino.RhinoDoc.Save
Save doc to disk using the document's Path
Returns:
Since: 7.0

Rhino.RhinoDoc.SaveAs(System.String)
Save doc as a 3dm to a specified path using the current Rhino file version
file3dmPath:
Returns: true on success
Since: 7.0

Rhino.RhinoDoc.SaveAs(System.String,System.Int32)
Save doc as a 3dm to a specified path
file3dmPath:
version: Rhino file version
Returns: true on success
Since: 7.0

Rhino.RhinoDoc.SaveAs(System.String,System.Int32,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Save doc as a 3dm to a specified path
file3dmPath:
version: Rhino file version
saveSmall: whether to inlcude render meshes and preview image
saveTextures: whether to include the bitmap table
saveGeometryOnly: whether to write enything besides geometry
savePluginData: whether to write plugin user data
Returns: true on success
Since: 8.0

Rhino.RhinoDoc.SaveAsTemplate(System.String)
Save this document as a template
file3dmTemplatePath:
Returns: true on success
Since: 7.0

Rhino.RhinoDoc.SaveAsTemplate(System.String,System.Int32)
Save this document as a template to a specific Rhino file version
file3dmTemplatePath:
version:
Returns: true on success
Since: 7.0

Rhino.RhinoDoc.Export(System.String)
Export the entire document to a file. All file formats that Rhino can export to
are supported by this function.
filePath:
Returns: true on success
Since: 7.0

Rhino.RhinoDoc.Export(System.String,Rhino.Collections.ArchivableDictionary)
Export the entire document to a file. All file formats that Rhino can export to
are supported by this function.
filePath:
options:
Options to help define how data should be exported.
Returns: true on success
Since: 8.0

Rhino.RhinoDoc.ExportSelected(System.String)
Export selected geometry to a file. All file formats that Rhino can export
to are supported by this function.
filePath:
Returns: true on success
Since: 7.0

Rhino.RhinoDoc.ExportSelected(System.String,Rhino.Collections.ArchivableDictionary)
Export selected geometry to a file. All file formats that Rhino can export
to are supported by this function.
filePath:
options:
Options to help define how data should be exported.
Returns: true on success
Since: 8.0

Rhino.RhinoDoc.WriteFile(System.String,Rhino.FileIO.FileWriteOptions)
Write information in this document to a file.
Note, the active document's name will be changed to that
of the path provided.
path: The name of the file to write.
options: The file writing options.
Returns: true if successful, false on failure.
Remarks:
This is the best choice for general file writing.
It handles making backups using temporary files,
locking and unlocking, loading file writing plug-ins,
and many other details.
Since: 5.0

Rhino.RhinoDoc.Write3dmFile(System.String,Rhino.FileIO.FileWriteOptions)
Write information in this document to a .3dm file.
Note, the active document's name will not be changed.
path: The name of the .3dm file to write.
options: The file writing options.
Returns: true if successful, false on failure.
Since: 6.5

Rhino.RhinoDoc.FindFile(System.String)
Search for a file using Rhino's search path.  Rhino will look in the
following places:
1. Current model folder
2. Path specified in options dialog/File tab
3. Rhino system folders
4. Rhino executable folder
filename:
Returns:
Path to existing file if found, an empty string if no file was found
Since: 5.0

Rhino.RhinoDoc.Create(System.String)
Creates a new RhinoDoc
modelTemplateFileName:
Name of a Rhino model to use as a template to initialize the document.
If the template contains views, those views are created.
If null, an empty document with no views is created
Returns:
Since: 6.4

Rhino.RhinoDoc.OpenDocuments
Returns a list of currently open Rhino documents
Returns:
Since: 6.0

Rhino.RhinoDoc.OpenDocuments(System.Boolean)
Returns a list of currently open Rhino documents
includeHeadless: pass true to include headless docs in the list
Returns:
Since: 7.2

Rhino.RhinoDoc.ActiveDoc
WARNING!! Do not use the ActiveDoc if you don't have to. Under Mac Rhino the ActiveDoc
can change while a command is running. Use the doc that is passed to you in your RunCommand
function or continue to use the same doc after the first call to ActiveDoc.
Since: 5.0

Rhino.RhinoDoc.FromId(System.Int32)
Since: 5.0
6.0

Rhino.RhinoDoc.FromRuntimeSerialNumber(System.UInt32)
Since: 6.0

Rhino.RhinoDoc.Name
Returns the name of the currently loaded Rhino document (3DM file).
Since: 5.0

Rhino.RhinoDoc.Path
Returns the path of the currently loaded Rhino document (3DM file).
Since: 5.0

Rhino.RhinoDoc.Notes
Returns or sets the document's notes.
Since: 5.0

Rhino.RhinoDoc.NotesLocked
Since: 8.6

Rhino.RhinoDoc.DateCreated
Since: 5.0

Rhino.RhinoDoc.DateLastEdited
Returns the date the document was created in Coordinated Universal Time (UTC).
Use DateTime.ToLocalTime to convert to local time.
Since: 5.0

Rhino.RhinoDoc.LinkedInstanceDefinitionUpdate
Controls if, when, and how linked and linked and embedded instance definitions are updated
when the source archive that was used to create the instance definition has changed.
Since: 8.29

Rhino.RhinoDoc.ActiveCommandId
Get the ID of the active command.
Since: 8.0

Rhino.RhinoDoc.GetGumballPlane(Rhino.Geometry.Plane@)
Returns the active plane of Rhino's auto-gumball widget.
Note, when calling from a Rhino command, make sure the command
class has the Rhino.Commands.Style.Transparent command style attribute.
plane: The active plane.
Returns: true if the auto-gumball widget is enabled and visible. False otherwise.
Since: 6.0

Rhino.RhinoDoc.ModelAbsoluteTolerance
Model space absolute tolerance.
Since: 5.0

Rhino.RhinoDoc.ModelAngleToleranceRadians
Model space angle tolerance.
Since: 5.0

Rhino.RhinoDoc.ModelAngleToleranceDegrees
Model space angle tolerance.
Since: 5.0

Rhino.RhinoDoc.ModelRelativeTolerance
Model space relative tolerance.
Since: 5.0

Rhino.RhinoDoc.ModelDistanceDisplayPrecision
Since: 5.8

Rhino.RhinoDoc.PageDistanceDisplayPrecision
Since: 5.8

Rhino.RhinoDoc.PageAbsoluteTolerance
Page space absolute tolerance.
Since: 5.0

Rhino.RhinoDoc.PageAngleToleranceRadians
Page space angle tolerance.
Since: 5.0

Rhino.RhinoDoc.PageAngleToleranceDegrees
Page space angle tolerance.
Since: 5.0

Rhino.RhinoDoc.PageRelativeTolerance
Page space relative tolerance.
Since: 5.0

Rhino.RhinoDoc.ModelDistanceDisplayMode
Gets/Sets the distance display mode for model space.
Since: 8.0

Rhino.RhinoDoc.PageDistanceDisplayMode
Gets/Sets the distance display mode for page space.
Since: 8.0

Rhino.RhinoDoc.ModelBasepoint
The base point in the model that is used when inserting the model into another as a block definition.
By default the base point in any model is 0,0,0.
Since: 6.10

Rhino.RhinoDoc.Modified
Returns or sets the document's modified flag.
Since: 5.0

Rhino.RhinoDoc.SubDAppearance
Returns or sets the appearance of all SubD objects in the document.
Remarks:
When setting this property, if the document contains SubD objects, then the document will be redrawn automatically.
Since: 7.5

Rhino.RhinoDoc.ReadFileVersion
Returns the file version of the current document.
Use this function to determine which version of Rhino last saved the document.
Returns:
The file version (e.g. 1, 2, 3, 4, etc.) or -1 if the document has not been read from disk.
Since: 5.0

Rhino.RhinoDoc.ModelUnitSystem
Since: 5.0

Rhino.RhinoDoc.GetUnitSystemName(System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Since: 5.0

Rhino.RhinoDoc.AdjustModelUnitSystem(Rhino.UnitSystem,System.Boolean)
Since: 5.0

Rhino.RhinoDoc.PageUnitSystem
Since: 5.0

Rhino.RhinoDoc.AdjustPageUnitSystem(Rhino.UnitSystem,System.Boolean)
Since: 5.0

Rhino.RhinoDoc.IsMetricUnitSystem(System.Boolean)
Determines if a document unit system is a metric unit system.
modelUnits: True to query model units, false to query page units.
Returns: Return true if the length unit is a metric unit system.
Since: 8.6

Rhino.RhinoDoc.DistanceDisplayPrecision
Since: 5.0

Rhino.RhinoDoc.GetCustomUnitSystem(System.Boolean,System.String@,System.Double@)
Get the custom unit system name and custom unit scale.
modelUnits:
Set true to get values from the document's model unit system.
Set false to get values from the document's page unit system.
customUnitName: The custom unit system name.
metersPerCustomUnit: The meters per custom unit scale.
Returns: true if successful, false otherwise.
Since: 7.9

Rhino.RhinoDoc.SetCustomUnitSystem(System.Boolean,System.String,System.Double,System.Boolean)
Changes the unit system to custom units and sets the custom unit scale.
modelUnits:
Set true to set values from the document's model unit system.
Set false to set values from the document's page unit system.
customUnitName: The custom unit system name.
metersPerCustomUnit: The meters per custom unit scale.
scale: Set true to scale existing objects.
Returns: true if successful, false otherwise.
Since: 7.9

Rhino.RhinoDoc.GetGridDefaults
Since: 8.13

Rhino.RhinoDoc.SetGridDefaults(Rhino.DocObjects.ConstructionPlaneGridDefaults)
Since: 8.13

Rhino.RhinoDoc.FormatNumber(System.Double,System.Boolean,System.Boolean)
Call this method to get string representing the specified value using
the documents display coordinate system and display precision.
value:
appendUnitSystemName:
abbreviate:
Returns:
Since: 8.0

Rhino.RhinoDoc.FormatNumber(System.Double)
Call this method to get string representing the specified value using
the documents display coordinate system and display precision.
value:
Returns:
Since: 8.0

Rhino.RhinoDoc.ActiveSpace
Get the space associated with the active viewport for this document
Since: 8.0

Rhino.RhinoDoc.IsReadOnly
Current read-only mode for this document.
true if the document can be viewed but NOT saved.
false if document can be viewed and saved.
Since: 5.0

Rhino.RhinoDoc.IsLocked
Check to see if the file associated with this document is locked.  If it is
locked then this is the only document that will be able to write the file.  Other
instances of Rhino will fail to write this document.
Since: 5.0

Rhino.RhinoDoc.IsInitializing
Since: 6.0

Rhino.RhinoDoc.IsCreating
Since: 6.0

Rhino.RhinoDoc.IsOpening
Since: 6.0

Rhino.RhinoDoc.IsAvailable
Since: 6.0

Rhino.RhinoDoc.IsClosing
Since: 6.0

Rhino.RhinoDoc.DocumentId
Gets the Document Id.
Since: 5.0

Rhino.RhinoDoc.RuntimeSerialNumber
Unique serialNumber for the document while the application is running.
This is not a persistent value.
Since: 6.0

Rhino.RhinoDoc.EarthAnchorPoint
Since: 5.0

Rhino.RhinoDoc.RenderSettings
Since: 5.0

Rhino.RhinoDoc.AnimationProperties
Since: 6.11

Rhino.RhinoDoc.CustomRenderSizes
Since: 6.0

Rhino.RhinoDoc.MeshingParameterStyle
Type of MeshingParameters currently used by the document to mesh objects
Since: 5.1

Rhino.RhinoDoc.GetMeshingParameters(Rhino.Geometry.MeshingParameterStyle)
Get MeshingParameters currently used by the document
style:
Returns:
Since: 5.1

Rhino.RhinoDoc.GetAnalysisMeshingParameters
Get analysis meshing parameters currently used by the document
Returns:
Since: 6.0

Rhino.RhinoDoc.SetCustomMeshingParameters(Rhino.Geometry.MeshingParameters)
Set the custom meshing parameters that this document will use. You must also modify the
MeshingParameterStyle property on the document to Custom if you want these meshing
parameters to be used
mp:
Since: 5.1

Rhino.RhinoDoc.GetCurrentMeshingParameters
Get the custom meshing parameters that this document will use.
Since: 6.0

Rhino.RhinoDoc.ModelSpaceHatchScale
The scale factor for hatches in model space when Hatch Scaling is enabled
Since: 6.1

Rhino.RhinoDoc.ModelSpaceHatchScalingEnabled
True if hatch scaling is enabled, false if not.
Since: 6.16

Rhino.RhinoDoc.ModelSpaceTextScale
The scale factor for text in model space when Annotation Scaling is enabled
Since: 6.1

Rhino.RhinoDoc.ModelSpaceAnnotationScalingEnabled
If ModelSpaceAnnotationScaling is on, sizes in dimstyles are multiplied by
dimscale when the annotation is displayed in a model space viewport not in a detail
Since: 6.0

Rhino.RhinoDoc.LayoutSpaceAnnotationScalingEnabled
If LayoutSpaceAnnotationScaling is on, sizes in dimstyles are multiplied by
dimscale when the annotation is displayed in a detail viewport not in a detail
Since: 6.0

Rhino.RhinoDoc.Worksession
Provides access to the document's worksession.
Since: 6.0

Rhino.RhinoDoc.Views
Since: 5.0

Rhino.RhinoDoc.Objects
Since: 5.0

Rhino.RhinoDoc.Manifest
Since: 6.0

Rhino.RhinoDoc.CreateDefaultAttributes
Gets the default object attributes for this document.
The attributes will be linked to the currently active layer
and they will inherit the Document WireDensity setting.
Since: 5.0

Rhino.RhinoDoc.Bitmaps
bitmaps used in textures, backgrounds, wallpapers, ...
Since: 5.0

Rhino.RhinoDoc.Materials
Materials in the document.
Since: 5.0

Rhino.RhinoDoc.Linetypes
Linetypes in the document.
Since: 5.0

Rhino.RhinoDoc.Layers
Layers in the document.
Since: 5.0

Rhino.RhinoDoc.Groups
Since: 5.0

Rhino.RhinoDoc.Fonts
Since: 5.0

Rhino.RhinoDoc.DimStyles
Since: 5.0

Rhino.RhinoDoc.Lights
Since: 5.0

Rhino.RhinoDoc.HatchPatterns
Since: 5.0

Rhino.RhinoDoc.InstanceDefinitions
Since: 5.0

Rhino.RhinoDoc.NamedConstructionPlanes
Collection of named construction planes.
Since: 5.0

Rhino.RhinoDoc.NamedViews
Collection of named views.
Since: 5.0

Rhino.RhinoDoc.Strings
Collection of document user data strings in this document
Since: 5.0

Rhino.RhinoDoc.RuntimeData
Collection of document runtime data. This is a good place to
put non-serializable, per document data, such as panel view models.
Note well: This data will be dispose with the document and does not
get serialized.
The runtime document data table.
Since: 6.3

Rhino.RhinoDoc.NamedPositions
Collection of named positions.
Since: 6.0

Rhino.RhinoDoc.Snapshots
Collection of snapshots.
Since: 6.7

Rhino.RhinoDoc.NamedLayerStates
Collection of named layer states.
Since: 6.14

Rhino.RhinoDoc.RenderMaterials
Since: 5.7

Rhino.RhinoDoc.RenderEnvironments
Since: 5.7

Rhino.RhinoDoc.RenderTextures
Since: 5.7

Rhino.RhinoDoc.CurrentEnvironment
Access to the current environment for various uses
Since: 6.0

Rhino.RhinoDoc.PostEffects
Access to the post effects
Since: 7.0

Rhino.RhinoDoc.GetRenderPrimitives(System.Boolean,System.Boolean)
Get a enumerable list of custom mesh primitives
forceTriangleMeshes:
If true all mesh faces will be triangulated
quietly:
Iterate quietly, if true then no user interface will be displayed
Returns:
Since: 6.0
8.0

Rhino.RhinoDoc.GetRenderPrimitives(Rhino.DocObjects.ViewportInfo,System.Boolean,System.Boolean)
Get a enumerable list of custom mesh primitives
viewport:
The rendering view camera.
forceTriangleMeshes:
If true all mesh faces will be triangulated
quietly:
Iterate quietly, if true then no user interface will be displayed
Returns:
Since: 6.0
8.0

Rhino.RhinoDoc.GetRenderPrimitives(System.Guid,Rhino.DocObjects.ViewportInfo,System.Boolean,System.Boolean)
Get a enumerable list of custom mesh primitives
plugInId:
The Id of the plug-in creating the iterator.
viewport:
The rendering view camera.
forceTriangleMeshes:
If true all mesh faces will be triangulated
quietly:
Iterate quietly, if true then no user interface will be displayed
Returns:
Since: 6.0
8.0

Rhino.RhinoDoc.HasCustomRenderMeshes(Rhino.Geometry.MeshType,Rhino.DocObjects.ViewportInfo,Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Flags@,Rhino.PlugIns.PlugIn,Rhino.Display.DisplayPipelineAttributes)
Returns true if the document has a set of custom render primitives - ie, CustomRenderMeshes will return non-null.
mt: The mesh type requested (render or analysis).
vp: The viewport being rendered.
flags: See MeshProvider.Flags
plugin: The requesting plug-in (typically the calling plugin)
attrs: Display attributes for the caller - null if this is a full rendering.
Returns: Returns true if the object will has a set of custom render primitives
/// Rhino.RhinoDoc.RenderMeshes(Rhino.Geometry.MeshType,Rhino.DocObjects.ViewportInfo,Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Flags@,Rhino.PlugIns.PlugIn,Rhino.Display.DisplayPipelineAttributes)
Since: 8.0

Rhino.RhinoDoc.RenderMeshes(Rhino.Geometry.MeshType,Rhino.DocObjects.ViewportInfo,Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Flags@,Rhino.PlugIns.PlugIn,Rhino.Display.DisplayPipelineAttributes)
Returns a set of non-object custom render primitives for this document.
mt: The mesh type requested (render or analysis).
vp: The viewport being rendered
flags: See MeshProvider.Flags
plugin: The requesting plug-in (typically the calling plugin)
attrs: Display attributes for the caller - null if this is a full rendering.
Returns:  Returns a set of custom render primitives for this object
Rhino.RhinoDoc.HasCustomRenderMeshes(Rhino.Geometry.MeshType,Rhino.DocObjects.ViewportInfo,Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Flags@,Rhino.PlugIns.PlugIn,Rhino.Display.DisplayPipelineAttributes)
Since: 8.0

Rhino.RhinoDoc.CustomRenderMeshesBoundingBox(Rhino.Geometry.MeshType,Rhino.DocObjects.ViewportInfo,Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Flags@,Rhino.PlugIns.PlugIn,Rhino.Display.DisplayPipelineAttributes,Rhino.Geometry.BoundingBox@)
Returns the bounding box of custom render primitives for this object .
mt: The mesh type requested (render or analysis).
vp: The viewport being rendered
flags: See MeshProvider.Flags
plugin: The requesting plug-in (typically the calling plugin)
attrs: Display attributes for the caller - null if this is a full rendering.
boundingBox: The requested bounding box
Returns: True if the process was a success
Since: 8.0

Rhino.RhinoDoc.GroundPlane
Gets the ground plane of this document.
Throws Rhino.Runtime.RdkNotLoadedException: If the RDK is not loaded.
Since: 5.0
8.0

Rhino.RhinoDoc.GetEmbeddedFilesList(System.Boolean)
Since: 6.0

Rhino.RhinoDoc.InGet
Returns true if currently in a GetPoint.Get(), GetObject.GetObjects(), or GetString.Get()

Rhino.RhinoDoc.InGetPoint
Returns true if currently in a GetPoint.Get().
Since: 8.5

Rhino.RhinoDoc.InGetPointWithBasePoint(Rhino.Geometry.Point3d@)
Returns true if currently in a GetPoint.Get(), GetObject.GetObjects(), or GetString.Get()

Rhino.RhinoDoc.InGetObject
Returns true if currently in a GetPoint.Get(), GetObject.GetObjects(), or GetString.Get()

Rhino.RhinoDoc.Audit(Rhino.FileIO.TextLog,System.Boolean)
Audits the contents of the document.
textLog: If an error is detected, then a description of the error is logged here.
attemptRepair: If true, then the method attempts to repair any detected errors.
Returns: True if document is valid.
Since: 8.19

Rhino.RhinoDoc.IsSendingMail
true if Rhino is in the process of sending this document as an email attachment.
Since: 5.0

Rhino.RhinoDoc.TemplateFileUsed
name of the template file used to create this document. This is a runtime value
only present if the document was newly created.
Since: 5.0

Rhino.RhinoDoc.ClearUndoRecords(System.Boolean)
Since: 5.0

Rhino.RhinoDoc.ClearUndoRecords(System.UInt32,System.Boolean)
Since: 6.0

Rhino.RhinoDoc.ClearRedoRecords
Since: 5.0

Rhino.RhinoDoc.UndoRecordingEnabled
Since: 5.0

Rhino.RhinoDoc.UndoRecordingIsActive
true if undo recording is actually happening now.
Since: 5.0

Rhino.RhinoDoc.BeginUndoRecord(System.String)
Instructs Rhino to begin recording undo information when the document
is changed outside of a command. We use this, e.g., to save changes
caused by the modeless layer or object properties dialogs
when commands are not running.
description: A text describing the record.
Returns:
Serial number of record.  Returns 0 if record is not started
because undo information is already being recorded or
undo is disabled.
Since: 5.0

Rhino.RhinoDoc.NextUndoRecordSerialNumber
The serial number that will be assigned to the next undo record that is
constructed.
Since: 6.0

Rhino.RhinoDoc.CurrentUndoRecordSerialNumber
>0: undo recording is active and being saved on the undo record with
the specified serial number.
0: undo recording is not active. (Disabled or nothing is being
recorded.)
Since: 6.0

Rhino.RhinoDoc.Undo
Undo the last action
Returns:  true on success
Since: 6.16

Rhino.RhinoDoc.Redo
Redo the last action that was "undone"
Returns:  true on success
Since: 6.16

Rhino.RhinoDoc.AddCustomUndoEvent(System.String,System.EventHandler{Rhino.Commands.CustomUndoEventArgs})
Since: 5.0

Rhino.RhinoDoc.AddCustomUndoEvent(System.String,System.EventHandler{Rhino.Commands.CustomUndoEventArgs},System.Object)
Add a custom undo event so you can undo private plug-in data
when the user performs an undo or redo
description:
handler:
tag:
Returns:
Since: 5.0

Rhino.RhinoDoc.EndUndoRecord(System.UInt32)
Ends the undo record.
undoRecordSerialNumber: The serial number of the undo record.
Returns: True if successful, false otherwise.
Since: 5.0

Rhino.RhinoDoc.UndoActive
Returns true if Undo is currently active.
Since: 6.0

Rhino.RhinoDoc.RedoActive
Returns true if Redo is currently active.
Since: 6.0

Rhino.RhinoDoc.ExtractPreviewImage(System.String)
Extracts the bitmap preview image from the specified .3dm file.
The .3dm file from which to extract the preview image.
If null, the path to the active document is used.
Returns: The preview bitmap if successful, null otherwise.
Since: 5.0

Rhino.RhinoDoc.SelectRenderContentInEditor(Rhino.Render.RenderContentCollection,System.Boolean)
Selects a collection of contents in any editors they appear in.
collection: A collection of RenderContents to select
append: Append to current selection
Since: 7.20

Rhino.RhinoDoc.SupportsRenderPrimitiveList(Rhino.DocObjects.ViewportInfo,Rhino.Display.DisplayPipelineAttributes)
Determines if custom render meshes will be built for this document (i.e. - GH meshes).
viewport: The viewport being rendered.
attrs:
Type of mesh to build. If attrs is non-null then a smaller mesh may be
generated in less time, false is meant when actually rendering.
Returns:
Returns true if custom render mesh(es) will get built for this document.
Since: 6.9
8.0

Rhino.RhinoDoc.GetRenderPrimitiveList(Rhino.DocObjects.ViewportInfo,Rhino.Display.DisplayPipelineAttributes)
Build custom render mesh(es) for this document (i.e. - GH meshes).
viewport: The viewport being rendered.
attrs:
Attributes for the view mode you are supplying meshes for.  Will be null if this is a modal rendering.
Returns:
Returns a RenderPrimitiveList if successful otherwise returns null.
Since: 6.9
8.0

Rhino.RhinoDoc.TryGetRenderPrimitiveBoundingBox(Rhino.DocObjects.ViewportInfo,Rhino.Display.DisplayPipelineAttributes,Rhino.Geometry.BoundingBox@)
Get the bounding box for the custom render meshes associated with this
document (i.e. - GH meshes).
viewport: The viewport being rendered.
attrs:
Attributes for the view mode you are supplying meshes for.  Will be null if this is a modal rendering.
boundingBox:
This will be set to BoundingBox.Unset on failure otherwise it will be
the bounding box for the custom render meshes associated with this
object.
Returns:
Returns true if the bounding box was successfully calculated otherwise
returns false on error.
Since: 6.9
8.0

Rhino.RhinoDoc.IsCommandRunning
Returns true if Rhino is currently running a command.
Since: 7.0

Rhino.RhinoDoc.InCommand(System.Boolean)
This is a low level tool to determine if Rhino is currently running a command.
bIgnoreScriptRunnerCommands:
If true, script running commands, like "ReadCommandFile" and the
RhinoScript plug-ins "RunScript" command, are not counted.
Returns: Number of active commands.
Since: 8.0

Rhino.RhinoDoc.CloseDocument
Since: 5.0

Rhino.RhinoDoc.NewDocument
Since: 5.0

Rhino.RhinoDoc.ActiveDocumentChanged
This event is raised when the active document used by modeless user
interface changes.  On Mac Rhino this will get raised before the
Rhino.RhinoDoc.NewDocument, Rhino.RhinoDoc.BeginOpenDocument and
Rhino.RhinoDoc.EndOpenDocument events.  Mac Rhino will also raise this
event with 0 for the document Id and a null document pointer when the
last document is closed.  Windows Rhino will raise this event after the
Rhino.RhinoDoc.NewDocument, Rhino.RhinoDoc.BeginOpenDocument and
Rhino.RhinoDoc.EndOpenDocument events when a new or existing model is
opened.
Since: 6.0

Rhino.RhinoDoc.DocumentPropertiesChanged
Since: 5.0

Rhino.RhinoDoc.UnitsChangedWithScaling
Called when a change in the model units results in a scaling operation on all of the objects in the document.
This call is made before any of the objects are scaled.
A call to RhinoDoc.DocumentPropertiesChanged follows.
Since: 7.20

Rhino.RhinoDoc.UserStringChanged
This event is raised when document user text strings are changed

Rhino.RhinoDoc.BeginOpenDocument
This event is raised when the document open operation begins.
NOTE: On Windows, this event will be fired when a clipboard paste
operation occurs, as Rhino opens a .tmp file in the User's
Local folder with the contents of the pasted document.
Since: 5.0

Rhino.RhinoDoc.EndOpenDocument
Since: 5.0

Rhino.RhinoDoc.EndOpenDocumentInitialiViewUpdate
This event is raised after Rhino.RhinoDoc.EndOpenDocument when the
documents initial views have been created and initialized.
Since: 5.11

Rhino.RhinoDoc.EndOpenDocumentInitialViewUpdate
This event is raised after Rhino.RhinoDoc.EndOpenDocument when the
documents initial views have been created and initialized.
Since: 6.18

Rhino.RhinoDoc.BeginSaveDocument
Since: 5.0

Rhino.RhinoDoc.EndSaveDocument
Since: 5.0

Rhino.RhinoDoc.AddRhinoObject
Called if a new object is added to the document.
Since: 5.0

Rhino.RhinoDoc.DeleteRhinoObject
Called if an object is deleted. At some later point the object can be un-deleted.
Since: 5.0

Rhino.RhinoDoc.ReplaceRhinoObject
Called if an object is about to be replaced.
If both RhinoDoc.UndoActive() and RhinoDoc.RedoActive() return false,
then immediately after the ReplaceObject event, there will be a DeleteObject
event followed by an AddObject event.
If either RhinoDoc.UndoActive() or RhinoDoc::RedoActive() return true,
then immediately after the ReplaceObject event, there will be a DeleteObject
event followed by an UndeleteObject event.
Since: 5.0

Rhino.RhinoDoc.UndeleteRhinoObject
Called if an object is un-deleted.
Since: 5.0

Rhino.RhinoDoc.PurgeRhinoObject
Called if an object is being purged from a document. The object will cease to exist forever.
Since: 5.0

Rhino.RhinoDoc.SelectObjects
Called when object(s) are selected.
Since: 5.0

Rhino.RhinoDoc.DeselectObjects
Called when object(s) are deselected.
Since: 5.0

Rhino.RhinoDoc.DeselectAllObjects
Called when all objects are deselected.
Since: 5.0

Rhino.RhinoDoc.ModifyObjectAttributes
Called when all object attributes are changed.
Since: 5.0

Rhino.RhinoDoc.BeforeTransformObjects
Called before objects are being transformed
Since: 5.10

Rhino.RhinoDoc.AfterTransformObjects
Called after objects are being transformed
Since: 8.15

Rhino.RhinoDoc.LayerTableEvent
Called when any modification happens to a document's layer table.
Since: 5.0

Rhino.RhinoDoc.LinetypeTableEvent
Called when any modification happens to a document's linetype table.
Since: 8.0

Rhino.RhinoDoc.HatchPatternTableEvent
Called when any modification happens to a document's hatch pattern table.
Since: 8.15

Rhino.RhinoDoc.DimensionStyleTableEvent
Called when any modification happens to a document's dimension style table.
Since: 6.0

Rhino.RhinoDoc.InstanceDefinitionTableEvent
Called when any modification happens to a document's instance definition table.
Since: 5.3

Rhino.RhinoDoc.GroupTableEvent
Called when any modification happens to a document's group table.
Since: 5.0

Rhino.RhinoDoc.LightTableEvent
Called when any modification happens to a document's light table.
Since: 5.3

Rhino.RhinoDoc.MaterialTableEvent
Called when any modification happens to a document's material table.
Since: 5.0

Rhino.RhinoDoc.RenderMaterialsTableEvent
Called when the Rhino.Render.RenderMaterialTable has been loaded, is
about to be cleared or has been cleared.  See Rhino.RhinoDoc.RenderContentTableEventType for more
information.
Since: 5.7

Rhino.RhinoDoc.RenderEnvironmentTableEvent
Called when the Rhino.Render.RenderEnvironmentTable has been loaded, is
about to be cleared or has been cleared.  See Rhino.RhinoDoc.RenderContentTableEventType for more
information.
Since: 5.7

Rhino.RhinoDoc.RenderTextureTableEvent
Called when the Rhino.Render.RenderTextureTable has been loaded, is
about to be cleared or has been cleared.  See Rhino.RhinoDoc.RenderContentTableEventType for more
information.
Since: 5.7

Rhino.RhinoDoc.TextureMappingEvent
Called when any modification happens to a document objects texture mapping.
Since: 5.8