Rhino.UI.ObjectPropertiesPageEventArgs


Rhino.UI.ObjectPropertiesPageEventArgs.#ctor(Rhino.UI.ObjectPropertiesPage)
Used by Rhino.UI.ObjectPropertiesPage to notify the page when
updating, modifying or determining if the page should be included
in the navigation bar
page:
Page sending the message
Since: 6.0

Rhino.UI.ObjectPropertiesPageEventArgs.Page
The page sending these arguments
Since: 6.0

Rhino.UI.ObjectPropertiesPageEventArgs.EventRuntimeSerialNumber
Gets the runtime serial number.
The runtime serial number.
Since: 6.14

Rhino.UI.ObjectPropertiesPageEventArgs.Objects
Return a list of Rhino objects to be processed by this object properties page
Since: 6.0

Rhino.UI.ObjectPropertiesPageEventArgs.IncludesObjectsType``1
Return true if any of the selected objects match the given type
Returns:
Since: 6.0

Rhino.UI.ObjectPropertiesPageEventArgs.IncludesObjectsType``1(System.Boolean)
Return true if any of the selected objects match the given type
allMustMatch:
If true then every selected object must match the object type
otherwise; only a single object has to be of the specified type
Returns:
Since: 6.7

Rhino.UI.ObjectPropertiesPageEventArgs.IncludesObjectsType(Rhino.DocObjects.ObjectType)
objectTypes:
Returns:
Since: 6.0

Rhino.UI.ObjectPropertiesPageEventArgs.IncludesObjectsType(Rhino.DocObjects.ObjectType,System.Boolean)
objectTypes:
allMustMatch:
If true then every selected object must match the object type
otherwise; only a single object has to be of the specified type
Returns:
Since: 6.7

Rhino.UI.ObjectPropertiesPageEventArgs.GetObjects``1
Get selected objects of a given type
Returns:
Since: 6.0

Rhino.UI.ObjectPropertiesPageEventArgs.GetObjects(Rhino.DocObjects.ObjectType)
Get selected objects that match a given filter
filter:
Returns:
Since: 6.0

Rhino.UI.ObjectPropertiesPageEventArgs.ObjectCount
Returns:
Since: 6.0

Rhino.UI.ObjectPropertiesPageEventArgs.ObjectTypes
Since: 6.0

Rhino.UI.ObjectPropertiesPageEventArgs.View
Active view
Since: 6.0

Rhino.UI.ObjectPropertiesPageEventArgs.Viewport
Active viewport
Since: 6.0

Rhino.UI.ObjectPropertiesPageEventArgs.DocRuntimeSerialNumber
Document containing the objects and views
Since: 6.0

Rhino.UI.ObjectPropertiesPageEventArgs.Document
Document containing the objects and views
Since: 6.0