Rhino.Geometry.SubDCreationOptions.ConcaveCornerOption
Defines how concave corners are treated.

Rhino.Geometry.SubDCreationOptions.ConcaveCornerOption.Unset
The option is not set.

Rhino.Geometry.SubDCreationOptions.ConcaveCornerOption.None
No concave corners. In general, this is the best choice.

Rhino.Geometry.SubDCreationOptions.ConcaveCornerOption.AtMeshCorner
A concave subd corner will appear at input mesh boundary vertices
where the corner angle >= MinimumConcaveCornerAngleRadians() and
the number of edges the end at the vertex is >= MinimumConcaveCornerEdgeCount().