Rhino.DocObjects.SectionLabelStyle
The source of sectioning attributes on an object.
Since: 8.0

Rhino.DocObjects.SectionLabelStyle.None
No label

Rhino.DocObjects.SectionLabelStyle.TextDotFromName
Label shown as a text dot with content from name

Rhino.DocObjects.SectionLabelStyle.TextFromName
Label shown as text with content from name