Rhino.Runtime.RhinoAccounts.IOpenIDConnectToken
This class represents an OpenIDConnect token issued from an OpenID provider. The token is immutable.

Rhino.Runtime.RhinoAccounts.IOpenIDConnectToken.Sub
The unique id for the subject this token represents.
Since: 7.0

Rhino.Runtime.RhinoAccounts.IOpenIDConnectToken.MemberGroups
Returns all the groups the user is a member of, but not an admin or an owner.
Since: 7.0

Rhino.Runtime.RhinoAccounts.IOpenIDConnectToken.AdminGroups
Returns all the groups the user is an admin of.
Since: 7.0

Rhino.Runtime.RhinoAccounts.IOpenIDConnectToken.OwnerGroups
Returns all the groups the user is an owner of.
Since: 7.0

Rhino.Runtime.RhinoAccounts.IOpenIDConnectToken.AllGroups
Returns all the groups the user is a member of.
Since: 7.0

Rhino.Runtime.RhinoAccounts.IOpenIDConnectToken.UpdatedAt
The last time the token was updated.
Since: 7.0

Rhino.Runtime.RhinoAccounts.IOpenIDConnectToken.Iat
The date the token was issued.
Since: 7.0

Rhino.Runtime.RhinoAccounts.IOpenIDConnectToken.Exp
The date the token expires.
Since: 7.0

Rhino.Runtime.RhinoAccounts.IOpenIDConnectToken.Iss
The id of the entity that issued the token.
Since: 7.0

Rhino.Runtime.RhinoAccounts.IOpenIDConnectToken.Aud
The id of the client (the audience) this token is intended for.
Since: 7.0

Rhino.Runtime.RhinoAccounts.IOpenIDConnectToken.AuthTime
Time when the End-User authentication occurred
Since: 7.0

Rhino.Runtime.RhinoAccounts.IOpenIDConnectToken.Nonce
String value used to associate a Client session with an ID Token, and to mitigate replay attacks
Since: 7.0

Rhino.Runtime.RhinoAccounts.IOpenIDConnectToken.AtHash
Access Token hash value. Its value is the base64url encoding of the left-most half of the hash of the octets of the ASCII representation of the access_token value, where the hash algorithm used is the hash algorithm used in the alg Header Parameter of the ID Token's JOSE Header. For instance, if the alg is RS256, hash the access_token value with SHA-256, then take the left-most 128 bits and base64url encode them. The at_hash value is a case sensitive string.
Since: 7.0

Rhino.Runtime.RhinoAccounts.IOpenIDConnectToken.Emails
All the emails belonging to the account the token represents.
Since: 7.0

Rhino.Runtime.RhinoAccounts.IOpenIDConnectToken.EmailVerified
true if all the emails in the account have been verified; false otherwise.
Since: 7.0

Rhino.Runtime.RhinoAccounts.IOpenIDConnectToken.Name
The name of the user this token represents.
Since: 7.0

Rhino.Runtime.RhinoAccounts.IOpenIDConnectToken.Phone
The phone of the user this token represents.
Since: 7.0

Rhino.Runtime.RhinoAccounts.IOpenIDConnectToken.Locale
The local of the user this token represents.  ISO 639-1 Alpha-2 [ISO639‑1] language code and an ISO 3166-1 Alpha-2 [ISO3166‑1] country code in, separated by a dash.
Since: 7.0

Rhino.Runtime.RhinoAccounts.IOpenIDConnectToken.Picture
The url of a picture/avatar/icon of the user this token represents.
Since: 7.0

Rhino.Runtime.RhinoAccounts.IOpenIDConnectToken.RawToken
The raw OpenIDConnect token.
Since: 7.0

Rhino.Runtime.RhinoAccounts.IOpenIDConnectToken.IsExpired
true if the token is expired; false otherwise.
Since: 7.0

Rhino.Runtime.RhinoAccounts.IOpenIDConnectToken.IsUpdated
true if the token has been updated; false otherwise.
Since: 7.0