Rhino.Input.Custom.TaskCompleteEventArgs.#ctor(System.Threading.Tasks.Task,Rhino.RhinoDoc)
Since: 6.0

Rhino.Input.Custom.TaskCompleteEventArgs.Task
Since: 6.0

Rhino.Input.Custom.TaskCompleteEventArgs.Doc
Since: 6.0

Rhino.Input.Custom.TaskCompleteEventArgs.Redraw
Since: 6.0