Rhino.DocObjects.TextureFilter
Determines how the color of the image pixel is calculated when the image
pixel corresponds to multiple texture bitmap pixels.
Since: 8.3

Rhino.DocObjects.TextureFilter.Nearest
Nearest texture pixel is used.

Rhino.DocObjects.TextureFilter.Linear
Weighted average of corresponding texture pixels.