Rhino.FileIO.FileTxtWriteOptions
Options for writing a Txt file.

Rhino.FileIO.FileTxtWriteOptions.Delimiter
Since: 8.0

Rhino.FileIO.FileTxtWriteOptions.DelimiterCharacter
Since: 8.0

Rhino.FileIO.FileTxtWriteOptions.Precision
Since: 8.0

Rhino.FileIO.FileTxtWriteOptions.ExportVertexColors
Since: 8.0

Rhino.FileIO.FileTxtWriteOptions.SurroundWithDoubleQuotes
Since: 8.0

Rhino.FileIO.FileTxtWriteOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0