Rhino.Runtime.InteropWrappers.SimpleArrayMeshPointer
Represents a wrapper to an unmanaged array of mesh pointers.
Wrapper for a C++ ON_SimpleArray of ON_Mesh* or constant ON_Mesh*. If you are not
writing C++ code then this class is not for you.

Rhino.Runtime.InteropWrappers.SimpleArrayMeshPointer.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayMeshPointer.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayMeshPointer.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayMeshPointer instance.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayMeshPointer.Count
Gets the amount of meshes in this array.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayMeshPointer.Add(Rhino.Geometry.Mesh,System.Boolean)
Adds a mesh to the list.
mesh: A mesh to add.
asConst: Whether this mesh should be treated as non-modifiable.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayMeshPointer.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.SimpleArrayMeshPointer.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayMeshPointer.Dispose(System.Boolean)
disposing:

Rhino.Runtime.InteropWrappers.SimpleArrayMeshPointer.ToNonConstArray
Copies the unmanaged array to a managed counterpart.
Returns: The managed array.
Since: 5.0