Rhino.Geometry.NurbsMultiMatcher.EdgeContinuityOption


Rhino.Geometry.NurbsMultiMatcher.EdgeContinuityOption.Unset


Rhino.Geometry.NurbsMultiMatcher.EdgeContinuityOption.Loose


Rhino.Geometry.NurbsMultiMatcher.EdgeContinuityOption.Position


Rhino.Geometry.NurbsMultiMatcher.EdgeContinuityOption.Tangency


Rhino.Geometry.NurbsMultiMatcher.EdgeContinuityOption.Curvature
