Rhino.Geometry.SubDDisplayParameters.Density
Density enumeration
Since: 7.18

Rhino.Geometry.SubDDisplayParameters.Density.UnsetDensity
Indicates the SubD display mesh density has not be set.

Rhino.Geometry.SubDDisplayParameters.Density.MinimumUserInterfaceDensity
The minimum SubD display density that can be se in Rhino user interface is ExtraCoarseDensity (1).

Rhino.Geometry.SubDDisplayParameters.Density.MaximumUserInterfaceDensity
The maximum SubD display density that can be se in Rhino user interface is ExtraFineDensity (5).

Rhino.Geometry.SubDDisplayParameters.Density.MinimumAdaptiveDensity
SubD display density values <= MinimumAdaptiveDensity will never be adaptively reduced.
SubD display density values > MinimumAdaptiveDensity may be adaptively reduced to a value >= MinimumAdaptiveDensity.

Rhino.Geometry.SubDDisplayParameters.Density.MinimumDensity
Each SubD quad will generate 1 display mesh quads in a 1x1 grid.
This density can only be used with SubDs where every face is a quad.
User interface code never returns this density.

Rhino.Geometry.SubDDisplayParameters.Density.ExtraCoarseDensity
When interpreted as an absolute SubD display density, each SubD quad will generate
4 display mesh quads in a 2x2 grid and each SubD N-gon will generate N display mesh quads.
Adaptive reductions do not apply to this density.
This is the minimum SubD display density.

Rhino.Geometry.SubDDisplayParameters.Density.CoarseDensity
When interpreted as an absolute SubD display density, each SubD quad will generate
16 display mesh quads in a 4x4 grid and each SubD N-gon will generate N*4 display mesh quads.
Adaptive reductions do not apply to this density.

Rhino.Geometry.SubDDisplayParameters.Density.MediumDensity
When interpreted as an absolute SubD display density, each SubD quad will generate
64 display mesh quads in an 8x8 grid and each SubD N-gon will generate N*8 display mesh quads.
When a SubD has more than 8000 faces, adaptive MediumDensity is reduced to CoarseDensity.

Rhino.Geometry.SubDDisplayParameters.Density.FineDensity
When interpreted as an absolute SubD display density, each SubD quad will generate
256 display mesh quads in a 16x16 grid and each SubD N-gon will generate N*16 display mesh quads.
When a SubD has more than 2000 faces, adaptive FineDensity is reduced to adaptive MediumDensity.

Rhino.Geometry.SubDDisplayParameters.Density.DefaultDensity
When interpreted as an absolute SubD display density, each SubD quad will generate
256 display mesh quads in a 16x16 grid and each SubD N-gon will generate N*16 display mesh quads.
When a SubD has more than 2000 faces, adaptive DefaultDensity is reduced to adaptive MediumDensity.
This is the default value for creating mesh approximations of SubD surface.
When treadted as an adaptive setting, it produces acceptable results for most SubDs.

Rhino.Geometry.SubDDisplayParameters.Density.ExtraFineDensity
When interpreted as an absolute SubD display density, each SubD quad will generate
1024 display mesh quads in a 32x32 grid and each SubD N-gon will generate N*32 display mesh quads.
When a SubD has more than 500 faces, adaptive ExtraFineDensity is reduced to adaptive FineDensity.

Rhino.Geometry.SubDDisplayParameters.Density.MaximumDensity
When interpreted as an absolute SubD display density, each SubD quad will generate
4096 display mesh quads in a 64x64 grid and each SubD N-gon will generate N*64 display mesh quads.
SubDDisplayParameters.AdaptiveDensity() determines if the subd display density is
treated adaptively or absolutely.
This value creates ridiculously dense display meshes and should generally be avoided.
No Rhino user interface will create this value.