Rhino.UI.Controls.ExpandableContentUI
[AddCustomUISections]
This class extends ContentUI to represent the default user interface which
the RDK provides for a content.This is the UI created by the default implementation
of CRhRdkCoreContent::CreateUI(). The main feature of this implementation is a 'holder'
containing one or more expandable 'sections' (AKA 'roll-ups').

Rhino.UI.Controls.ExpandableContentUI.#ctor(System.IntPtr)
Interna Constructor

Rhino.UI.Controls.ExpandableContentUI.AddSection(Rhino.UI.Controls.ICollapsibleSection)
Add a section to the UI. Called \e before Create(). A generic controller is attached.
pSection:
Since: 7.11

Rhino.UI.Controls.ExpandableContentUI.AddSection(Rhino.UI.Controls.ICollapsibleSection,Rhino.UI.Controls.IRdkViewModel)
Add a section to the UI with a custom controller. Called \e before Create().
Since: 7.11