Rhino.Display.ColorCMYK
Represents a CMYK (Cyan, Magenta, Yellow, Key) color with double precision floating point channels.
CMYK colors are used primarily in printing environments as they provide a good simulation of physical ink.

Rhino.Display.ColorCMYK.m_a
Alpha values are inverted internally! 0 = opaque; 1 = transparent!

Rhino.Display.ColorCMYK.#ctor(System.Drawing.Color)
Initializes a new instance of ColorCMYK that is equivalent to an ARGB color.
rgb: ARGB color to mimic.
Remarks: Exact conversions between color spaces are often not possible.
Since: 5.0

Rhino.Display.ColorCMYK.#ctor(System.Double,System.Double,System.Double)
Initializes a new instance of ColorCMYK with custom channel values.
The cyan, magenta and yellow values will be adjusted based on their
combined darkness.
cyan: Cyan channel hint.
magenta: Magenta channel hint.
yellow: Yellow channel hint.
Since: 5.0

Rhino.Display.ColorCMYK.#ctor(System.Double,System.Double,System.Double,System.Double)
Initializes a new instance of ColorCMYK with custom channel values.
cyan: Cyan channel value. Cyan channels are limited to the 0.0 and 1.0 range.
magenta: Magenta channel value. Magenta channels are limited to the 0.0 and 1.0 range.
yellow: Yellow channel value. Yellow channels are limited to the 0.0 and 1.0 range.
key: Key channel value. Key channels are limited to the 0.0 and 1.0 range.
Since: 5.0

Rhino.Display.ColorCMYK.#ctor(System.Double,System.Double,System.Double,System.Double,System.Double)
Initializes a new instance of ColorCMYK with custom channel values.
alpha: Alpha channel value. Alpha channels are limited to the 0.0 and 1.0 range.
cyan: Cyan channel value. Cyan channels are limited to the 0.0 and 1.0 range.
magenta: Magenta channel value. Magenta channels are limited to the 0.0 and 1.0 range.
yellow: Yellow channel value. Yellow channels are limited to the 0.0 and 1.0 range.
key: Key channel value. Key channels are limited to the 0.0 and 1.0 range.
Since: 5.0

Rhino.Display.ColorCMYK.CreateFromRGBA(Rhino.Display.ColorRGBA)
Create the nearest CMYK equivalent of a RGBA color.
rgba: Target color in RGBA space.
Returns: The CMYK equivalent of the RGBA color.
Since: 7.0

Rhino.Display.ColorCMYK.CreateFromHSL(Rhino.Display.ColorHSL)
Constructs the nearest CMYK equivalent of an HSL color.
hsl: Target color in HSL space.
Returns: The CMYK equivalent of the HSL color.
Since: 5.0

Rhino.Display.ColorCMYK.CreateFromXYZ(Rhino.Display.ColorXYZ)
Constructs the nearest CMYK equivalent of an XYZ color.
xyz: Target color in XYZ space.
Returns: The CMYK equivalent of the XYZ color.
Since: 5.0

Rhino.Display.ColorCMYK.CreateFromLAB(Rhino.Display.ColorLAB)
Constructs the nearest CMYK equivalent of a LAB color.
lab: Target color in LAB space.
Returns: The CMYK equivalent of the LAB color.
Since: 5.0

Rhino.Display.ColorCMYK.CreateFromLCH(Rhino.Display.ColorLCH)
Constructs the nearest CMYK equivalent of a LCH color.
lch: Target color in LCH space.
Returns: The CMYK equivalent of the LCH color.
Since: 5.0

Rhino.Display.ColorCMYK.CreateFromHSV(Rhino.Display.ColorHSV)
Constructs the nearest CMYK equivalent of an HSV color.
hsv: Target color in HSV space.
Returns: The CMYK equivalent of the HSV color.
Since: 6.0

Rhino.Display.ColorCMYK.op_Implicit(Rhino.Display.ColorCMYK)~System.Drawing.Color
Implicitly converts a CMYK color into a .Net library color.
cmyk: A CMYK color.
Returns: A ARGB .Net library color.

Rhino.Display.ColorCMYK.C
Gets or sets the Cyan channel value.
Cyan channels are limited to the 0~1 range.
Since: 5.0

Rhino.Display.ColorCMYK.M
Gets or sets the Magenta channel value.
Magenta channels are limited to the 0~1 range.
Since: 5.0

Rhino.Display.ColorCMYK.Y
Gets or sets the Yellow channel value.
Yellow channels are limited to the 0~1 range.
Since: 5.0

Rhino.Display.ColorCMYK.K
Gets or sets the Key channel value.
Key channels are limited to the 0~1 range.
Since: 5.0

Rhino.Display.ColorCMYK.A
Gets or sets the Alpha channel value.
Alpha channels are limited to the 0~1 range.
Since: 5.0