Rhino.DocObjects.ConstructionPlaneGridDefaults
Default grid settings for a document

Rhino.DocObjects.ConstructionPlaneGridDefaults.GridSpacing
Distance between grid lines
Since: 8.13

Rhino.DocObjects.ConstructionPlaneGridDefaults.SnapSpacing
When grid snap is enabled, the distance between snap points. Typically
this is the same distance as grid spacing
Since: 8.13

Rhino.DocObjects.ConstructionPlaneGridDefaults.GridLineCount
Number of grid lines in each direction
Since: 8.13

Rhino.DocObjects.ConstructionPlaneGridDefaults.GridThickFrequency
This line frequency. 0: none, 1: all lines are thick, 2: every other is
thick, ...
Since: 8.13

Rhino.DocObjects.ConstructionPlaneGridDefaults.ShowGrid
Show the grid
Since: 8.13

Rhino.DocObjects.ConstructionPlaneGridDefaults.ShowGridAxes
Show the grid axes
Since: 8.13

Rhino.DocObjects.ConstructionPlaneGridDefaults.ShowWorldAxes
Show the world axes icon in the corner
Since: 8.13