Rhino.Runtime.AssemblyResolver.ResolverContext.Assemblies
Dictionary of the Assembly instances loaded by this AssemblyResolverContext.

Rhino.Runtime.AssemblyResolver.ResolverContext.LoadFailures
Dictionary of the Assembly locations that failed to load.

Rhino.Runtime.AssemblyResolver.ResolverContext.GetCurrentDomainAssemblies
Gets the assemblies that have been loaded into the appropiate context of the
current application domain.
Returns: An array of assemblies in this application domain.

Rhino.Runtime.AssemblyResolver.ResolverContext.LoadFile(System.String)
Loads an assembly into the appropiate context, given its path.
path: The fully qualified path of the file to load.
Returns: The loaded assembly.