Rhino.Render.ChangeQueue.MeshInstance.AncestryRecord
Information about the ancestry of a MeshInstance

Rhino.Render.ChangeQueue.MeshInstance.AncestryRecord.ReferenceId
The ModelObjectId of the InstanceObject
Since: 8.2

Rhino.Render.ChangeQueue.MeshInstance.AncestryRecord.DefinitionId
The ModelObjectId of the InstanceDefinition
Since: 8.2

Rhino.Render.ChangeQueue.MeshInstance.AncestryRecord.ReferenceAttributes
The object attributes from the InstanceObject
Since: 8.2

Rhino.Render.ChangeQueue.MeshInstance.AncestryRecord.Transform
The transform from the InstanceObject
Since: 8.2

Rhino.Render.ChangeQueue.MeshInstance.AncestryRecord.Dispose(System.Boolean)
Dispose. Disposes unmanaged memory.
isDisposing:

Rhino.Render.ChangeQueue.MeshInstance.AncestryRecord.Dispose
Dispose
Since: 8.2

Rhino.Render.ChangeQueue.MeshInstance.AncestryRecord.Finalize
Finalizer