Rhino.UI.PropertyPageType
IRhinoProperties page type

Rhino.UI.PropertyPageType.Material
Replace the material page with this page; only works for the current render plug - in.

Rhino.UI.PropertyPageType.Light
Replace the light page with this page; only works for the current render plug-in.

Rhino.UI.PropertyPageType.Custom
User-defined custom object page.

Rhino.UI.PropertyPageType.ObjectProperties
For internal use only.

Rhino.UI.PropertyPageType.Dimension
If page is provided by Rhino and only dimensions are selected, activate this page.

Rhino.UI.PropertyPageType.Leader
If page is provided by Rhino and leaders are selected, activate this page.

Rhino.UI.PropertyPageType.Text
If page is provided by Rhino and only text objects are selected, activate this page.

Rhino.UI.PropertyPageType.Hatch
If page is provided by Rhino and only hatch objects are selected, activate this page.

Rhino.UI.PropertyPageType.Dot
If page is provided by Rhino and only dot objects are selected, activate this page.

Rhino.UI.PropertyPageType.TextureMapping
Replace the texture mapping page with this page; only works for the current render plug-in.

Rhino.UI.PropertyPageType.Detail
If page is provided by Rhino and only detail objects are selected, activate this page.

Rhino.UI.PropertyPageType.ClippingPlane
If page is provided by Rhino and only clipping plane objects are selected, activate this page.

Rhino.UI.PropertyPageType.NamedView
If page is provided by Rhino and only named view widget objects are selected, activate this page.

Rhino.UI.PropertyPageType.Decal
Decals user interface

Rhino.UI.PropertyPageType.View
Page is a view properties page and uses view properties methods. Does not use object properties methods.

Rhino.UI.PropertyPageType.PageCount
Reserved, do not use.