Rhino.DocObjects.LinearDimensionObject
Rhino Object that represents a linear dimension geometry and attributes

Rhino.DocObjects.LinearDimensionObject.LinearDimensionGeometry
Get the dimension geometry for this object.
Since: 6.0