Rhino.Geometry.ReduceMeshParameters
Parameters for Reduce method

Rhino.Geometry.ReduceMeshParameters.#ctor
Constructs a polygon reduction parameter object with default values.
Users of this class should not rely on default values to stay constant
across service releases.
Since: 6.0

Rhino.Geometry.ReduceMeshParameters.DesiredPolygonCount
Desired or target number of faces
Since: 6.0

Rhino.Geometry.ReduceMeshParameters.AllowDistortion
If true, faces are removed until Rhino.Geometry.ReduceMeshParameters.DesiredPolygonCount is reached, distorting
the shape as needed. If false, only flat (coplanar) regions are simplified, which leaves
the shape unchanged and ignores Rhino.Geometry.ReduceMeshParameters.DesiredPolygonCount.
Since: 6.0

Rhino.Geometry.ReduceMeshParameters.Accuracy
Integer from 1 to 10 telling how accurate reduction algorithm
to use. Greater number gives more accurate results
Since: 6.0

Rhino.Geometry.ReduceMeshParameters.NormalizeMeshSize
If true mesh is fitted to an axis aligned unit cube until reduction is complete
Since: 6.0

Rhino.Geometry.ReduceMeshParameters.Error
Since: 6.0

Rhino.Geometry.ReduceMeshParameters.FaceTags
Since: 6.0

Rhino.Geometry.ReduceMeshParameters.LockedComponents
List of topological mesh vertices and mesh vertices that will not be moved or deleted in reduction process.
Each mesh vertex will lock the corresponding topological mesh vertex. In other words it is not possible to have a
locked and non-locked mesh vertex at the same location.
Since: 6.0

Rhino.Geometry.ReduceMeshParameters.CancelToken
Since: 6.0

Rhino.Geometry.ReduceMeshParameters.ProgressReporter
Since: 6.0