Rhino.Render.SupportOptions.AlwaysShowSunPreview
Since: 6.0

Rhino.Render.SupportOptions.SetAlwaysShowSunPreview(System.Boolean)
Since: 6.0

Rhino.Render.SupportOptions.PreviewCustomRenderMeshes
Since: 6.0

Rhino.Render.SupportOptions.SetPreviewCustomRenderMeshes(System.Boolean)
Since: 6.0

Rhino.Render.SupportOptions.MultithreadedTextureEvaluation
Since: 6.0

Rhino.Render.SupportOptions.SetMultithreadedTextureEvaluation(System.Boolean)
Since: 6.0

Rhino.Render.SupportOptions.HarvestContentParameters
Since: 6.0

Rhino.Render.SupportOptions.SetHarvestContentParameters(System.Boolean)
Since: 6.0

Rhino.Render.SupportOptions.TextureSize
Since: 6.0

Rhino.Render.SupportOptions.SetTextureSize(Rhino.Render.SupportOptions.RdkTextureSize,System.Boolean)
Since: 6.0
6.0

Rhino.Render.SupportOptions.SupportSharedUIsNoCache
Since: 6.0

Rhino.Render.SupportOptions.SupportSharedUIs
Since: 6.0

Rhino.Render.SupportOptions.SetSupportSharedUIs(System.Boolean)
Since: 6.0

Rhino.Render.SupportOptions.CombineEditors
Since: 6.0

Rhino.Render.SupportOptions.SetCombineEditors(System.Boolean)
Since: 6.0

Rhino.Render.SupportOptions.UseDefaultLibraryPath
Since: 6.0
8.0

Rhino.Render.SupportOptions.Libraries_UseDefaultLocation
Since: 8.0

Rhino.Render.SupportOptions.SetUseDefaultLibraryPath(System.Boolean)
Since: 6.0
8.0

Rhino.Render.SupportOptions.Libraries_SetUseDefaultLocation(System.Boolean)
Since: 8.0

Rhino.Render.SupportOptions.CustomLibraryPath
Since: 6.0
8.0

Rhino.Render.SupportOptions.Libraries_CustomPath
Since: 8.0

Rhino.Render.SupportOptions.SetCustomLibraryPath(System.String)
Since: 6.0
8.0

Rhino.Render.SupportOptions.Libraries_SetCustomPath(System.String)
Since: 8.0

Rhino.Render.SupportOptions.ShowRenderContent
Since: 6.0
8.0

Rhino.Render.SupportOptions.Libraries_ShowRenderContent
Since: 8.0

Rhino.Render.SupportOptions.ShowDocuments
Since: 6.0
8.0

Rhino.Render.SupportOptions.Libraries_ShowDocuments
Since: 8.0

Rhino.Render.SupportOptions.ShowCustom
Since: 6.0
8.0

Rhino.Render.SupportOptions.Libraries_ShowCustom
Since: 8.0

Rhino.Render.SupportOptions.SetShowRenderContent(System.Boolean)
Since: 6.0
8.0

Rhino.Render.SupportOptions.Libraries_SetShowRenderContent(System.Boolean)
Since: 8.0

Rhino.Render.SupportOptions.SetShowDocuments(System.Boolean)
Since: 6.0
8.0

Rhino.Render.SupportOptions.Libraries_SetShowDocuments(System.Boolean)
Since: 8.0

Rhino.Render.SupportOptions.SetShowCustom(System.Boolean)
Since: 6.0
8.0

Rhino.Render.SupportOptions.Libraries_SetShowCustom(System.Boolean)
Since: 8.0

Rhino.Render.SupportOptions.CustomPaths
Since: 6.0
8.0

Rhino.Render.SupportOptions.Libraries_CustomPathList
Since: 8.0

Rhino.Render.SupportOptions.SetCustomPaths(System.String)
Since: 6.0
8.0

Rhino.Render.SupportOptions.Libraries_SetCustomPathList(System.String)
Since: 8.0
path: Semicolon delimited string of paths.

Rhino.Render.SupportOptions.LibrariesInitialLocation
Since: 6.0
8.0

Rhino.Render.SupportOptions.Libraries_InitialLocation
Since: 8.0

Rhino.Render.SupportOptions.SetLibrariesInitialLocation(Rhino.Render.SupportOptions.RdkInitialLocation)
Since: 6.0
8.0

Rhino.Render.SupportOptions.Libraries_SetInitialLocation(Rhino.Render.SupportOptions.RdkInitialLocation)
Since: 8.0

Rhino.Render.SupportOptions.LibrariesInitialLocationCustomFolder
Since: 6.0
8.0

Rhino.Render.SupportOptions.Libraries_InitialLocationCustomFolder
Since: 8.0

Rhino.Render.SupportOptions.SetLibrariesInitialLocationCustomFolder(System.String)
Since: 6.0
8.0

Rhino.Render.SupportOptions.Libraries_SetInitialLocationCustomFolder(System.String)
Since: 8.0

Rhino.Render.SupportOptions.FileExplorer_UseDefaultLocation
Since: 8.0

Rhino.Render.SupportOptions.FileExplorer_SetUseDefaultLocation(System.Boolean)
Since: 8.0

Rhino.Render.SupportOptions.FileExplorer_CustomPath
Since: 8.0

Rhino.Render.SupportOptions.FileExplorer_SetCustomPath(System.String)
Since: 8.0

Rhino.Render.SupportOptions.FileExplorer_ShowRenderContent
Since: 8.0

Rhino.Render.SupportOptions.FileExplorer_ShowDocuments
Since: 8.0

Rhino.Render.SupportOptions.FileExplorer_ShowCustom
Since: 8.0

Rhino.Render.SupportOptions.FileExplorer_SetShowRenderContent(System.Boolean)
Since: 8.0

Rhino.Render.SupportOptions.FileExplorer_SetShowDocuments(System.Boolean)
Since: 8.0

Rhino.Render.SupportOptions.FileExplorer_SetShowCustom(System.Boolean)
Since: 8.0

Rhino.Render.SupportOptions.FileExplorer_CustomPathList
Since: 8.0

Rhino.Render.SupportOptions.FileExplorer_SetCustomPathList(System.String)
Since: 8.0
path: Semicolon delimited string of paths.

Rhino.Render.SupportOptions.FileExplorer_InitialLocation
Since: 8.0

Rhino.Render.SupportOptions.FileExplorer_SetInitialLocation(Rhino.Render.SupportOptions.RdkInitialLocation)
Since: 8.0

Rhino.Render.SupportOptions.FileExplorer_InitialLocationCustomFolder
Since: 8.0

Rhino.Render.SupportOptions.FileExplorer_SetInitialLocationCustomFolder(System.String)
Since: 8.0

Rhino.Render.SupportOptions.SetLastNavigatedLocation(System.String)
Since: 6.10
8.0

Rhino.Render.SupportOptions.LastNavigatedLocation
Since: 6.10
8.0

Rhino.Render.SupportOptions.Libraries_SetLastNavigatedLocation(System.String)
Since: 8.0

Rhino.Render.SupportOptions.Libraries_LastNavigatedLocation
Since: 8.0

Rhino.Render.SupportOptions.FileExplorer_SetLastNavigatedLocation(System.String)
Since: 8.0

Rhino.Render.SupportOptions.FileExplorer_LastNavigatedLocation
Since: 8.0

Rhino.Render.SupportOptions.PreferNativeRenderer
Since: 6.0

Rhino.Render.SupportOptions.SetPreferNativeRenderer(System.Boolean)
Since: 6.0

Rhino.Render.SupportOptions.UsePreviewCache
Since: 6.0

Rhino.Render.SupportOptions.SetUsePreviewCache(System.Boolean)
Since: 6.0

Rhino.Render.SupportOptions.UseQuickInitialPreview
Since: 6.0

Rhino.Render.SupportOptions.SetUseQuickInitialPreview(System.Boolean)
Since: 6.0

Rhino.Render.SupportOptions.UsePreview
Since: 6.0

Rhino.Render.SupportOptions.UseRenderedPreview
Since: 6.0

Rhino.Render.SupportOptions.ShowDetailsPanel
Since: 6.0

Rhino.Render.SupportOptions.SetShowDetailsPanel(System.Boolean)
Since: 6.0

Rhino.Render.SupportOptions.PreferredUnpackFolder
Since: 6.0

Rhino.Render.SupportOptions.SetPreferredUnpackFolder(System.String)
Since: 6.0

Rhino.Render.SupportOptions.CheckSupportFilesBeforeRendering
Since: 6.0

Rhino.Render.SupportOptions.SetCheckSupportFilesBeforeRendering(System.Boolean)
Since: 6.0

Rhino.Render.SupportOptions.AutoSaveRenderings
Since: 6.0

Rhino.Render.SupportOptions.SetAutoSaveRenderings(System.Boolean)
Since: 6.0

Rhino.Render.SupportOptions.AutoSaveKeepAmount
Since: 6.0

Rhino.Render.SupportOptions.SetAutoSaveKeepAmount(System.Int32)
Since: 6.0

Rhino.Render.SupportOptions.MaxPreviewCacheMB
Since: 6.0

Rhino.Render.SupportOptions.MaxPreviewSeconds
Since: 6.0

Rhino.Render.SupportOptions.EnablePreviewJobLog
Since: 6.0

Rhino.Render.SupportOptions.DarkPreviewCheckerColor
Since: 6.0

Rhino.Render.SupportOptions.LightPreviewCheckerColor
Since: 6.0

Rhino.Render.SupportOptions.LabelFormatLoc
Since: 6.0

Rhino.Render.SupportOptions.SetLabelFormatLoc(System.Int32)
Since: 6.0

Rhino.Render.SupportOptions.LabelFormatUtc
Since: 6.0

Rhino.Render.SupportOptions.SetLabelFormatUtc(System.Int32)
Since: 6.0