Rhino.Render.CustomRenderMeshes.Instance
The core of the custom render primitive delivery system - and instance defines a single mesh.
Each instance has a shared mesh and a transform, along with a material, mapping channels (at the mesh and instance level).

Rhino.Render.CustomRenderMeshes.Instance.#ctor
Construct a new Instance object
Since: 8.0

Rhino.Render.CustomRenderMeshes.Instance.Finalize
Finalizer to ensure correctly implemented dispose pattern.

Rhino.Render.CustomRenderMeshes.Instance.Dispose
Dispose method
Since: 8.0

Rhino.Render.CustomRenderMeshes.Instance.Dispose(System.Boolean)
Dispose method.
isDisposing:

Rhino.Render.CustomRenderMeshes.Instance.Mesh
Returns the mesh associated with this geometry.  Note that this function will always return a mesh
even if the type is not a mesh...so you can always call this function without checking the type
to give you the mesh.  It's more efficient to use the primitive directly of course...but if you don't support it...
Since: 8.0

Rhino.Render.CustomRenderMeshes.Instance.Material
The material for this instance.
Since: 8.0

Rhino.Render.CustomRenderMeshes.Instance.Transform
The transform for this instance.  Transform the geometry by this to set its final location in world space.
Since: 8.0

Rhino.Render.CustomRenderMeshes.Instance.IsViewDependent
If this instance will change depending on the view direction.
Since: 8.0

Rhino.Render.CustomRenderMeshes.Instance.IsRequestingPlugInDependent
If this instance will change depending on the requesting plug-in.
Since: 8.0

Rhino.Render.CustomRenderMeshes.Instance.IsForcedMaterial
The material for this instance should override any display mode materials.
Since: 8.11