Rhino.DocObjects.BasepointZero
Specifies enumerated constants used to indicate the zero level convention relating to a location on Earth.
This is used in conjunction with the Rhino.DocObjects.EarthAnchorPoint class.
Since: 5.0
8.6

Rhino.DocObjects.BasepointZero.GroundLevel
The ground level is the convention for 0.

Rhino.DocObjects.BasepointZero.MeanSeaLevel
The mean sea level is the convention for 0.

Rhino.DocObjects.BasepointZero.CenterOfEarth
The center of the planet is the convention for 0.