Rhino.Geometry.AnnotationBase
Provides a common base class to all annotation geometry.
This class refers to the geometric element that is independent from the document.

Rhino.Geometry.AnnotationBase.#ctor
Protected constructor for internal use.

Rhino.Geometry.AnnotationBase.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor used in serialization.
info: Serialization data.
context: Serialization stream.

Rhino.Geometry.AnnotationBase.AnnotationType
Type of annotation
Since: 6.0

Rhino.Geometry.AnnotationBase.DimensionStyleId
Id of this annotation's parent dimstyle
If this annotation has overrides to dimstyle properties,
those overrides will be represented in the DimensionStyle
returned by DimensionStyle(ParentStyle)
Since: 6.0

Rhino.Geometry.AnnotationBase.HasPropertyOverrides
Since: 6.0

Rhino.Geometry.AnnotationBase.IsPropertyOverridden(Rhino.DocObjects.DimensionStyle.Field)
Returns true if a property is overridden
field:
Returns:
Since: 6.0

Rhino.Geometry.AnnotationBase.ClearPropertyOverrides
Clears all overridden properties for this annotation
Returns:
Since: 6.0

Rhino.Geometry.AnnotationBase.GetDimensionStyle(Rhino.DocObjects.DimensionStyle)
Return the proper dimension style from which to get properties
for this annotation object
If this object has style overrides, those will be included in the
returned dimension style and the style will be updated to include
the current state of the parent style for non-overridden fields
parentDimStyle:
Returns:
Since: 6.0

Rhino.Geometry.AnnotationBase.DimensionStyle
If there are no overrides then the parent style is returned otherwise the dimension style saved with the annotation is returned.
Since: 6.0

Rhino.Geometry.AnnotationBase.SetOverrideDimStyle(Rhino.DocObjects.DimensionStyle)
Set a style including overrides for this annotation object.
The DimensionStyle OverrideStyle must have the override fields marked
as overridden and must have it's Id set to nil.
Use DimensionStyle.SetFieldOverride(Field field) and related functions
to manage override settings. To override a field, the field value must be set
and the field must be marked as an override.
The DimensionStyle passed in here must not be in the dimstyle table
OverrideStyle:
Returns:
Since: 6.0

Rhino.Geometry.AnnotationBase.ParentDimensionStyle
The parent dimension style associated with this annotation
Since: 6.0

Rhino.Geometry.AnnotationBase.TextHeight
AnnotationBase.TextHeight
Gets the parent dimstyle for the annotation and
gets or sets the text height in the dimstyle
Since: 5.0

Rhino.Geometry.AnnotationBase.MaskEnabled
Determines whether or not to draw a Text Mask
Since: 6.0

Rhino.Geometry.AnnotationBase.MaskUsesViewportColor
If true, the viewport's color is used for the mask color. If
false, the color defined by MaskColor is used
Since: 6.0

Rhino.Geometry.AnnotationBase.MaskColorSource
Gets or sets whether the mask background color is from the background or from a color
Since: 6.0

Rhino.Geometry.AnnotationBase.DrawTextFrame
Gets or sets whether to draw a frame around a text mask
Since: 7.0

Rhino.Geometry.AnnotationBase.MaskFrame
Gets or sets whether to draw a frame around a text mask
Since: 7.0

Rhino.Geometry.AnnotationBase.MaskColor
Color to use for drawing a text mask when it is enabled. If the mask is
enabled and MaskColor is System.Drawing.Color.Transparent, then the
viewport's color will be used for the MaskColor
Since: 6.0

Rhino.Geometry.AnnotationBase.MaskOffset
Offset for the border around text of the rectangle used to draw the mask.  This
value multiplied by TextHeight is the offset on each side of the tight rectangle
around the text characters to the mask rectangle. The default value is 0.1.
Since: 6.0

Rhino.Geometry.AnnotationBase.DimensionScale
Gets or sets the dimension scale
Since: 6.0

Rhino.Geometry.AnnotationBase.GetDimensionScale(Rhino.RhinoDoc,Rhino.DocObjects.DimensionStyle,Rhino.Display.RhinoViewport)
Get view dependent dimension scale
doc:
dimstyle:
vport:
Returns:
Since: 6.0

Rhino.Geometry.AnnotationBase.DrawForward
Gets or sets whether the text is oriented towards the reader when viewed from behind
Since: 6.0

Rhino.Geometry.AnnotationBase.Font
The base Font for the text of the annotation.  The text string is rich text and therefore a different font that the base font can be associated with sub strings of the text
Since: 6.0

Rhino.Geometry.AnnotationBase.FontIndex
Obsolete; use Font property instead
Since: 6.1

Rhino.Geometry.AnnotationBase.DimensionLengthDisplay
Length display units and format
Since: 6.0

Rhino.Geometry.AnnotationBase.AlternateDimensionLengthDisplay
Alternate length display units and format
Since: 6.0

Rhino.Geometry.AnnotationBase.DecimalSeparator
Set or get the decimal separator c
Since: 7.0

Rhino.Geometry.AnnotationBase.Plane
Plane that this annotation lies on
Since: 5.0

Rhino.Geometry.AnnotationBase.GetText(System.Boolean)
Return text string for this annotation
rich:
If true, the string will include RTF formatting information.
If false, the 'plain' form of the text will be returned.

Rhino.Geometry.AnnotationBase.GetPlainTextWithFields
Return plain text string for this annotation with field expressions unevaluated

Rhino.Geometry.AnnotationBase.GetPlainTextWithRunMap(System.Int32[]@)
Return plain text string for this annotation with field expressions unevaluated.
map: an array of int values in groups of 3: run index, character start position, and length.
Returns: A plain text string.
Since: 7.0

Rhino.Geometry.AnnotationBase.TextFormula
See RichText
Since: 5.0

Rhino.Geometry.AnnotationBase.RichText
Text including additional RTF formatting information
Since: 6.0

Rhino.Geometry.AnnotationBase.Text
Text including additional RTF formatting information
Since: 5.0

Rhino.Geometry.AnnotationBase.PlainText
Text stripped of RTF formatting information
Since: 6.0

Rhino.Geometry.AnnotationBase.PlainTextWithFields
Text stripped of RTF formatting information and with field expressions intact
Since: 6.19

Rhino.Geometry.AnnotationBase.PlainTextToRtf(System.String)
str:
Returns:
Since: 6.0

Rhino.Geometry.AnnotationBase.SetRichText(System.String,Rhino.DocObjects.DimensionStyle)
Sets the annotation's text as rich text (RTF), optionally using a specified dimension style for formatting overrides.
rtfText: The RTF (Rich Text Format) string to assign to the annotation.
dimstyle: The dimension style to use for formatting overrides, or null to use the current style.
Since: 6.0

Rhino.Geometry.AnnotationBase.TextHasRtfFormatting
Gets a value indicating whether the annotation's text is formatted as RTF (Rich Text Format).
Returns true if the text begins with an RTF header; otherwise, false.
Since: 6.0

Rhino.Geometry.AnnotationBase.FormatRtfString(System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.String)
Modifies the formatting of an RTF (Rich Text Format) string by setting or clearing bold, italic, underline, and font face properties on the first character run.
rtf_in: The input RTF string to modify.
clear_bold: If true, clears the bold formatting.
set_bold: If true, sets the bold formatting.
clear_italic: If true, clears the italic formatting.
set_italic: If true, sets the italic formatting.
clear_underline: If true, clears the underline formatting.
set_underline: If true, sets the underline formatting.
clear_facename: If true, clears the font face name.
set_facename: If true, sets the font face name.
facename: The font face name to set if set_facename is true.
Returns: The modified RTF string with the requested formatting changes applied.
Since: 6.0

Rhino.Geometry.AnnotationBase.FirstCharProperties(System.String,System.Boolean@,System.Boolean@,System.Boolean@,System.String@)
Extracts the font properties (bold, italic, underline, and facename) from the first character run of an RTF string.
rtf_str: The RTF string to analyze.
bold: Set to true if the first run is bold; otherwise, false.
italic: Set to true if the first run is italic; otherwise, false.
underline: Set to true if the first run is underlined; otherwise, false.
facename: Receives the font face name of the first run.
Returns: True if the properties were successfully extracted; otherwise, false.
Remarks: Obsolete. Use Rhino.Geometry.AnnotationBase.FirstCharFont instead.
Since: 6.0

Rhino.Geometry.AnnotationBase.FirstCharFont
Returns the font used by the first run of text in an annotation
Returns:
Since: 6.5

Rhino.Geometry.AnnotationBase.IsAllBold
Returns true if all of the text in the annotation is Bold, otherwise returns false
Returns:
Since: 6.22

Rhino.Geometry.AnnotationBase.IsAllItalic
Returns true if all of the text in the annotation is Italic, otherwise returns false
Returns:
Since: 6.22

Rhino.Geometry.AnnotationBase.IsAllUnderlined
Returns true if all of the text in the annotation is Underlined, otherwise returns false
Returns:
Since: 6.22

Rhino.Geometry.AnnotationBase.TextModelWidth
Width of text in the model
Since: 6.0

Rhino.Geometry.AnnotationBase.FormatWidth
Text format width (Wrapping rectangle)
Since: 6.0

Rhino.Geometry.AnnotationBase.TextIsWrapped
Is text wrapping on
Since: 6.0

Rhino.Geometry.AnnotationBase.WrapText
Wrap text
Since: 6.0

Rhino.Geometry.AnnotationBase.TextRotationRadians
Rotation of text in radians
Since: 6.0

Rhino.Geometry.AnnotationBase.TextRotationDegrees
Rotation of text in degrees
Since: 6.0

Rhino.Geometry.AnnotationBase.SetBold(System.Boolean)
set_on:
Returns:
Since: 6.0

Rhino.Geometry.AnnotationBase.SetItalic(System.Boolean)
set_on:
Returns:
Since: 6.0

Rhino.Geometry.AnnotationBase.SetUnderline(System.Boolean)
set_on:
Returns:
Since: 6.0

Rhino.Geometry.AnnotationBase.SetFacename(System.Boolean,System.String)
set_on:
facename:
Returns:
Since: 6.0

Rhino.Geometry.AnnotationBase.GetBoundingBox(Rhino.Geometry.Transform)
Aligned bounding box solver. Gets the world axis aligned bounding box for the transformed geometry.
xform: Transformation to apply to bounding box after calculation.
The geometry is not modified.
Returns: The bounding box of the transformed geometry in world coordinates
or BoundingBox.Empty if not bounding box could be found.
Since: 6.10

Rhino.Geometry.AnnotationBase.RunReplace(System.String,System.Int32,System.Int32,System.Int32,System.Int32)
Replace text within a formatted string
replaceString:
startRunIndex:
startRunPosition:
endRunIndex:
endRunPosition:
Returns:
Since: 7.0