Rhino.Geometry.PreserveEnd
Preserves, or maintains, the shape of the opposite the one being edited.
Since: 7.6

Rhino.Geometry.PreserveEnd.None
No constraint.

Rhino.Geometry.PreserveEnd.Position
Location only.

Rhino.Geometry.PreserveEnd.Tangency
Position and curve direction.

Rhino.Geometry.PreserveEnd.Curvature
Position, direction, and radius of curvature.