Rhino.Render.Fields.TransformField
Transform field value class

Rhino.Render.Fields.TransformField.#ctor(Rhino.Render.RenderContent,System.IntPtr)
Constructor
renderContent: RenderContent whose Fields owns this filed.
attachToPointer: Existing C++ pointer to attach to.

Rhino.Render.Fields.TransformField.Value
Gets or sets the field value
Since: 5.1

Rhino.Render.Fields.TransformField.ValueAsObject
Since: 5.7