Rhino.Display.CullObjectEventArgs.RhinoObject
Since: 5.3

Rhino.Display.CullObjectEventArgs.RhinoObjectSerialNumber
Gets the rhino object runtime serial number.
The rhino object serial number.
Since: 6.14

Rhino.Display.CullObjectEventArgs.CullObject
Since: 5.3