Rhino.UI.Gumball.GumballObject.#ctor
Since: 5.0

Rhino.UI.Gumball.GumballObject.Dispose
Since: 5.0

Rhino.UI.Gumball.GumballObject.SetFromBoundingBox(Rhino.Geometry.BoundingBox)
Since: 5.0

Rhino.UI.Gumball.GumballObject.SetFromBoundingBox(Rhino.Geometry.Plane,Rhino.Geometry.BoundingBox)
Sets the gumball bounding box with respect to a frame.
frame: The frame.
frameBoundingBox: Bounding box with respect to frame.
Returns:
true if input is valid and gumball is set. false if input is not valid.
In this case, gumball is set to the default.
Since: 5.0

Rhino.UI.Gumball.GumballObject.SetFromLine(Rhino.Geometry.Line)
Since: 5.0

Rhino.UI.Gumball.GumballObject.SetFromPlane(Rhino.Geometry.Plane)
Since: 5.0

Rhino.UI.Gumball.GumballObject.SetFromArc(Rhino.Geometry.Arc)
Since: 5.0

Rhino.UI.Gumball.GumballObject.SetFromCircle(Rhino.Geometry.Circle)
Since: 5.0

Rhino.UI.Gumball.GumballObject.SetFromEllipse(Rhino.Geometry.Ellipse)
Since: 5.0

Rhino.UI.Gumball.GumballObject.SetFromLight(Rhino.Geometry.Light)
Since: 5.0

Rhino.UI.Gumball.GumballObject.SetFromHatch(Rhino.Geometry.Hatch)
Since: 5.0

Rhino.UI.Gumball.GumballObject.SetFromCurve(Rhino.Geometry.Curve)
Since: 5.0

Rhino.UI.Gumball.GumballObject.SetFromExtrusion(Rhino.Geometry.Extrusion)
Since: 5.0

Rhino.UI.Gumball.GumballObject.Frame
Since: 5.0