Rhino.DocObjects.SurfaceObject
Represents a surface in a document.

Rhino.DocObjects.SurfaceObject.SurfaceGeometry
Gets the surface geometry linked with this object.
Since: 5.0

Rhino.DocObjects.SurfaceObject.DuplicateSurfaceGeometry
Constructs a new deep copy of the surface geometry.
Returns: The copy of the geometry.
Since: 5.0