Rhino.Geometry.QuadRemeshParameters
Parameters for QuadRemesh method

Rhino.Geometry.QuadRemeshParameters.TargetEdgeLength
When TargetEdgeLength is greater than 0 TargetQuadCount will be re-computed with
the target goal of an approximated edge length based on the area of the input mesh
e.g TargetQuadCount = Input mesh Area * sqr(TargetEdgeLength)
AdaptiveSize as well as AdaptiveQuadCount will also be ignored;
Since: 7.8

Rhino.Geometry.QuadRemeshParameters.TargetQuadCount
The number of quads to try to achieve in the final re-meshed object
Note: This value is overridden if TargetEdgeLength > 0
Since: 7.0

Rhino.Geometry.QuadRemeshParameters.AdaptiveSize
Larger values results in for quad sizes that adjust to match input curvature.
Smaller values results in more uniform quad sizes at the risk of less feature preservation.
Range [0 - 100]
Note: this value is ignored when TargetEdgeLength > 0
Since: 7.0

Rhino.Geometry.QuadRemeshParameters.AdaptiveQuadCount
Respect the original Target Quad Count value as much as possible.
True returns more quads than TargetQuadCount depending on amount of high-curvature areas.
Note: this value is ignored when TargetEdgeLength > 0
Since: 7.0

Rhino.Geometry.QuadRemeshParameters.DetectHardEdges
When enabled the hard edges in models will be retained.
Since: 7.0

Rhino.Geometry.QuadRemeshParameters.GuideCurveInfluence
0 = Approximate
1 = Interpolate Edge Ring
2 = Interpolate Edge Loop
This value is ignored if Guide Curves are not supplied
Since: 7.0

Rhino.Geometry.QuadRemeshParameters.PreserveMeshArrayEdgesMode
0=off, 1=On(Smart), 2=On(Strict) :
Mesh array's created from Breps will have their brep face edge boundaries retained.
Smart - Small or insignificant input faces are ignored.
Strict - All input faces are factored in re-meshed result.
Since: 7.0

Rhino.Geometry.QuadRemeshParameters.SymmetryAxis
Symmetry axis to use for symmetric re-meshing
Since: 7.0