Rhino.Runtime.InteropWrappers.SimpleArrayMeshFace
Wrapper for ON_SimpleArray<ON_MeshFace>. If you are not writing C++ code
then this class is not for you.

Rhino.Runtime.InteropWrappers.SimpleArrayMeshFace.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.
Since: 8.0

Rhino.Runtime.InteropWrappers.SimpleArrayMeshFace.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.
Since: 8.0

Rhino.Runtime.InteropWrappers.SimpleArrayMeshFace.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayMeshFace instance.
Since: 8.0

Rhino.Runtime.InteropWrappers.SimpleArrayMeshFace.Count
Gets the amount of mesh faces in this array.
Since: 8.0

Rhino.Runtime.InteropWrappers.SimpleArrayMeshFace.ToArray
Copies the unmanaged array to a managed counterpart.
Returns: The managed array.
Since: 8.0

Rhino.Runtime.InteropWrappers.SimpleArrayMeshFace.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.SimpleArrayMeshFace.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 8.0