Rhino.Geometry.Unroller
Represents the operation of unrolling a single surface.

Rhino.Geometry.Unroller.#ctor(Rhino.Geometry.Surface)
Initializes a new instance of the Rhino.Geometry.Unroller class with surface.
surface: A surface to be unrolled.
Since: 5.0

Rhino.Geometry.Unroller.#ctor(Rhino.Geometry.Brep)
Initializes a new instance of the Rhino.Geometry.Unroller class with a brep.
brep: A brep to be unrolled.
Since: 5.0

Rhino.Geometry.Unroller.AddFollowingGeometry(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})
Adds curves that should be unrolled along with the surface/brep.
curves: An array, a list or any enumerable set of curves.
Since: 5.0

Rhino.Geometry.Unroller.AddFollowingGeometry(Rhino.Geometry.Curve)
Adds a curve that should be unrolled along with the surface/brep.
curve: The curve.
Since: 5.0

Rhino.Geometry.Unroller.AddFollowingGeometry(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Adds points that should be unrolled along with the surface/brep.
points: An array, a list or any enumerable set of points.
Since: 5.0

Rhino.Geometry.Unroller.AddFollowingGeometry(Rhino.Geometry.Point3d)
Adds a point that should be unrolled along with the surface/brep.
point: A point.
Since: 5.0

Rhino.Geometry.Unroller.AddFollowingGeometry(Rhino.Geometry.Point)
Adds a point that should be unrolled along with the surface/brep.
point: A point.
Since: 5.0

Rhino.Geometry.Unroller.AddFollowingGeometry(System.Collections.Generic.IEnumerable{Rhino.Geometry.TextDot})
Adds text dots that should be unrolled along with the surface/brep.
dots: An array, a list or any enumerable set of text dots.
Since: 5.0

Rhino.Geometry.Unroller.AddFollowingGeometry(Rhino.Geometry.TextDot)
Adds a text dot that should be unrolled along with the surface/brep.
dot: A text dot.
Since: 5.0

Rhino.Geometry.Unroller.AddFollowingGeometry(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Collections.Generic.IEnumerable{System.String})
Adds text dots that should be unrolled along with the surface/brep.
dotLocations: An array, a list, or any enumerable set of dot locations.
dotText: An array, a list, or any enumerable set of dot strings.
Since: 5.0

Rhino.Geometry.Unroller.AddFollowingGeometry(Rhino.Geometry.Point3d,System.String)
Adds a text dot that should be unrolled along with the surface/brep.
dotLocation: A dot point.
dotText: A dot text.
Since: 5.0

Rhino.Geometry.Unroller.ExplodeOutput
Gets or sets a value determining whether geometry should be exploded.
Since: 5.0

Rhino.Geometry.Unroller.ExplodeSpacing
Gets or sets a value determining whether spacing should be exploded.
Since: 5.0

Rhino.Geometry.Unroller.AbsoluteTolerance
Gets or sets the absolute tolerance for the unrolling operation.
Absolute tolerance is used in the evaluation of new entities,
such as intersections, re-projections and splits.
In the current implementation, absolute tolerance is used
in tessellating rails, fitting curves and pulling back trims.
Since: 5.0

Rhino.Geometry.Unroller.RelativeTolerance
Gets or sets the relative tolerance for the unrolling operation.
Relative tolerance is used in the evaluation of intrinsic properties,
such as computations "along" the surface or brep.
In the current implementation, relative tolerance is used to decide
if a surface is flat enough to try to unroll. That helps ease the scale dependency.
The surface has to be linear in one direction within (length * RelativeTolerance)
to be considered linear for that purpose. Otherwise smash will ignore that tolerance and
unroll anything.
Since: 5.0

Rhino.Geometry.Unroller.PerformUnroll(Rhino.Geometry.Curve[]@,Rhino.Geometry.Point3d[]@,Rhino.Geometry.TextDot[]@)
Executes unrolling operations.
unrolledCurves: An array of unrolled curves is assigned during the call in this out parameter.
unrolledPoints: An array of unrolled points is assigned during the call in this out parameter.
unrolledDots: An array of unrolled text dots is assigned during the call in this out parameter.
Returns: An array of breps. This array can be empty.
Since: 5.0

Rhino.Geometry.Unroller.PerformUnroll(System.Collections.Generic.List{Rhino.Geometry.Brep})
Executes unrolling operations.
flatbreps: List of breps containing flattened results.
Returns: Number of breps in result
Since: 6.0

Rhino.Geometry.Unroller.FollowingGeometryIndex(Rhino.Geometry.TextDot)
Given an unrolled text dot, returns the index of the source, or following text dot.
dot: An unrolled text dot returned by Unroller.PerformUnroll.
Returns: The index of the text dot added by Unroller.AddFollowingGeometry if successful, otherwise -1.
Since: 6.0

Rhino.Geometry.Unroller.FollowingGeometryIndex(Rhino.Geometry.Curve)
Given an unrolled curve, returns the index of the source, or following curve.
curve: An unrolled curve returned by Unroller.PerformUnroll.
Returns: The index of the curve added by Unroller.AddFollowingGeometry if successful, otherwise -1.
Since: 6.0