Rhino.Render.RenderSettings.RenderingSources
Rendering source (render directly from a NamedView or Snapshot)
Since: 6.1

Rhino.Render.RenderSettings.RenderingSources.ActiveViewport
Get the rendering view from the currently active viewport (as in all previous versions of Rhino)

Rhino.Render.RenderSettings.RenderingSources.SpecificViewport
Get the rendering view from the named viewport (see NamedViewport below)

Rhino.Render.RenderSettings.RenderingSources.NamedView
Get the rendering view from a specific named view (see NamedView below)

Rhino.Render.RenderSettings.RenderingSources.SnapShot
Before rendering, restore the Snapshot specified in Snapshot below, then render.