Rhino.Geometry.DistancingMode
Defines how offset and similar operations should work.
Since: 6.0

Rhino.Geometry.DistancingMode.Undefined
Nothing is defined. This serves as null.

Rhino.Geometry.DistancingMode.Linear
When geometrically possible, offsets with a linear distance.

Rhino.Geometry.DistancingMode.LinearFromEnd
When geometrically possible and an opposite side exists, offsets with a linear distance from that side.

Rhino.Geometry.DistancingMode.Ratio
When geometrically possible, uses a percentage of respective neighbours to
compute offsets.

Rhino.Geometry.DistancingMode.RatioFromEnd
When geometrically possible and an opposite side exists, uses a percentage of respective neighbours to
compute offsets.