Rhino.Geometry.SubDSurfaceInterpolator.MaximumCounts
Stores maximum count values for the solver to work in reasonable time.

Rhino.Geometry.SubDSurfaceInterpolator.MaximumCounts.MaximumRecommendedInterpolatedVertexCount
Interpolation requires building a solver.
If the number of interpolated vertices is greater than MaximumInterpolatedVertexCount,
the solver construction time can be too long for some users' comfort.
Given sufficient time, memory, and CPU resources, the code will work with any value