Rhino.DocObjects.ViewSectionBehavior
Defines how views work with clipping planes.
Since: 8.0

Rhino.DocObjects.ViewSectionBehavior.ClipAndSection
Default - show geometry on unclipped side of clipping plane and show section

Rhino.DocObjects.ViewSectionBehavior.SectionOnly
Only show the section at the intersection of a clipping plane