Rhino.Render.ChangeQueue.DynamicObjectTransform
ChangeQueue DynamicObject

Rhino.Render.ChangeQueue.DynamicObjectTransform.MeshInstanceId
Get the mesh instance id for this dynamic object.
Since: 6.0

Rhino.Render.ChangeQueue.DynamicObjectTransform.Transform
Transform for the DynamicObject
Since: 6.0

Rhino.Render.ChangeQueue.DynamicObjectTransform.ToString
String representation of DynamicObject
Returns: