Rhino.DocObjects.DimensionStyle.TextFit
Text display position inside or outside extension lines

Rhino.DocObjects.DimensionStyle.TextFit.Auto
Auto - Display inside when space permits

Rhino.DocObjects.DimensionStyle.TextFit.TextInside
Force text inside extensions

Rhino.DocObjects.DimensionStyle.TextFit.TextRight
Force text outside to the right of extensions

Rhino.DocObjects.DimensionStyle.TextFit.TextLeft
Force text outside to the left of extensions

Rhino.DocObjects.DimensionStyle.TextFit.TextHintRight
Move text outside to the right of extensions when it won't fit inside

Rhino.DocObjects.DimensionStyle.TextFit.TextHintLeft
Move text outside to the left of extensions when it won't fit inside