Rhino.Input.Custom.GetCancel.#ctor
Since: 6.0

Rhino.Input.Custom.GetCancel.Token
Since: 6.0

Rhino.Input.Custom.GetCancel.TaskCompleted
Since: 6.0

Rhino.Input.Custom.GetCancel.ProgressReporting
Since: 6.0

Rhino.Input.Custom.GetCancel.ProgressMessage
Since: 6.0

Rhino.Input.Custom.GetCancel.Wait(System.Threading.Tasks.Task,Rhino.RhinoDoc)
Awaits a particular task to finish.
task: The task.
doc: A document to set progress reporting.
Returns: A result enumeration.
Since: 7.0

Rhino.Input.Custom.GetCancel.Wait``1(System.Threading.Tasks.Task{``0},Rhino.RhinoDoc)
Awaits a particular task to finish.
task: The task.
doc: A document to set progress reporting.
Returns: A result enumeration.
Since: 6.0

Rhino.Input.Custom.GetCancel.WaitAll(System.Collections.Generic.IEnumerable{System.Threading.Tasks.Task},Rhino.RhinoDoc)
Awaits some tasks to finish.
tasks: The tasks.
doc: A document to set progress reporting.
Returns: A result enumeration.
Since: 7.0

Rhino.Input.Custom.GetCancel.WaitAll``1(System.Collections.Generic.IEnumerable{System.Threading.Tasks.Task{``0}},Rhino.RhinoDoc)
Awaits some tasks to finish.
tasks: The tasks.
doc: A document to set progress reporting.
Returns: A result enumeration.

Rhino.Input.Custom.GetCancel.Progress
Since: 6.0