Rhino.FileIO.FileObjWriteOptions.PolylineExportType
Determines how polylines will be written to the file
Since: 8.0

Rhino.FileIO.FileObjWriteOptions.PolylineExportType.Bspline
Polyline is exported as a degree 1 Bspline (this has been the historical method)

Rhino.FileIO.FileObjWriteOptions.PolylineExportType.Single
Polyline is exported as a single OBJ "l" object with multiple indices to "v" objects

Rhino.FileIO.FileObjWriteOptions.PolylineExportType.Multiple
Polyline is exported as multiple OBJ "l" objects, each with 2 indices to "v" objects