Rhino.Input.Custom.GetNumber
Used to get double precision numbers.

Rhino.Input.Custom.GetNumber.#ctor
Create a new GetNumber.
Since: 5.0

Rhino.Input.Custom.GetNumber.Get
Call to get a number.
Returns: If the user chose a number, then Rhino.Input.GetResult.Number; another enumeration value otherwise.
Since: 5.0

Rhino.Input.Custom.GetNumber.SetLowerLimit(System.Double,System.Boolean)
Sets a lower limit on the number that can be returned.
By default there is no lower limit.
lowerLimit: smallest acceptable number.
strictlyGreaterThan:
If true, then the returned number will be > lower_limit.
Since: 5.0

Rhino.Input.Custom.GetNumber.SetUpperLimit(System.Double,System.Boolean)
Sets an upper limit on the number that can be returned.
By default there is no upper limit.
upperLimit: largest acceptable number.
strictlyLessThan: If true, then the returned number will be < upper_limit.
Since: 5.0