Rhino.Geometry.SurfaceCurvature
Maintains computed information for surface curvature evaluation.

Rhino.Geometry.SurfaceCurvature.UVPoint
Gets the UV location where the curvature was computed.
Since: 5.0

Rhino.Geometry.SurfaceCurvature.Point
Gets the surface point at UV.
Since: 5.0

Rhino.Geometry.SurfaceCurvature.Normal
Gets the surface normal at UV.
Since: 5.0

Rhino.Geometry.SurfaceCurvature.Direction(System.Int32)
Gets the principal curvature direction vector.
direction: Direction index, valid values are 0 and 1.
Returns: The specified direction vector.
Since: 5.0

Rhino.Geometry.SurfaceCurvature.Kappa(System.Int32)
Gets the principal curvature values.
Kappa(0) - Principal curvature with maximum absolute value
Kappa(1) - Principal curvature with minimum absolute value
direction: Kappa index, valid values are 0 and 1.
Returns: The specified kappa value.
Since: 5.0

Rhino.Geometry.SurfaceCurvature.Gaussian
Gets the Gaussian curvature value at UV.
Since: 5.0

Rhino.Geometry.SurfaceCurvature.Mean
Gets the Mean curvature value at UV.
Since: 5.0

Rhino.Geometry.SurfaceCurvature.OsculatingCircle(System.Int32)
Computes the osculating circle along the given direction.
direction: Direction index, valid values are 0 and 1.
Returns: The osculating circle in the given direction or Circle.Unset on failure.
Since: 5.0