Rhino.Geometry.LoftType
Specifies enumerated constants for all supported loft types.
Since: 5.0

Rhino.Geometry.LoftType.Normal
Uses chord-length parameterization in the loft direction.

Rhino.Geometry.LoftType.Loose
The surface is allowed to move away from the original curves to make a smoother surface.
The surface control points are created at the same locations as the control points
of the loft input curves.

Rhino.Geometry.LoftType.Tight
The surface sticks closely to the original curves. Uses square root of chord-length
parameterization in the loft direction.

Rhino.Geometry.LoftType.Straight
The sections between the curves are straight. This is also known as a ruled surface.

Rhino.Geometry.LoftType.Developable
Obsolete, do not use.

Rhino.Geometry.LoftType.Uniform
Constructs a uniform loft. The object knot vectors will be uniform.