Rhino.Geometry.MorphControl
Represents a geometry that is able to control the morphing behavior of some other geometry.

Rhino.Geometry.MorphControl.#ctor(Rhino.Geometry.NurbsCurve,Rhino.Geometry.NurbsCurve)
Constructs a MorphControl that allows for morphing between two curves.
originCurve: The origin curve for morphing.
targetCurve: The target curve for morphing.
Since: 5.0

Rhino.Geometry.MorphControl.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor for internal use.
info: Serialization data.
context: Serialization stream.

Rhino.Geometry.MorphControl.SpaceMorphTolerance
The 3d fitting tolerance used when morphing surfaces and breps.
The default is 0.0 and any value <= 0.0 is ignored by morphing functions.
The value returned by Tolerance does not affect the way meshes and points are morphed.
Since: 5.0

Rhino.Geometry.MorphControl.QuickPreview
true if the morph should be done as quickly as possible because the
result is being used for some type of dynamic preview.  If QuickPreview
is true, the tolerance may be ignored. The QuickPreview value does not
affect the way meshes and points are morphed. The default is false.
Since: 5.0

Rhino.Geometry.MorphControl.PreserveStructure
true if the morph should be done in a way that preserves the structure
of the geometry.  In particular, for NURBS objects, true  means that
only the control points are moved.  The PreserveStructure value does not
affect the way meshes and points are morphed. The default is false.
Since: 5.0

Rhino.Geometry.MorphControl.Curve
Returns the morph control's curve.  While this should never be null, the
calling function should check.
Since: 6.0

Rhino.Geometry.MorphControl.Surface
Returns the morph control's surface.  While this should never be null, the
calling function should check.
Since: 6.0

Rhino.Geometry.MorphControl.Morph(Rhino.Geometry.GeometryBase)
Applies the space morph to geometry.
geometry: The geometry to be morphed.
Returns: true on success, false on failure.
Since: 5.0