Rhino.Geometry.Collections.SubDVertexList
Provides access to all the vertices and vertex-related functionality of a SubD

Rhino.Geometry.Collections.SubDVertexList.Count
Gets the number of SubD vertices.
Since: 7.0

Rhino.Geometry.Collections.SubDVertexList.First
First vertex in this linked list of vertices
Since: 7.0

Rhino.Geometry.Collections.SubDVertexList.Find(System.UInt32)
Find a vertex in this SubD with a given id
id:
Returns:
Since: 7.0

Rhino.Geometry.Collections.SubDVertexList.Find(System.Int32)
Find a vertex in this SubD with a given id
id:
Returns:
Since: 7.0

Rhino.Geometry.Collections.SubDVertexList.GetEnumerator
Implementation of IEnumerable, so a vertex list can be used with foreach and LINQ
the same way Rhino.Geometry.Collections.SubDEdgeList and Rhino.Geometry.Collections.SubDFaceList can.
Remarks:
Note that this list has both a Rhino.Geometry.Collections.SubDVertexList.First property and, now that it is
enumerable, a LINQ First() extension method. They disagree on an empty SubD: the
property returns null and First() throws.
Since: 8.36

Rhino.Geometry.Collections.SubDVertexList.System#Collections#IEnumerable#GetEnumerator
Since: 8.36

Rhino.Geometry.Collections.SubDVertexList.VertexEnumerator
Walks the SubD's linked list of vertices on the active level.

Rhino.Geometry.Collections.SubDVertexList.Add(Rhino.Geometry.SubDVertexTag,Rhino.Geometry.Point3d)
Add a new vertex to the end of the Vertex list.
tag: The type of vertex tag, such as smooth or corner.
vertex: Location of new vertex.
Returns: The newly added vertex.
Throws System.ArgumentOutOfRangeException: If tag is unset or non-defined.
Since: 7.0

Rhino.Geometry.Collections.SubDVertexList.SetVertexTags(System.Collections.Generic.IEnumerable{System.Int32},Rhino.Geometry.SubDVertexTag)
Set vertex tags for a list of vertices. Useful for adding creases to SubDs
vertexIndices: list of indices for the vertices to set tags on
tag: The type of vertex tag

Rhino.Geometry.Collections.SubDVertexList.SetVertexTags(System.Collections.Generic.IEnumerable{Rhino.Geometry.SubDVertex},Rhino.Geometry.SubDVertexTag)
Set vertex tags for a list of vertices. Useful for adding creases to SubDs
vertices: list of vertices to set a specific tag on
tag: The type of vertex tag