Rhino.Commands.Result
Defines enumerated constant values for several command result types.
Since: 5.0

Rhino.Commands.Result.Success
Command worked.

Rhino.Commands.Result.Cancel
User canceled command.

Rhino.Commands.Result.Nothing
Command did nothing but cancel was not pressed.

Rhino.Commands.Result.Failure
Command failed (bad input, computational problem, etc.)

Rhino.Commands.Result.UnknownCommand
Command not found (user probably had a typo in command name).

Rhino.Commands.Result.CancelModelessDialog
Commands canceled and modeless dialog.

Rhino.Commands.Result.ExitRhino
exit RhinoCommon.