Rhino.Render.Fields.Field
Generic data fields used to add publicly accessible properties to
RenderContent.FieldDictionary.  These should be created by calling a
FieldDictaionary.Add() method on a Render content object.  These are
allocated after the RenderContent object's C++ object is created and
added to the underlying C++ objects content dictionary, who ever
allocates a field is responsible for deleting it so these objects clean
up the C++ pointers when they are disposed of.

Rhino.Render.Fields.Field.m_name
Place holder for the initial field value, this will get used by
CreateCppPointer(), it will call Set(m_initialValue) after creating the
C++ pointer to initialize the field value.

Rhino.Render.Fields.Field.Name
Field name value string passed to the constructor.
Since: 6.0

Rhino.Render.Fields.Field.Key
Field name value string passed to the constructor
Since: 5.1

Rhino.Render.Fields.Field.Tag
Gets or sets an object that contains data to associate with the field.
Returns:
An object that contains information that is associated with the field.
Since: 5.1

Rhino.Render.Fields.Field.TextureAmountMax
Set Max value for Texture amount
Since: 7.0

Rhino.Render.Fields.Field.TextureAmountMin
Set Min value for Texture amount
Since: 7.0

Rhino.Render.Fields.Field.UseTextureOn
True if 'texture on' is in use, otherwise false. In the UI 'texture on' is represented
as a checkbox. If true then the checbox is shown. If false then the checkbox is not shown.
Since: 7.12

Rhino.Render.Fields.Field.UseTextureAmount
True if 'texture amount' is in use, otherwise false. The 'texture amount' is represented
as a numeric stepper in the UI. If true, then the stepper is shown. If false, then the
stepper is hidden.
Since: 7.12

Rhino.Render.Fields.Field.IsHiddenInAutoUI
When fields are used by the automatic UI, they can be hidden from it by calling this method.
Since: 7.2

Rhino.Render.Fields.Field.AutomaticRegisteredProperty
Since: 8.15

Rhino.Render.Fields.Field.Set``1(``0)
Set the field value with a change notification of
RenderContent.ChangeContexts.Program.  Will throw an exception if the
key name is invalid or if T is not a supported data type.
Data type of the value parameter.
value: New value for this field.

Rhino.Render.Fields.Field.Set``1(``0,Rhino.Render.RenderContent.ChangeContexts)
Set the field value and send the appropriate change notification to the
render SDK.  Will throw an exception if the key name is invalid or if
T is not a supported data type.
Data type of the value parameter.
value: New value for this field.
changeContext: The reason why the value is changing.

Rhino.Render.Fields.Field.ValueAsObject
Since: 5.7

Rhino.Render.Fields.Field.GetValue``1
Parametrized version of GetValue calling appropriate ValueAs* methods.
Since: 6.12
Type of value to get.
Returns: Value of type T of the field

Rhino.Render.Fields.Field.ValueAsString
Get field value as a string.
Returns: Returns the field value as a string if possible.

Rhino.Render.Fields.Field.ValueAsBool
Return field value as a bool.
Returns: Returns field value as a bool.

Rhino.Render.Fields.Field.ValueAsInt
Return field value as integer.
Returns: Return the field value as an integer.

Rhino.Render.Fields.Field.ValueAsDouble
Return field value as a double precision number.
Returns: Return the field value as a double precision number.

Rhino.Render.Fields.Field.ValueAsFloat
Return field value as floating point number.
Returns: Return the field value as an floating point number.

Rhino.Render.Fields.Field.ValueAsColor4f
Return field as a Rhino.Display.Color4f color value.
Returns: Return field as a Rhino.Display.Color4f color value.

Rhino.Render.Fields.Field.ValueAsVector2d
Return field as a Rhino.Geometry.Vector2d color value.
Returns: Return field as a Rhino.Geometry.Vector2d color value.

Rhino.Render.Fields.Field.ValueAsVector3d
Return field as a Rhino.Geometry.Vector3d color value.
Returns: Return field as a Rhino.Geometry.Vector3d color value.

Rhino.Render.Fields.Field.ValueAsPoint2d
Return field as a Rhino.Geometry.Point2d color value.
Returns: Return field as a Rhino.Geometry.Point2d color value.

Rhino.Render.Fields.Field.ValueAsPoint3d
Return field as a Rhino.Geometry.Point3d color value.
Returns: Return field as a Rhino.Geometry.Point3d color value.

Rhino.Render.Fields.Field.ValueAsPoint4d
Return field as a Rhino.Geometry.Point4d color value.
Returns: Return field as a Rhino.Geometry.Point4d color value.

Rhino.Render.Fields.Field.ValueAsGuid
Return field value as Guid.
Returns: Return the field value as an Guid.

Rhino.Render.Fields.Field.ValueAsTransform
Return field as a Rhino.Geometry.Transform color value.
Returns: Return field as a Rhino.Geometry.Transform color value.

Rhino.Render.Fields.Field.ValueAsDateTime
Return field as a DateTime value.
Returns: Return field as a DateTime value.

Rhino.Render.Fields.Field.ValueAsByteArray
Return field as a byte array.
Returns: Return field as a byte array.

Rhino.Render.Fields.Field.InternalDispose
IDisposable required method

Rhino.Render.Fields.Field.FieldFromPointer(Rhino.Render.RenderContent,System.IntPtr)
Create a Field[data type] object from a content field pointer using its values
variant type to figure out what kind of Field[data type] object to return.
renderContent: RenderContent whose Fields dictionary the field belongs to.
fieldPointer:
C++ pointer to the field object, will throw a ArgumentNullException if this
value is null.
Returns: