Rhino.Geometry.BrepEdgeFilletDistance
Fillet distances along a BrepEdge
Since: 8.6

Rhino.Geometry.BrepEdgeFilletDistance.#ctor(System.Double,System.Double)
Construct a fillet distance
edgeParameter: The parameter along the edge where to apply the fillet distance
filletDistance: The distance to apply
Since: 8.7

Rhino.Geometry.BrepEdgeFilletDistance.EdgeParameter
The parameter along the BrepEdge where to apply a fillet distance (radius)
Since: 8.7

Rhino.Geometry.BrepEdgeFilletDistance.FilletDistance
Distance to fillet
Since: 8.7