Rhino.UI.PanelEventArgs
Panels.Show event arguments

Rhino.UI.PanelEventArgs.#ctor(System.Guid,System.UInt32)
Since: 6.0

Rhino.UI.PanelEventArgs.PanelId
Class Id for panel being shown or hidden
Since: 6.0

Rhino.UI.PanelEventArgs.DocumentSerialNumber
Since: 6.0

Rhino.UI.PanelEventArgs.Document
Since: 6.0