Rhino.Commands.CommandEventArgs.CommandId
Gets the ID of the command that raised this event.
Since: 5.0

Rhino.Commands.CommandEventArgs.CommandEnglishName
Gets the English name of the command that raised this event.
Since: 5.0

Rhino.Commands.CommandEventArgs.CommandLocalName
Gets the name of the command that raised this event in the local language.
Since: 5.0

Rhino.Commands.CommandEventArgs.CommandHelpURL
Gets the help url of the command that raised this event.
Remarks:
Null is a possible return. Calling function must check before using result.
m_help_url will get set only if the commmand has a ContextHelpURL override.
Since: 8.0

Rhino.Commands.CommandEventArgs.CommandIsHiddenFromUser
Returns true if the command that raised this event is hidden from the user;
that is it doesn't autocomplete on the command line.

Rhino.Commands.CommandEventArgs.CommandPluginName
Gets the name of the plug-in that this command belongs to.  If the command is internal
to Rhino, then this property is an empty string.
Since: 5.0

Rhino.Commands.CommandEventArgs.CommandResult
Gets the result of the command that raised this event.
This value is only meaningful during EndCommand events.
Since: 5.0

Rhino.Commands.CommandEventArgs.DocumentRuntimeSerialNumber
Since: 6.0

Rhino.Commands.CommandEventArgs.Document
Since: 6.0