Rhino.Render.RealtimeDisplayMode.DisplayPipelineSettingsChangedEventArgs.Attributes
Since: 6.0

Rhino.Render.RealtimeDisplayMode.DisplayPipelineSettingsChangedEventArgs.#ctor(Rhino.Display.DisplayPipelineAttributes)
Since: 6.0