Rhino.ApplicationSettings.ChooseOneObjectSettings
Contains static methods and properties to modify "choose one object" settings.
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettings.GetDefaultState
Gets the factory settings of the application.
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettings.GetCurrentState
Gets the current settings of the application.
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettings.RestoreDefaults
Commits the default settings as the current settings.
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettings.UpdateFromState(Rhino.ApplicationSettings.ChooseOneObjectSettingsState)
Sets all settings to a particular defined joined state.
state: The particular state.
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettings.FollowCursor
FollowCursor
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettings.XOffset
XOffset
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettings.YOffset
YOffset
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettings.AutomaticResize
AutomaticResize
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettings.MaxAutoResizeItems
MaxAutoResizeItems
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettings.ShowTitlebarAndBorder
ShowTitlebarAndBorder
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettings.ShowObjectName
ShowObjectName
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettings.ShowObjectType
ShowObjectType
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettings.ShowObjectColor
ShowObjectColor
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettings.ShowObjectLayer
ShowObjectLayer
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettings.DynamicHighlight
DynamicHighlight
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettings.UseCustomColor
UseCustomColor
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettings.HighlightColor
HighlightColor
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettings.ShowAllOption
ShowAllOption
Since: 8.0

Rhino.ApplicationSettings.ChooseOneObjectSettings.ShowObjectTypeDetails
ShowObjectTypeDetails
Since: 8.0