Rhino.FileIO.FileX_TWriteOptions
Options used when writing a X_T file

Rhino.FileIO.FileX_TWriteOptions.Type
Get and set the type of the x_t file being written.
Since: 8.0

Rhino.FileIO.FileX_TWriteOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0