Rhino.Render.Fields.BoolField
bool field value class

Rhino.Render.Fields.BoolField.#ctor(Rhino.Render.RenderContent,System.IntPtr)
Constructor
renderContent: RenderContent whose Fields owns this filed.
attachToPointer: Existing C++ pointer to attach to.

Rhino.Render.Fields.BoolField.Value
Gets or sets the field value
Since: 5.1

Rhino.Render.Fields.BoolField.ValueAsObject
Since: 5.7