Rhino.Geometry.BrepFace
Provides strongly-typed access to brep faces.
A Brep face is composed of one surface and trimming curves.

Rhino.Geometry.BrepFace.Brep
Gets the Brep that owns this face.
Since: 6.9

Rhino.Geometry.BrepFace.OrientationIsReversed
true if face orientation is opposite of natural surface orientation.
Since: 5.0

Rhino.Geometry.BrepFace.IsSurface
Gets a value indicating whether the face is synonymous with the underlying surface.
If a Face has no trimming curves then it is considered a Surface.
Since: 5.0

Rhino.Geometry.BrepFace.FaceIndex
Index of face in Brep.Faces array.
Since: 5.0

Rhino.Geometry.BrepFace.SurfaceIndex
Surface index of the 3d surface geometry used by this face or -1
Since: 5.6

Rhino.Geometry.BrepFace.Loops
Loops in this face.
Since: 5.0

Rhino.Geometry.BrepFace.OuterLoop
Every face has a single outer loop.
Since: 5.0

Rhino.Geometry.BrepFace.MaterialChannelIndex
This face's rendering material channel index.
Since: 6.26

Rhino.Geometry.BrepFace.PullPointsToFace(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Double)
Pulls one or more points to a brep face.
points: Points to pull.
tolerance: Tolerance for pulling operation. Only points that are closer than tolerance will be pulled to the face.
Returns: An array of pulled points.
Since: 5.0

Rhino.Geometry.BrepFace.DraftAnglePoint(Rhino.Geometry.Point2d,System.Double,Rhino.Geometry.Vector3d,System.Boolean,Rhino.Geometry.Point3d@,System.Double@)
Returns the surface draft angle and point at a parameter.
testPoint: The u,v parameter on the face to evaluate.
testAngle: The angle in radians to test.
pullDirection: The pull direction.
edge: Restricts the point placement to an edge.
draftPoint: The draft angle point.
draftAngle: The draft angle in radians.
Returns: True if successful, false otherwise.
Since: 6.0

Rhino.Geometry.BrepFace.RemoveHoles(System.Double)
Remove all inner loops, or holes, from a Brep face.
tolerance:
Returns:
Since: 6.0

Rhino.Geometry.BrepFace.CreateExtrusion(Rhino.Geometry.Curve,System.Boolean)
Extrude a face in a Brep.
pathCurve: The path to extrude along. Note, the direction of the extrusion will follow the direction of the curve.
cap: If true, the extrusion is capped with a translation of the face being extruded
Returns: A Brep on success or null on failure.
Since: 5.3

Rhino.Geometry.BrepFace.ShrinkFace(Rhino.Geometry.BrepFace.ShrinkDisableSide)
Shrinks the underlying untrimmed surface of this Brep face close to trimming boundaries.
Shrinking a surface is like extending smoothly, only backwards. knot of full multiplicity
are added where you want the surface to be cut off. Then the remaining control points are
thrown away.
disableSide: The side(s) of the surface to not shrink.
Returns: true on success, false on failure.
Since: 6.0

Rhino.Geometry.BrepFace.RefitTrim(Rhino.Geometry.BrepEdge,System.Collections.Generic.IEnumerable{System.Double},System.Double,System.Boolean,System.Double@)
The RefitTrim command replaces a trimmed surface edge with an untrimmed edge.
edge: The edge to fit.
knots: The custom knot vector to use, or an empty vector to use the existing knots of the surface.
tolerance: The 3d tolerance for projection, splitting, and fitting.
bSections: If true, the surface is divided into separate surface patches at all knots.
fitQuality: A measure of the 3d fit to the trim curve.
Returns: The trimmed surfaces.
Since: 7.0

Rhino.Geometry.BrepFace.ShrinkSurfaceToEdge
Shrinks the underlying untrimmed surface of this Brep face right to the trimming boundaries.
Note, shrinking the trimmed surface can sometimes cause problems later since having
the edges so close to the trimming boundaries can cause commands that use the surface
edges as input to fail.
Returns: true on success, false on failure.
Since: 6.16

Rhino.Geometry.BrepFace.SetDomain(System.Int32,Rhino.Geometry.Interval)
Sets the surface domain of this face.
direction: Direction of face to set (0 = U, 1 = V).
domain: Domain to apply.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.BrepFace.DuplicateFace(System.Boolean)
Duplicate a face from the brep to create new single face brep.
duplicateMeshes: If true, shading meshes will be copied as well.
Returns: A new single-face brep synonymous with the current Face.
Since: 5.0

Rhino.Geometry.BrepFace.DuplicateSurface
Gets a copy to the untrimmed surface that this face is based on.
Returns: A copy of this face's underlying surface.
Since: 5.0

Rhino.Geometry.BrepFace.UnderlyingSurface
Gets the untrimmed surface that is the base of this face.
Returns: A surface, or null on error.
Since: 5.0

Rhino.Geometry.BrepFace.Split(System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Double)
Split this face using 3D trimming curves.
curves: Curves to split with.
tolerance: Tolerance for splitting, when in doubt use the Document Absolute Tolerance.
Returns: A brep consisting of all the split fragments, or null on failure.
Since: 5.0

Rhino.Geometry.BrepFace.IsPointOnFace(System.Double,System.Double)
Tests if a parameter space point is in the active region of a face.
u: Parameter space point U value.
v: Parameter space point V value.
Returns: A value describing the relationship between the point and the face.
Since: 5.0

Rhino.Geometry.BrepFace.IsPointOnFace(System.Double,System.Double,System.Double)
Tests if a parameter space point is in the active region of a face.
u: Parameter space point U value.
v: Parameter space point V value.
tolerance: 3D tolerance used when checking to see if the point is on a face or inside of a loop.
Returns: A value describing the relationship between the point and the face.
Since: 7.0

Rhino.Geometry.BrepFace.TrimAwareIsoIntervals(System.Int32,System.Double)
Gets intervals where the iso curve exists on a BrepFace (trimmed surface)
direction: Direction of isocurve.
0 = Isocurve connects all points with a constant U value.
1 = Isocurve connects all points with a constant V value.
constantParameter: Surface parameter that remains identical along the isocurves.
Returns:
If direction = 0, the parameter space iso interval connects the 2d points
(intervals[i][0],iso_constant) and (intervals[i][1],iso_constant).
If direction = 1, the parameter space iso interval connects the 2d points
(iso_constant,intervals[i][0]) and (iso_constant,intervals[i][1]).
Since: 5.0

Rhino.Geometry.BrepFace.TrimAwareIsoCurve(System.Int32,System.Double)
Similar to IsoCurve function, except this function pays attention to trims on faces
and may return multiple curves.
direction: Direction of isocurve.
0 = Isocurve connects all points with a constant U value.
1 = Isocurve connects all points with a constant V value.
constantParameter: Surface parameter that remains identical along the isocurves.
Returns: Isoparametric curves connecting all points with the constantParameter value.
Remarks:
In this function "direction" indicates which direction the resulting curve runs.
0: horizontal, 1: vertical
In the other Surface functions that take a "direction" argument,
"direction" indicates if "constantParameter" is a "u" or "v" parameter.
Since: 5.0

Rhino.Geometry.BrepFace.GetMesh(Rhino.Geometry.MeshType)
Obtains a reference to a specified type of mesh for this brep face.
meshType: The mesh type.
Returns: A mesh.
Since: 5.0

Rhino.Geometry.BrepFace.SetMesh(Rhino.Geometry.MeshType,Rhino.Geometry.Mesh)
Sets a reference to a specified type of mesh for this brep face.
meshType: The mesh type.
mesh: The new mesh.
Returns: true if the operation succeeded; otherwise false.
Since: 5.0

Rhino.Geometry.BrepFace.AdjacentEdges
Gets the indices of all the BrepEdges that delineate this Face.
Since: 5.0

Rhino.Geometry.BrepFace.AdjacentFaces
Gets the indices of all the BrepFaces that surround (are adjacent to) this face.
Since: 5.0

Rhino.Geometry.BrepFace.ChangeSurface(System.Int32)
Expert user tool that replaces the 3d surface geometry use by the face.
surfaceIndex: brep surface index of new surface.
Returns: true if successful.
Remarks:
If the face had a surface and new surface has a different shape, then
you probably want to call something like RebuildEdges() to move
the 3d edge curves so they will lie on the new surface. This doesn't
delete the old surface; call Brep.CullUnusedSurfaces() or Brep.Compact()
to remove unused surfaces.
Since: 5.0

Rhino.Geometry.BrepFace.RebuildEdges(System.Double,System.Boolean,System.Boolean)
Rebuild the edges used by a face so they lie on the surface.
tolerance: tolerance for fitting 3d edge curves.
rebuildSharedEdges:
if false and edge is used by this face and a neighbor, then the edge
will be skipped.
rebuildVertices:
if true, vertex locations are updated to lie on the surface.
Returns: true on success.
Since: 5.0

Rhino.Geometry.BrepFace.SetPackId(System.UInt32)
Used by SubD functions that create breps to transmit the subd face SubDFace.PackId value
to the brep face or faces generated from the subd face.
Unless you are an expert and doing something very carefully and very fancy, to not call this function.
packId: The pack id.
Since: 7.19

Rhino.Geometry.BrepFace.ClearPackId
Sets BrepFace.PackId to 0.
Since: 7.19

Rhino.Geometry.BrepFace.PackId
0 if the pack it is unset, or >0 if the set pack id.
Remarks:
PackId values assigned to brep faces are inheritied from the PackId values
assigned to subd faces when a subd is converted into a brep.
These faces are "trivially trimmed" which means the boundary of the face
is identical to the boundary of the underlying surface.
There are two types of face packs in a subd, quad grid packs and singleton packs.
A subd quad grid pack is a set of subd quads that form a rectangular grid.
A subd singleton pack is a single face, quad or n-gon, that is not part of
a quad grid pack.
There are three types of face packs in a brep created from a subd,
grid packs, star packs and singleton packs.
A brep "grid pack" comes from a rectangular grid of subd quads. A grid pack of brep faces can
be converted into a single larger trivially trimmed brep face.
A brep "star pack" of brep faces comes from a singel subd n-gon (n = 3, 5 or more). The star pack
will have n faces with a star center vertex and shared edges radiating from the star center.
A brep "singleton" pack comes from a single subd quad that could not be grouped into a larger
subd quad grid pack.
Since: 7.19

Rhino.Geometry.BrepFace.ProxyBrepSubDFaceId
If this face is part of a brep created by SubD.ProxyBrep(), then
the subd component id of the corresponding SubD face is returned.
Otherwise 0 is returned.
Since: 7.19

Rhino.Geometry.BrepFace.Id
Gets or sets the persistent id of this Brep face. By default, the id is Guid.Zero.
Note, Rhino does not set this id. Thus, the property is available for use
as a way of tracking Brep faces.
Since: 7.7

Rhino.Geometry.BrepFace.PerFaceColor
If per-face color is "Empty", then this face does not have a custom color
Since: 7.0

Rhino.Geometry.BrepFace.ClearMaterialChannelIndex
Clear this face's rendering material channel index.
Since: 6.26

Rhino.Geometry.BrepFace.FilletSurfaceToRail(Rhino.Geometry.Curve,Rhino.Geometry.BrepFace,System.Double,System.Double,System.Int32,System.Int32,System.Collections.Generic.IEnumerable{System.Double},System.Int32,System.Boolean,Rhino.Geometry.FilletSurfaceSplitType,System.Double,System.Collections.Generic.List{Rhino.Geometry.Brep},System.Collections.Generic.List{Rhino.Geometry.Brep},System.Collections.Generic.List{Rhino.Geometry.Brep},System.Double[]@)
Creates a surface between two surfaces, with a fixed rail curve on the first surface.
curveOnFace: A curve on this face
secondFace: The second face
u1: A parameter in the u direction of the second face at the side you want to keep after filleting.
v1: A parameter in the v direction of the second face at the side you want to keep after filleting.
railDegree: Desired fillet degree (3 or 5) in the u-direction, along the rails
arcDegree: esired fillet degree (2, 3, 4, or 5) in the v-direction, along the fillet arcs.If 2, then the surface is rational in v
arcSliders: Array of 2 sliders to shape the fillet in the arc direction, used for arcDegree = 3, 4, or 5; input { 0.0, 0.0 } to ignore
[0] (-1 to 1) slides tangent arms from base (-1) to theoretical(1)
[1] (-1 to 1) slides inner CV(s) from base (-1) to theoretical(1)
numBezierSrfs: If >0, this indicates the number of equally-spaced fillet surfaces to be output in the rail direction, each surface Bézier in u.
extend: If true, then when one input surface is longer than the other, the fillet surface is extended to the input surface edges.
split_type: The split type
tolerance: The tolerance. In in doubt, the document's absolute tolerance.
out_fillets: The results of the fillet calculation.
out_breps0: The trim or split results of the Brep owned by faceWithCurve.
out_breps1: The trim or split results of the Brep owned by pFace1.
fitResults: array of doubles indicating fitting results:
[0] max 3d point deviation along surface 0
[1] max 3d point deviation along surface 1
[2] max angle deviation along surface 0 (in degrees)
[3] max angle deviation along surface 1 (in degrees)
[4] max angle deviation between Bézier surfaces(in degrees)
[5] max curvature difference between Bézier surfaces
Returns:  true if successful, false otherwise.
Remarks: The trim or split input Breps are in OutBreps0, and OutBreps1. If the input faces are
from the same Brep, nothing will be added to OutBreps1.If you specified a split type
of RhinoFilletSurfaceSplitType::Nothing, then nothing will be added to either OutBreps0
or OutBreps1.
Since: 8.0

Rhino.Geometry.BrepFace.FilletSurfaceToCurve(Rhino.Geometry.Curve,System.Double,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Collections.Generic.IEnumerable{System.Double},System.Int32,System.Double,System.Collections.Generic.List{Rhino.Geometry.Brep},System.Double[]@)
Creates a constant-radius fillet surface between a surface and the curve.
curve: the curve to which this face is being filleted.
t: A parameter on the curve, indicating region of fillet.
u: A parameter in the u direction of the face indicating which side of the curve to fillet.
v: A parameter in the v direction of the face indicating which side of the curve to fillet.
radius: The radius of the constant-radius fillet desired. NOTE: using arcSliders will change the shape of the arcs themselves
alignToCurve: Does the user want the fillet to align to the curve?
0 - No, ignore the curve's b-spline structure
1 - Yes, match the curves's degree, spans, CVs as much as possible
2 - Same as 1, but iterate to fit to tolerance
Note that a value of 1 or 2 will cause nBezierSrfs to be ignored
railDegree: Desired fillet degree (3 or 5) in the u-direction, along the curve
arcDegree: Desired fillet degree (2, 3, 4, or 5) in the v-direction, along the fillet arcs.If 2, then the surface is rational in v
arcSliders: Array of 2 sliders to shape the fillet in the arc direction, used for arcDegree = 3, 4, or 5; input { 0.0, 0.0 } to ignore
[0] (-1 to 1) slides tangent arms from base (-1) to theoretical(1)
[1] (-1 to 1) slides inner CV(s) from base (-1) to theoretical(1)
numBezierSrfs: If >0, this indicates the number of equally-spaced fillet surfaces to be output in the rail direction, each surface Bézier in u.
tolerance: The tolerance. In in doubt, the document's absolute tolerance.
out_fillets: he results of the fillet calculation.
fitResults: array of doubles indicating fitting results:
[0] max 3d point deviation along curve
[1] max 3d point deviation along face
[2] max angle deviation along face(in degrees)
[3] max angle deviation between Bézier surfaces(in degrees)
[4] max curvature difference between Bézier surfaces
Returns: true if successful, false otherwise.
Since: 8.0