Rhino.Render.FreeFloatingBase
Base class for Rhino.Render objects that are owned by the document, or can be delivered separately
from other functions.  In general, you cannot create these objects yourself.

Rhino.Render.FreeFloatingBase.DefaultCppConstructor
Implementation must provide a function that calls into C++ to default construct an object of this type.
Returns:

Rhino.Render.FreeFloatingBase.CopyFrom(Rhino.Render.FreeFloatingBase)
Copy from another object
src:
Since: 6.0

Rhino.Render.FreeFloatingBase.Finalize
Handle destruction of the un-managed CPP object.