Rhino.Geometry.Collections.NurbsCurveKnotList
Provides access to the knot vector of a NURBS curve.

Rhino.Geometry.Collections.NurbsCurveKnotList.Count
Total number of knots in this curve.
Since: 5.0

Rhino.Geometry.Collections.NurbsCurveKnotList.Item(System.Int32)
Gets or sets the knot vector value at the given index.
index: Index of knot to access.
Returns: The knot value at [index]

Rhino.Geometry.Collections.NurbsCurveKnotList.EnsurePrivateCopy
If you want to keep a copy of this class around by holding onto it in a variable after a command
completes, call EnsurePrivateCopy to make sure that this class is not tied to the document. You can
call this function as many times as you want.
Since: 5.0

Rhino.Geometry.Collections.NurbsCurveKnotList.InsertKnot(System.Double)
Inserts a knot and update control point locations.
Does not change parameterization or locus of curve.
value: Knot value to insert.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Collections.NurbsCurveKnotList.InsertKnot(System.Double,System.Int32)
Inserts a knot and update control point locations.
Does not change parameterization or locus of curve.
value: Knot value to insert.
multiplicity: Multiplicity of knot to insert.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Collections.NurbsCurveKnotList.KnotMultiplicity(System.Int32)
Get knot multiplicity.
index: Index of knot to query.
Returns: The multiplicity (valence) of the knot.
Since: 5.0

Rhino.Geometry.Collections.NurbsCurveKnotList.CreateUniformKnots(System.Double)
Compute a clamped, uniform knot vector based on the current
degree and control point count. Does not change values of control
vertices.
knotSpacing: Spacing of subsequent knots.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Collections.NurbsCurveKnotList.CreatePeriodicKnots(System.Double)
Compute a clamped, uniform, periodic knot vector based on the current
degree and control point count. Does not change values of control
vertices.
knotSpacing: Spacing of subsequent knots.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Collections.NurbsCurveKnotList.IsClampedStart
Gets a value indicating whether or not the knot vector is clamped at the start of the curve.
Clamped curves start at the first control-point. This requires fully multiple knots.
Since: 5.0

Rhino.Geometry.Collections.NurbsCurveKnotList.IsClampedEnd
Gets a value indicating whether or not the knot vector is clamped at the end of the curve.
Clamped curves are coincident with the first and last control-point. This requires fully multiple knots.
Since: 5.0

Rhino.Geometry.Collections.NurbsCurveKnotList.ClampEnd(Rhino.Geometry.CurveEnd)
Clamp end knots. Does not modify control point locations.
end: Curve end to clamp.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Collections.NurbsCurveKnotList.SuperfluousKnot(System.Boolean)
Computes the knots that are superfluous because they are not used in NURBs evaluation.
These make it appear so that the first and last curve spans are different from interior spans.
http://wiki.mcneel.com/developer/onsuperfluousknot
start: true if the query targets the first knot. Otherwise, the last knot.
Returns: A component.
Since: 5.0

Rhino.Geometry.Collections.NurbsCurveKnotList.KnotStyle
Gets the style of the knot vector.
Since: 7.1

Rhino.Geometry.Collections.NurbsCurveKnotList.RemoveMultipleKnots(System.Int32,System.Int32,System.Double)
Remove multiple knots from this curve.
minimumMultiplicity:
Remove knots with multiplicity > minimumKnotMultiplicity.
maximumMultiplicity:
Remove knots with multiplicity < maximumKnotMultiplicity.
tolerance:
When you remove knots, the shape of the curve is changed.
If tolerance is RhinoMath.UnsetValue, any amount of change is permitted.
If tolerance is >=0, the maximum distance between the input and output
curve is restricted to be <= tolerance.
Returns: number of knots removed on success. 0 if no knots were removed
Since: 6.0

Rhino.Geometry.Collections.NurbsCurveKnotList.RemoveKnots(System.Int32,System.Int32)
Remove knots from a curve and adjusts the remaining control points to maintain curve position as closely as possible.
The knots from Knots[index0] through Knots[index1 - 1] will be removed.
index0: The starting knot index, where Degree-1 < index0 < index1 <= Points.Count-1.
index1: The ending knot index, where Degree-1 < index0 < index1 <= Points.Count-1.
Returns: true if successful, false on failure.
Since: 6.0

Rhino.Geometry.Collections.NurbsCurveKnotList.RemoveKnotAt(System.Double)
Remove a knot from a curve and adjusts the remaining control points to maintain curve position as closely as possible.
t: The parameter on the curve that is closest to the knot to be removed.
Returns: true if successful, false on failure.
Since: 6.0

Rhino.Geometry.Collections.NurbsCurveKnotList.EpsilonEquals(Rhino.Geometry.Collections.NurbsCurveKnotList,System.Double)
Checks that all values in the other list are sequentially equal within epsilon to the values in this list.
other: The other list.
epsilon: The epsilon value.
Returns: True if values are, orderly, equal within epsilon. False otherwise.
Since: 5.4

Rhino.Geometry.Collections.NurbsCurveKnotList.IndexOf(System.Double)
Returns the first item in the list.
item: The value.
Returns: The index, or -1 if no index is found.
Since: 6.0

Rhino.Geometry.Collections.NurbsCurveKnotList.Contains(System.Double)
Returns an indication of the presence of a value in the knot list.
item: The item.
Returns: true if present, false otherwise.
Since: 6.0

Rhino.Geometry.Collections.NurbsCurveKnotList.CopyTo(System.Double[],System.Int32)
Copies the list to an array.
array: The array to copy to.
arrayIndex: The index into copy will begin.
Since: 6.0