Rhino.Geometry.RailType
Rail types used for creating filleted Brep edges
Since: 6.0

Rhino.Geometry.RailType.DistanceFromEdge
The distance from the edge curves determines the intersection.

Rhino.Geometry.RailType.RollingBall
The radius of a rolling ball determines the intersection.

Rhino.Geometry.RailType.DistanceBetweenRails
The distance between the edge rails determines the intersection.