Rhino.Render.PostEffects.CustomPostEffectAttribute.#ctor(Rhino.Render.PostEffects.PostEffectType,System.String,Rhino.Render.PostEffects.PostEffectStyles,Rhino.Render.PostEffects.PostEffectExecuteWhileRenderingOptions,System.Boolean,System.Int32)
Since: 7.0

Rhino.Render.PostEffects.CustomPostEffectAttribute.PostEffectType
Since: 7.0

Rhino.Render.PostEffects.CustomPostEffectAttribute.Styles
Since: 7.0

Rhino.Render.PostEffects.CustomPostEffectAttribute.ExecuteWhileRenderingOption
Since: 7.0

Rhino.Render.PostEffects.CustomPostEffectAttribute.CanDisplayHelp
Since: 7.0

Rhino.Render.PostEffects.CustomPostEffectAttribute.Name
Since: 7.0

Rhino.Render.PostEffects.CustomPostEffectAttribute.ExecuteWhileRenderingDelay
Since: 7.0