Rhino.DocObjects.ViewportInfo
Represents a viewing frustum.

Rhino.DocObjects.ViewportInfo.#ctor
Initializes a new instance.
Since: 5.0

Rhino.DocObjects.ViewportInfo.#ctor(Rhino.DocObjects.ViewportInfo)
Initializes a new instance by copying values from another instance.
other: The other viewport info.
Since: 5.0

Rhino.DocObjects.ViewportInfo.#ctor(Rhino.Display.RhinoViewport)
Copies all of the ViewportInfo data from an existing RhinoViewport.
rhinoViewport: A viewport to copy.
Since: 5.0

Rhino.DocObjects.ViewportInfo.CalculateCameraRotationAngle(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Calculates the camera rotation angle.
direction: The camera direction.
up: The camera up direction.
Returns: The camera rotation angle in radians.
Since: 6.8

Rhino.DocObjects.ViewportInfo.CalculateCameraUpDirection(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,System.Double)
Calculates the camera up direction.
location: The camera location.
direction: The camera direction.
angle: The camera rotation angle in radians.
Returns: The camera up direction.
Since: 6.8

Rhino.DocObjects.ViewportInfo.IsValidCamera
Gets a value that indicates whether the camera is valid.
Since: 5.0

Rhino.DocObjects.ViewportInfo.IsValidFrustum
Gets a value that indicates whether the frustum is valid.
Since: 5.0

Rhino.DocObjects.ViewportInfo.IsPerspectiveProjection
Get or set whether this projection is perspective.
Since: 5.0

Rhino.DocObjects.ViewportInfo.IsParallelProjection
Get or set whether this projection is parallel.
Since: 5.0

Rhino.DocObjects.ViewportInfo.IsTwoPointPerspectiveProjection
Gets a value that indicates whether this projection is a two-point perspective.
Since: 5.0

Rhino.DocObjects.ViewportInfo.ChangeToParallelProjection(System.Boolean)
Use this function to change projections of valid viewports
from parallel to perspective.  It will make common additional
adjustments to the frustum and camera location so the resulting
views are similar.  The camera direction and target point are
not be changed.
If the current projection is parallel and symmetricFrustum,
FrustumIsLeftRightSymmetric() and FrustumIsTopBottomSymmetric()
are all equal, then no changes are made and true is returned.
symmetricFrustum: true if you want the resulting frustum to be symmetric.
Returns: true if the operation succeeded; otherwise, false.
Since: 5.0

Rhino.DocObjects.ViewportInfo.ChangeToParallelReflectedProjection
When a viewport is set to Parallel Reflected projection, the geometry on the ceiling is shown as if it is mirrored to the floor below.
Returns: true if successful
Since: 8.14

Rhino.DocObjects.ViewportInfo.ChangeToPerspectiveProjection(System.Double,System.Boolean,System.Double)
Use this function to change projections of valid viewports
from parallel to perspective.  It will make common additional
adjustments to the frustum and camera location so the resulting
views are similar.  The camera direction and target point are
not changed.
If the current projection is perspective and symmetricFrustum,
IsFrustumIsLeftRightSymmetric, and IsFrustumIsTopBottomSymmetric
are all equal, then no changes are made and true is returned.
targetDistance:
If RhinoMath.UnsetValue this parameter is ignored.
Otherwise it must be > 0 and indicates which plane in the current view frustum should be preserved.
symmetricFrustum:
true if you want the resulting frustum to be symmetric.
lensLength: (pass 50.0 when in doubt)
35 mm lens length to use when changing from parallel
to perspective projections. If the current projection
is perspective or lens_length is <= 0.0,
then this parameter is ignored.
Returns: true if the operation succeeded; otherwise, false.
Since: 5.0

Rhino.DocObjects.ViewportInfo.ChangeToTwoPointPerspectiveProjection(System.Double,Rhino.Geometry.Vector3d,System.Double)
Changes projections of valid viewports
to a two point perspective.  It will make common additional
adjustments to the frustum and camera location and direction
so the resulting views are similar.
If the current projection is perspective and
IsFrustumIsLeftRightSymmetric is true and
IsFrustumIsTopBottomSymmetric is false, then no changes are
made and true is returned.
targetDistance:
If RhinoMath.UnsetValue this parameter is ignored.  Otherwise
it must be > 0 and indicates which plane in the current
view frustum should be preserved.
up:
The locked up direction. Pass Vector3d.Zero if you want to use the world
axis direction that is closest to the current up direction.
Pass CameraY() if you want to preserve the current up direction.
lensLength:
(pass 50.0 when in doubt)
35 mm lens length to use when changing from parallel
to perspective projections. If the current projection
is perspective or lens_length is <= 0.0,
then this parameter is ignored.
Returns: true if the operation succeeded; otherwise, false.
Since: 5.0

Rhino.DocObjects.ViewportInfo.CameraLocation
Gets the camera location (position) point.
Since: 5.0

Rhino.DocObjects.ViewportInfo.SetCameraLocation(Rhino.Geometry.Point3d)
Sets the camera location (position) point.
Returns: true if the operation succeeded; otherwise, false.
Since: 5.0

Rhino.DocObjects.ViewportInfo.CameraDirection
Gets the direction that the camera faces.
Since: 5.0

Rhino.DocObjects.ViewportInfo.SetCameraDirection(Rhino.Geometry.Vector3d)
Sets the direction that the camera faces.
direction: A new direction.
Returns: true if the direction was set; otherwise false.
Since: 5.0

Rhino.DocObjects.ViewportInfo.CameraUp
Gets the camera up vector.
Since: 5.0

Rhino.DocObjects.ViewportInfo.SetCameraUp(Rhino.Geometry.Vector3d)
Sets the camera up vector.
up: A new direction.
Returns: true if the direction was set; otherwise false.
Since: 5.0

Rhino.DocObjects.ViewportInfo.IsCameraLocationLocked
Gets or sets a value that indicates whether the camera location is unmodifiable.
Since: 5.0

Rhino.DocObjects.ViewportInfo.IsCameraDirectionLocked
Gets or sets a value that indicates whether the direction that the camera faces is unmodifiable.
Since: 5.0

Rhino.DocObjects.ViewportInfo.IsCameraUpLocked
Gets or sets a value that indicates whether the camera up vector is unmodifiable.
Since: 5.0

Rhino.DocObjects.ViewportInfo.IsFrustumLeftRightSymmetric
Gets or sets a value that indicates whether the camera frustum has a vertical symmetry axis.
Since: 5.0

Rhino.DocObjects.ViewportInfo.IsFrustumTopBottomSymmetric
Gets or sets a value that indicates whether the camera frustum has a horizontal symmetry axis.
Since: 5.0

Rhino.DocObjects.ViewportInfo.UnlockCamera
Unlocks the camera vectors and location.
Since: 5.0

Rhino.DocObjects.ViewportInfo.UnlockFrustumSymmetry
Unlocks frustum horizontal and vertical symmetries.
Since: 5.0

Rhino.DocObjects.ViewportInfo.GetCameraFrame(Rhino.Geometry.Point3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@)
Gets location and vectors of this camera.
location: An out parameter that will be filled with a point during the call.
cameraX: An out parameter that will be filled with the X vector during the call.
cameraY: An out parameter that will be filled with the Y vector during the call.
cameraZ: An out parameter that will be filled with the Z vector during the call.
Returns: true if current camera orientation is valid; otherwise false.
Since: 5.0

Rhino.DocObjects.ViewportInfo.CameraX
Gets the unit "to the right" vector.
Since: 5.0

Rhino.DocObjects.ViewportInfo.CameraY
Gets the unit "up" vector.
Since: 5.0

Rhino.DocObjects.ViewportInfo.CameraZ
Gets the unit vector in -CameraDirection.
Since: 5.0

Rhino.DocObjects.ViewportInfo.DefaultCameraDirection
Default z=up perspective camera direction
Since: 6.0

Rhino.DocObjects.ViewportInfo.SetFrustum(System.Double,System.Double,System.Double,System.Double,System.Double,System.Double)
Sets the view frustum. If FrustumSymmetryIsLocked() is true
and left != -right or bottom != -top, then they will be
adjusted so the resulting frustum is symmetric.
left: A new left value.
right: A new right value.
bottom: A new bottom value.
top: A new top value.
nearDistance: A new near distance value.
farDistance: A new far distance value.
Returns: true if operation succeeded; otherwise, false.
Since: 5.0

Rhino.DocObjects.ViewportInfo.GetFrustum(System.Double@,System.Double@,System.Double@,System.Double@,System.Double@,System.Double@)
Gets the view frustum.
left: A left value that will be filled during the call.
right: A right value that will be filled during the call.
bottom: A bottom value that will be filled during the call.
top: A top value that will be filled during the call.
nearDistance: A near distance value that will be filled during the call.
farDistance: A far distance value that will be filled during the call.
Returns: true if operation succeeded; otherwise, false.
Since: 5.0

Rhino.DocObjects.ViewportInfo.FrustumAspect
Setting FrustumAspect changes the larger of the frustum's width/height
so that the resulting value of width/height matches the requested
aspect.  The camera angle is not changed.  If you change the shape
of the view port with a call SetScreenPort(), then you generally
want to call SetFrustumAspect() with the value returned by
GetScreenPortAspect().
Since: 5.0

Rhino.DocObjects.ViewportInfo.FrustumCenter
Gets the frustum center point.
Since: 5.0

Rhino.DocObjects.ViewportInfo.FrustumLeft
Gets the frustum left value. This is -right if the frustum has a vertical symmetry axis.
This number is usually negative.
Since: 5.0

Rhino.DocObjects.ViewportInfo.FrustumRight
Gets the frustum right value. This is -left if the frustum has a vertical symmetry axis.
This number is usually positive.
Since: 5.0

Rhino.DocObjects.ViewportInfo.FrustumBottom
Gets the frustum bottom value. This is -top if the frustum has a horizontal symmetry axis.
This number is usually negative.
Since: 5.0

Rhino.DocObjects.ViewportInfo.FrustumTop
Gets the frustum top value. This is -bottom if the frustum has a horizontal symmetry axis.
This number is usually positive.
Since: 5.0

Rhino.DocObjects.ViewportInfo.FrustumNear
Gets the frustum near-cutting value.
Since: 5.0

Rhino.DocObjects.ViewportInfo.FrustumFar
Gets the frustum far-cutting value.
Since: 5.0

Rhino.DocObjects.ViewportInfo.FrustumWidth
Gets the frustum width. This is Rhino.DocObjects.ViewportInfo.FrustumRight - Rhino.DocObjects.ViewportInfo.FrustumLeft.
Since: 5.0

Rhino.DocObjects.ViewportInfo.FrustumHeight
Gets the frustum height. This is Rhino.DocObjects.ViewportInfo.FrustumTop - Rhino.DocObjects.ViewportInfo.FrustumBottom.
Since: 5.0

Rhino.DocObjects.ViewportInfo.FrustumMinimumDiameter
Gets the frustum minimum diameter, or the minimum between Rhino.DocObjects.ViewportInfo.FrustumWidth and Rhino.DocObjects.ViewportInfo.FrustumHeight.
Since: 5.0

Rhino.DocObjects.ViewportInfo.FrustumMaximumDiameter
Gets the frustum maximum diameter, or the maximum between Rhino.DocObjects.ViewportInfo.FrustumWidth and Rhino.DocObjects.ViewportInfo.FrustumHeight.
Since: 5.0

Rhino.DocObjects.ViewportInfo.SetFrustumNearFar(Rhino.Geometry.BoundingBox)
Sets the frustum near and far using a bounding box.
boundingBox: A bounding box to use.
Returns: true if operation succeeded; otherwise, false.
Since: 5.0

Rhino.DocObjects.ViewportInfo.SetFrustumNearFar(Rhino.Geometry.Point3d,System.Double)
Sets the frustum near and far using a center point and radius.
center: A center point.
radius: A radius value.
Returns: true if operation succeeded; otherwise, false.
Since: 5.0

Rhino.DocObjects.ViewportInfo.SetFrustumNearFar(System.Double,System.Double)
Sets the frustum near and far distances using two values.
nearDistance: The new near distance.
farDistance: The new far distance.
Returns: true if operation succeeded; otherwise, false.
Since: 5.0

Rhino.DocObjects.ViewportInfo.ChangeToSymmetricFrustum(System.Boolean,System.Boolean,System.Double)
If needed, adjusts the current frustum so it has the
specified symmetries and adjust the camera location
so the target plane remains visible.
isLeftRightSymmetric: If true, the frustum will be adjusted so left = -right.
isTopBottomSymmetric: If true, the frustum will be adjusted so top = -bottom.
targetDistance:
If projection is not perspective or target_distance is RhinoMath.UnsetValue,
then this parameter is ignored. If the projection is perspective and targetDistance
is not RhinoMath.UnsetValue, then it must be > 0.0 and it is used to determine
which plane in the old frustum will appear unchanged in the new frustum.
Returns:
Returns true if the viewport has now a frustum with the specified symmetries.
Since: 5.0

Rhino.DocObjects.ViewportInfo.GetPointDepth(Rhino.Geometry.Point3d,System.Double@)
Gets the clipping distance of a point. This function ignores the
current value of the viewport's near and far settings. If
the viewport is a perspective projection, then it intersects
the semi infinite frustum volume with the bounding box and
returns the near and far distances of the intersection.
If the viewport is a parallel projection, it intersects the
infinite view region with the bounding box and returns the
near and far distances of the projection.
point: A point to measure.
distance: distance of the point (can be < 0)
Returns: true if the bounding box intersects the view frustum and
near_dist/far_dist were set.
false if the bounding box does not intersect the view frustum.
Since: 5.0

Rhino.DocObjects.ViewportInfo.GetBoundingBoxDepth(Rhino.Geometry.BoundingBox,System.Double@,System.Double@)
Gets near and far clipping distances of a bounding box.
This function ignores the current value of the viewport's
near and far settings. If the viewport is a perspective
projection, the it intersects the semi infinite frustum
volume with the bounding box and returns the near and far
distances of the intersection.  If the viewport is a parallel
projection, it intersects the infinite view region with the
bounding box and returns the near and far distances of the
projection.
bbox: The bounding box to sample.
nearDistance: Near distance of the box. This value can be zero or
negative when the camera location is inside box.
farDistance: Far distance of the box. This value can be equal to
near_dist, zero or negative when the camera location is in front of the bounding box.
Returns: true if the bounding box intersects the view frustum and near_dist/far_dist were set.
false if the bounding box does not intersect the view frustum.
Since: 5.0

Rhino.DocObjects.ViewportInfo.GetSphereDepth(Rhino.Geometry.Sphere,System.Double@,System.Double@)
Gets near and far clipping distances of a bounding sphere.
sphere: The sphere to sample.
nearDistance: Near distance of the sphere (can be < 0)
farDistance: Far distance of the sphere (can be equal to near_dist)
Returns: true if the sphere intersects the view frustum and near_dist/far_dist were set.
false if the sphere does not intersect the view frustum.
Since: 5.0

Rhino.DocObjects.ViewportInfo.SetFrustumNearFar(System.Double,System.Double,System.Double,System.Double,System.Double)
Sets near and far clipping distance subject to constraints.
nearDistance: (>0) desired near clipping distance.
farDistance: (>near_dist) desired near clipping distance.
minNearDistance:
If min_near_dist <= 0.0, it is ignored.
If min_near_dist > 0 and near_dist < min_near_dist, then the frustum's near_dist will be increased to min_near_dist.
minNearOverFar:
If min_near_over_far <= 0.0, it is ignored.
If near_dist < far_dist*min_near_over_far, then
near_dist is increased and/or far_dist is decreased
so that near_dist = far_dist*min_near_over_far.
If near_dist < target_dist < far_dist, then near_dist
near_dist is increased and far_dist is decreased so that
projection precision will be good at target_dist.
Otherwise, near_dist is simply set to
far_dist*min_near_over_far.
targetDistance: If target_dist <= 0.0, it is ignored.
If target_dist > 0, it is used as described in the
description of the min_near_over_far parameter.
Returns: true if operation succeeded; otherwise, false.
Since: 5.0

Rhino.DocObjects.ViewportInfo.FrustumNearPlane
Gets near clipping plane if camera and frustum
are valid.  The plane's frame is the same as the camera's
frame.  The origin is located at the intersection of the
camera direction ray and the near clipping plane. The plane's
normal points out of the frustum towards the camera
location.
Since: 5.0

Rhino.DocObjects.ViewportInfo.FrustumFarPlane
Gets far clipping plane if camera and frustum
are valid.  The plane's frame is the same as the camera's
frame.  The origin is located at the intersection of the
camera direction ray and the far clipping plane. The plane's
normal points into the frustum towards the camera location.
Since: 5.0

Rhino.DocObjects.ViewportInfo.FrustumLeftPlane
Gets the frustum left plane that separates visible from off-screen.
Since: 5.0

Rhino.DocObjects.ViewportInfo.FrustumRightPlane
Gets the frustum right plane that separates visible from off-screen.
Since: 5.0

Rhino.DocObjects.ViewportInfo.FrustumBottomPlane
Gets the frustum bottom plane that separates visible from off-screen.
Since: 5.0

Rhino.DocObjects.ViewportInfo.FrustumTopPlane
Gets the frustum top plane that separates visible from off-screen.
Since: 5.0

Rhino.DocObjects.ViewportInfo.GetNearPlaneCorners
Gets the corners of near clipping plane rectangle.
4 points are returned in the order of bottom left, bottom right,
top left, top right.
Returns:
Four corner points on success.
Empty array if viewport is not valid.
Since: 5.0

Rhino.DocObjects.ViewportInfo.GetFarPlaneCorners
Gets the corners of far clipping plane rectangle.
4 points are returned in the order of bottom left, bottom right,
top left, top right.
Returns:
Four corner points on success.
Empty array if viewport is not valid.
Since: 5.0

Rhino.DocObjects.ViewportInfo.GetFramePlaneCorners(System.Double)
Gets the corners of the frame plane rectangle at specified depth.
4 points are returned in the order of bottom left, bottom right,
top left, top right.
depth: Distance from camera location.
Returns:
Four corner points on success.
Empty array if viewport is not valid.
Since: 8.0

Rhino.DocObjects.ViewportInfo.SetScreenPort(System.Int32,System.Int32,System.Int32,System.Int32,System.Int32,System.Int32)
Location of viewport in pixels.
These are provided so you can set the port you are using
and get the appropriate transformations to and from
screen space.
// For a Windows window
/      int width = width of window client area in pixels;
/      int height = height of window client area in pixels;
/      port_left = 0;
/      port_right = width;
/      port_top = 0;
/      port_bottom = height;
/      port_near = 0;
/      port_far = 1;
/      SetScreenPort( port_left, port_right,
/                     port_bottom, port_top,
/                     port_near, port_far );
left: A left value.
right: A left value. (port_left != port_right)
bottom: A bottom value.
top: A top value. (port_top != port_bottom)
near: A near value.
far: A far value.
Returns: true if input is valid.
Since: 5.0

Rhino.DocObjects.ViewportInfo.SetScreenPort(System.Drawing.Rectangle,System.Int32,System.Int32)
Gets the location of viewport in pixels.
See value meanings in SetScreenPort.
windowRectangle: A new rectangle.
near: The near value.
far: The far value.
Returns: true if input is valid.
Since: 5.0

Rhino.DocObjects.ViewportInfo.SetScreenPort(System.Drawing.Rectangle)
Gets the location of viewport in pixels.
See value meanings in SetScreenPort.
windowRectangle: A new rectangle.
Returns: true if input is valid.
Since: 5.0

Rhino.DocObjects.ViewportInfo.GetScreenPortLocation(System.Int32@,System.Int32@,System.Int32@,System.Int32@)
Get the location of viewport in pixels (non System.Drawing version of GetScreenPort)
left:
top:
right:
bottom:
Since: 6.0

Rhino.DocObjects.ViewportInfo.GetScreenPort(System.Int32@,System.Int32@)
Gets the location of viewport in pixels.
See value meanings in SetScreenPort.
near: The near value. This out parameter is assigned during the call.
far: The far value. This out parameter is assigned during the call.
Returns: The rectangle, or Empty rectangle on error.
Since: 5.0

Rhino.DocObjects.ViewportInfo.GetScreenPort
Gets the location of viewport in pixels.
See documentation for SetScreenPort.
Returns: The rectangle, or Empty rectangle on error.
Since: 5.0

Rhino.DocObjects.ViewportInfo.ScreenPort
Get or set the screen port. Rhino.DocObjects.ViewportInfo.SetScreenPort(System.Drawing.Rectangle) and Rhino.DocObjects.ViewportInfo.GetScreenPort
Since: 6.0

Rhino.DocObjects.ViewportInfo.ScreenPortAspect
Gets the screen aspect ratio.
This is width / height.
Since: 5.0

Rhino.DocObjects.ViewportInfo.GetCameraAngles(System.Double@,System.Double@,System.Double@)
Gets the field of view angles.
halfDiagonalAngleRadians: 1/2 of diagonal subtended angle. This out parameter is assigned during this call.
halfVerticalAngleRadians: 1/2 of vertical subtended angle. This out parameter is assigned during this call.
halfHorizontalAngleRadians: 1/2 of horizontal subtended angle. This out parameter is assigned during this call.
Returns: true if the operation succeeded; otherwise, false.
Since: 5.0

Rhino.DocObjects.ViewportInfo.CameraAngle
Gets or sets the 1/2 smallest angle. See Rhino.DocObjects.ViewportInfo.GetCameraAngles(System.Double@,System.Double@,System.Double@) for more information.
Since: 5.0

Rhino.DocObjects.ViewportInfo.Camera35mmLensLength
This property assumes the camera is horizontal and crop the
film rather than the image when the aspect of the frustum
is not 36/24.  (35mm film is 36mm wide and 24mm high.)
Setting preserves camera location,
changes the frustum, but maintains the frustum's aspect.
Since: 5.0

Rhino.DocObjects.ViewportInfo.GetXform(Rhino.DocObjects.CoordinateSystem,Rhino.DocObjects.CoordinateSystem)
Computes a transform from a coordinate system to another.
sourceSystem: The coordinate system to map from.
destinationSystem: The coordinate system to map into.
Returns: The 4x4 transformation matrix (acts on the left).
Since: 5.0

Rhino.DocObjects.ViewportInfo.GetFrustumLine(System.Double,System.Double)
Gets the world coordinate line in the view frustum
that projects to a point on the screen.
screenX: (screenx,screeny) = screen location.
screenY: (screenx,screeny) = screen location.
Returns: 3d world coordinate line segment starting on the near clipping plane and ending on the far clipping plane.
Since: 5.1

Rhino.DocObjects.ViewportInfo.GetFrustumLine(System.Drawing.Point)
Gets the world coordinate line in the view frustum
that projects to a point on the screen.
screenPoint: screen location
Returns: 3d world coordinate line segment starting on the near clipping plane and ending on the far clipping plane.
Since: 5.1

Rhino.DocObjects.ViewportInfo.GetFrustumLine(System.Drawing.PointF)
Gets the world coordinate line in the view frustum
that projects to a point on the screen.
screenPoint: screen location
Returns: 3d world coordinate line segment starting on the near clipping plane and ending on the far clipping plane.
Since: 5.1

Rhino.DocObjects.ViewportInfo.GetWorldToScreenScale(Rhino.Geometry.Point3d)
Gets the scale factor from point in frustum to screen scale.
pointInFrustum: point in viewing frustum.
Returns: number of pixels per world unit at the 3d point.
Since: 5.1

Rhino.DocObjects.ViewportInfo.Extents(System.Double,Rhino.Geometry.BoundingBox)
Extends this viewport view to include a bounding box.
Use Extents() as a quick way to set a viewport to so that bounding
volume is inside of a viewports frustum.
The view angle is used to determine the position of the camera.
halfViewAngleRadians: 1/2 smallest subtended view angle in radians.
bbox: A bounding box in 3d world coordinates.
Returns: true if the operation succeeded; otherwise, false.
Since: 5.0

Rhino.DocObjects.ViewportInfo.Extents(System.Double,Rhino.Geometry.Sphere)
Extends this viewport view to include a sphere.
Use Extents() as a quick way to set a viewport to so that bounding
volume is inside of a viewports frustum.
The view angle is used to determine the position of the camera.
halfViewAngleRadians: 1/2 smallest subtended view angle in radians.
sphere: A sphere in 3d world coordinates.
Returns: true if the operation succeeded; otherwise, false.
Since: 5.0

Rhino.DocObjects.ViewportInfo.ZoomToScreenRect(System.Int32,System.Int32,System.Int32,System.Int32)
Zooms to a screen zone.
View changing from screen input points. Handy for
using a mouse to manipulate a view.
ZoomToScreenRect() may change camera and frustum settings.
left: Screen coordinate.
top: Screen coordinate.
right: Screen coordinate.
bottom: Screen coordinate.
Returns: true if the operation succeeded; otherwise, false.
Since: 5.0

Rhino.DocObjects.ViewportInfo.ZoomToScreenRect(System.Drawing.Rectangle)
Zooms to a screen zone.
View changing from screen input points. Handy for
using a mouse to manipulate a view.
ZoomToScreenRect() may change camera and frustum settings.
windowRectangle: The new window rectangle in screen space.
Returns: true if the operation succeeded; otherwise, false.
Since: 5.0

Rhino.DocObjects.ViewportInfo.DollyCamera(Rhino.Geometry.Vector3d)
DollyCamera() does not update the frustum's clipping planes.
To update the frustum's clipping planes call DollyFrustum(d)
with d = dollyVector o cameraFrameZ.  To convert screen locations
into a dolly vector, use GetDollyCameraVector().
Does not update frustum.  To update frustum use DollyFrustum(d) with d = dollyVector o cameraFrameZ.
dollyVector: dolly vector in world coordinates.
Returns: true if the operation succeeded; otherwise, false.
Since: 5.0

Rhino.DocObjects.ViewportInfo.GetDollyCameraVector(System.Int32,System.Int32,System.Int32,System.Int32,System.Double)
Gets a world coordinate dolly vector that can be passed to DollyCamera().
screenX0: Screen coordinates of start point.
screenY0: Screen coordinates of start point.
screenX1: Screen coordinates of end point.
screenY1: Screen coordinates of end point.
projectionPlaneDistance: Distance of projection plane from camera. When in doubt, use 0.5*(frus_near+frus_far).
Returns: The world coordinate dolly vector.
Since: 5.0

Rhino.DocObjects.ViewportInfo.GetDollyCameraVector(System.Drawing.Point,System.Drawing.Point,System.Double)
Gets a world coordinate dolly vector that can be passed to DollyCamera().
screen0: Start point.
screen1: End point.
projectionPlaneDistance: Distance of projection plane from camera. When in doubt, use 0.5*(frus_near+frus_far).
Returns: The world coordinate dolly vector.
Since: 5.0

Rhino.DocObjects.ViewportInfo.DollyFrustum(System.Double)
Moves the frustum clipping planes.
dollyDistance: Distance to move in camera direction.
Returns: true if the operation succeeded; otherwise, false.
Since: 5.0

Rhino.DocObjects.ViewportInfo.DollyExtents(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},System.Double)
Dolly the camera location and so that the view frustum contains
all of the document objects that can be seen in view.
If the projection is perspective, the camera angle is not changed.
geometry:
border:
If border > 1.0, then the frustum in enlarged by this factor
to provide a border around the view.  1.1 works well for
parallel projections; 0.0 is suggested for perspective projections.
Returns: True if successful.
Since: 5.6

Rhino.DocObjects.ViewportInfo.DollyExtents(Rhino.Geometry.BoundingBox,System.Double)
Dolly the camera location and so that the view frustum contains
all of the document objects that can be seen in view.
If the projection is perspective, the camera angle is not changed.
cameraCoordinateBoundingBox:
border:
If border > 1.0, then the frustum in enlarged by this factor
to provide a border around the view.  1.1 works well for
parallel projections; 0.0 is suggested for perspective projections.
Returns: True if successful.
Since: 5.6

Rhino.DocObjects.ViewportInfo.ViewScale
Applies scaling factors to parallel projection clipping coordinates
by setting the m_clip_mod transformation.
If you want to compress the view projection across the viewing
plane, then set x = 0.5, y = 1.0, and z = 1.0.
Since: 5.0

Rhino.DocObjects.ViewportInfo.SetViewScale(System.Double,System.Double,System.Double)
Set scaling applied for this viewport projection. For reflected
projections, call with values 1,1,-1
scaleX:
scaleY:
scaleZ:
Since: 8.0

Rhino.DocObjects.ViewportInfo.GetViewScale
Get scaling applied to this viewport projection. Reflected ceiling projections
will return the values 1,1,-1
Returns:
Since: 8.0

Rhino.DocObjects.ViewportInfo.FrustumCenterPoint(System.Double)
Return a point on the central axis of the view frustum.
This point is a good choice for a general purpose target point.
targetDistance: If targetDistance > 0.0, then the distance from the returned
point to the camera plane will be targetDistance. Note that
if the frustum is not symmetric, the distance from the
returned point to the camera location will be larger than
targetDistance.
If targetDistance == ON_UNSET_VALUE and the frustum
is valid with near > 0.0, then 0.5*(near + far) will be used
as the targetDistance.
Returns: A point on the frustum's central axis.  If the viewport or input
is not valid, then ON_3dPoint::UnsetPoint is returned.
Since: 5.0

Rhino.DocObjects.ViewportInfo.TargetPoint
The current value of the target point.  This point does not play
a role in the view projection calculations.  It can be used as a
fixed point when changing the camera so the visible regions of the
before and after frustums both contain the region of interest.
The default constructor sets this point on ON_3dPoint::UnsetPoint.
You must explicitly call one SetTargetPoint() functions to set
the target point.
Since: 5.0

Rhino.DocObjects.ViewportInfo.TargetDistance(System.Boolean)
Gets the distance from the target point to the camera plane.
Note that if the frustum is not symmetric, then this distance
is shorter than the distance from the target to the camera location.
useFrustumCenterFallback: If bUseFrustumCenterFallback is false and the target point is
not valid, then ON_UNSET_VALUE is returned.
If bUseFrustumCenterFallback is true and the frustum is valid
and current target point is not valid or is behind the camera,
then 0.5*(near + far) is returned.
Returns: Shortest signed distance from camera plane to target point.
If the target point is on the visible side of the camera,
a positive value is returned.  ON_UNSET_VALUE is returned
when the input of view is not valid.
Since: 5.0

Rhino.DocObjects.ViewportInfo.PerspectiveMinNearOverFar
Expert user function to control the minimum
ratio of near/far when perspective projections
are begin used.
Since: 7.0

Rhino.DocObjects.ViewportInfo.PerspectiveMinNearDist
Expert user function to control the minimum
value of near when perspective projections
are being used.
Since: 7.0

Rhino.DocObjects.ViewportInfo.Id
Sets the viewport's id to the value used to
uniquely identify this viewport.
There is no approved way to change the viewport
id once it is set in order to maintain consistency
across multiple viewports and those routines that
manage them.
Since: 5.0

Rhino.DocObjects.ViewportInfo.TransformCamera(Rhino.Geometry.Transform)
Transforms the view camera location, direction, and up.
xform: Transformation to apply to camera.
Returns: True if a valid camera was transformed, false if
invalid camera, frustum, or transformation.
Since: 7.0

Rhino.DocObjects.ViewportInfo.RotateCamera(System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Rotates the view camera.
rotationAngleRadians: The amount to rotate expressed in radians.
rotationAxis: The axis to rotate around.
rotationCenter: The point to rotate around.
Returns: True if rotation is successful, false otherwise.
Since: 7.0