Rhino.Render.Dithering.Methods
Dithering algorithm.

Rhino.Render.Dithering.Methods.None
No dithering

Rhino.Render.Dithering.Methods.FloydSteinberg
Floyd Steinberg algorithm

Rhino.Render.Dithering.Methods.SimpleNoise
Simple random noise