Rhino.DocObjects.PageSettings
The paper size and margins of a layout, in millimeters. Only meaningful for a view
whose Rhino.DocObjects.ViewInfo.ViewType is Rhino.DocObjects.ViewType.PageView.
Since: 8.36

Rhino.DocObjects.PageSettings.PageNumber
The page number of this layout.
Since: 8.36

Rhino.DocObjects.PageSettings.WidthMillimeters
Paper width in millimeters.
Since: 8.36

Rhino.DocObjects.PageSettings.HeightMillimeters
Paper height in millimeters.
Since: 8.36

Rhino.DocObjects.PageSettings.LeftMarginMillimeters
Left margin in millimeters.
Since: 8.36

Rhino.DocObjects.PageSettings.RightMarginMillimeters
Right margin in millimeters.
Since: 8.36

Rhino.DocObjects.PageSettings.TopMarginMillimeters
Top margin in millimeters.
Since: 8.36

Rhino.DocObjects.PageSettings.BottomMarginMillimeters
Bottom margin in millimeters.
Since: 8.36

Rhino.DocObjects.PageSettings.PrinterName
Name of the printer this layout targets, if any.
Since: 8.36