Rhino.Runtime.PythonScript
Represents a Python script.

Rhino.Runtime.PythonScript.Create
Constructs a new Python script context.
Returns: A new Python script, or null if none could be created. Rhino 4 always returns null.
Since: 5.0

Rhino.Runtime.PythonScript.RuntimeAssemblies
Get list of assemblies used by python for library browser and
inclusion into the runtime
Returns:
Since: 7.0

Rhino.Runtime.PythonScript.AddRuntimeAssembly(System.Reflection.Assembly)
Add assembly to list of assemblies used by python
assembly:
Since: 7.0

Rhino.Runtime.PythonScript.SearchPaths
Get/Set additional search paths used by the python interpreter
Since: 7.1

Rhino.Runtime.PythonScript.GetSearchPaths
Protected helper function for static SearchPaths
Returns:

Rhino.Runtime.PythonScript.SetSearchPaths(System.String[])
Protected helper function for static SearchPaths
paths:

Rhino.Runtime.PythonScript.#ctor
Initializes a new instance of the Rhino.Runtime.PythonScript class.

Rhino.Runtime.PythonScript.Compile(System.String)
Compiles a class in a quick-to-execute proxy.
script: A string text.
Returns: A Python compiled code instance.
Since: 5.0

Rhino.Runtime.PythonScript.ContainsVariable(System.String)
Determines if the main scripting context has a variable with a name.
name: The variable name.
Returns: true if the variable is present.
Since: 5.0

Rhino.Runtime.PythonScript.GetVariableNames
Retrieves all variable names in the script.
Returns: An enumerable set with all names of the variables.
Since: 5.0

Rhino.Runtime.PythonScript.GetVariable(System.String)
Gets the object associated with a variable name in the main scripting context.
name: A variable name.
Returns: The variable object.
Since: 5.0

Rhino.Runtime.PythonScript.SetVariable(System.String,System.Object)
Sets a variable with a name and an object. Object can be null (Nothing in Visual Basic).
name: A valid variable name in Python.
value: A valid value for that variable name.
Since: 5.0

Rhino.Runtime.PythonScript.SetIntellisenseVariable(System.String,System.Object)
Sets a variable for runtime introspection.
name: A variable name.
value: A variable value.
Since: 5.0

Rhino.Runtime.PythonScript.RemoveVariable(System.String)
Removes a defined variable from the main scripting context.
name: The variable name.
Since: 5.0

Rhino.Runtime.PythonScript.EvaluateExpression(System.String,System.String)
Evaluates statements and an expression in the main scripting context.
statements: One or several statements.
expression: An expression.
Returns: The expression result.
Since: 5.0

Rhino.Runtime.PythonScript.ExecuteFile(System.String)
Executes a Python file. The file is executed in a new, __main__ scope.
path: The path to the file.
Returns: true if the file executed. This method can throw scripting-runtime based exceptions.
Since: 5.0

Rhino.Runtime.PythonScript.ExecuteFileInScope(System.String)
Executes a Python file in the calling script scope. All old variables are kept.
path: The path to the file.
Returns: true if the file executed. This method can throw scripting-runtime based exceptions.
Since: 7.0

Rhino.Runtime.PythonScript.ExecuteScript(System.String)
Executes a Python string.
script: A Python text.
Returns: true if the file executed. This method can throw scripting-runtime based exceptions.
Since: 5.0

Rhino.Runtime.PythonScript.GetStackTraceFromException(System.Exception)
Retrieves a meaningful representation of the call stack.
ex: An exception that was thrown by some of the methods in this class.
Returns: A string that represents the Python exception.
Since: 5.0

Rhino.Runtime.PythonScript.Output
Gets or sets the Python script "print()" target.
By default string output goes to the Rhino.RhinoApp.Write function.
Set Output if you want to redirect the output from python to a different function
while this script executes.
Since: 5.0

Rhino.Runtime.PythonScript.ScriptContextDoc
object set to variable held in scriptcontext.doc.
Since: 5.0

Rhino.Runtime.PythonScript.ScriptContextCommand
Command associated with this script. Used for localiation
Since: 6.0

Rhino.Runtime.PythonScript.ContextId
Gets or sets a context unique identified.
Since: 5.0

Rhino.Runtime.PythonScript.CreateTextEditorControl(System.String,System.Action{System.String})
Creates a control where the user is able to type Python code.
script: A starting script.
helpcallback: A method that is called when help is shown for a function, a class or a method.
Returns: A Windows Forms control.
Since: 5.0

Rhino.Runtime.PythonScript.SetupScriptContext(System.Object)
Setups the script context. Use a RhinoDoc instance unless unsure.
doc: Document.
Since: 6.0