Rhino.Runtime.InteropWrappers.SimpleArrayHatchLinePointer
Wrapper for a C++ ON_SimpleArray of ON_HatchLine*.
If you are not writing C++ code, then you can ignore this class.
Since: 8.0

Rhino.Runtime.InteropWrappers.SimpleArrayHatchLinePointer.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.
Since: 8.0

Rhino.Runtime.InteropWrappers.SimpleArrayHatchLinePointer.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.
Since: 8.0

Rhino.Runtime.InteropWrappers.SimpleArrayHatchLinePointer.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayHatchLinePointer instance.
Since: 8.0

Rhino.Runtime.InteropWrappers.SimpleArrayHatchLinePointer.#ctor(System.Collections.Generic.IEnumerable{Rhino.DocObjects.HatchLine})
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayHatchLinePointer instance, from a set of input hatch lines.
hatchLines: A list, an array or any collection of curves that implements the enumerable interface.
Since: 8.0

Rhino.Runtime.InteropWrappers.SimpleArrayHatchLinePointer.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.SimpleArrayHatchLinePointer.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 8.0

Rhino.Runtime.InteropWrappers.SimpleArrayHatchLinePointer.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.