Rhino.Geometry.Collections.HiddenLineDrawingPointList
Provides access to all the HiddenLineDrawingPoint objects in a HiddenLineDrawing object.

Rhino.Geometry.Collections.HiddenLineDrawingPointList.Count
Gets the number of HiddenLineDrawingPoint objects.

Rhino.Geometry.Collections.HiddenLineDrawingPointList.Item(System.Int32)
Get the HiddenLineDrawingPoint at a given index.
index: Index of HiddenLineDrawingPoint to access.
Throws System.IndexOutOfRangeException: Thrown when the index is invalid.
Returns: The HiddenLineDrawingPoint at [index].

Rhino.Geometry.Collections.HiddenLineDrawingPointList.GetEnumerator
Gets an enumerator that visits all curves.
Returns: The enumerator.

Rhino.Geometry.Collections.HiddenLineDrawingPointList.System#Collections#IEnumerable#GetEnumerator
Gets the same enumerator as Rhino.Geometry.Collections.HiddenLineDrawingPointList.GetEnumerator.
Returns: The enumerator.