Rhino.FileIO.FilePlyWriteOptions.UseSimpleDialog
Determines whether to use the simple or detailed meshing dialog.
Since: 7.0

Rhino.FileIO.FilePlyWriteOptions.ExportASCII
Determines whether to export as Ascii.
Since: 7.0

Rhino.FileIO.FilePlyWriteOptions.ExportDoubles
Determines whether vertexes are exported as doubles or floats.
Since: 7.0
Remarks: only has impact for binary export, floats are always exported to ascii.

Rhino.FileIO.FilePlyWriteOptions.ExportNormals
Determines whether to export vertex normals.
Since: 7.0

Rhino.FileIO.FilePlyWriteOptions.ExportColors
Determines whether to export vertex colors.
Since: 7.0

Rhino.FileIO.FilePlyWriteOptions.ExportMaterial
Determines whether to export a material.
Since: 7.0

Rhino.FileIO.FilePlyWriteOptions.MeshingParameters
Since: 7.0

Rhino.FileIO.FilePlyWriteOptions.#ctor(Rhino.FileIO.FileWriteOptions)
writeOptions:
Since: 7.0