Rhino.DocObjects.InstanceDefinition
This is the same as Rhino.Geometry.InstanceDefinitionGeometry, but in a Rhino document.

Rhino.DocObjects.InstanceDefinition.ComponentType
Returns Rhino.DocObjects.ModelComponentType.InstanceDefinition.
Since: 6.0

Rhino.DocObjects.InstanceDefinition.IsDeleted
Returns true if this instance definition is deleted. Deleted object are not saved to a file archive.
Since: 5.0

Rhino.DocObjects.InstanceDefinition.IsReference
An object from a work session reference model is reference a
reference object and cannot be modified.  An object is a reference
object if, and only if, it is on a reference layer.
Since: 5.0

Rhino.DocObjects.InstanceDefinition.ObjectCount
Number of objects this definition uses. This counts the objects that are used to define the geometry.
This does NOT count the number of references to this instance definition.
Since: 5.0

Rhino.DocObjects.InstanceDefinition.UpdateType
Since: 5.0

Rhino.DocObjects.InstanceDefinition.Object(System.Int32)
returns an object used as part of this definition.
index: 0 <= index < ObjectCount.
Returns:
Returns an object that is used to define the geometry.
Does NOT return an object that references this definition.count the number of references to this instance.
Since: 5.0

Rhino.DocObjects.InstanceDefinition.GetObjects
Gets an array with the objects that belong to this instance definition.
Returns: An array of Rhino objects. The returned array can be empty, but not null.
Since: 5.0

Rhino.DocObjects.InstanceDefinition.GetReferences(System.Int32)
Gets a list of the CRhinoInstanceObjects (inserts) that contains
a reference this instance definition.
wheretoLook:
0 = get top level references in active document.
1 = get top level and nested references in active document.
2 = check for references from other instance definitions.
Returns: An array of instance objects. The returned array can be empty, but not null.
Since: 5.0

Rhino.DocObjects.InstanceDefinition.UseCount
Returns the number of references of this instance definition in the model.
Both top-level references and nested instances are included in the count.
Returns: The number of references of this instance definition in the model.
Since: 7.4

Rhino.DocObjects.InstanceDefinition.UseCount(System.Int32@,System.Int32@)
Returns the number of references of this instance definition in the model.
Both top-level references and nested instances are included in the count.
topLevelReferenceCount: The number of top-level references.
nestedReferenceCount: The number of nested instances.
Returns: The number of references of this instance definition in the model.
Since: 7.4

Rhino.DocObjects.InstanceDefinition.GetContainers
Gets a list of all the InstanceDefinitions that contain a reference this InstanceDefinition.
Returns: An array of instance definitions. The returned array can be empty, but not null.
Since: 5.0

Rhino.DocObjects.InstanceDefinition.UsesDefinition(System.Int32)
Determines if this instance definition contains a reference to another instance definition.
otherIdefIndex: index of another instance definition.
Returns:
0      no
1      other_idef_index is the index of this instance definition
>1      This InstanceDefinition uses the instance definition
and the returned value is the nesting depth.
Since: 5.0

Rhino.DocObjects.InstanceDefinition.InUse(System.Int32)
Determines whether the instance definition is referenced.
wheretoLook:
0 = check for top level references in active document.
1 = check for top level and nested references in active document.
2 = check for references in other instance definitions.
Returns: true if the instance definition is used; otherwise false.
Since: 5.0

Rhino.DocObjects.InstanceDefinition.UsesLayer(System.Int32)
Returns true if some object in the instance definition is on the layer with the specified layer index.
layerIndex: The index of layer to search for.
Returns:
True if there is an object in the instance definition that is on the layer.
Since: 8.7

Rhino.DocObjects.InstanceDefinition.UsesLinetype(System.Int32)
Returns true if some object in the instance definition references the linetype with the specified linetype index.
linetypeIndex: The index of linetype to search for.
Returns: True if there is an object in the instance definition that references that linetype.
Since: 8.7

Rhino.DocObjects.InstanceDefinition.Index
Index of this instance definition in the index definition table.
Since: 5.0

Rhino.DocObjects.InstanceDefinition.IsTenuous
True if this instance definition is from a linked file.
It will be saved only if it is referenced by an instance reference object that is in the active geometry list and is being saved.
Note that there can be multiple linked instance definitions with references to tenuous instance definitions.
Since: 5.0

Rhino.DocObjects.InstanceDefinition.SkipNestedLinkedDefinitions
This property applies when an instance definition is linked.
If true, when reading the file that defines the content of the linked instance definition, skip any linked instance definitions found in that file.
If false, when reading the file that defines the content of the linked instance definition, recursively load linked instance definitions found in that file.
Since: 7.8

Rhino.DocObjects.InstanceDefinition.LayerStyle
Specifies how model components (layers, materials, dimension styles, etc.)
from linked instance definition files appear in the active model.
Since: 7.8

Rhino.DocObjects.InstanceDefinition.UnitSystem
Gets the unit system of the instance definition. If the instance definition was
imported from another 3dm file, the unit system may differ from that of the document.
Since: 7.0

Rhino.DocObjects.InstanceDefinition.SourceArchive
Gets the full file path for linked instance definitions.
Since: 5.0

Rhino.DocObjects.InstanceDefinition.CreatePreviewBitmap(Rhino.Display.DefinedViewportProjection,Rhino.DocObjects.DisplayMode,System.Drawing.Size)
Creates a preview bitmap of the instance definition.
definedViewportProjection: The view projection.
displayMode: The display mode.
bitmapSize: The bitmap size in pixels.
Returns: The preview bitmap if successful, null otherwise.
Since: 5.0

Rhino.DocObjects.InstanceDefinition.CreatePreviewBitmap(Rhino.Display.DefinedViewportProjection,Rhino.DocObjects.DisplayMode,System.Drawing.Size,System.Boolean)
Creates a preview bitmap of the instance definition.
definedViewportProjection: The view projection.
displayMode: The display mode.
bitmapSize: The bitmap size in pixels.
applyDpiScaling: Specify true to apply DPI scaling (Windows-only).
Returns: The preview bitmap if successful, null otherwise.
Since: 6.0

Rhino.DocObjects.InstanceDefinition.CreatePreviewBitmap(Rhino.Display.DefinedViewportProjection,System.Drawing.Size)
Creates a wireframe preview bitmap of the instance definition.
definedViewportProjection: The view projection.
bitmapSize: The bitmap size in pixels.
Returns: The preview bitmap if successful, null otherwise.
Since: 5.0

Rhino.DocObjects.InstanceDefinition.CreatePreviewBitmap(Rhino.Display.DefinedViewportProjection,System.Drawing.Size,System.Boolean)
Creates a wireframe preview bitmap of the instance definition.
definedViewportProjection: The view projection.
bitmapSize: The bitmap size in pixels.
applyDpiScaling: Specify true to apply DPI scaling (Windows-only).
Returns: The preview bitmap if successful, null otherwise.
Since: 6.0

Rhino.DocObjects.InstanceDefinition.CreatePreviewBitmap(System.Guid,Rhino.Display.DefinedViewportProjection,Rhino.DocObjects.DisplayMode,System.Drawing.Size,System.Boolean)
Creates a preview bitmap of the instance definition.
definitionObjectId: Id of one of this definition's objects to draw selected.
viewportProjection: The view projection.
displayMode: The display mode.
bitmapSize: The bitmap size in pixels.
applyDpiScaling: Specify true to apply DPI scaling (Windows-only).
Returns: The preview bitmap if successful, null otherwise.
Since: 6.21

Rhino.DocObjects.InstanceDefinition.CreatePreviewBitmap(System.Guid,Rhino.Display.DefinedViewportProjection,Rhino.Display.IsometricCamera,System.Boolean,System.Drawing.Size,System.Boolean)
Creates a preview bitmap of the instance definition.
displayModeId: The id of the display mode to draw with.
viewportProjection: The view projection.
isometricCamera: The isometric camera angle.
drawDecorations: Specify true to draw viewport decorations, such as grid and axes.
bitmapSize: The bitmap size in pixels.
applyDpiScaling: Specify true to apply DPI scaling (Windows-only).
Returns: The preview bitmap if successful, null otherwise.
Since: 8.10

Rhino.DocObjects.InstanceDefinition.ArchiveFileStatus
Returns the archive file status of a linked instance definition.
Since: 5.2

Rhino.DocObjects.InstanceDefinition.Equals(System.Object)
Equality is checked against InstanceDefinition.Id
obj:
Returns: True if obj.Id equals Id

Rhino.DocObjects.InstanceDefinition.GetHashCode
Use Id.GetHashCode()
Returns: