Rhino.DocObjects.HatchLine
Hatch lines are used by hatch pattern to specify
the dashes and offset patterns of the lines.
Remarks:
Each line has the following information:
Angle is the direction of the line counter-clockwise from the x-axis.
The first line origin is at the base point.
Each line repetition is offset from the previous line.
Offset.X is parallel to the line and Offset.Y is perpendicular to the line.
The base and offset values are rotated by the line's angle to
produce a location in the hatch pattern's coordinate system.
There can be gaps and dashes specified for drawing the line.
If there are no dashes, the line is solid.
Negative length dashes are gaps.
Positive length dashes are drawn as line segments.
Since: 8.0

Rhino.DocObjects.HatchLine.#ctor
Construts a new hatch line.
Since: 8.0

Rhino.DocObjects.HatchLine.#ctor(Rhino.DocObjects.HatchLine)
Construts a new hatch line.
hatchLine: The hatch line to copy.
Since: 8.0

Rhino.DocObjects.HatchLine.IsValid
Verifies a hatch line is valid.
Since: 8.0

Rhino.DocObjects.HatchLine.Angle
Gets and sets the angle, in radians, of the hatch line.
The angle is measured counter-clockwise from the x-axis.
Since: 8.0

Rhino.DocObjects.HatchLine.BasePoint
Get and sets this line's 2d base point.
Since: 8.0

Rhino.DocObjects.HatchLine.Offset
Get and sets this line's 2d offset for line repetitions.
Offset.X is shift parallel to line.
Offset.Y is spacing perpendicular to line.
Since: 8.0

Rhino.DocObjects.HatchLine.DashCount
Gets the number of dashes + gaps in this line.
Since: 8.0

Rhino.DocObjects.HatchLine.GetDashes
Gets all of the dashes.
Since: 8.0

Rhino.DocObjects.HatchLine.PatternLength
Get the total length of a pattern repeat.
Since: 8.0

Rhino.DocObjects.HatchLine.DashAt(System.Int32)
Get the dash length at the specified index.
dashIndex: Index of the dash to get.
Returns: The length of the dash. or gap if negative.
Since: 8.0

Rhino.DocObjects.HatchLine.AppendDash(System.Double)
Add a dash to the pattern.
dash: Length to append, < 0 for a gap.
Since: 8.0

Rhino.DocObjects.HatchLine.SetDashes(System.Collections.Generic.IEnumerable{System.Double})
Sets a new dash array.
dashes: The dash enumeration.
Since: 8.0

Rhino.DocObjects.HatchLine.m_ptr
ON_HatchLine*

Rhino.DocObjects.HatchLine.ConstPointer
Gets the constant (immutable) pointer of this object.

Rhino.DocObjects.HatchLine.NonConstPointer
Gets the non-constant pointer (for modification) of this object.

Rhino.DocObjects.HatchLine.Finalize
Passively releases the unmanaged object.

Rhino.DocObjects.HatchLine.Dispose
Actively releases the unmanaged object.
Since: 8.0

Rhino.DocObjects.HatchLine.Dispose(System.Boolean)
Releases the unmanaged object.