Rhino.GpuDeviceInfo
Represents a GPU device providing name, vendor and memory all as strings.
Currently fully implemented only on Windows.

Rhino.GpuDeviceInfo.Name
Name of the device
Since: 7.3

Rhino.GpuDeviceInfo.Vendor
Vendor of the device
Since: 7.3

Rhino.GpuDeviceInfo.Memory
Memory of the device in bytes
Since: 7.3

Rhino.GpuDeviceInfo.MemoryAsString
Memory of the device as a human-readable string
Since: 7.3

Rhino.GpuDeviceInfo.DriverDateAsString
The driver date as string formatted year-month-day
Since: 7.4