Rhino.Geometry.Collections.MeshVertexStatusList
Provides access to status information relative to components of a mesh.

Rhino.Geometry.Collections.MeshVertexStatusList.Count
Gets or sets the number of hidden vertices. For this to be a valid part of a mesh, this count should be the same as the one of mesh vertices.
Since: 6.0

Rhino.Geometry.Collections.MeshVertexStatusList.HiddenCount
Gets a value indicating how many vertices have been set to hidden.
Since: 6.0

Rhino.Geometry.Collections.MeshVertexStatusList.Capacity
Gets or sets the total number of hidden vertex information the internal data structure can hold without resizing.
Since: 6.0

Rhino.Geometry.Collections.MeshVertexStatusList.Item(System.Int32)
Gets or sets the hidden value at the given index.
The index must be valid or an IndexOutOfRangeException will be thrown.
index: Index of hidden flag to access.
Throws System.ArgumentOutOfRangeException: Thrown when the index is invalid.
Returns: The hidden flag at [index].

Rhino.Geometry.Collections.MeshVertexStatusList.Clear
Clears the hidden vertex list on the mesh. This results in a fully visible mesh.
Since: 6.0

Rhino.Geometry.Collections.MeshVertexStatusList.Add(System.Boolean)
Adds a new flag at the end of the list.
hidden: True if vertex is hidden.
Returns: The index of the newly added hidden vertex.
Since: 6.0

Rhino.Geometry.Collections.MeshVertexStatusList.AddRange(System.Collections.Generic.IEnumerable{System.Boolean})
Appends an array, a list or any enumerable of flags to the end of the list.
values: Hidden values to append.
Returns: true on success, false on failure.
Since: 6.0

Rhino.Geometry.Collections.MeshVertexStatusList.Destroy
Releases all memory allocated to store hidden vertices. The list capacity will be 0 after this call.
Vertices will be immediately considered visible.
Subsequent calls can add new items.
Since: 6.0

Rhino.Geometry.Collections.MeshVertexStatusList.System#Collections#Generic#ICollection{System#Boolean}#Add(System.Boolean)
Since: 6.0

Rhino.Geometry.Collections.MeshVertexStatusList.Contains(System.Boolean)
Determines if some vertices are hidden or some are shown.
hidden: The value to be checked. True means some vertex is hidden.
Returns: True if the array contains the specified value.
Since: 6.0

Rhino.Geometry.Collections.MeshVertexStatusList.CopyTo(System.Boolean[],System.Int32)
Copies to an array, starting at an index.
array: The array to be copied into.
arrayIndex: The starting index in the array.
Since: 6.0

Rhino.Geometry.Collections.MeshVertexStatusList.GetEnumerator
Gets an enumerator that yields all flags in this collection.
Returns: The enumerator.
Since: 6.0

Rhino.Geometry.Collections.MeshVertexStatusList.System#Collections#IEnumerable#GetEnumerator
Since: 6.0