Rhino.UI.StatusBar
Contains static methods to control the application status bar.

Rhino.UI.StatusBar.SetDistancePane(System.Double)
Sets the distance pane to a distance value.
distance: The distance value.
Since: 5.0

Rhino.UI.StatusBar.SetNumberPane(System.Double)
Sets the number pane to a number value
number:
Since: 6.0

Rhino.UI.StatusBar.SetPointPane(Rhino.Geometry.Point3d)
Sets the point pane to a point value.
point: The point value.
Since: 5.0

Rhino.UI.StatusBar.SetMessagePane(System.String)
Sets the message pane to a message.
message: The message value.
Since: 5.0

Rhino.UI.StatusBar.ClearMessagePane
Removes the message from the message pane.
Since: 5.0

Rhino.UI.StatusBar.ShowProgressMeter(System.Int32,System.Int32,System.String,System.Boolean,System.Boolean)
Starts, or shows, Rhino's status bar progress meter.
lowerLimit: The lower limit of the progress meter's range.
upperLimit: The upper limit of the progress meter's range.
label: The short description of the progress (e.g. "Calculating", "Meshing", etc)
embedLabel:
If true, then the label will be embedded in the progress meter.
If false, then the label will appear to the left of the progress meter.
showPercentComplete:
If true, then the percent complete will appear in the progress meter.
Returns:
1 - The progress meter was created successfully.
0 - The progress meter was not created.
-1 - The progress meter was not created because some other process has already created it.
Since: 5.0

Rhino.UI.StatusBar.ShowProgressMeter(System.UInt32,System.Int32,System.Int32,System.String,System.Boolean,System.Boolean)
Starts, or shows, Rhino's status bar progress meter.
docSerialNumber: The document runtime serial number.
lowerLimit: The lower limit of the progress meter's range.
upperLimit: The upper limit of the progress meter's range.
label: The short description of the progress (e.g. "Calculating", "Meshing", etc)
embedLabel:
If true, then the label will be embedded in the progress meter.
If false, then the label will appear to the left of the progress meter.
showPercentComplete:
If true, then the percent complete will appear in the progress meter.
Returns:
1 - The progress meter was created successfully.
0 - The progress meter was not created.
-1 - The progress meter was not created because some other process has already created it.
Since: 6.12

Rhino.UI.StatusBar.UpdateProgressMeter(System.Int32,System.Boolean)
Sets the current position of Rhino's status bar progress meter.
position: The new value. This can be stated in absolute terms, or relative compared to the current position.
The interval bounds are specified when you first show the bar.
absolute:
If true, then the progress meter is moved to position.
If false, then the progress meter is moved position from the current position (relative).
Returns:
The previous position if successful.
Since: 5.0

Rhino.UI.StatusBar.UpdateProgressMeter(System.UInt32,System.Int32,System.Boolean)
Sets the current position of Rhino's status bar progress meter.
docSerialNumber: The document runtime serial number.
position: The new value. This can be stated in absolute terms, or relative compared to the current position.
The interval bounds are specified when you first show the bar.
absolute:
If true, then the progress meter is moved to position.
If false, then the progress meter is moved position from the current position (relative).
Returns:
The previous position if successful.
Since: 6.12

Rhino.UI.StatusBar.UpdateProgressMeter(System.String,System.Int32,System.Boolean)
Sets the label and current position of Rhino's status bar progress meter.
label:
The short description of the progress (e.g. "Calculating", "Meshing", etc)
position:
The new value. This can be stated in absolute terms, or relative compared to the current position.
The interval bounds are specified when you first show the bar.
Note, if value is Rhino.RhinoMath.UnsetIntIndex, only the label is updated.
absolute:
If true, then the progress meter is moved to position.
If false, then the progress meter is moved position from the current position (relative).
Returns:
The previous position if successful.
Since: 8.6

Rhino.UI.StatusBar.UpdateProgressMeter(System.UInt32,System.String,System.Int32,System.Boolean)
Sets the label and current position of Rhino's status bar progress meter.
docSerialNumber: The document runtime serial number.
label: The short description of the progress (e.g. "Calculating", "Meshing", etc)
position:
The new value. This can be stated in absolute terms, or relative compared to the current position.
The interval bounds are specified when you first show the bar.
Note, if value is Rhino.RhinoMath.UnsetIntIndex, only the label is updated.
absolute:
If true, then the progress meter is moved to position.
If false, then the progress meter is moved position from the current position (relative).
Returns:
The previous position if successful.
Since: 8.6

Rhino.UI.StatusBar.HideProgressMeter
Ends, or hides, Rhino's status bar progress meter.
Since: 5.0

Rhino.UI.StatusBar.HideProgressMeter(System.UInt32)
Ends, or hides, Rhino's status bar progress meter.
docSerialNumber: The document runtime serial number.
Since: 6.12