Rhino.Input.Custom.PickContext
Utility for determining if objects are picked

Rhino.Input.Custom.PickContext.#ctor
Since: 5.0

Rhino.Input.Custom.PickContext.Dispose
Since: 5.0

Rhino.Input.Custom.PickContext.View
This view can be a model view or a page view. When view is a page view,
then you need to distinguish between the viewports MainViewport() and
ActiveViewport().  When m_view is a model view, both MainViewport() and
ActiveViewport() return the world view's viewport.
Since: 5.0

Rhino.Input.Custom.PickContext.PickLine
pick chord starts on near clipping plane and ends on far clipping plane.
Since: 5.0

Rhino.Input.Custom.PickContext.PickStyle
Since: 5.0

Rhino.Input.Custom.PickContext.PickMode
Since: 5.0

Rhino.Input.Custom.PickContext.PickGroupsEnabled
True if GroupObjects should be added to the pick list
Since: 5.0

Rhino.Input.Custom.PickContext.SubObjectSelectionEnabled
True if the user had activated sub-object selection
Since: 5.0

Rhino.Input.Custom.PickContext.GetObjectUsed
Since: 5.0

Rhino.Input.Custom.PickContext.SetPickTransform(Rhino.Geometry.Transform)
Since: 5.0

Rhino.Input.Custom.PickContext.UpdateClippingPlanes
Updates the clipping plane information in pick region. The
SetClippingPlanes and View fields must be called before calling
UpdateClippingPlanes().
Since: 5.0

Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.BoundingBox,System.Boolean@)
Fast test to check if a bounding box intersects a pick frustum.
box:
boxCompletelyInFrustum:
Set to true if the box is completely contained in the pick frustum.
When doing a window or crossing pick, you can immediately return a
hit if the object's bounding box is completely inside of the pick frustum.
Returns:
False if bounding box is invalid or box does not intersect the pick frustum
Since: 5.0

Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.Point3d,System.Double@,System.Double@)
Utility for picking 3d point
point:
depth:
depth returned here for point picks.
LARGER values are NEARER to the camera.
SMALLER values are FARTHER from the camera.
distance:
planar distance returned here for point picks.
SMALLER values are CLOSER to the pick point
Returns: true if there is a hit
Since: 5.0

Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.Point3d[],System.Int32@,System.Double@,System.Double@)
Since: 5.0

Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.PointCloud,System.Int32@,System.Double@,System.Double@)
Since: 5.0

Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.Line,System.Double@,System.Double@,System.Double@)
Since: 5.0

Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.BezierCurve,System.Double@,System.Double@,System.Double@)
Since: 5.0

Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.NurbsCurve,System.Double@,System.Double@,System.Double@)
Since: 5.0

Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.Mesh,Rhino.Input.Custom.PickContext.MeshPickStyle,Rhino.Geometry.Point3d@,Rhino.Geometry.Point2d@,Rhino.Geometry.Point2d@,System.Double@,System.Double@,Rhino.Input.Custom.PickContext.MeshHitFlag@,System.Int32@)
Utility for picking meshes
mesh: mesh to test
pickStyle: mode used for pick test
hitPoint: location returned here for point picks
hitSurfaceUV:
If the mesh has surface parameters, set to the surface parameters of the hit point
hitTextureCoordinate:
If the mesh has texture coordinates, set to the texture coordinate of the hit
point.  Note that the texture coordinates can be set in many different ways
and this information is useless unless you know how the texture coordinates
are set on this particular mesh.
depth:
depth returned here for point picks
LARGER values are NEARER to the camera.
SMALLER values are FARTHER from the camera.
distance:
planar distance returned here for point picks.
SMALLER values are CLOSER to the pick point
hitFlag:
For point picks, How to interpret the hitIndex (vertex hit, edge hit, or face hit)
hitIndex:
index of vertex/edge/face that was hit. Use hitFlag to determine what this index
corresponds to
Returns:
Since: 5.0

Rhino.Input.Custom.PickContext.PickFrustumTest(Rhino.Geometry.Mesh,Rhino.Input.Custom.PickContext.MeshPickStyle,Rhino.Geometry.Point3d@,System.Double@,System.Double@,Rhino.Input.Custom.PickContext.MeshHitFlag@,System.Int32@)
Utility for picking meshes
mesh: mesh to test
pickStyle: mode used for pick test
hitPoint: location returned here for point picks
depth:
depth returned here for point picks
LARGER values are NEARER to the camera.
SMALLER values are FARTHER from the camera.
distance:
planar distance returned here for point picks.
SMALLER values are CLOSER to the pick point
hitFlag:
For point picks, How to interpret the hitIndex (vertex hit, edge hit, or face hit)
hitIndex:
index of vertex/edge/face that was hit. Use hitFlag to determine what this index
corresponds to
Returns:
Since: 5.0

Rhino.Input.Custom.PickContext.PickMeshTopologyVertices(Rhino.Geometry.Mesh)
Utility for picking mesh vertices
mesh:
Returns: indices of mesh topology vertices that were picked
Since: 5.0