Rhino.Render.PostEffects.PostEffectThreadEngine.CppPointer
Since: 7.0

Rhino.Render.PostEffects.PostEffectThreadEngine.#ctor(System.IntPtr)
Since: 7.0

Rhino.Render.PostEffects.PostEffectThreadEngine.Dispose
Since: 7.0

Rhino.Render.PostEffects.PostEffectThreadEngine.RunPostEffect(Rhino.Render.PostEffects.PostEffectJob,Rhino.Render.PostEffects.PostEffectPipeline,Rhino.Render.PostEffects.PostEffect,System.Drawing.Rectangle,System.Guid[])
Since: 7.0