Rhino.Render.TexturedValue`1
Generic class to help holding on to related values. This can be
used to get data from textured content fields with the
HandleTexturedValue function.
Color4f or float
Since: 6.12