Rhino.DocObjects.Font.FontType
An enum that reports if the font face is available on the current device.

Rhino.DocObjects.Font.FontType.Unset
Not set.

Rhino.DocObjects.Font.FontType.ManagedFont
In the managed font list.

Rhino.DocObjects.Font.FontType.InstalledFont
In the installed font list.