Rhino.Geometry.Concavity
Enumerates the possible types of edge concavity types.
Since: 6.2

Rhino.Geometry.Concavity.None
Concavity is not relevant, for example naked and non-manifold edges
cannot have a concavity measure.

Rhino.Geometry.Concavity.Tangent
Faces on either side of the edge are tangent within tolerance.

Rhino.Geometry.Concavity.Convex
Faces on either side of the edge are convex.

Rhino.Geometry.Concavity.Concave
Faces on either side of the edge are concave.