Rhino.DocObjects.DimensionStyle.Field
Field identifiers used for file i/o and getting/setting values

Rhino.DocObjects.DimensionStyle.Field.Unset


Rhino.DocObjects.DimensionStyle.Field.Name
Dimension style Name property. Cannot be inherited from parent.

Rhino.DocObjects.DimensionStyle.Field.Index
Dimension style runtime model component index property. Cannot be inherited from parent.

Rhino.DocObjects.DimensionStyle.Field.ExtensionLineExtension


Rhino.DocObjects.DimensionStyle.Field.ExtensionLineOffset


Rhino.DocObjects.DimensionStyle.Field.Arrowsize


Rhino.DocObjects.DimensionStyle.Field.LeaderArrowsize


Rhino.DocObjects.DimensionStyle.Field.Centermark


Rhino.DocObjects.DimensionStyle.Field.TextGap


Rhino.DocObjects.DimensionStyle.Field.TextHeight


Rhino.DocObjects.DimensionStyle.Field.DimTextLocation
Linear, angular, and ordinate dimension text location above/in/below

Rhino.DocObjects.DimensionStyle.Field.MaskFrameType
Text mask frame

Rhino.DocObjects.DimensionStyle.Field.LengthResolution


Rhino.DocObjects.DimensionStyle.Field.AngleFormat


Rhino.DocObjects.DimensionStyle.Field.AngleResolution


Rhino.DocObjects.DimensionStyle.Field.Font


Rhino.DocObjects.DimensionStyle.Field.LengthFactor
LengthFactor is a rarely used. It applies when a model is being
drawn to a scale and the dimension length values should be
reverse scaled. For example, if a model is drawn at 1/4 scale,
a line 5 units long indicates the real world line is 20 units
long. In this case setting LengthFactor to 4 would cause
a linear dimension applied to that line to display a value of 20.

Rhino.DocObjects.DimensionStyle.Field.Alternate


Rhino.DocObjects.DimensionStyle.Field.AlternateLengthFactor
AlternateLengthFactor is a rarely used. See Length factor for
a description of this property.

Rhino.DocObjects.DimensionStyle.Field.AlternateLengthResolution


Rhino.DocObjects.DimensionStyle.Field.Prefix


Rhino.DocObjects.DimensionStyle.Field.Suffix


Rhino.DocObjects.DimensionStyle.Field.AlternatePrefix


Rhino.DocObjects.DimensionStyle.Field.AlternateSuffix


Rhino.DocObjects.DimensionStyle.Field.DimensionLineExtension


Rhino.DocObjects.DimensionStyle.Field.SuppressExtension1


Rhino.DocObjects.DimensionStyle.Field.SuppressExtension2


Rhino.DocObjects.DimensionStyle.Field.ExtLineColorSource


Rhino.DocObjects.DimensionStyle.Field.DimLineColorSource


Rhino.DocObjects.DimensionStyle.Field.ArrowColorSource


Rhino.DocObjects.DimensionStyle.Field.TextColorSource


Rhino.DocObjects.DimensionStyle.Field.ExtLineColor


Rhino.DocObjects.DimensionStyle.Field.DimLineColor


Rhino.DocObjects.DimensionStyle.Field.ArrowColor


Rhino.DocObjects.DimensionStyle.Field.TextColor


Rhino.DocObjects.DimensionStyle.Field.ExtLinePlotColorSource


Rhino.DocObjects.DimensionStyle.Field.DimLinePlotColorSource


Rhino.DocObjects.DimensionStyle.Field.ArrowPlotColorSource


Rhino.DocObjects.DimensionStyle.Field.TextPlotColorSource


Rhino.DocObjects.DimensionStyle.Field.ExtLinePlotColor


Rhino.DocObjects.DimensionStyle.Field.DimLinePlotColor


Rhino.DocObjects.DimensionStyle.Field.ArrowPlotColor


Rhino.DocObjects.DimensionStyle.Field.TextPlotColor


Rhino.DocObjects.DimensionStyle.Field.ExtLinePlotWeightSource


Rhino.DocObjects.DimensionStyle.Field.DimLinePlotWeightSource


Rhino.DocObjects.DimensionStyle.Field.ExtLinePlotWeight_mm


Rhino.DocObjects.DimensionStyle.Field.DimLinePlotWeight_mm


Rhino.DocObjects.DimensionStyle.Field.ToleranceFormat


Rhino.DocObjects.DimensionStyle.Field.ToleranceResolution


Rhino.DocObjects.DimensionStyle.Field.ToleranceUpperValue


Rhino.DocObjects.DimensionStyle.Field.ToleranceLowerValue


Rhino.DocObjects.DimensionStyle.Field.AltToleranceResolution


Rhino.DocObjects.DimensionStyle.Field.ToleranceHeightScale


Rhino.DocObjects.DimensionStyle.Field.BaselineSpacing


Rhino.DocObjects.DimensionStyle.Field.DrawMask


Rhino.DocObjects.DimensionStyle.Field.MaskColorSource


Rhino.DocObjects.DimensionStyle.Field.MaskColor


Rhino.DocObjects.DimensionStyle.Field.MaskBorder


Rhino.DocObjects.DimensionStyle.Field.DimensionScale


Rhino.DocObjects.DimensionStyle.Field.DimscaleSource


Rhino.DocObjects.DimensionStyle.Field.FixedExtensionLength


Rhino.DocObjects.DimensionStyle.Field.FixedExtensionOn


Rhino.DocObjects.DimensionStyle.Field.TextRotation


Rhino.DocObjects.DimensionStyle.Field.SuppressArrow1


Rhino.DocObjects.DimensionStyle.Field.SuppressArrow2


Rhino.DocObjects.DimensionStyle.Field.TextmoveLeader


Rhino.DocObjects.DimensionStyle.Field.ArclengthSymbol


Rhino.DocObjects.DimensionStyle.Field.StackTextheightScale


Rhino.DocObjects.DimensionStyle.Field.StackFormat


Rhino.DocObjects.DimensionStyle.Field.AltRound


Rhino.DocObjects.DimensionStyle.Field.Round


Rhino.DocObjects.DimensionStyle.Field.AngularRound


Rhino.DocObjects.DimensionStyle.Field.AltZeroSuppress


Rhino.DocObjects.DimensionStyle.Field.AngleZeroSuppress


Rhino.DocObjects.DimensionStyle.Field.ZeroSuppress


Rhino.DocObjects.DimensionStyle.Field.AltBelow


Rhino.DocObjects.DimensionStyle.Field.ArrowType1


Rhino.DocObjects.DimensionStyle.Field.ArrowType2


Rhino.DocObjects.DimensionStyle.Field.LeaderArrowType


Rhino.DocObjects.DimensionStyle.Field.ArrowBlockId1


Rhino.DocObjects.DimensionStyle.Field.ArrowBlockId2


Rhino.DocObjects.DimensionStyle.Field.LeaderArrowBlock


Rhino.DocObjects.DimensionStyle.Field.DimRadialTextLocation
Radial dimension text location above/in/below

Rhino.DocObjects.DimensionStyle.Field.TextVerticalAlignment


Rhino.DocObjects.DimensionStyle.Field.LeaderTextVerticalAlignment


Rhino.DocObjects.DimensionStyle.Field.LeaderContentAngleStyle


Rhino.DocObjects.DimensionStyle.Field.LeaderCurveType


Rhino.DocObjects.DimensionStyle.Field.LeaderContentAngle


Rhino.DocObjects.DimensionStyle.Field.LeaderHasLanding


Rhino.DocObjects.DimensionStyle.Field.LeaderLandingLength


Rhino.DocObjects.DimensionStyle.Field.MaskFlags


Rhino.DocObjects.DimensionStyle.Field.CentermarkStyle


Rhino.DocObjects.DimensionStyle.Field.TextHorizontalAlignment


Rhino.DocObjects.DimensionStyle.Field.LeaderTextHorizontalAlignment


Rhino.DocObjects.DimensionStyle.Field.DrawForward


Rhino.DocObjects.DimensionStyle.Field.SignedOrdinate


Rhino.DocObjects.DimensionStyle.Field.UnitSystem
Unit system for dimension rendering sizes like  TextHeight, TextGap, ArrowSize, ExtOffset,
and dozens of other properties that control the appearance and placement of the components
used to render a dimension.

Rhino.DocObjects.DimensionStyle.Field.TextMask


Rhino.DocObjects.DimensionStyle.Field.TextOrientation


Rhino.DocObjects.DimensionStyle.Field.LeaderTextOrientation


Rhino.DocObjects.DimensionStyle.Field.DimTextOrientation


Rhino.DocObjects.DimensionStyle.Field.DimRadialTextOrientation


Rhino.DocObjects.DimensionStyle.Field.DimTextAngleStyle


Rhino.DocObjects.DimensionStyle.Field.DimRadialTextAngleStyle


Rhino.DocObjects.DimensionStyle.Field.TextUnderlined


Rhino.DocObjects.DimensionStyle.Field.DimensionLengthDisplay
Dimension length display. See ON_DimStyle::DimensionLengthDisplay() for a description of this parameter.

Rhino.DocObjects.DimensionStyle.Field.AlternateDimensionLengthDisplay
Alternate dimension length display. See ON_DimStyle::AlternateDimensionLengthDisplay() for a description of this parameter.

Rhino.DocObjects.DimensionStyle.Field.ForceDimLine
Force dimension line to draw when text is moved outside

Rhino.DocObjects.DimensionStyle.Field.ArrowFit
Arrow position when arrows won't fit between extensions

Rhino.DocObjects.DimensionStyle.Field.TextFit
Text position when text won't fit between extensions

Rhino.DocObjects.DimensionStyle.Field.DecimalSeparator
Character to use for decimal separator in dimension text

Rhino.DocObjects.DimensionStyle.Field.Count
Every enum UINT value that identifies a valid dimension style property is less than the UINT value of Count.