Rhino.Render.RenderTexture.NewBitmapTexture(Rhino.Render.SimulatedTexture)
Constructs a new basic texture from a SimulatedTexture.
texture: The texture to create the basic texture from.
Returns: A new render texture.
Since: 5.3
6.4

Rhino.Render.RenderTexture.NewBitmapTexture(Rhino.Render.SimulatedTexture,Rhino.RhinoDoc)
Constructs a new basic texture from a SimulatedTexture.
texture: The texture to create the basic texture from.
doc: The document to associate the texture with.
Returns: A new render texture.
Since: 6.4

Rhino.Render.RenderTexture.SaveAsImage(System.String,System.Int32,System.Int32,System.Int32)
Save texture as image
FullPath: The full path of the file
width: Image width
height: Image height
depth: Image depth
Returns: returns true if file was saved, otherwise false
Since: 6.15

Rhino.Render.RenderTexture.NewBitmapTexture(System.Drawing.Bitmap,Rhino.RhinoDoc)
Constructs a new basic texture from a Bitmap.
bitmap: The bitmap to create the basic texture from.
doc: The document to associate the texture with.
Returns: A new render texture.
Remarks: The returned bitmap texture holds a copy of 'bitmap'.
Since: 7.0

Rhino.Render.RenderTexture.RenderHashWithoutLocalMapping
Render hash for texture excluding local mapping.
Since: 6.0

Rhino.Render.RenderTexture.RenderHashWithoutLocalMappingOrLinearWorkflow
Render hash for texture excluding local mapping and linear workflow.
Since: 8.0

Rhino.Render.RenderTexture.LocalMappingTransform
Gets the transformation that can be applied to the UVW vector to convert it
from normalized texture space into locally mapped space (ie - with repeat,
offset and rotation applied.)
Since: 5.1

Rhino.Render.RenderTexture.PixelSize(System.Int32@,System.Int32@,System.Int32@)
Get the texture dimensions for the RenderTexture.
u: width
v: height
w: depth, used for 3D textures
Since: 6.0
Rhino.Render.RenderTexture.PixelSize2

Rhino.Render.RenderTexture.PixelSize2
Override to provide details on the actual pixel sizes of this texture in UVW directions
return null if the texture should not be treated as a bitmap.
Since: 7.6

Rhino.Render.RenderTexture.CreateEvaluator(Rhino.Render.RenderTexture.TextureEvaluatorFlags)
Constructs a texture evaluator. This is an independent lightweight object
capable of evaluating texture color throughout uvw space. May be called
from within a rendering shade pipeline.
Returns: A texture evaluator instance.
Since: 6.0

Rhino.Render.RenderTexture.CreateEvaluator
Constructs a texture evaluator. This is an independent lightweight object
capable of evaluating texture color throughout uvw space. May be called
from within a rendering shade pipeline.
Returns: A texture evaluator instance.
Since: 5.1
6.0

Rhino.Render.RenderTexture.SimulateTexture(Rhino.Render.SimulatedTexture@,System.Boolean)
Since: 5.1
6.0

Rhino.Render.RenderTexture.SimulateTexture(Rhino.Render.SimulatedTexture@,Rhino.Render.RenderTexture.TextureGeneration,System.Int32,Rhino.DocObjects.RhinoObject)
Since: 6.0

Rhino.Render.RenderTexture.SimulatedTexture(Rhino.Render.RenderTexture.TextureGeneration,System.Int32,Rhino.DocObjects.RhinoObject)
Since: 6.0

Rhino.Render.RenderTexture.GenerateTextureSimulation(System.Drawing.Bitmap@,Rhino.Render.RenderTexture.TextureEvaluatorFlags)
Since: 8.0

Rhino.Render.RenderTexture.GetProjectionMode
Since: 5.7

Rhino.Render.RenderTexture.SetProjectionMode(Rhino.Render.TextureProjectionMode,Rhino.Render.RenderContent.ChangeContexts)
Since: 5.7

Rhino.Render.RenderTexture.GetWrapType
Since: 5.7

Rhino.Render.RenderTexture.SetWrapType(Rhino.Render.TextureWrapType,Rhino.Render.RenderContent.ChangeContexts)
Since: 5.7

Rhino.Render.RenderTexture.GetMappingChannel
Since: 5.7

Rhino.Render.RenderTexture.SetMappingChannel(System.Int32,Rhino.Render.RenderContent.ChangeContexts)
Since: 5.7

Rhino.Render.RenderTexture.GetRepeatLocked
Since: 5.7

Rhino.Render.RenderTexture.SetRepeatLocked(System.Boolean,Rhino.Render.RenderContent.ChangeContexts)
Since: 5.7

Rhino.Render.RenderTexture.GetOffsetLocked
Since: 5.7

Rhino.Render.RenderTexture.SetOffsetLocked(System.Boolean,Rhino.Render.RenderContent.ChangeContexts)
Since: 5.7

Rhino.Render.RenderTexture.GetPreviewIn3D
Since: 5.7

Rhino.Render.RenderTexture.SetPreviewIn3D(System.Boolean,Rhino.Render.RenderContent.ChangeContexts)
Since: 5.7

Rhino.Render.RenderTexture.GetRepeat
Get repeat value across UVW space. If the projection type is WCS or
other type specified in model units, then this is the repeat across 1
meter of the model.
Returns:
Since: 5.7

Rhino.Render.RenderTexture.SetRepeat(Rhino.Geometry.Vector3d,Rhino.Render.RenderContent.ChangeContexts)
Set repeat value across UVW space. If the projection type is WCS or
other type specified in model units, then this is the repeat across 1
meter of the model.
value:
changeContext:
Since: 5.7

Rhino.Render.RenderTexture.GetOffset
Get offset value across UVW space. If the projection type is WCS or
other type specified in model units, then this is the offset in meters.
Returns:
Since: 5.7

Rhino.Render.RenderTexture.SetOffset(Rhino.Geometry.Vector3d,Rhino.Render.RenderContent.ChangeContexts)
Set offset value across UVW space. If the projection type is WCS or
other type specified in model units, then this is the offset in meters.
value:
changeContext:
Since: 5.7

Rhino.Render.RenderTexture.GetRotation
Returns:
Since: 5.7

Rhino.Render.RenderTexture.SetRotation(Rhino.Geometry.Vector3d,Rhino.Render.RenderContent.ChangeContexts)
Since: 5.7

Rhino.Render.RenderTexture.GetInternalEnvironmentMappingMode
Since: 5.7

Rhino.Render.RenderTexture.GetEnvironmentMappingMode
Since: 5.7

Rhino.Render.RenderTexture.SetEnvironmentMappingMode(Rhino.Render.TextureEnvironmentMappingMode,Rhino.Render.RenderContent.ChangeContexts)
Since: 5.7

Rhino.Render.RenderTexture.SetEnvironmentMappingMode(Rhino.Render.TextureEnvironmentMappingMode)
Since: 6.0

Rhino.Render.RenderTexture.GetPreviewLocalMapping
Since: 5.7

Rhino.Render.RenderTexture.SetPreviewLocalMapping(System.Boolean,Rhino.Render.RenderContent.ChangeContexts)
Since: 5.7

Rhino.Render.RenderTexture.GetLocalMappingType
Since: 6.3

Rhino.Render.RenderTexture.SetPreviewLocalMapping(System.Boolean)
Since: 6.0

Rhino.Render.RenderTexture.GetDisplayInViewport
Since: 5.7

Rhino.Render.RenderTexture.SetDisplayInViewport(System.Boolean,Rhino.Render.RenderContent.ChangeContexts)
Since: 5.7

Rhino.Render.RenderTexture.SetDisplayInViewport(System.Boolean)
Since: 6.0

Rhino.Render.RenderTexture.IsHdrCapable
Return true if the texture is HDR capable.
When creating a custom RenderTexture implementation that is HDR capable
set the appropriate property on the CustomRenderContentAttribute decorator on that clas.
Returns:
Since: 5.7

Rhino.Render.RenderTexture.IsLinear
Return true if the texture color data is linear.
NOTE: this function is marked as virtual, but the correct way to make a custom RenderTexture linear is by
setting the correct property for the CustomRenderContentAttribute decorator on the class.
Returns:
Since: 6.0

Rhino.Render.RenderTexture.IsNormalMap
Return true if the texture is a normalmap.
When creating a custom RenderTexture implementation of a normal map
set the appropriate property on the CustomRenderContentAttribute decorator on that clas.
Returns:
Since: 6.16

Rhino.Render.RenderTexture.GraphInfo(Rhino.Render.TextureGraphInfo@)
Since: 6.3

Rhino.Render.RenderTexture.SetGraphInfo(Rhino.Render.TextureGraphInfo)
Since: 6.3

Rhino.Render.RenderTexture.IsImageBased
Query if the texture is image based.
When creating a custom RenderTexture implementation of an image-based texture
set the appropriate property on the CustomRenderContentAttribute decorator on that class.
Do not override this function
Returns: true if the texture is image-based.
Since: 6.0

Rhino.Render.RenderTexture.GetEnvironmentMappingProjection(Rhino.Render.TextureEnvironmentMappingMode,Rhino.Geometry.Vector3d,System.Single@,System.Single@)
Since: 5.7

Rhino.Render.RenderTexture.GetWcsBoxMapping(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)
Since: 5.7

Rhino.Render.RenderTexture.GetProceduralPerlinNoiseArrayPointer
Since: 8.0

Rhino.Render.RenderTexture.GetProceduralPerlinNoiseArraySize
Since: 8.0

Rhino.Render.RenderTexture.GetProceduralImpulseNoiseArrayPointer
Since: 8.0

Rhino.Render.RenderTexture.GetProceduralImpulseNoiseArraySize
Since: 8.0

Rhino.Render.RenderTexture.GetProceduralVcNoiseArrayPointer
Since: 8.0

Rhino.Render.RenderTexture.GetProceduralVcNoiseArraySize
Since: 8.0

Rhino.Render.RenderTexture.GetProceduralAaltonenNoiseArrayPointer
Since: 8.0

Rhino.Render.RenderTexture.GetProceduralAaltonenNoiseArraySize
Since: 8.0