Rhino.Display.ViewCaptureSettings
Holds information required to generate high resolution output of a
RhinoViewport. This is used for generating paper prints or image files

Rhino.Display.ViewCaptureSettings.#ctor
Construct default view capture settings
Since: 6.0

Rhino.Display.ViewCaptureSettings.#ctor(Rhino.Display.ViewCaptureSettings)
Copy constructor
other: settings to copy data from
Since: 8.5

Rhino.Display.ViewCaptureSettings.#ctor(Rhino.Display.RhinoView,System.Drawing.Size,System.Double)
Constructor
sourceView: The Rhino view to capture or print.
mediaSize: The size of the output media.
dpi: Capture "density" in dots per inch.
Since: 6.0

Rhino.Display.ViewCaptureSettings.#ctor(Rhino.Display.RhinoPageView,System.Double)
Constructor
sourcePageView: The Rhino page view to capture or print.
dpi: Capture "density" in dots per inch.
Since: 6.0

Rhino.Display.ViewCaptureSettings.CreatePreviewSettings(System.Drawing.Size)
Create a ViewCaptureSettings based on this instance, but scaled to fit in a different
sized area. Scaling is also performed on dpi. This is primarily used to for capturing
images that are shown as print previews
Returns:
new ViewCaptureSettings instance on success. Null on failure
Since: 7.9

Rhino.Display.ViewCaptureSettings.Equals(Rhino.Display.ViewCaptureSettings)
Check if the contents of this object is the same as another object
other: other settings to compare against
Returns:
Since: 8.5

Rhino.Display.ViewCaptureSettings.SetViewport(Rhino.Display.RhinoViewport)
Since: 6.15

Rhino.Display.ViewCaptureSettings.GetViewport
Get RhinoViewport that this view capture settings is targeting
Returns:
Since: 8.0

Rhino.Display.ViewCaptureSettings.Document
Since: 6.15

Rhino.Display.ViewCaptureSettings.ViewArea
How the RhinoViewport is mapped to the output rectangle
Since: 7.7

Rhino.Display.ViewCaptureSettings.RasterMode
Since: 6.17

Rhino.Display.ViewCaptureSettings.MatchLinetypePatternDefinition
Default is true. Linetype scales are normally generated right before
printing/view capture in order to get linetypes to print to the same
lengths as defined. If false, the linetypes are not scaled and the
current pattern lengths as seen on the screen as used.
Since: 7.6

Rhino.Display.ViewCaptureSettings.ApplyDisplayModeThicknessScales
Should curves and edges have their thicknesses scaled based the on the display
mode settings for a view being captured (default is false)
Since: 8.5

Rhino.Display.ViewCaptureSettings.SetLayout(System.Drawing.Size,System.Drawing.Rectangle)
Since: 6.0

Rhino.Display.ViewCaptureSettings.MediaSize
Total size of the image or page in dots
Since: 6.0

Rhino.Display.ViewCaptureSettings.DrawRectangle
Rectangle where drawing is confined to on MediaSize
Since: 8.5

Rhino.Display.ViewCaptureSettings.Resolution
Capture "density" in dots per inch.
Since: 6.0

Rhino.Display.ViewCaptureSettings.CropRectangle
Actual area of output rectangle that view capture is sent to.
Since: 6.0

Rhino.Display.ViewCaptureSettings.MaximizePrintableArea
Minimize cropping so the full drawable area is used
Since: 7.9

Rhino.Display.ViewCaptureSettings.MatchViewportAspectRatio
Adjust crop rectangle to match the aspect ratio of the original viewport that these
settings reference
Returns: true on success
Since: 7.9

Rhino.Display.ViewCaptureSettings.GetMargins(Rhino.UnitSystem,System.Double@,System.Double@,System.Double@,System.Double@)
Get distances from the edge of the paper (MediaSize) to the CropRectangle
in a defined unit system
lengthUnits: Units to get distances in
left: Distance from left edge of paper to left edge of CropRectangle
top: Distance from top edge of paper to top edge of CropRectangle
right: Distance from right edge of paper to right edge of CropRectangle
bottom: Distance from bottom edge of paper to bottom edge of CropRectangle
Returns:
True if successful.
False if unsuccessful (this could happen if there is no set device_dpi)
Since: 6.2

Rhino.Display.ViewCaptureSettings.SetMargins(Rhino.UnitSystem,System.Double,System.Double,System.Double,System.Double)
Set distances from the edge of the paper (MediaSize) to the CropRectange
in a defined unit system
lengthUnits: Units that left, top, right, and bottom are defined in
left: Distance from left edge of paper to left edge of CropRectangle
top: Distance from top edge of paper to top edge of CropRectangle
right: Distance from right edge of paper to right edge of CropRectangle
bottom: Distance from bottom edge of paper to bottom edge of CropRectangle
Returns:
True if successful.
False if unsuccessful (this could happen if there is no set device_dpi)
Since: 6.2

Rhino.Display.ViewCaptureSettings.SetMarginLeft(Rhino.UnitSystem,System.Double)
Set the distance from the left edge of the paper to the CropRectangle
lengthUnits: units that distance is defined in
distance: distance to set
Returns:
True if successful.
False if unsuccessful (this could happen if there is no set device_dpi)
Since: 8.5

Rhino.Display.ViewCaptureSettings.SetMarginTop(Rhino.UnitSystem,System.Double)
Set the distance from the top edge of the paper to the CropRectangle
lengthUnits: units that distance is defined in
distance: distance to set
Returns:
True if successful.
False if unsuccessful (this could happen if there is no set device_dpi)
Since: 8.5

Rhino.Display.ViewCaptureSettings.SetMarginRight(Rhino.UnitSystem,System.Double)
Set the distance from the right edge of the paper to the CropRectangle
lengthUnits: units that distance is defined in
distance: distance to set
Returns:
True if successful.
False if unsuccessful (this could happen if there is no set device_dpi)
Since: 8.5

Rhino.Display.ViewCaptureSettings.SetMarginBottom(Rhino.UnitSystem,System.Double)
Set the distance from the bottom edge of the paper to the CropRectangle
lengthUnits: units that distance is defined in
distance: distance to set
Returns:
True if successful.
False if unsuccessful (this could happen if there is no set device_dpi)
Since: 8.5

Rhino.Display.ViewCaptureSettings.SetOffset(Rhino.UnitSystem,System.Boolean,System.Double,System.Double)
Since: 6.2

Rhino.Display.ViewCaptureSettings.GetOffset(Rhino.UnitSystem,System.Boolean@,System.Double@,System.Double@)
Since: 6.2

Rhino.Display.ViewCaptureSettings.OffsetAnchor
Since: 6.2

Rhino.Display.ViewCaptureSettings.IsValid
Since: 6.0

Rhino.Display.ViewCaptureSettings.DrawBackground
Since: 6.0

Rhino.Display.ViewCaptureSettings.DrawGrid
Since: 6.0

Rhino.Display.ViewCaptureSettings.DrawAxis
Since: 6.0

Rhino.Display.ViewCaptureSettings.DrawLockedObjects
Since: 6.0

Rhino.Display.ViewCaptureSettings.DrawMargins
Since: 6.0

Rhino.Display.ViewCaptureSettings.DrawSelectedObjectsOnly
Since: 6.0

Rhino.Display.ViewCaptureSettings.DrawClippingPlanes
Since: 6.0

Rhino.Display.ViewCaptureSettings.DrawLights
Since: 6.0

Rhino.Display.ViewCaptureSettings.DrawBackgroundBitmap
Since: 6.2

Rhino.Display.ViewCaptureSettings.DrawWallpaper
Since: 6.2

Rhino.Display.ViewCaptureSettings.UsePrintWidths
Since: 6.15

Rhino.Display.ViewCaptureSettings.WireThicknessScale
Scaling factor to apply to object print widths (typically 1.0). This is
helpful when printing something at 1/2 scale and having all of the curves
print 1/2 as thick.
Since: 6.15

Rhino.Display.ViewCaptureSettings.PointSizeMillimeters
Size of point objects in millimeters.
if scale <= 0 the size is minimized so points are always drawn as small as possible
Since: 6.15

Rhino.Display.ViewCaptureSettings.ArrowheadSizeMillimeters
Arrowhead size in millimeters.
Since: 6.15

Rhino.Display.ViewCaptureSettings.TextDotPointSize
Font point size use for printing text dots. The default value is 10.0.
This has morphed into a scale setting as individual text dots have
their own sizes. A value of 20 will print dots at double of their size
setting while a value of 10 will print with no scaling applied.
Since: 7.27

Rhino.Display.ViewCaptureSettings.DefaultPrintWidthMillimeters
Line thickness, in millimeters, used to print objects with no defined thickness.
Since: 6.15

Rhino.Display.ViewCaptureSettings.HorizontalScale
Horizontal stretch to be applied to output. Useful for calibrating printers
Since: 8.4

Rhino.Display.ViewCaptureSettings.VerticalScale
Vertical stretch to be applied to output. Useful for calibrating printers
Since: 8.4

Rhino.Display.ViewCaptureSettings.OutputColor
Since: 6.8

Rhino.Display.ViewCaptureSettings.HeaderText
Text drawn at the top of the output
Since: 7.6

Rhino.Display.ViewCaptureSettings.FooterText
Text drawn at the bottom of the output
Since: 7.6

Rhino.Display.ViewCaptureSettings.GetModelScale(Rhino.UnitSystem,Rhino.UnitSystem)
Returns the model scale factor.
pageUnits: The current page units.
modelUnits: The current model units.
Returns: The model scale factor.
Since: 6.21

Rhino.Display.ViewCaptureSettings.SetModelScaleToValue(System.Double)
Sets the model scale to a value.
scale: The scale value.
Since: 6.21

Rhino.Display.ViewCaptureSettings.SetModelScaleToFit(System.Boolean)
Scales the model to fit.
promptOnChange: Prompt the user if the model scale will change.
Since: 6.21

Rhino.Display.ViewCaptureSettings.IsScaleToFit
Returns true if the model has been scaled to fit.
Since: 6.21

Rhino.Display.ViewCaptureSettings.ModelScaleType
Since: 6.21

Rhino.Display.ViewCaptureSettings.SetWindowRect(Rhino.Geometry.Point2d,Rhino.Geometry.Point2d)
Set the print area to a window selection based on two points in screen coordinates
screenPoint1:
first point; it doesn't matter what corner of the rectangle this point represents
screenPoint2: point representing opposite corner of rectangle from screenPoint1
Since: 7.4

Rhino.Display.ViewCaptureSettings.SetWindowRect(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Set the print area to a window selection based on two points in world coordinates
worldPoint1:
First point in world coordinates. This point is projected to screen coordinates
worldPoint2:
Second point in world coordinates. This point is projected to screen coordinates
Since: 7.4

Rhino.Display.ViewCaptureSettings.LinetypeWidthUnitsArePageLengths
Since: 8.0

Rhino.Display.ViewCaptureSettings.Load(System.String,Rhino.PersistentSettings)
Since: 8.1

Rhino.Display.ViewCaptureSettings.Save(System.String,Rhino.PersistentSettings)
Since: 8.1

Rhino.Display.ViewCaptureSettings.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 6.0

Rhino.Display.ViewCaptureSettings.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().