Rhino.DocObjects.FontQuartet.#ctor(System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Since: 6.26

Rhino.DocObjects.FontQuartet.QuartetName
Since: 6.7

Rhino.DocObjects.FontQuartet.HasRegularFont
Since: 6.7

Rhino.DocObjects.FontQuartet.HasBoldFont
Since: 6.7

Rhino.DocObjects.FontQuartet.HasItalicFont
Since: 6.7

Rhino.DocObjects.FontQuartet.HasBoldItalicFont
Since: 6.7