Rhino.DocObjects.AngularDimensionObject
Rhino Object that represents an angular dimension geometry and attributes

Rhino.DocObjects.AngularDimensionObject.AngularDimensionGeometry
Get the dimension geometry for this object.
Since: 6.0