Rhino.FileIO.FileSvgReadOptions
Options used when reading a Svg file

Rhino.FileIO.FileSvgReadOptions.RetainGrouping
Since: 8.0

Rhino.FileIO.FileSvgReadOptions.GroupMultiCurvePaths
Since: 8.0

Rhino.FileIO.FileSvgReadOptions.ImportFilledObjectAs
Since: 8.0

Rhino.FileIO.FileSvgReadOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Import function
Returns:
Since: 8.0