Rhino.FileIO.File3dmObjectTable
Represents a simple object table for a file that is open externally.
This class mimics Rhino.DocObjects.Tables.ObjectTable while providing external access to the file.

Rhino.FileIO.File3dmObjectTable.ComponentType
Returns Rhino.DocObjects.ModelComponentType.ModelGeometry.
Since: 6.0

Rhino.FileIO.File3dmObjectTable.FindByLayer(System.String)
Finds all File3dmObject that are in a given layer.
layer: Layer to search.
Returns:
Array of objects that belong to the specified layer or empty array if no objects could be found.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.FindByLayer(Rhino.DocObjects.Layer)
Finds all File3dmObject that are in a given layer.
layer: A layer instance.
Returns: Array of objects that belong to the specified layer or empty array if no objects could be found.
Throws System.ArgumentNullException: If layer is null.
Since: 6.0

Rhino.FileIO.File3dmObjectTable.FindByGroup(Rhino.DocObjects.Group)
Finds all File3dmObject that are in a given group.
group: A group instance.
Returns: Array of objects that belong to the specified group or empty array if no objects could be found.
Throws System.ArgumentNullException: If group is null.
Since: 6.20

Rhino.FileIO.File3dmObjectTable.GetBoundingBox
Gets the bounding box containing every object in this table.
Returns: The computed bounding box.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.Add(Rhino.FileIO.File3dmObject)
Duplicates the object, then adds a copy of the object to the document.
item: The item to duplicate and add.
Since: 6.0

Rhino.FileIO.File3dmObjectTable.Add(Rhino.Geometry.GeometryBase,Rhino.DocObjects.ObjectAttributes)
Duplicates the object, then adds a copy of the object to the document.
item: The item to duplicate and add.
attributes: The attributes to link with geometry.
Since: 6.0

Rhino.FileIO.File3dmObjectTable.AddPoint(System.Double,System.Double,System.Double)
Adds a point object to the table.
x: X component of point coordinate.
y: Y component of point coordinate.
z: Z component of point coordinate.
Returns: id of new object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddPoint(Rhino.Geometry.Point3d)
Adds a point object to the table.
point: A location for point.
Returns: Id of new object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddPoint(Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes)
Adds a point object to the document.
point: A location for point.
attributes: attributes to apply to point.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddPoint(Rhino.Geometry.Point3f)
Adds a point object to the document.
point: location of point.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddPoint(Rhino.Geometry.Point3f,Rhino.DocObjects.ObjectAttributes)
Adds a point object to the document.
point: location of point.
attributes: attributes to apply to point.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Adds multiple points to the document.
points: Points to add.
Returns: List of object ids.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.DocObjects.ObjectAttributes)
Adds multiple points to the document.
points: Points to add.
attributes: Attributes to apply to point objects.
Returns: An array of object unique identifiers.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3f})
Adds multiple points to the document.
points: Points to add.
Returns: An array of object unique identifiers.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3f},Rhino.DocObjects.ObjectAttributes)
Adds multiple points to the document.
points: Points to add.
attributes: Attributes to apply to point objects.
Returns: An array of object unique identifiers.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddPointCloud(Rhino.Geometry.PointCloud)
Adds a point cloud object to the document.
cloud: PointCloud to add.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddPointCloud(Rhino.Geometry.PointCloud,Rhino.DocObjects.ObjectAttributes)
Adds a point cloud object to the document.
cloud: PointCloud to add.
attributes: attributes to apply to point cloud.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddPointCloud(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Adds a point cloud object to the document.
points: A list, an array or any enumerable set of Rhino.Geometry.Point3d.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddPointCloud(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.DocObjects.ObjectAttributes)
Adds a point cloud object to the document.
points: A list, an array or any enumerable set of Rhino.Geometry.Point3d.
attributes: Attributes to apply to point cloud.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddClippingPlane(Rhino.Geometry.Plane,System.Double,System.Double,System.Guid)
Adds a clipping plane object to Rhino.
plane: A plane.
uMagnitude: The size in U direction.
vMagnitude: The size in V direction.
clippedViewportId: The viewport id that the new clipping plane will clip.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddClippingPlane(Rhino.Geometry.Plane,System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Guid})
Adds a clipping plane object to Rhino.
plane: A plane.
uMagnitude: The size in U direction.
vMagnitude: The size in V direction.
clippedViewportIds: A list, an array or any enumerable of viewport ids that the new clipping plane will clip.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddClippingPlane(Rhino.Geometry.Plane,System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Guid},Rhino.DocObjects.ObjectAttributes)
Adds a clipping plane object to Rhino.
plane: A plane.
uMagnitude: The size in U direction.
vMagnitude: The size in V direction.
clippedViewportIds: list of viewport ids that the new clipping plane will clip.
attributes: Attributes to apply to point cloud.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddLinearDimension(Rhino.Geometry.LinearDimension)
Adds a linear dimension to the 3dm file object table.
dimension: A dimension.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddLinearDimension(Rhino.Geometry.LinearDimension,Rhino.DocObjects.ObjectAttributes)
Adds a linear dimension to the 3dm file object table.
dimension: A dimension.
attributes: Attributes to apply to dimension.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddAngularDimension(Rhino.Geometry.AngularDimension)
Adds a angular dimension object to the 3dm file object table.
dimension: Dimension object to add.
Returns: A unique identifier for the object.
Since: 6.5

Rhino.FileIO.File3dmObjectTable.AddAngularDimension(Rhino.Geometry.AngularDimension,Rhino.DocObjects.ObjectAttributes)
Adds a angular dimension object to the 3dm file object table.
dimension: Dimension object to add.
attributes: Attributes to apply to dimension.
Returns: A unique identifier for the object.
Since: 6.5

Rhino.FileIO.File3dmObjectTable.AddOrdinateDimension(Rhino.Geometry.OrdinateDimension)
Adds an ordinate dimension object to the 3dm file object table.
dimension: Dimension object to add.
Returns: A unique identifier for the object.
Since: 7.32

Rhino.FileIO.File3dmObjectTable.AddOrdinateDimension(Rhino.Geometry.OrdinateDimension,Rhino.DocObjects.ObjectAttributes)
Adds an ordinate dimension object to the 3dm file object table.
dimension: Dimension object to add.
attributes: Attributes to apply to dimension.
Returns: A unique identifier for the object.
Since: 7.32

Rhino.FileIO.File3dmObjectTable.AddRadialDimension(Rhino.Geometry.RadialDimension)
Adds a radial dimension object to the 3dm file object table.
dimension: Dimension object to add.
Returns: A unique identifier for the object.
Since: 7.32

Rhino.FileIO.File3dmObjectTable.AddRadialDimension(Rhino.Geometry.RadialDimension,Rhino.DocObjects.ObjectAttributes)
Adds a radial dimension object to the 3dm file object table.
dimension: Dimension object to add.
attributes: Attributes to apply to dimension.
Returns: A unique identifier for the object.
Since: 7.32

Rhino.FileIO.File3dmObjectTable.AddLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Adds a line object to Rhino.
from: A line start point.
to: A line end point.
Returns: A unique identifier of new rhino object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes)
Adds a line object to Rhino.
from: The start point of the line.
to: The end point of the line.
attributes: Attributes to apply to line.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddLine(Rhino.Geometry.Line)
Adds a line object to Rhino.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddLine(Rhino.Geometry.Line,Rhino.DocObjects.ObjectAttributes)
Adds a line object to Rhino.
line: A line.
attributes: Attributes to apply to line.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Adds a polyline object to Rhino.
points: A list, an array or any enumerable set of Rhino.Geometry.Point3d.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.DocObjects.ObjectAttributes)
Adds a polyline object to Rhino.
points: A list, an array or any enumerable set of Rhino.Geometry.Point3d.
attributes: Attributes to apply to line.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddArc(Rhino.Geometry.Arc)
Adds a curve object to the document representing an arc.
arc: An arc.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddArc(Rhino.Geometry.Arc,Rhino.DocObjects.ObjectAttributes)
Adds a curve object to the document representing an arc.
arc: An arc to add.
attributes: attributes to apply to arc.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddCircle(Rhino.Geometry.Circle)
Adds a curve object to the document representing a circle.
circle: A circle to add.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddCircle(Rhino.Geometry.Circle,Rhino.DocObjects.ObjectAttributes)
Adds a curve object to the document representing a circle.
circle: A circle to add.
attributes: attributes to apply to circle.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddEllipse(Rhino.Geometry.Ellipse)
Adds a curve object to the document representing an ellipse.
ellipse: An ellipse to add.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddEllipse(Rhino.Geometry.Ellipse,Rhino.DocObjects.ObjectAttributes)
Adds a curve object to the document representing an ellipse.
ellipse: An ellipse to add.
attributes: attributes to apply to ellipse.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddSphere(Rhino.Geometry.Sphere)
Adds a surface object to the document representing a sphere.
sphere: A sphere to add.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddSphere(Rhino.Geometry.Sphere,Rhino.DocObjects.ObjectAttributes)
Adds a surface object to the document representing a sphere.
sphere: A sphere to add.
attributes: Attributes to link with the sphere.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddCurve(Rhino.Geometry.Curve)
Adds a curve object to the table.
curve: A curve to add.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddCurve(Rhino.Geometry.Curve,Rhino.DocObjects.ObjectAttributes)
Adds a curve object to the table.
curve: A duplicate of this curve is added to Rhino.
attributes: Attributes to apply to curve.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddTextDot(System.String,Rhino.Geometry.Point3d)
Adds a text dot object to the table.
text: The text.
location: The location.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddTextDot(System.String,Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes)
Adds a text dot object to the table.
text: The text.
location: The location.
attributes: Attributes to link with curve.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddTextDot(Rhino.Geometry.TextDot)
Adds a text dot object to the table.
dot: The text dot.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddTextDot(Rhino.Geometry.TextDot,Rhino.DocObjects.ObjectAttributes)
Adds a text dot object to the table.
dot: The text dot.
attributes: Attributes to link with text dot.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddInstanceObject(Rhino.Geometry.InstanceReferenceGeometry)
Adds an instance reference geometry object to the table.
instanceReference: The instance reference geometry object.
Returns: A unique identifier for the object.
Since: 6.5

Rhino.FileIO.File3dmObjectTable.AddInstanceObject(Rhino.Geometry.InstanceReferenceGeometry,Rhino.DocObjects.ObjectAttributes)
Adds an instance reference geometry object to the table.
instanceReference: The instance reference geometry object.
attributes: The attributes to link with the object.
Returns: A unique identifier for the object.
Since: 6.5

Rhino.FileIO.File3dmObjectTable.AddInstanceObject(System.Int32,Rhino.Geometry.Transform)
Adds an instance reference geometry object to the table.
instanceDefinitionIndex: The index of the instance definition geometry object.
instanceXform: The transformation.
Returns: A unique identifier for the object.
Since: 6.5

Rhino.FileIO.File3dmObjectTable.AddInstanceObject(System.Int32,Rhino.Geometry.Transform,Rhino.DocObjects.ObjectAttributes)
Adds an instance reference geometry object to the table.
instanceDefinitionIndex: The index of the instance definition geometry object.
instanceXform: The transformation.
attributes: The object attributes.
Returns: A unique identifier for the object.
Since: 6.5

Rhino.FileIO.File3dmObjectTable.AddText(Rhino.Display.Text3d)
Adds an annotation text object to the document.
text3d: The text object to add.
Returns: The Guid of the newly added object or Guid.Empty on failure.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddText(Rhino.Display.Text3d,Rhino.DocObjects.ObjectAttributes)
Adds an annotation text object to the document.
text3d: The text object to add.
attributes: Attributes to link to the object.
Returns: The Guid of the newly added object or Guid.Empty on failure.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddText(System.String,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean)
Adds an annotation text object to the document.
text: Text string.
plane: Plane of text.
height: Height of text.
fontName: Name of FontFace.
bold: Bold flag.
italic: Italic flag.
Returns: The Guid of the newly added object or Guid.Empty on failure.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddText(System.String,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean,Rhino.Geometry.TextJustification)
Adds an annotation text object to the document.
text: Text string.
plane: Plane of text.
height: Height of text.
fontName: Name of FontFace.
bold: Bold flag.
italic: Italic flag.
justification: The justification of the text.
Returns: The Guid of the newly added object or Guid.Empty on failure.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddText(System.String,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean,Rhino.Geometry.TextJustification,Rhino.DocObjects.ObjectAttributes)
Adds an annotation text object to the document.
text: Text string.
plane: Plane of text.
height: Height of text.
fontName: Name of FontFace.
bold: Bold flag.
italic: Italic flag.
justification: The justification of the text.
attributes: Attributes to link to the object.
Returns: The Guid of the newly added object or Guid.Empty on failure.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddText(System.String,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean,Rhino.DocObjects.ObjectAttributes)
Adds an annotation text object to the document.
text: Text string.
plane: Plane of text.
height: Height of text.
fontName: Name of FontFace.
bold: Bold flag.
italic: Italic flag.
attributes: Object Attributes.
Returns: The Guid of the newly added object or Guid.Empty on failure.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddSurface(Rhino.Geometry.Surface)
Adds a surface object to Rhino.
surface: A duplicate of this surface is added to Rhino.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddSurface(Rhino.Geometry.Surface,Rhino.DocObjects.ObjectAttributes)
Adds a surface object to Rhino.
surface: A duplicate of this surface is added to Rhino.
attributes: Attributes to link to the object.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddExtrusion(Rhino.Geometry.Extrusion)
Adds an extrusion object to Rhino.
extrusion: A duplicate of this extrusion is added to Rhino.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddExtrusion(Rhino.Geometry.Extrusion,Rhino.DocObjects.ObjectAttributes)
Adds an extrusion object to Rhino.
extrusion: A duplicate of this extrusion is added to Rhino.
attributes: Attributes to link to the object.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddMesh(Rhino.Geometry.Mesh)
Adds a mesh object to Rhino.
mesh: A duplicate of this mesh is added to Rhino.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddMesh(Rhino.Geometry.Mesh,Rhino.DocObjects.ObjectAttributes)
Adds a mesh object to Rhino.
mesh: A duplicate of this mesh is added to Rhino.
attributes: Attributes to link to the object.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddBrep(Rhino.Geometry.Brep)
Adds a brep object to Rhino.
brep: A duplicate of this brep is added to Rhino.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddBrep(Rhino.Geometry.Brep,Rhino.DocObjects.ObjectAttributes)
Adds a brep object to Rhino.
brep: A duplicate of this brep is added to Rhino.
attributes: Attributes to apply to brep.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddLeader(Rhino.Geometry.Plane,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d})
Adds an annotation leader to the document.
plane: A plane.
points: A list, an array or any enumerable set of 2d points.
Returns: A unique identifier for the object; or System.Guid.Empty on failure.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddLeader(Rhino.Geometry.Plane,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d},Rhino.DocObjects.ObjectAttributes)
Adds an annotation leader to the document.
plane: A plane.
points: A list, an array or any enumerable set of 2d points.
attributes: Attributes to apply to brep.
Returns: A unique identifier for the object; or System.Guid.Empty on failure.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddLeader(System.String,Rhino.Geometry.Plane,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d},Rhino.DocObjects.ObjectAttributes)
Adds an annotation leader to the document.
text: The text.
plane: A plane.
points: A list, an array or any enumerable set of 2d points.
attributes: Attributes to apply to brep.
Returns: A unique identifier for the object; or System.Guid.Empty on failure.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddLeader(System.String,Rhino.Geometry.Plane,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d})
Adds an annotation leader to the document.
text: The text.
plane: A plane.
points: A list, an array or any enumerable set of 2d points.
Returns: A unique identifier for the object; or System.Guid.Empty on failure.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddLeader(System.String,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Adds an annotation leader to the document. This overload is only provided in the Rhino SDK.
text: The text.
points: A list, an array or any enumerable set of 2d points.
Returns: A unique identifier for the object; or System.Guid.Empty on failure.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddLeader(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Adds an annotation leader to the document. This overload is only provided in the Rhino SDK.
points: A list, an array or any enumerable set of 2d points.
Returns: A unique identifier for the object; or System.Guid.Empty on failure.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddHatch(Rhino.Geometry.Hatch)
Adds a hatch to the document.
hatch: A hatch.
Returns: A unique identifier for the hatch, or System.Guid.Empty on failure.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddHatch(Rhino.Geometry.Hatch,Rhino.DocObjects.ObjectAttributes)
Adds a hatch to the document.
hatch: A hatch.
attributes: Attributes to apply
Returns: A unique identifier for the hatch, or System.Guid.Empty on failure.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.AddSubD(Rhino.Geometry.SubD)
Adds a SubD to the document
subd: the Subd to add
Returns: A unique identifier for the SubD, or System.Guid.Empty on failure
Since: 7.1

Rhino.FileIO.File3dmObjectTable.AddSubD(Rhino.Geometry.SubD,Rhino.DocObjects.ObjectAttributes)
Adds a SubD to the document
subd: the Subd to add
attributes: Attributes to apply
Returns: A unique identifier for the SubD, or System.Guid.Empty on failure
Since: 7.1

Rhino.FileIO.File3dmObjectTable.Delete(System.Guid)
Deletes object from document.
objectId: Id of the object to delete.
Returns: true on success, false on failure.
Since: 5.2

Rhino.FileIO.File3dmObjectTable.Delete(System.Collections.Generic.IEnumerable{System.Guid})
Deletes a collection of objects from the document.
objectIds: Ids of all objects to delete.
Returns: The number of successfully deleted objects.
Since: 5.2

Rhino.FileIO.File3dmObjectTable.Count
Returns the total amount of items in the object table, including lights.
Since: 5.0

Rhino.FileIO.File3dmObjectTable.GetEnumerator
Returns an enumerator that yields all objects in this document.
Like in Rhino, this includes lights. Unlike in Rhino, however, all lights are returned in the end of the list.
Returns: An enumerator that yields all objects in a document.
Since: 5.0