Rhino.DocObjects.OrdinateDimensionObject
Rhino Object that represents an ordinate dimension geometry and attributes

Rhino.DocObjects.OrdinateDimensionObject.OrdinateDimensionGeometry
Get the dimension geometry for this object.
Since: 6.0