Rhino.Geometry.Intersect.LineCircleIntersection
Represents all possible cases of a Line|Circle intersection event.
Since: 5.0

Rhino.Geometry.Intersect.LineCircleIntersection.None
No intersections.

Rhino.Geometry.Intersect.LineCircleIntersection.Single
One intersection.

Rhino.Geometry.Intersect.LineCircleIntersection.Multiple
Two intersections.