Rhino.Geometry.SubD
Subdivision surface

Rhino.Geometry.SubD.NonConstOperation
Destroy cache handle

Rhino.Geometry.SubD.#ctor
Create a new instance of SubD geometry
Since: 7.0

Rhino.Geometry.SubD.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor used in serialization.

Rhino.Geometry.SubD.OnSwitchToNonConst
Called when this object switches from being considered "owned by the document"
to being an independent instance.

Rhino.Geometry.SubD.DuplicateEdgeCurves
Gets Nurbs form of all edges in this SubD, with clamped knots.
NB: Does not update the SubD evaluation cache before getting the edges.
Returns: An array of edge curves.
Rhino.Geometry.SubD.UpdateSurfaceMeshCache(System.Boolean)
Since: 8.7

Rhino.Geometry.SubD.DuplicateEdgeCurves(System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Gets Nurbs form of edges in this SubD.
NB: Does not update the SubD evaluation cache before getting the edges.
boundaryOnly:
If true, then only the boundary edges are duplicated.
If false, then all edges are duplicated.
If both boundaryOnly and interiorOnly are true, an empty array is returned.
interiorOnly:
If true, then only the interior edges are duplicated.
If false, then all edges are duplicated.
Note: interior edges with faces of different orientations are also returned.
If both boundaryOnly and interiorOnly are true, an empty array is returned.
smoothOnly:
If true, then only the smooth (and not sharp) edges are duplicated.
If false, then all edges are duplicated.
If both smoothOnly and sharpOnly and creaseOnly are true, an empty array is returned.
sharpOnly:
If true, then only the sharp edges are duplicated.
If false, then all edges are duplicated.
If both smoothOnly and sharpOnly and creaseOnly are true, an empty array is returned.
creaseOnly:
If true, then only the creased edges are duplicated.
If false, then all edges are duplicated.
If both smoothOnly and sharpOnly and creaseOnly are true, an empty array is returned.
clampEnds:
If true, the end knots are clamped.
Otherwise the end knots are(-2,-1,0,...., k1, k1+1, k1+2).
Returns: Array of edge curves on success.
Rhino.Geometry.SubD.UpdateSurfaceMeshCache(System.Boolean)
Since: 8.7

Rhino.Geometry.SubD.TransformComponents(System.Collections.Generic.IEnumerable{Rhino.Geometry.ComponentIndex},Rhino.Geometry.Transform,Rhino.Geometry.SubDComponentLocation)
Transforms an enumerable of SubD components.
components: The SubD components to transform.
xform: The transformation to apply.
componentLocation:
Select between applying the transform to the control net (faster) or the surface points (slower).
Returns: The number of vertex locations that changed.
Remarks:
This method does not clear the evaluation cache.
Since: 8.12

Rhino.Geometry.SubD.Dispose(System.Boolean)
Deletes the underlying native pointer during a Dispose call or GC collection
disposing:

Rhino.Geometry.SubD.Faces
All faces in this SubD
Since: 7.0

Rhino.Geometry.SubD.Vertices
All vertices in this SubD
Since: 7.0

Rhino.Geometry.SubD.Edges
All edges in this SubD
Since: 7.0

Rhino.Geometry.SubD.IsSolid
Test SubD to see if the active level is a solid.
A "solid" is a closed oriented manifold, or a closed oriented manifold.
Since: 7.0

Rhino.Geometry.SubD.TextureCoordinateType
Gets the texture cordinate type.
Since: 8.28

Rhino.Geometry.SubD.Empty
Get a new, empty SubD object.
Since: 7.18

Rhino.Geometry.SubD.Flip
Reverses the orientation of all SubD normals.
Returns: True if successful.
Since: 8.7

Rhino.Geometry.SubD.JoinSubDs(System.Collections.Generic.IEnumerable{Rhino.Geometry.SubD},System.Double,System.Boolean)
Joins an enumeration of SubDs to form as few as possible resulting SubDs.
There may be more than one SubD in the result array.
subdsToJoin: An enumeration of SubDs to join.
tolerance: The join tolerance.
joinedEdgesAreCreases:
If true, merged boundary edges will be creases.
If false, merged boundary edges will be smooth.
Returns:
Remarks:
NOTE: All of the input SubDs are copied and added to the result array in one form or another.
NOTE: Symmetry information is removed from newly joined SubDs.See also comments in
SubD.JoinSubDs with the bPreserveSymmetry parameter.
Since: 7.14

Rhino.Geometry.SubD.JoinSubDs(System.Collections.Generic.IEnumerable{Rhino.Geometry.SubD},System.Double,System.Boolean,System.Boolean)
Joins an enumeration of SubDs to form as few as possible resulting SubDs.
There may be more than one SubD in the result array.
subdsToJoin: An enumeration of SubDs to join.
tolerance: The join tolerance.
joinedEdgesAreCreases:
If true, merged boundary edges will be creases.
If false, merged boundary edges will be smooth.
preserveSymmetry:
If true, and if all inputs share the same symmetry, the output will also be symmetrical wrt. that symmetry.
If false, or true but no common symmetry exists, symmetry information is removed from all newly joined SubDs.
Returns:
Remarks:
NOTE: All of the input SubDs are copied and added to the result array in one form or another.
Since: 7.16

Rhino.Geometry.SubD.ToBrep(Rhino.Geometry.SubDToBrepOptions)
Create a Brep based on this SubD geometry.
options:
The SubD to Brep conversion options. Use SubDToBrepOptions.Default
for sensible defaults. Currently, these return unpacked faces
and locally-G1 vertices in the output Brep.
Returns: A new Brep if successful, or null on failure.
Since: 7.0

Rhino.Geometry.SubD.ToBrep
Create a Brep based on this SubD geometry, based on SubDToBrepOptions.Default options.
Returns: A new Brep if successful, or null on failure.
Since: 7.6

Rhino.Geometry.SubD.CreateFromMesh(Rhino.Geometry.Mesh)
Create a new SubD from a mesh.
mesh: The input mesh.
Returns: A new SubD if successful, or null on failure.
Since: 7.0

Rhino.Geometry.SubD.CreateFromMesh(Rhino.Geometry.Mesh,Rhino.Geometry.SubDCreationOptions)
Create a new SubD from a mesh.
mesh: The input mesh.
options: The SubD creation options.
Returns: A new SubD if successful, or null on failure.
Since: 7.0

Rhino.Geometry.SubD.CreateFromSurface(Rhino.Geometry.Surface,Rhino.Geometry.SubDFromSurfaceMethods,System.Boolean)
Create a SubD that approximates the surface. If the surface is a SubD
friendly NURBS surface and withCorners is true, then the SubD and input
surface will have the same geometry.
surface:
method: Selects the method used to calculate the SubD.
corners:
If the surface is open, then the corner vertices with be tagged as
VertexTagCorner. This makes the resulting SubD have sharp corners to
match the appearance of the input surface.
Returns:
Since: 7.9

Rhino.Geometry.SubD.CreateQuadSphere(Rhino.Geometry.Sphere,Rhino.Geometry.SubDComponentLocation,System.UInt32)
Creates a SubD sphere made from quad faces.
sphere: Location, size and orientation of the sphere.
vertexLocation:
If vertexLocation = SubDComponentLocation::ControlNet,
then the control net points will be on the surface of the sphere.
Otherwise the limit surface points will be on the sphere.
quadSubdivisionLevel:
The resulting sphere will have 6*4^subdivision level quads.
(0 for 6 quads, 1 for 24 quads, 2 for 96 quads, ...).
Returns:
If the input parameters are valid, a SubD quad sphere is returned. Otherwise null is returned.
Since: 8.4

Rhino.Geometry.SubD.CreateGlobeSphere(Rhino.Geometry.Sphere,Rhino.Geometry.SubDComponentLocation,System.UInt32,System.UInt32)
Creates a SubD sphere made from polar triangle fans and bands of quads.
The result resembles a globe with triangle fans at the poles and the
edges forming latitude parallels and longitude meridians.
sphere: Location, size and orientation of the sphere.
vertexLocation:
If vertexLocation = SubDComponentLocation::ControlNet,
then the control net points will be on the surface of the sphere.
Otherwise the limit surface points will be on the sphere.
axialFaceCount:
Number of faces along the sphere's meridians. (axialFaceCount >= 2)
For example, if you wanted each face to span 30 degrees of latitude,
you would pass 6 (=180 degrees/30 degrees) for axialFaceCount.
equatorialFaceCount:
Number of faces around the sphere's parallels. (equatorialFaceCount >= 3)
For example, if you wanted each face to span 30 degrees of longitude,
you would pass 12 (=360 degrees/30 degrees) for equatorialFaceCount.
Returns:
If the input parameters are valid, a SubD globe sphere is returned. Otherwise null is returned.
Since: 8.4

Rhino.Geometry.SubD.CreateTriSphere(Rhino.Geometry.Sphere,Rhino.Geometry.SubDComponentLocation,System.UInt32)
Creates a SubD sphere made from triangular faces.
This is a goofy topology for a Catmull-Clark subdivision surface
(all triangles and all vertices have 5 or 6 edges).
You may want to consider using the much behaved result from
CreateSubDQuadSphere() or even the result from CreateSubDGlobeSphere().
sphere: Location, size and orientation of the sphere.
vertexLocation:
If vertexLocation = SubDComponentLocation::ControlNet,
then the control net points will be on the surface of the sphere.
Otherwise the limit surface points will be on the sphere.
triSubdivisionLevel:
The resulting sphere will have 20*4^subdivision level triangles.
(0 for 20 triangles, 1 for 80 triangles, 2 for 320 triangles, ...).
Returns:
If the input parameters are valid, a SubD tri sphere is returned. Otherwise null is returned.
Since: 8.4

Rhino.Geometry.SubD.CreateIcosahedron(Rhino.Geometry.Sphere,Rhino.Geometry.SubDComponentLocation)
Creates a SubD sphere based on an icosohedron (20 triangular faces and 5 valent vertices).
This is a goofy topology for a Catmull-Clark subdivision surface
(all triangles, all vertices have 5 edges).
You may want to consider using the much behaved result from
CreateSubDQuadSphere(sphere, vertexLocation, 1)
or even the result from CreateSubDGlobeSphere().
sphere: Location, size and orientation of the sphere.
vertexLocation:
If vertexLocation = SubDComponentLocation::ControlNet,
then the control net points will be on the surface of the sphere.
Otherwise the limit surface points will be on the sphere.
Returns:
If the input parameters are valid, a SubD icosahedron is returned. Otherwise null is returned.
Since: 8.4

Rhino.Geometry.SubD.DeleteComponents(System.Collections.Generic.IEnumerable{Rhino.Geometry.SubDComponent},System.Boolean)
Deletes components from this SubD.
Deleting a vertex deletes every edge and face attached to it. Deleting an edge
deletes every face attached to it. Deleting a face deletes only that face.
components: The components to delete.
markDeletedFaceEdges:
If true, edges that survive the deletion of a face they bounded get their runtime
mark set, so the caller can find the boundary of the hole that was opened.
Returns: True if the deletion succeeded.
Since: 8.36

Rhino.Geometry.SubD.DeleteComponents(System.Collections.Generic.IEnumerable{Rhino.Geometry.SubDComponent})
Deletes components from this SubD, leaving the edges that bounded any deleted face
unmarked. See
Rhino.Geometry.SubD.DeleteComponents(System.Collections.Generic.IEnumerable{Rhino.Geometry.SubDComponent},System.Boolean).
components: The components to delete.
Returns: True if the deletion succeeded.
Since: 8.36

Rhino.Geometry.SubD.DeleteComponents(System.Collections.Generic.IEnumerable{Rhino.Geometry.ComponentIndex},System.Boolean)
Deletes components from this SubD, identified by component index.
componentIndices: The component indices to delete.
markDeletedFaceEdges:
If true, edges that survive the deletion of a face they bounded get their runtime
mark set.
Returns: True if the deletion succeeded.
Since: 8.36

Rhino.Geometry.SubD.DissolveOrDeleteComponents(System.Collections.Generic.IEnumerable{Rhino.Geometry.SubDComponent})
Dissolves the given edges and vertices, merging the faces around them, and deletes
the given faces.
This is the difference between removing an edge between two quads to get one bigger
face, and removing the two quads to leave a hole. Use
Rhino.Geometry.SubD.DeleteComponents(System.Collections.Generic.IEnumerable{Rhino.Geometry.SubDComponent},System.Boolean) when a hole is what
you want.
components: The vertices, edges and faces to dissolve or delete.
Returns: The number of merged faces created by dissolving edges and vertices.
Since: 8.36

Rhino.Geometry.SubD.DissolveOrDeleteComponents(System.Collections.Generic.IEnumerable{Rhino.Geometry.ComponentIndex})
Dissolves or deletes components, identified by component index.
See Rhino.Geometry.SubD.DissolveOrDeleteComponents(System.Collections.Generic.IEnumerable{Rhino.Geometry.SubDComponent}).
componentIndices: The component indices to dissolve or delete.
Returns: The number of merged faces created by dissolving edges and vertices.
Since: 8.36

Rhino.Geometry.SubD.CreateSubDBox(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Double,System.UInt32,System.UInt32,System.UInt32)
Creates a SubD box.
corners:
The eight box corners. The first four are the bottom face, in order around it, and
the last four are the top face, in the same order.
edgeSharpness:
The sharpness to give the edges where box sides meet.
Rhino.Geometry.SubDEdgeSharpness.SmoothValue leaves them smooth and
Rhino.Geometry.SubDEdgeSharpness.CreaseValue makes them creases.
faceCountX: Number of faces along the first bottom edge.
faceCountY: Number of faces along the second bottom edge.
faceCountZ: Number of faces from the bottom face to the top face.
Returns: A new SubD box, or null if the input is not valid.
Since: 8.36

Rhino.Geometry.SubD.CreateSubDBox(Rhino.Geometry.Box,System.Double,System.UInt32,System.UInt32,System.UInt32)
Creates a SubD box from a Rhino.Geometry.Box.
box: The box to build from. It must be valid.
edgeSharpness:
The sharpness to give the edges where box sides meet. See
Rhino.Geometry.SubD.CreateSubDBox(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Double,System.UInt32,System.UInt32,System.UInt32).
faceCountX: Number of faces in the box X direction.
faceCountY: Number of faces in the box Y direction.
faceCountZ: Number of faces in the box Z direction.
Returns: A new SubD box, or null if the input is not valid.
Since: 8.36

Rhino.Geometry.SubD.ErrorCount
The number of errors the SubD code has trapped since the process started.
This is a diagnostic counter, not a per-SubD property. Sample it before and after an
operation to find out whether that operation hit an internal error, which usually
means the SubD is not valid.
Since: 8.36

Rhino.Geometry.SubD.SharpEdgeCount
Gets the number of sharp edges in this SubD.
See Rhino.Geometry.SubDEdge.IsSharp for what makes an edge sharp.
Returns: The number of sharp edges.
Since: 8.36

Rhino.Geometry.SubD.SharpEdgeCount(Rhino.Geometry.SubDEdgeSharpness@)
Gets the number of sharp edges in this SubD, and the range of sharpness values used.
sharpnessRange:
The smallest and largest sharpness found on the sharp edges. If there are no sharp
edges, this is Rhino.Geometry.SubDEdgeSharpness.Smooth.
Returns: The number of sharp edges.
Since: 8.36

Rhino.Geometry.SubD.ClearEdgeSharpness
Converts every sharp edge in this SubD to a smooth edge.
Returns: The number of edges that were changed.
Since: 8.36

Rhino.Geometry.SubD.SetEdgeSharpness(System.Collections.Generic.IEnumerable{Rhino.Geometry.SubDEdge},Rhino.Geometry.SubDEdgeSharpness,System.Boolean)
Sets the sharpness of a list of edges.
edges: The edges to change.
sharpness:
The sharpness to apply to every edge in the list. Pass
Rhino.Geometry.SubDEdgeSharpness.Smooth to make the edges smooth again.
preserveSymmetry:
If true and this SubD has symmetric content, the change tries to keep it symmetric.
Returns: The number of edges that were changed.
Since: 8.36

Rhino.Geometry.SubD.SetEdgeSharpness(System.Collections.Generic.IEnumerable{Rhino.Geometry.SubDEdge},System.Collections.Generic.IEnumerable{Rhino.Geometry.SubDEdgeSharpness},System.Boolean)
Sets the sharpness of a list of edges, one sharpness per edge.
Use this with Rhino.Geometry.SubDEdgeSharpness.CreateEdgeChainSharpness(Rhino.Geometry.Interval,System.Int32)
to give a chain of edges a sharpness that varies evenly along it.
edges: The edges to change.
sharpnesses:
One sharpness per edge, in the same order as edges. Must be the same length.
preserveSymmetry:
If true and this SubD has symmetric content, the change tries to keep it symmetric.
Returns: The number of edges that were changed.
Since: 8.36

Rhino.Geometry.SubD.SetEdgeSharpness(System.Collections.Generic.IEnumerable{System.Int32},Rhino.Geometry.SubDEdgeSharpness,System.Boolean)
Sets the sharpness of a list of edges, identified by their ids.
edgeIds: The ids of the edges to change.
sharpness:
The sharpness to apply to every edge in the list. Pass
Rhino.Geometry.SubDEdgeSharpness.Smooth to make the edges smooth again.
preserveSymmetry:
If true and this SubD has symmetric content, the change tries to keep it symmetric.
Returns: The number of edges that were changed.
Since: 8.36

Rhino.Geometry.SubD.PackFaces
Resets the SubD to the default face packing if adding creases or deleting faces breaks the quad grids.
It does not change the topology or geometry of the SubD. SubD face packs always stop at creases.
Returns: The number of face packs.
Since: 7.23

Rhino.Geometry.SubD.Offset(System.Double,System.Boolean)
Makes a new SubD with vertices offset at distance in the direction of the control net vertex normals.
Optionally, based on the value of solidify, adds the input SubD and a ribbon of faces along any naked edges.
distance: The distance to offset.
solidify: true if the output SubD should be turned into a closed SubD.
Returns: A new SubD if successful, or null on failure.
Since: 7.0

Rhino.Geometry.SubD.CreateFromLoft(System.Collections.Generic.IEnumerable{Rhino.Geometry.NurbsCurve},System.Boolean,System.Boolean,System.Boolean,System.Int32)
Creates a SubD lofted through shape curves.
curves: An enumeration of SubD-friendly NURBS curves to loft through.
closed: Creates a SubD that is closed in the lofting direction. Must have three or more shape curves.
addCorners: With open curves, adds creased vertices to the SubD at both ends of the first and last curves.
addCreases: With kinked curves, adds creased edges to the SubD along the kinks.
divisions: The segment number between adjacent input curves.
Returns: A new SubD if successful, or null on failure.
Remarks:
Shape curves must be in the proper order and orientation and have point counts for the desired surface.
Shape curves must be either all open or all closed.
Since: 7.0

Rhino.Geometry.SubD.CreateFromSweep(Rhino.Geometry.NurbsCurve,System.Collections.Generic.IEnumerable{Rhino.Geometry.NurbsCurve},System.Boolean,System.Boolean,System.Boolean,Rhino.Geometry.Vector3d)
Fits a SubD through a series of profile curves that define the SubD cross-sections and one curve that defines a SubD edge.
rail1: A SubD-friendly NURBS curve to sweep along.
shapes: An enumeration of SubD-friendly NURBS curves to sweep through.
closed: Creates a SubD that is closed in the rail curve direction.
addCorners: With open curves, adds creased vertices to the SubD at both ends of the first and last curves.
roadlikeFrame:
Determines how sweep frame rotations are calculated.
If false (Freeform), frame are propagated based on a reference direction taken from the rail curve curvature direction.
If true (Roadlike), frame rotations are calculated based on a vector supplied in "roadlikeNormal" and the world coordinate system.
roadlikeNormal:
If roadlikeFrame = true, provide 3D vector used to calculate the frame rotations for sweep shapes.
If roadlikeFrame = false, then pass Rhino.Geometry.Vector3d.Unset.
Returns: A new SubD if successful, or null on failure.
Remarks:
Shape curves must be in the proper order and orientation.
Shape curves must have the same point counts and rail curves must have the same point counts.
Shape curves will relocated to the nearest pair of Greville points on the rails.
Shape curves will be made at each pair of rail edit points where there isn't an input shape.
Since: 7.0

Rhino.Geometry.SubD.CreateFromSweep(Rhino.Geometry.NurbsCurve,Rhino.Geometry.NurbsCurve,System.Collections.Generic.IEnumerable{Rhino.Geometry.NurbsCurve},System.Boolean,System.Boolean)
Fits a SubD through a series of profile curves that define the SubD cross-sections and two curves that defines SubD edges.
rail1: The first SubD-friendly NURBS curve to sweep along.
rail2: The second SubD-friendly NURBS curve to sweep along.
shapes: An enumeration of SubD-friendly NURBS curves to sweep through.
closed: Creates a SubD that is closed in the rail curve direction.
addCorners: With open curves, adds creased vertices to the SubD at both ends of the first and last curves.
Returns: A new SubD if successful, or null on failure.
Remarks:
Shape curves must be in the proper order and orientation.
Shape curves must have the same point counts and rail curves must have the same point counts.
Shape curves will relocated to the nearest pair of Greville points on the rails.
Shape curves will be made at each pair of rail edit points where there isn't an input shape.
Since: 7.0

Rhino.Geometry.SubD.MergeAllCoplanarFaces(System.Double)
Merges adjacent coplanar faces into single faces.
tolerance:
Tolerance for determining when edges are adjacent.
When in doubt, use the document's ModelAbsoluteTolerance property.
Returns: true if faces were merged, false if no faces were merged.
Since: 7.9

Rhino.Geometry.SubD.MergeAllCoplanarFaces(System.Double,System.Double)
Merges adjacent coplanar faces into single faces.
tolerance:
Tolerance for determining when edges are adjacent.
When in doubt, use the document's ModelAbsoluteTolerance property.
angleTolerance:
Angle tolerance, in radians, for determining when faces are parallel.
When in doubt, use the document's ModelAngleToleranceRadians property.
Returns: true if faces were merged, false if no faces were merged.
Since: 7.9

Rhino.Geometry.SubD.CreateFromCylinder(Rhino.Geometry.Cylinder,System.UInt32,System.UInt32,Rhino.Geometry.SubDEndCapStyle,Rhino.Geometry.SubDEdgeTag,Rhino.Geometry.SubDComponentLocation)
Creates a SubD form of a cylinder.
cylinder: The defining cylinder.
circumferenceFaceCount: Number of faces around the cylinder.
heightFaceCount: Number of faces in the top-to-bottom direction.
endCapStyle: The end cap style.
endCapEdgeTag: The end cap edge tag.
radiusLocation: The SubD component location.
Returns: A new SubD if successful, or null on failure.
Since: 7.6

Rhino.Geometry.SubD.ClearEvaluationCache
Clear all cached evaluation information (meshes, surface points, bounding boxes, ...)
that depends on edge tags, vertex tags, and the location of vertex control points.
Rhino.Geometry.SubD.CopyEvaluationCache(Rhino.Geometry.SubD@)
Rhino.Geometry.SubD.UpdateSurfaceMeshCache(System.Boolean)
Since: 7.0

Rhino.Geometry.SubD.CopyEvaluationCache(Rhino.Geometry.SubD@)
Expert function that copies cached evaluations of component subdivision points and
limit surface information from src to this. Typically this is done for performance
critical situations like control point editing:
- Copy a SubD to be modified (this does not copy the evaluation cache)
- Copy the evaluation cache from the unmodified SubD
- Modify the SubD copy
- Update the surface mesh cache so that only the modified parts are recalculated
- Display, meshing, bounding boxes on the modified SubD are now available
src: The SubD from which to copy cached evaluations
Returns: True if the cache was fully copied, false otherwise
Rhino.Geometry.SubD.ClearEvaluationCache
Rhino.Geometry.SubD.UpdateSurfaceMeshCache(System.Boolean)
Since: 8.8

Rhino.Geometry.SubD.UpdateSurfaceMeshCache(System.Boolean)
Updates limit surface information returned by
- Rhino.Geometry.SubDVertex.SurfacePoint,
- Rhino.Geometry.SubDEdge.ToNurbsCurve(System.Boolean), and
- Rhino.Geometry.Mesh.CreateFromSubD(Rhino.Geometry.SubD,System.Int32).
The density of the mesh cache is Rhino.Geometry.SubDDisplayParameters.Default.
lazyUpdate:
If false, all information is updated.
If true, only missing information is updated. If a relatively small subset
of a SubD has been modified and care was taken to mark cached subdivision
information as stale, then passing true can substantially improve performance.
Returns: The number of elements that were updated.
Rhino.Geometry.SubD.ClearEvaluationCache
Rhino.Geometry.SubD.CopyEvaluationCache(Rhino.Geometry.SubD@)
Since: 8.7

Rhino.Geometry.SubD.SurfaceMeshCacheExists(System.Boolean,System.Boolean,System.Boolean)
Checks that a surface mesh evaluation cache exists, and that it has the required options.
This cache is used by
- Rhino.Geometry.SubDVertex.SurfacePoint,
- Rhino.Geometry.SubDEdge.ToNurbsCurve(System.Boolean), and
- Rhino.Geometry.Mesh.CreateFromSubD(Rhino.Geometry.SubD,System.Int32).
bTextureCoordinatesExist: If True, the cache must contain texture coordinates information.
bCurvaturesExist: If True, the cache must contain curvature information.
bColorsExist: If True, the cache must contain color information.
Returns: True if the cache exists on all face fragments and has the required options.
Remarks: This does not check that the cache is up to date, Rhino.Geometry.SubD.UpdateSurfaceMeshCache(System.Boolean).
Rhino.Geometry.SubD.ClearEvaluationCache
Rhino.Geometry.SubD.CopyEvaluationCache(Rhino.Geometry.SubD@)
Since: 8.9

Rhino.Geometry.SubD.ComponentFromComponentIndex(Rhino.Geometry.ComponentIndex)
Returns a SubDComponent, either a SubDEdge, SubDFace, or SubDVertex, from a component index.
componentIndex: The component index.
Returns: The SubDComponent if successful, null otherwise.
Since: 7.6

Rhino.Geometry.SubD.UpdateAllTagsAndSectorCoefficients
Updates vertex tag, edge tag, and edge coefficient values on the active
level. After completing custom editing operations that modify the
topology of the SubD control net or changing values of vertex or edge
tags, the tag and sector coefficients information on nearby components
in the edited areas need to be updated.
Returns:
Number of vertices and edges that were changed during the update.
Since: 7.0

Rhino.Geometry.SubD.Subdivide
Apply the Catmull-Clark subdivision algorithm and save the results in this SubD.
Returns: true on success
Since: 8.0

Rhino.Geometry.SubD.Subdivide(System.Int32)
Apply the Catmull-Clark subdivision algorithm and save the results in this SubD.
count: Number of times to subdivide (must be greater than 0)
Returns: true on success
Since: 7.0

Rhino.Geometry.SubD.Subdivide(System.Collections.Generic.IEnumerable{System.Int32})
Apply the Catmull-Clark subdivision algorithm and save the results in this SubD.
faceIndices: Indices of the faces to subdivide.
Returns: true on success
Since: 8.0

Rhino.Geometry.SubD.InterpolateSurfacePoints(Rhino.Geometry.Point3d[])
Modifies the SubD so that the SubD vertex limit surface points are
equal to surface_points[]
surfacePoints:
Points for limit surface to interpolate. surface_points[i] is the
location for the i-th vertex returned by SubVertexIterator vit(this)
Returns: True on success
Rhino.Geometry.SubD.SetVertexSurfacePoint(System.UInt32,Rhino.Geometry.Point3d)
Rhino.Geometry.SubDVertex.SurfacePoint
Rhino.Geometry.SubDSurfaceInterpolator
Since: 7.1

Rhino.Geometry.SubD.InterpolateSurfacePoints(System.UInt32[],Rhino.Geometry.Point3d[])
Modifies the SubD so that the SubD vertex limit surface points of the listed vertices are
equal to surface_points[].
vertexIndices:
Ids of the vertices to interpolate. Other vertices remain fixed.
surfacePoints:
Points for limit surface to interpolate. surface_points[i] is the
location for the vertex returned by this.Vertices.Find(vertexIndices[i]).
Returns: True on success
Rhino.Geometry.SubD.SetVertexSurfacePoint(System.UInt32,Rhino.Geometry.Point3d)
Rhino.Geometry.SubDVertex.SurfacePoint
Rhino.Geometry.SubDSurfaceInterpolator
Since: 8.0

Rhino.Geometry.SubD.SetVertexSurfacePoint(System.UInt32,Rhino.Geometry.Point3d)
Set the location of a single vertex surface point.
This function is not suitable for setting the locations of multiple vertex surface points that are topologically near to each other.
vertexIndex:
Index of the vertex to modify
surfacePoint:
New surface point location for that vertex
Returns:
True if a vertex was modified, false otherwise.
Rhino.Geometry.SubD.InterpolateSurfacePoints(Rhino.Geometry.Point3d[])
Rhino.Geometry.SubD.InterpolateSurfacePoints(System.UInt32[],Rhino.Geometry.Point3d[])
Rhino.Geometry.SubDVertex.SurfacePoint
Rhino.Geometry.SubDSurfaceInterpolator
Since: 8.0