Rhino.Geometry.PlaneSurface
Represents a plane surface.

Rhino.Geometry.PlaneSurface.#ctor
Constructs a new plane surface.
Since: 8.0

Rhino.Geometry.PlaneSurface.#ctor(Rhino.Geometry.Plane)
Constructs a new plane surface.
plane: The plane.
Since: 8.1

Rhino.Geometry.PlaneSurface.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.Interval,Rhino.Geometry.Interval)
Constructs a plane surface with x and y extents.
plane: The plane.
xExtents: The increasing x interval of the plane that defines the rectangle.
The corresponding evaluation interval domain is set so that it matches the
extents interval.
yExtents: The increasing y interval of the plane that defines the rectangle.
The corresponding evaluation interval domain is set so that it matches the
extents interval.
Since: 5.0

Rhino.Geometry.PlaneSurface.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor for internal use.
info: Serialization data.
context: Serialization stream.

Rhino.Geometry.PlaneSurface.Plane
Gets or sets the plane surface's plane.
Since: 8.0

Rhino.Geometry.PlaneSurface.GetExtents(System.Int32)
Gets the extents of the plane surface.
direction:
The direction, where 0 gets plane surface's x coordinate extents
and 1 gets plane surface's y coordinate extents.
Returns: An increasing interval.
Since: 8.0

Rhino.Geometry.PlaneSurface.SetExtents(System.Int32,Rhino.Geometry.Interval,System.Boolean)
Sets the extents of the plane surface.
direction:
The direction, where 0 sets plane surface's x coordinate extents
and 1 sets plane surface's y coordinate extents.
extents: An increasing interval.
syncDomain:
If true, the corresponding evaluation interval domain is set so that it matches the extents interval.
If false, the corresponding evaluation interval domain is not changed.
Since: 8.0

Rhino.Geometry.PlaneSurface.ToMesh
Computes a polygon mesh of the surface made of one quad.
Returns: A polygon mesh of the surface.
Since: 8.0

Rhino.Geometry.PlaneSurface.CreateThroughBox(Rhino.Geometry.Line,Rhino.Geometry.Vector3d,Rhino.Geometry.BoundingBox)
Create a plane that contains the intersection of a bounding box.
lineInPlane: A line that will lie on the plane.
vectorInPlane: A vector the direction of which will be in plane.
box: A box to cut through.
Returns: A new plane surface on success, or null on error.
Since: 5.0

Rhino.Geometry.PlaneSurface.CreateThroughBox(Rhino.Geometry.Plane,Rhino.Geometry.BoundingBox)
Create a plane that contains the intersection of a bounding box.
plane: An original plane value.
box: A box to use for extension boundary.
Returns: A new plane surface on success, or null on error.
Since: 5.0