Rhino.Render.UICommands.UICommandOrigin
A UICommand origin represents the place in the UI where the user
clicked to invoke a menu or other UI that displays UICommands.

Rhino.Render.UICommands.UICommandOrigin.ParentWindow
Parent Window for dialogs.

Rhino.Render.UICommands.UICommandOrigin.CppPointer
CppPointer

Rhino.Render.UICommands.UICommandOrigin.#ctor(System.IntPtr,System.Boolean)
Constructor
pUICommandOrigin: IntPtr to UICommand origin
delete: Delete IntPtr

Rhino.Render.UICommands.UICommandOrigin.Control
The control type that was clicked on
Returns: The control type that was clicked on

Rhino.Render.UICommands.UICommandOrigin.Controller
The controller of the control that the user is interacting with.
Returns: pointer to the controller

Rhino.Render.UICommands.UICommandOrigin.GetSelectedCount
Gets the number of selected contents.
Returns: Returns the number of selected contents.

Rhino.Render.UICommands.UICommandOrigin.GetSelection
Get the contents that have been selected by the user.
Returns: Returns the selected contents

Rhino.Render.UICommands.UICommandOrigin.GetSelection(System.Boolean)
Get the contents that have been selected by the user.
ForModify: ForModify indicates if the operation is planning to modify the contents.
Returns: Returns the selected contents

Rhino.Render.UICommands.UICommandOrigin.SupportsUICommand(Rhino.Render.UICommands.UICommand)
Origins support for the UICommand.
Returns: True if the origin supports the execution of a particular UICommand.

Rhino.Render.UICommands.UICommandOrigin.IsAmbivalent
An origin is 'ambivalent' when it wants to show UICommand for both top-level and
child contents on the same menu.This is a special quirk of the spanner menu.
Returns: True if origin shows UICommands for both top level and child contents on the same menu

Rhino.Render.UICommands.UICommandOrigin.ReplacingSelection
UICommand can replace selection
Returns: True if UICommands can replace the selected content.

Rhino.Render.UICommands.UICommandOrigin.TopLevelKind
The kind of the top level content in the UI
Returns: The content kind e.g material, environment or texture for the top level content

Rhino.Render.UICommands.UICommandOrigin.AllowedKinds
Gets the allowed kinds for creating new contents.
Returns: Returns a list of the allowed kinds for creating new contents