Rhino.DocObjects.Tables.DimStyleTableEventType
Since: 6.0

Rhino.DocObjects.Tables.DimStyleTableEventType.Modified
name, color, etc., change

Rhino.DocObjects.Tables.DimStyleTableEventType.Sorted
doc.m_dimstyle_table.Sort() potentially changed sort order

Rhino.DocObjects.Tables.DimStyleTableEventType.Current
current dim style change