Rhino.Geometry.EdgeAdjacency
Enumerates all possible Topological Edge adjacency types.
Since: 5.0

Rhino.Geometry.EdgeAdjacency.None
Edge is not used by any faces and is therefore superfluous.

Rhino.Geometry.EdgeAdjacency.Naked
Edge is used by a single face.

Rhino.Geometry.EdgeAdjacency.Interior
Edge is used by two adjacent faces.

Rhino.Geometry.EdgeAdjacency.NonManifold
Edge is used by three or more adjacent faces.