Rhino.FileIO.File3dmInstanceDefinitionTable
Provides access to instance (block) definitions in the 3dm file.

Rhino.FileIO.File3dmInstanceDefinitionTable.ComponentType
Returns Rhino.DocObjects.ModelComponentType.InstanceDefinition.
Since: 6.0

Rhino.FileIO.File3dmInstanceDefinitionTable.FindName(System.String)
Finds an InstanceDefinitionGeometry given its name.
name: The name of the InstanceDefinitionGeometry to be searched.
Returns: An InstanceDefinitionGeometry, or null on error.
Since: 6.0

Rhino.FileIO.File3dmInstanceDefinitionTable.FindNameHash(Rhino.FileIO.NameHash)
Finds a InstanceDefinitionGeometry given its name hash.
nameHash: The name hash of the InstanceDefinitionGeometry to be searched.
Returns: An InstanceDefinitionGeometry, or null on error.
Since: 6.0

Rhino.FileIO.File3dmInstanceDefinitionTable.Add(System.String,System.String,System.String,System.String,Rhino.Geometry.Point3d,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjectAttributes})
Adds an instance definition to the instance definition table.
name: The definition name.
description: The definition description.
url: A URL or hyperlink.
urlTag: A description of the URL or hyperlink.
basePoint: A base point.
geometry: An array, a list or any enumerable set of geometry.
attributes: An array, a list or any enumerable set of attributes.
Returns:
>=0  index of instance definition in the instance definition table. -1 on failure.
Since: 7.0

Rhino.FileIO.File3dmInstanceDefinitionTable.Add(System.String,System.String,Rhino.Geometry.Point3d,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjectAttributes})
Adds an instance definition to the instance definition table.
name: The definition name.
description: The definition description.
basePoint: A base point.
geometry: An array, a list or any enumerable set of geometry.
attributes: An array, a list or any enumerable set of attributes.
Returns:
>=0  index of instance definition in the instance definition table. -1 on failure.
Since: 6.5

Rhino.FileIO.File3dmInstanceDefinitionTable.Add(System.String,System.String,Rhino.Geometry.Point3d,System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})
Adds an instance definition to the instance definition table.
name: The definition name.
description: The definition description.
basePoint: A base point.
geometry: An array, a list or any enumerable set of geometry.
Returns:
>=0  index of instance definition in the instance definition table. -1 on failure.
Since: 6.5

Rhino.FileIO.File3dmInstanceDefinitionTable.Add(System.String,System.String,Rhino.Geometry.Point3d,Rhino.Geometry.GeometryBase,Rhino.DocObjects.ObjectAttributes)
Adds an instance definition to the instance definition table.
name: The definition name.
description: The definition description.
basePoint: A base point.
geometry: An element.
attributes: An attribute.
Returns:
>=0  index of instance definition in the instance definition table. -1 on failure.
Since: 6.5

Rhino.FileIO.File3dmInstanceDefinitionTable.AddLinked(System.String,System.String,System.String)
Adds a linked instance definition to the instance definition table.
filename: Full path of the file to link.
name: The definition name.
description: The definition description.
Returns:
Since: 6.13