Rhino.FileIO.SHA1OpenNURBS
Provides the OpenNURBS implementation of SHA1.
This class is provided only with the purpose of hashing. It is not meant to be
used for any cryptographic purpose.

Rhino.FileIO.SHA1OpenNURBS.#ctor
Constructs a new instance of the SHA1 algorithm.
Since: 6.0

Rhino.FileIO.SHA1OpenNURBS.Initialize
Resets this instance of the algorithm, so that it can be used again.
It is not required to call this method after creation.
Since: 6.0

Rhino.FileIO.SHA1OpenNURBS.HashCore(System.Byte[],System.Int32,System.Int32)
Advances the hash by an input array.
array: The array.
start: The start of the data to consider in the array.
length: The used data length on the array.

Rhino.FileIO.SHA1OpenNURBS.HashFinal
Returns the currently computed hash.
Returns: The final hash.

Rhino.FileIO.SHA1OpenNURBS.Dispose(System.Boolean)
Reclaims unmanaged resources used by this instance, and invalidates
the instance. After calling this method, all other methods will always
call ObjectDisposedException.
disposing: true if the class user called Dispose.

Rhino.FileIO.SHA1OpenNURBS.Finalize
Instructs the runtime to reclaim unmanaged resources if the developer
forgot to call Dispose().

Rhino.FileIO.SHA1OpenNURBS.StringHash(System.String)
Computes the SHA1 hash of a string, converted to UTF8.
input:
Returns: A 20-byte long SHA1 hash.
Throws System.ArgumentNullException: When input is null.
Since: 6.0

Rhino.FileIO.SHA1OpenNURBS.FileSystemPathHash(System.String,System.Nullable{System.Boolean})
Computes the SHA1 hash of a file system path, converted to UTF8.
These file system paths have identical values of FileSystemPathHash():
/x/y/z/name.ext
\x\y\z\name.ext
/x//y//z/name.ext
/x/y/a/b/c/../../../z/name.ext
/X/Y/Z/NAME.EXT (When ignoreCase is true)
path: A non-null path string.
ignoreCase: If case should be ignored.
If this is null or unspecified, the operating system default is used.
Returns: A 20-byte long SHA1 hash.
Throws System.ArgumentNullException: When input is null.