Rhino.Render.DataSources.ContentFactory.CppPointer
Since: 6.1

Rhino.Render.DataSources.ContentFactory.#ctor(System.IntPtr)
Since: 6.1

Rhino.Render.DataSources.ContentFactory.Dispose
Since: 6.1

Rhino.Render.DataSources.ContentFactory.NewContent
New Content returns a new content, which is Initialized with the Initialize() function.
The content should be unitilized after use with the Unitialize function.
Returns:
Since: 6.1

Rhino.Render.DataSources.ContentFactory.Kind
Since: 6.3

Rhino.Render.DataSources.ContentFactory.ContentTypeId
Since: 6.7