Rhino.Geometry.TextJustification
Specifies enumerated constants used to indicate the internal alignment and justification of text.
Since: 5.0

Rhino.Geometry.TextJustification.None
The default justification.

Rhino.Geometry.TextJustification.Left
Left justification.

Rhino.Geometry.TextJustification.Center
Center justification.

Rhino.Geometry.TextJustification.Right
Right justification.

Rhino.Geometry.TextJustification.Bottom
Bottom inner alignment.

Rhino.Geometry.TextJustification.Middle
Middle inner alignment.

Rhino.Geometry.TextJustification.Top
Top inner alignment.

Rhino.Geometry.TextJustification.BottomLeft
Combination of left justification and bottom alignment.

Rhino.Geometry.TextJustification.BottomCenter
Combination of center justification and bottom alignment.

Rhino.Geometry.TextJustification.BottomRight
Combination of right justification and bottom alignment.

Rhino.Geometry.TextJustification.MiddleLeft
Combination of left justification and middle alignment.

Rhino.Geometry.TextJustification.MiddleCenter
Combination of center justification and middle alignment.

Rhino.Geometry.TextJustification.MiddleRight
Combination of right justification and middle alignment.

Rhino.Geometry.TextJustification.TopLeft
Combination of left justification and top alignment.

Rhino.Geometry.TextJustification.TopCenter
Combination of center justification and top alignment.

Rhino.Geometry.TextJustification.TopRight
Combination of right justification and top alignment.