Rhino.Render.CreatePreviewEventArgs
Used in RenderPlugIn virtual CreatePreview function

Rhino.Render.CreatePreviewEventArgs.PreviewNotifier
Since: 6.0

Rhino.Render.CreatePreviewEventArgs.SceneServerPtr
Access to the preview scene server pointer. Used by ChangeQueue when created from
CreatePreviewEventArgs

Rhino.Render.CreatePreviewEventArgs.SkipInitialisation
Call this if you don't want the argument to handle data initialisation.
This is for use with the ChangeQueue
Since: 6.0

Rhino.Render.CreatePreviewEventArgs.Reason
Reason the preview is getting generated
Since: 5.11

Rhino.Render.CreatePreviewEventArgs.PreviewContent
Obsolete, will return always null
Since: 5.1

Rhino.Render.CreatePreviewEventArgs.PreviewImageSize
Pixel size of the image that is being requested for the preview scene
Since: 5.1

Rhino.Render.CreatePreviewEventArgs.Quality
Quality of the preview image that is being requested for the preview scene
Since: 5.1

Rhino.Render.CreatePreviewEventArgs.PreviewImage
Initially null.  If this image is set, then this image will be used for
the preview.  If never set, the default internal simulation preview will
be used.
Since: 5.1

Rhino.Render.CreatePreviewEventArgs.Cancel
Get set by Rhino if the preview generation should be canceled for this
Since: 5.1

Rhino.Render.CreatePreviewEventArgs.Id
Unique Id for this scene.
Since: 5.1

Rhino.Render.CreatePreviewEventArgs.ContentKind
Description of content that preview is being generated for.
Since: 6.0

Rhino.Render.CreatePreviewEventArgs.ContentTypeId
The class Id of content that preview is being generated for.
Since: 6.0

Rhino.Render.CreatePreviewEventArgs.Environment
The environment that the previewed object is rendered in.
Since: 5.1

Rhino.Render.CreatePreviewEventArgs.Objects
Since: 5.1

Rhino.Render.CreatePreviewEventArgs.Lights
Since: 5.1

Rhino.Render.CreatePreviewEventArgs.Viewport
Since: 5.1