Rhino.UI.Gumball.GumballMode
Transformation modes for gumballs.
Since: 5.0

Rhino.UI.Gumball.GumballMode.Menu
Gumball menu button was picked.

Rhino.UI.Gumball.GumballMode.TranslateFree
Unconstrained translation.

Rhino.UI.Gumball.GumballMode.TranslateX
Translation along a single axis.

Rhino.UI.Gumball.GumballMode.TranslateY
Translation along a single axis.

Rhino.UI.Gumball.GumballMode.TranslateZ
Translation along a single axis.

Rhino.UI.Gumball.GumballMode.TranslateXY
Translation in a plane.

Rhino.UI.Gumball.GumballMode.TranslateYZ
Translation in a plane.

Rhino.UI.Gumball.GumballMode.TranslateZX
Translation in a plane.

Rhino.UI.Gumball.GumballMode.ScaleX
Scale along a single axis.

Rhino.UI.Gumball.GumballMode.ScaleY
Scale along a single axis.

Rhino.UI.Gumball.GumballMode.ScaleZ
Scale along a single axis.

Rhino.UI.Gumball.GumballMode.ScaleXY
Scale in a plane.

Rhino.UI.Gumball.GumballMode.ScaleYZ
Scale in a plane.

Rhino.UI.Gumball.GumballMode.ScaleZX
Scale in a plane.

Rhino.UI.Gumball.GumballMode.RotateX
Rotation around a single axis.

Rhino.UI.Gumball.GumballMode.RotateY
Rotation around a single axis.

Rhino.UI.Gumball.GumballMode.RotateZ
Rotation around a single axis.

Rhino.UI.Gumball.GumballMode.ExtrudeX
Extrusion along a single axis.

Rhino.UI.Gumball.GumballMode.ExtrudeY
Extrusion along a single axis.

Rhino.UI.Gumball.GumballMode.ExtrudeZ
Extrusion along a single axis.

Rhino.UI.Gumball.GumballMode.CutX
Cutting extrusion along the gumball X axis.

Rhino.UI.Gumball.GumballMode.CutY
Cutting extrusion along the gumball Y axis.

Rhino.UI.Gumball.GumballMode.CutZ
Cutting extrusion along the gumball Z axis.