Rhino.Display.ColorStop
Combination of a color and position. Used in defining gradient fills

Rhino.Display.ColorStop.#ctor(System.Drawing.Color,System.Double)
Create color stop from a color and position
color:
t:
Since: 7.0

Rhino.Display.ColorStop.Color
Since: 7.0

Rhino.Display.ColorStop.Position
Parameter that Color is defined at
Since: 7.0