Rhino.TesselationFailure
A class used to signal failure conditions of the 2D MeshCreateFromClosedPolylinesAndPoints.

Rhino.TesselationFailure.OpenPolylines
Gets the indices of open polylines.

Rhino.TesselationFailure.SelfIntersectingPolylines
Gets the indices of self-intersecting polylines.

Rhino.TesselationFailure.MutuallyIntersectingPolylines
Gets the pairs of indices of mutually intersecting polylines.

Rhino.TesselationFailure.PolylinesNotContainedInOne
Is true if not all polylines are contained in one

Rhino.TesselationFailure.What
Gets a description of the failure condition.

Rhino.TesselationFailure.Any
Checks if any failure condition is present.
Returns: True if any failure condition is present; otherwise, false.