Rhino.Geometry.NurbsCurve.NurbsCurveEndConditionType
What end conditions to set
Since: 6.0

Rhino.Geometry.NurbsCurve.NurbsCurveEndConditionType.Nothing
Set nothing

Rhino.Geometry.NurbsCurve.NurbsCurveEndConditionType.Position
Set endpoint

Rhino.Geometry.NurbsCurve.NurbsCurveEndConditionType.Tangency
Set tangent

Rhino.Geometry.NurbsCurve.NurbsCurveEndConditionType.Curvature
Set curvature