Rhino.DocObjects.MaterialRefs
If you are developing a high quality plug-in renderer, and a user is
assigning a custom render material to this object, then add rendering
material information to the MaterialRefs dictionary.
Note to developers:
As soon as the MaterialRefs dictionary contains items rendering
material queries slow down.  Do not populate the MaterialRefs
dictionary when setting the MaterialIndex will take care of your needs.

Rhino.DocObjects.MaterialRefs.Create(Rhino.DocObjects.MaterialRefCreateParams)
Call this method to create a MaterialRef which can be used when calling
one of the Add methods.
createParams:
Values used to initialize the MaterialRef
Returns:
A temporary MaterialRef object, the caller is responsible for disposing
of this object.
Since: 5.10

Rhino.DocObjects.MaterialRefs.GetEnumerator
Returns an enumerator that iterates through this dictionary.
Returns:
A IEnumerator that can be used to iterate this dictionary.
Since: 5.10

Rhino.DocObjects.MaterialRefs.System#Collections#IEnumerable#GetEnumerator
Returns an enumerator that iterates through this dictionary.
Returns:
An System.Collections.IEnumerator object that can be used to iterate
through this dictionary.
Since: 5.10

Rhino.DocObjects.MaterialRefs.Add(System.Collections.Generic.KeyValuePair{System.Guid,Rhino.DocObjects.MaterialRef})
Adds an item to this dictionary.
item:
The object to add to this dictionary
Throws System.ArgumentNullException:
value is null.
Throws System.ArgumentException:
key is empty.

Rhino.DocObjects.MaterialRefs.Add(System.Guid,Rhino.DocObjects.MaterialRef)
Add or replace an element with the provided key and value to this dictionary.
key:
The plug-in associated with this MaterialRef
value:
MaterialRef to add to this dictionary
Throws System.ArgumentNullException:
value is null.
Throws System.ArgumentException:
key is empty.
Since: 5.10

Rhino.DocObjects.MaterialRefs.Clear
Removes all items from this dictionary.
Since: 5.10

Rhino.DocObjects.MaterialRefs.Contains(System.Collections.Generic.KeyValuePair{System.Guid,Rhino.DocObjects.MaterialRef})
Determines whether this dictionary contains a specific value.
item:
The object to locate in this dictionary.
Returns:
true if item is found in this dictionary; otherwise, false.

Rhino.DocObjects.MaterialRefs.CopyTo(System.Collections.Generic.KeyValuePair{System.Guid,Rhino.DocObjects.MaterialRef}[],System.Int32)
Copies the elements of this dictionary to an System.Array, starting at
a particular System.Array index.
array:
The one-dimensional System.Array that is the destination of the
elements copied from this dictionary. The System.Array must have
zero-based indexing.
arrayIndex:
The zero-based index in array at which copying begins.
Throws System.ArgumentNullException:
array is null
Throws System.ArgumentOutOfRangeException:
arrayIndex is less than 0.
Throws System.ArgumentOutOfRangeException:
The number of elements in the source dictionary is greater than the
available space from arrayIndex to the end of the destination array.

Rhino.DocObjects.MaterialRefs.Remove(System.Collections.Generic.KeyValuePair{System.Guid,Rhino.DocObjects.MaterialRef})
Removes the element with the specified plug-in id from the this dictionary.
item:
The object to remove from this dictionary
Returns:

Rhino.DocObjects.MaterialRefs.Count
Gets the number of elements contained in this dictionary
Since: 5.10

Rhino.DocObjects.MaterialRefs.IsReadOnly
IDictionary required property, always returns false for this dictionary.
Since: 5.10

Rhino.DocObjects.MaterialRefs.ContainsKey(System.Guid)
Determines whether this dictionary contains an MaterialRef with the
specified plug-in id.
key:
The plug-in Id used to locate a MaterialRef in this dictionary.
Returns:
true if this dictionary contains an element with the specified plug-in
Id; otherwise, false.
Since: 5.10

Rhino.DocObjects.MaterialRefs.Remove(System.Guid)
Removes the MaterialRef with the specified plug-in Id from this
dictionary.
key:
The plug-in Id for the MaterialRef to remove.
Returns:
true if the MaterialRef is successfully removed; otherwise, false. This
method also returns false if key was not found in the original dictionary.
Since: 5.10

Rhino.DocObjects.MaterialRefs.TryGetValue(System.Guid,Rhino.DocObjects.MaterialRef@)
Gets the value associated with the specified key.
key:
The plug-in Id whose MaterialRef to get.
value:
When this method returns, the MaterialRef associated with the specified
key, if the key is found; otherwise, null. This parameter is passed
uninitialized.
Returns:
true if this dictionary contains a MaterialRef with the specified key;
otherwise, false.
Since: 5.10

Rhino.DocObjects.MaterialRefs.Item(System.Guid)
Gets or sets the element with the specified plug-in Id.
key:
The plug-in Id of the MaterialRef to get or set.
Returns:
The MaterialRef with the specified key.
Throws System.ArgumentNullException:
value is null.
Throws System.ArgumentException:
key is empty.

Rhino.DocObjects.MaterialRefs.Keys
Gets an ICollection containing the plug-in Id's in this dictionary.
Since: 5.10

Rhino.DocObjects.MaterialRefs.Values
Gets an ICollection containing the MaterialRef objects in this
dictionary.
Since: 5.10