Rhino.Render.ChangeQueue.ChangeQueue
Base class for ChangeQueue.
Generally used by render plugins to build interactive updating of scenes that are being rendered.

Rhino.Render.ChangeQueue.ChangeQueue.m_serial_number


Rhino.Render.ChangeQueue.ChangeQueue.CrcFromGuid(System.Guid)
Helper function to get a CRC from a Guid.
guid:
Returns:
Since: 6.0

Rhino.Render.ChangeQueue.ChangeQueue.IsPreview
Return true if this ChangeQueue is created for preview rendering.
No view was set for preview rendering.
Since: 6.0

Rhino.Render.ChangeQueue.ChangeQueue.ViewId
Return view ID for a RhinoDoc based ChangeQueue.
Returns Guid.Empty if no view was associated with the changequeue,
i.e. preview rendering.
Since: 6.0

Rhino.Render.ChangeQueue.ChangeQueue.m_plugin_id
Id of plugin instantiating change queue

Rhino.Render.ChangeQueue.ChangeQueue.#ctor(System.Guid,System.UInt32,Rhino.DocObjects.ViewInfo,System.Boolean)
Construct a new ChangeQueue from the given document
pluginId: Id of plugin instantiating ChangeQueue
docRuntimeSerialNumber:
viewinfo:
bRespectDisplayPipelineAttributes: Determines whether the display pipeline attributes for this viewport should be taken into account when supplying data.  If you are
using this queue to populate a scene for the "Render" command, set this to false.  If you are using it to draw a realtime preview, you will probably want to set it to true.

Rhino.Render.ChangeQueue.ChangeQueue.#ctor(System.Guid,System.UInt32,Rhino.DocObjects.ViewInfo,Rhino.Display.DisplayPipelineAttributes,System.Boolean,System.Boolean)
Construct a new ChangeQueue from the given document, using given display pipeline attributes.
pluginId: Id of plugin instantiating ChangeQueue
docRuntimeSerialNumber:
viewinfo:
attributes: Display pipeline attributes to use.
bRespectDisplayPipelineAttributes: Determines whether the display pipeline attributes for this viewport should be taken into account when supplying data.  If you are
using this queue to populate a scene for the "Render" command, set this to false.  If you are using it to draw a realtime preview, you will probably want to set it to true.
bNotifyChanges: Determines whether you want to receive updates when the model changes.  If you are rendering for a view capture, print or something similar, you will probably want to set this to false.

Rhino.Render.ChangeQueue.ChangeQueue.#ctor(System.Guid,Rhino.Render.CreatePreviewEventArgs)
Construct a new ChangeQueue using the given CreatePreviewEventArgs.
The preview scene for these args will be used to populate the world.
pluginId: Id of plugin instantiating ChangeQueue
createPreviewEventArgs:

Rhino.Render.ChangeQueue.ChangeQueue.OneShot
Call Flush() once, after that automatically dispose the queue.
Since: 6.0

Rhino.Render.ChangeQueue.ChangeQueue.CreateWorld
Calls CreateWorld with true passed.
Since: 6.0

Rhino.Render.ChangeQueue.ChangeQueue.CreateWorld(System.Boolean)
Signal the queue to do the initialisation of the queue, seeding it with the content currently available.
bFlushWhenReady: Set to true CreateWorld should automatically flush at the end.
Note that the Flush called when true is passed doesn't apply changes.
Since: 6.0

Rhino.Render.ChangeQueue.ChangeQueue.Flush
Tell the ChangeQueue to flush all collected events.
This can trigger a host of Apply* calls.
The following is the order in which those calls get
made if there are changes for that specific data type:
ApplyViewChange
ApplyLinearWorkflowChanges
ApplyDynamicObjectTransforms
ApplyDynamicLightChanges
ApplyRenderSettingsChanges
ApplyEnvironmentChanges (background)
ApplyEnvironmentChanges (refl)
ApplyEnvironmentChanges (sky)
ApplySkylightChanges
ApplySunChanges
ApplyLightChanges
ApplyMaterialChanges
ApplyMeshChanges
ApplyMeshInstanceChanges
ApplyGroundPlaneChanges
ApplyClippingPlaneChanges
Since: 6.0

Rhino.Render.ChangeQueue.ChangeQueue.GetQueueSkylight
Get skylight known to the queue at the time of the Flush
Returns:
Since: 6.0

Rhino.Render.ChangeQueue.ChangeQueue.GetQueueGroundPlane
Get groundplane known to the queue at the time of the Flush
Returns:
Since: 6.0

Rhino.Render.ChangeQueue.ChangeQueue.GetQueueRenderSettings
Get render settings known to the queue at the time of the Flush
Returns:
Since: 6.0

Rhino.Render.ChangeQueue.ChangeQueue.GetQueueSun
Get sun known to the queue at the time of the Flush
Returns:
Since: 6.0

Rhino.Render.ChangeQueue.ChangeQueue.GetQueueView
Get view known to the queue at the time of the Flush
Returns: ViewInfo
Since: 6.0

Rhino.Render.ChangeQueue.ChangeQueue.AreViewsEqual(Rhino.DocObjects.ViewInfo,Rhino.DocObjects.ViewInfo)
Compare to ViewInfo instances and decide whether they are equal or not.
If you need to change the way the comparison is done you can override
this function and implement your custom comparison.
aView: First ViewInfo to compare
bView: Second ViewInfo to compare
Returns: true if the views are considered equal
Since: 6.0

Rhino.Render.ChangeQueue.ChangeQueue.GetQueueSceneBoundingBox
Get the scene bounding box
Returns: Scene bounding box
Since: 6.0

Rhino.Render.ChangeQueue.ChangeQueue.Dispose
Dispose our ChangeQueue
Since: 6.0

Rhino.Render.ChangeQueue.ChangeQueue.Dispose(System.Boolean)
Dispose our ChangeQueue. Disposes unmanaged memory.
isDisposing:

Rhino.Render.ChangeQueue.ChangeQueue.MaterialFromId(System.UInt32)
Get the RenderMaterial from the ChangeQueue material cache based on RenderHash
crc: The RenderHash
Returns: RenderMaterial
Since: 6.0

Rhino.Render.ChangeQueue.ChangeQueue.MaterialFromOriginalInstanceId(System.Guid)
Get the RenderMaterial from the ChangeQueue material cache from the original instance id
id: The original instance id
Returns: RenderMaterial
Since: 8.5

Rhino.Render.ChangeQueue.ChangeQueue.OriginalInstanceIdsFromMaterialId(System.UInt32)
Return the collection of original document instance ids assocaited with the material id.
crc: The material id
Returns:
Since: 8.23

Rhino.Render.ChangeQueue.ChangeQueue.OriginalInstanceIdsFromTextureId(System.UInt32)
Return the collection of original document instance ids assocaited with the Texture id.
crc: The Texture id
Returns:
Since: 8.23

Rhino.Render.ChangeQueue.ChangeQueue.OriginalInstanceIdsFromEnvironmentId(System.UInt32)
Return the collection of original document instance ids assocaited with the Environment id.
crc: The Environment id
Returns:
Since: 8.23

Rhino.Render.ChangeQueue.ChangeQueue.TextureFromOriginalInstanceId(System.Guid)
Get the RenderTexture from the ChangeQueue content cache from the original instance id
id: The original instance id
Returns: RenderTexture
Since: 8.5

Rhino.Render.ChangeQueue.ChangeQueue.EnvironmentFromOriginalInstanceId(System.Guid)
Get the RenderEnvironment from the ChangeQueue content cache from the original instance id
id: The original instance id
Returns: RenderEnvironment
Since: 8.5

Rhino.Render.ChangeQueue.ChangeQueue.EnvironmentIdForUsage(Rhino.Render.RenderEnvironment.Usage)
Get RenderEnvironment RenderHash for given usage.
usage:
Returns:
Since: 6.0

Rhino.Render.ChangeQueue.ChangeQueue.EnvironmentForid(System.UInt32)
Get RenderEnvironment for given RenderHash. Can return null.
crc:
Returns: RenderEnvironment if render hash gives a match, null otherwise
Since: 6.0

Rhino.Render.ChangeQueue.ChangeQueue.TextureForId(System.UInt32)
Get RenderTexture for given RenderHash. Can return null.
crc: render hash of the content to search for
Returns: RenderTexture if found for render hash, null otherwise
Since: 7.0

Rhino.Render.ChangeQueue.ChangeQueue.DisplayPipelineAttributes
Get the DisplayPipelineAttributes if available, null otherwise
Since: 6.0

Rhino.Render.ChangeQueue.ChangeQueue.ConvertCameraBasedLightToWorld(Rhino.Render.ChangeQueue.ChangeQueue,Rhino.Render.ChangeQueue.Light,Rhino.DocObjects.ViewInfo)
Convert given (camera-based) light to a world-based light (in-place)
changequeue:
light:
vp:
Since: 6.0

Rhino.Render.ChangeQueue.ChangeQueue.OnApplyViewChange(System.Int32,System.IntPtr)
Handler for view changes
serial: runtime serial of the ChangeQueue instance.
viewInfo: Reference to ON_3dmView.m_vp

Rhino.Render.ChangeQueue.ChangeQueue.ApplyViewChange(Rhino.DocObjects.ViewInfo)
Override ApplyViewChange when you want to receive changes to the view/camera
viewInfo: The ViewInfo with the changes

Rhino.Render.ChangeQueue.ChangeQueue.ApplyDynamicObjectTransforms(System.Collections.Generic.List{Rhino.Render.ChangeQueue.DynamicObjectTransform})
Handle dynamic object transforms

Rhino.Render.ChangeQueue.ChangeQueue.ApplyDynamicLightChanges(System.Collections.Generic.List{Rhino.Geometry.Light})
Handle dynamic light changes

Rhino.Render.ChangeQueue.ChangeQueue.OnApplyMeshChanges(System.Int32,System.IntPtr,System.IntPtr)
Handler for receiving mesh changes
serial: Runtime serial of the ChangeQueue instance.
pDeletedUuids:
pAddedMeshes:

Rhino.Render.ChangeQueue.ChangeQueue.ApplyMeshChanges(System.Guid[],System.Collections.Generic.List{Rhino.Render.ChangeQueue.Mesh})
Override this when you want to handle mesh changes.
deleted: List of Guids to meshes that have been deleted
added: List of ChangeQueueMeshes that have been added or changed

Rhino.Render.ChangeQueue.ChangeQueue.ApplyMeshInstanceChanges(System.Collections.Generic.List{System.UInt32},System.Collections.Generic.List{Rhino.Render.ChangeQueue.MeshInstance})
Override this when you want to handle mesh instance changes (block instances and first-time added new meshes)
deleted:
addedOrChanged:

Rhino.Render.ChangeQueue.ChangeQueue.ApplySunChanges(Rhino.Geometry.Light)
Override this when you want to handle sun changes

Rhino.Render.ChangeQueue.ChangeQueue.ApplySkylightChanges(Rhino.Render.ChangeQueue.Skylight)
Override this when you want to handle skylight changes
skylight:

Rhino.Render.ChangeQueue.ChangeQueue.ApplyLightChanges(System.Collections.Generic.List{Rhino.Render.ChangeQueue.Light})
Override this when you want to handle light changes

Rhino.Render.ChangeQueue.ChangeQueue.ApplyMaterialChanges(System.Collections.Generic.List{Rhino.Render.ChangeQueue.Material})
Override when you want to handle material changes
mats: List of ChangeQueue::Material that have changed

Rhino.Render.ChangeQueue.ChangeQueue.ApplyRenderSettingsChanges(Rhino.Render.RenderSettings)
Override this when you need to handle background changes (through RenderSettings)
rs:

Rhino.Render.ChangeQueue.ChangeQueue.ApplyEnvironmentChanges(Rhino.Render.RenderEnvironment.Usage)
Override this when you want to handle environment changes

Rhino.Render.ChangeQueue.ChangeQueue.ApplyGroundPlaneChanges(Rhino.Render.ChangeQueue.GroundPlane)
Override this when you want to handle groundplane changes
gp:

Rhino.Render.ChangeQueue.ChangeQueue.ApplyClippingPlaneChanges(System.Guid[],System.Collections.Generic.List{Rhino.Render.ChangeQueue.ClippingPlane})
Override this when you want to handle clippingplane changes
deleted:
addedOrModified:

Rhino.Render.ChangeQueue.ChangeQueue.ApplyDynamicClippingPlaneChanges(System.Collections.Generic.List{Rhino.Render.ChangeQueue.ClippingPlane})
Override this when you want to handle dynamicclippingplane changes
changed:

Rhino.Render.ChangeQueue.ChangeQueue.ApplyRenderSettingsChanges(Rhino.Render.ChangeQueue.DisplayRenderSettings)
Override this when you want to handle render setting changes. These are for the viewport settings.

Rhino.Render.ChangeQueue.ChangeQueue.ProvideOriginalObject
Override ProvideOriginalObject and return true if you want original objects supplied with
ChangeQueue.Mesh. This will then also allow access to the Attributes.UserData of the original
object from which the Mesh was generated.
Returns:

Rhino.Render.ChangeQueue.ChangeQueue.ApplyLinearWorkflowChanges(Rhino.Render.LinearWorkflow)
Override this when you want to handle linear workflow changes

Rhino.Render.ChangeQueue.ChangeQueue.NotifyBeginUpdates
Override this when you want to be notified of begin of changes

Rhino.Render.ChangeQueue.ChangeQueue.NotifyEndUpdates
Override this when you want to be notified when change notifications have ended.

Rhino.Render.ChangeQueue.ChangeQueue.NotifyDynamicUpdatesAreAvailable
Override this when you want to be notified dynamic updates are available

Rhino.Render.ChangeQueue.ChangeQueue.BakeFor
Override this if you need to control baking behavior for textures. By
default bake everything.
Returns:

Rhino.Render.ChangeQueue.ChangeQueue.BakingSize(Rhino.DocObjects.RhinoObject,Rhino.Render.RenderMaterial,Rhino.DocObjects.TextureType)
Override this if you need to control the size of the baked bitmaps for textures. By
default the value returned is 2048.
Returns:

Rhino.Render.ChangeQueue.ChangeQueue.ContentRenderHash(Rhino.Render.RenderContent,Rhino.Render.CrcRenderHashFlags,System.String,Rhino.Render.LinearWorkflow)
Override this if you need to modify the way render hashes are calcuated in the change queue.  This will alter the way materials are grouped.
Returns:

Rhino.Render.ChangeQueue.ChangeQueue.ApplyDisplayPipelineAttributesChanges(Rhino.Display.DisplayPipelineAttributes)
Override if you need to react to display attribute changes.
This function is needed to be able to react to different sample settings for i.e.
capture preview rendering.
displayPipelineAttributes: The changed DisplayPipelineAttributes.