Rhino.FileIO.FileSlcWriteOptions
Options used when writing a SLC file

Rhino.FileIO.FileSlcWriteOptions.StartPoint
Start of the slicing normal
Since: 7.0

Rhino.FileIO.FileSlcWriteOptions.EndPoint
End of the slicing normal
Since: 7.0

Rhino.FileIO.FileSlcWriteOptions.SliceDistance
The distance between the slices or layers of curves that your final
output will contain. The distance should be based on the slice
thickness of your final output device
Since: 7.0

Rhino.FileIO.FileSlcWriteOptions.UseMeshes
Use meshes to generate slices. The curves for each slice are generated
by intersecting the object mesh with a plane. the Angle between
polyline segments data is not used when this value is true
Since: 7.0

Rhino.FileIO.FileSlcWriteOptions.AngleBetweenSegmentsDegrees
The angle that determines how smooth the polylines of the slice curves
will be. When the number is small you will get a smooth final output
but it will take more time to export and a larger file.
Since: 7.0