Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader
Wrapper for ON_SimpleArray<ON_BinaryArchive>. If you are not writing C++ code
then this class is not for you.

Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader class.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader.#ctor(System.IntPtr)
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader class.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader.Add(Rhino.FileIO.BinaryArchiveReader)
Adds a new Rhino.FileIO.BinaryArchiveReader at the end of this array.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader.Count
Gets the amount of elements in this array.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader.Get(System.Int32)
Get the BinaryArchiveReader at index.
index:
Returns: The BinaryArchiveReader at the specified index.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.SimpleArrayBinaryArchiveReader.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 6.0