Rhino.Display.DisplayPipelineAttributes.LockedObjectUse
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.LockedObjectUse.UseObjectAttributes
Uses the object's specified attributes.

Rhino.Display.DisplayPipelineAttributes.LockedObjectUse.SpecifyColor
Use specified lock color

Rhino.Display.DisplayPipelineAttributes.LockedObjectUse.UseAppSettings
Use settings specified in Appearance: Colors Options.