Rhino.Render.RenderEnvironment.CurrentEnvironment
Since: 5.1

Rhino.Render.RenderEnvironment.NewBasicEnvironment(Rhino.Render.SimulatedEnvironment)
Constructs a new Rhino.Render.RenderEnvironment from a Rhino.Render.SimulatedEnvironment.
environment: The environment to create the basic environment from.
Returns: A new basic environment.
Since: 5.3

Rhino.Render.RenderEnvironment.NewBasicEnvironment(Rhino.Render.SimulatedEnvironment,Rhino.RhinoDoc)
Since: 6.4

Rhino.Render.RenderEnvironment.SimulateEnvironment(Rhino.Render.SimulatedEnvironment@,System.Boolean)
Since: 5.1

Rhino.Render.RenderEnvironment.SimulateEnvironment(System.Boolean)
Since: 6.0

Rhino.Render.RenderEnvironment.TextureChildSlotName
Since: 6.0