Rhino.FileIO.FileUdoWriteOptions
Options for writing a Moray UDO file

Rhino.FileIO.FileUdoWriteOptions.MeshingParameters
Since: 8.0

Rhino.FileIO.FileUdoWriteOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0