Rhino.DocObjects.InstanceDefinitionUpdateType
The possible relationships between the instance definition geometry
and the archive containing the original definition.
Since: 5.0

Rhino.DocObjects.InstanceDefinitionUpdateType.Static
The Rhino user interface uses the term "Embedded" for Static update types.
This instance definition is never updated. If m_source_archive is set,
it records the origin of the instance definition geometry, but
m_source_archive is never used to update the instance definition.

Rhino.DocObjects.InstanceDefinitionUpdateType.Embedded
This instance definition geometry was imported from another archive and is embedded.
If the source archive changes, the user is asked if they want to update the instance definition.

Rhino.DocObjects.InstanceDefinitionUpdateType.LinkedAndEmbedded
This instance definition geometry was imported from another archive and is embedded.
If the source archive changes, the instance definition is automatically updated.
If the soruce archive is not available, the instance definition is still valid.

Rhino.DocObjects.InstanceDefinitionUpdateType.Linked
This instance definition geometry was imported from another archive and is not embedded.
If the source archive changes, the instance definition is automatically updated.
If the source archive is not available, the instance definition is not valid.