Rhino.UI.Controls.FactoryBase
Base class for CollapsibleSection and ViewModel factories used by the RDK UI

Rhino.UI.Controls.FactoryBase.Finalize
Finalizer

Rhino.UI.Controls.FactoryBase.Get(System.Guid)
Override this method to return a new instance of your class for the given ID
id:
Returns:
Since: 6.0

Rhino.UI.Controls.FactoryBase.Register(Rhino.PlugIns.PlugIn)
Call this function during the startup of your plug-in to ensure that all classes that support factory creation
are registed
plugin:
Returns:
Since: 6.0

Rhino.UI.Controls.FactoryBase.Register
Call this function during startup of current assembly to load classes with factory creation support
are registed
Returns:
Since: 6.0