Rhino.PlugIns.CustomRenderSaveFileTypes.#ctor
Only allow Rhino Common to construct one of these

Rhino.PlugIns.CustomRenderSaveFileTypes.Clear
Clear the cached save type list

Rhino.PlugIns.CustomRenderSaveFileTypes.CustomRenderSaveFileTypeFromExtension(System.String)
Find the first CustomRenderSaveFileType that includes the specified
file extension.
extensionId:
Runtime Id of extension to find as a string
Returns:
Returns the CustomRenderSaveFileType which contains the specified file
extension or null if one is not found.

Rhino.PlugIns.CustomRenderSaveFileTypes.TypeList
Used to cache the list, the cache is built by the
OnCustomRenderSaveFileTypes callback and used by the
OnSaveCusomtomRenderFile callback to find the specific
save file callback.

Rhino.PlugIns.CustomRenderSaveFileTypes.RegisterFileType(System.Collections.Generic.IEnumerable{System.String},System.String,Rhino.PlugIns.CustomRenderSaveFileTypes.SaveFileHandler)
Call this method to register a custom file save type with the render
output window save dialog.
extensions:
List of one or more file extension associated with this custom type,
for example: HDR, HDRI
description:
File extension description which appears in the file save dialog file
type combo box.
Called by the rendered scene to write the save file.
saveFileHandler:
Since: 5.11