Rhino.UI.Internal.TabPanels.SystemIformationMessageType
Status bar information pane system information message

Rhino.UI.Internal.TabPanels.SystemIformationMessageType.MemoryUse
Memory used by the Rhino process.

Rhino.UI.Internal.TabPanels.SystemIformationMessageType.AvailableMemory
Available physical memory.

Rhino.UI.Internal.TabPanels.SystemIformationMessageType.CpuUse
Percentage of CPU used.