Rhino.FileIO.FileVrml
Support for writing wrl file format

Rhino.FileIO.FileVrml.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileVrmlWriteOptions)
Write a wrl file based on the contents of a RhinoDoc
path: path to write a file to
doc: document to get geometry from
options: options used for generating the wrl file
Returns: true on success
Since: 8.0