Rhino.Render.Decals
Represents all the decals of an object.

Rhino.Render.Decals.Add(Rhino.Render.Decal)
Add a new Decal to the decals list, use Decal.Create to create
a new decal instance to add.
decal:
Returns:
Since: 5.10

Rhino.Render.Decals.Clear
Since: 5.10
8.0

Rhino.Render.Decals.RemoveAllDecals
Remove all the decals from the collection.
Since: 8.0

Rhino.Render.Decals.Remove(Rhino.Render.Decal)
Remove a single decal from the collection.
Since: 5.10

Rhino.Render.Decals.GetEnumerator
Since: 5.10

Rhino.Render.Decals.System#Collections#IEnumerable#GetEnumerator
Since: 5.10