Rhino.Geometry.BrepEdge
Represents a single edge curve in a Brep object.

Rhino.Geometry.BrepEdge.Tolerance
Gets or sets the accuracy of the edge curve (>=0.0 or RhinoMath.UnsetValue)
A value of UnsetValue indicates that the tolerance should be computed.
The maximum distance from the edge's 3d curve to any surface of a face
that has this edge as a portion of its boundary must be <= this tolerance.
Since: 5.0

Rhino.Geometry.BrepEdge.TrimCount
Gets the number of trim-curves that use this edge.
Since: 5.0

Rhino.Geometry.BrepEdge.Valence
Gets the topological valency of this edge. The topological valency
is defined by how many adjacent faces share this edge.
Since: 5.0

Rhino.Geometry.BrepEdge.Brep
Gets the Brep that owns this edge.
Since: 5.0

Rhino.Geometry.BrepEdge.EdgeIndex
Gets the index of this edge in the Brep.Edges collection.
Since: 5.0

Rhino.Geometry.BrepEdge.ProxyBrepSubDEdgeId
If this edge is part of a brep created by SubD.ProxyBrep(),
then the subd component id of the corresponding SubD edge is returned.
Otherwise 0 is returned.
Since: 7.19

Rhino.Geometry.BrepEdge.ConcavityAt(System.Double,System.Double)
Determine the concavity of this edge at a specific parameter.
t: Edge curve parameter.
tolerance: Angle tolerance for tangent faces.
Returns: Concavity measure at parameter.
Since: 6.2

Rhino.Geometry.BrepEdge.IsSmoothManifoldEdge(System.Double)
For a manifold, non-boundary edge, decides whether or not the two surfaces
on either side meet smoothly.
angleToleranceRadians:
used to decide if surface normals on either side are parallel.
Returns:
true if edge is manifold, has exactly 2 trims, and surface normals on either
side agree to within angle_tolerance.
Since: 5.0

Rhino.Geometry.BrepEdge.AdjacentFaces
Gets the indices of all the BrepFaces that use this edge.
Since: 5.0

Rhino.Geometry.BrepEdge.TrimIndices
Gets the indices of all trims associated with this edge.
Returns: Empty array on failure.
Since: 5.12

Rhino.Geometry.BrepEdge.GetEdgeParameter(System.Int32,System.Double,System.Double@)
Get corresponding edge parameter for given trim at given trim parameter.
trimIndex:
trimParameter:
edgeParameter:
Returns: true on success
Since: 5.12

Rhino.Geometry.BrepEdge.EdgeCurveIndex
Get the brep.Curves3D[] index of the 3d curve geometry used by this edge or -1.
Since: 6.0

Rhino.Geometry.BrepEdge.EdgeCurve
Get the brep.Curves3D[] 3d curve geometry used by this edge or null.
Since: 6.0

Rhino.Geometry.BrepEdge.SetEdgeCurve(System.Int32)
Set 3d curve geometry used by a b-rep edge.
curve3dIndex: index of 3d curve in m_C3[] array
Returns: true if successful
Since: 5.4

Rhino.Geometry.BrepEdge.SetEdgeCurve(System.Int32,Rhino.Geometry.Interval)
Set 3d curve geometry used by a b-rep edge.
curve3dIndex: index of 3d curve in m_C3[] array
subDomain:
Returns: true if successful
Since: 5.4

Rhino.Geometry.BrepEdge.StartVertex
BrepVertex at start of edge
Since: 5.10

Rhino.Geometry.BrepEdge.EndVertex
BrepVertex at end of edge
Since: 5.10