Rhino.FileIO.File3dmMaterialTable
Provides access to materials in the 3dm file.

Rhino.FileIO.File3dmMaterialTable.ComponentType
Returns Rhino.DocObjects.ModelComponentType.RenderMaterial.
Since: 6.0

Rhino.FileIO.File3dmMaterialTable.FindIndex(System.Int32)
Retrieves a material based on Index. This search type of search is discouraged.
We are moving towards using only IDs for all tables.
index: The index to search for.
Returns: A material, or null if none was found.
Since: 6.0

Rhino.FileIO.File3dmMaterialTable.AddMaterial(Rhino.DocObjects.Material)
Adds a material to the model material table
material:
Returns: The material's index (>=0) is returned. Otherwise, RhinoMath.UnsetIntIndex is returned.
Since: 8.4