Rhino.Display.DisplayModeChangedEventArgs.Viewport
Since: 6.18

Rhino.Display.DisplayModeChangedEventArgs.RhinoDoc
Since: 6.18

Rhino.Display.DisplayModeChangedEventArgs.OldDisplayModeId
Since: 6.18

Rhino.Display.DisplayModeChangedEventArgs.ChangedDisplayModeId
Since: 6.18