SnapShotsClientDataArray
SnapShotsClientDataArray

SnapShotsClientDataArray.#ctor(System.IntPtr)
SnapShotsClientDataArray constructor

SnapShotsClientDataArray.Finalize
SnapShotsClientDataArray destructor

SnapShotsClientDataArray.Dispose
SnapShotsClientDataArray dispose

SnapShotsClientDataArray.Dispose(System.Boolean)
SnapShotsClientDataArray dispose

SnapShotsClientDataArray.Count
Get the number of instances
Returns: returns the number of instances

SnapShotsClientDataArray.At(System.Int32)
Get the instance at index
index: The index of the instance
Returns: returns the instance at index