Rhino.Runtime.InteropWrappers.SimpleArrayInterval
Wrapper for ON_SimpleArray<ON_Interval>. If you are not writing C++ code
then this class is not for you.

Rhino.Runtime.InteropWrappers.SimpleArrayInterval.ConstPointer
Gets the constant (immutable) pointer of this array.
Returns: The constant pointer.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayInterval.NonConstPointer
Gets the non-constant pointer (for modification) of this array.
Returns: The non-constant pointer.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayInterval.#ctor
Initializes a new Rhino.Runtime.InteropWrappers.SimpleArrayInterval class.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayInterval.Add(Rhino.Geometry.Interval)
Adds a new Rhino.Geometry.Interval at the end of this array.
Since: 6.0

Rhino.Runtime.InteropWrappers.SimpleArrayInterval.Count
Gets the amount of elements in this array.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayInterval.ToArray
Returns the managed counterpart of the unmanaged array.
Returns: The managed array.
Since: 5.0

Rhino.Runtime.InteropWrappers.SimpleArrayInterval.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Runtime.InteropWrappers.SimpleArrayInterval.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0