Rhino.Geometry.NurbsMultiMatcher.FreeEdgeMovementOption


Rhino.Geometry.NurbsMultiMatcher.FreeEdgeMovementOption.Unset


Rhino.Geometry.NurbsMultiMatcher.FreeEdgeMovementOption.None


Rhino.Geometry.NurbsMultiMatcher.FreeEdgeMovementOption.Rigid


Rhino.Geometry.NurbsMultiMatcher.FreeEdgeMovementOption.Smooth
