Rhino.Render.RdkUndoRecord
RdkUndoRecord class

Rhino.Render.RdkUndoRecord.#ctor(System.IntPtr)
Constructor for RdkUndoRecord
Since: 6.0

Rhino.Render.RdkUndoRecord.Finalize
Destructor for RdkUndoRecord

Rhino.Render.RdkUndoRecord.Dispose
Dispose for RdkUndoRecord
Since: 6.0

Rhino.Render.RdkUndoRecord.SetDescription(System.String)
Set description for RdkUndoRecord
Since: 6.0