Rhino.Geometry.CurveOffsetEndStyle
Defines enumerated values for all implemented end styles in curve offsets.
Since: 7.0

Rhino.Geometry.CurveOffsetEndStyle.None
No closing segments are added.

Rhino.Geometry.CurveOffsetEndStyle.Flat
Straight-line segments are added between the curves.

Rhino.Geometry.CurveOffsetEndStyle.Round
Tangent arcs are added between the curves.