Rhino.DocObjects.Tables.RhinoDocCommonTable`1.Document
Document that owns this table.

Rhino.DocObjects.Tables.RhinoDocCommonTable`1.__FindNameInternal(System.String)
Expose this only in tables that have UNIQUE names
and where uniqueness is not derived from parent ID (layers).

Rhino.DocObjects.Tables.RhinoDocCommonTable`1.__FindNameHashInternal(Rhino.FileIO.NameHash)
Expose this only in tables that have UNIQUE names
and where uniqueness is not derived from parent ID (layers).