Rhino.Geometry.BezierSurface
Represents a Bezier surface.

Rhino.Geometry.BezierSurface.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Geometry.BezierSurface.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0

Rhino.Geometry.BezierSurface.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.Geometry.BezierSurface.IsValid
Tests an object to see if it is valid.
Since: 7.1

Rhino.Geometry.BezierSurface.Dimension
Dimension of Bezier
Since: 7.1

Rhino.Geometry.BezierSurface.CreateLoftedBezier(System.Collections.Generic.IEnumerable{Rhino.Geometry.BezierCurve})
Loft a bezier surface through a list of bezier curves.
curves: list of curves that have the same degree
Returns: new bezier curve if successful
Since: 7.1

Rhino.Geometry.BezierSurface.GetBoundingBox(System.Boolean)
Bounding box solver. Gets the world axis aligned bounding box for the surface.
accurate: This parameter is currently ignored.
Returns:
The bounding box of the geometry in world coordinates or BoundingBox.Empty
if not bounding box could be found.
Since: 7.1

Rhino.Geometry.BezierSurface.Transform(Rhino.Geometry.Transform)
Transforms the surface
xform:
Transformation to apply to geometry.
Returns: true if geometry successfully transformed.
Since: 7.1

Rhino.Geometry.BezierSurface.Domain(System.Int32)
Gets the domain in a direction.
direction: 0 gets first parameter, 1 gets second parameter.
Returns: An interval value.
Since: 7.1

Rhino.Geometry.BezierSurface.Reverse(System.Int32)
Reverses parameterization Domain changes from [a,b] to [-b,-a]
direction:
0 for first parameter's domain, 1 for second parameter's domain.
Returns: a new reversed surface on success.
Since: 7.1

Rhino.Geometry.BezierSurface.Transpose
Transposes surface parameterization (swap U and V)
Returns: New transposed surface on success, null on failure.
Since: 7.1

Rhino.Geometry.BezierSurface.PointAt(System.Double,System.Double)
Evaluates point at a surface parameter.
u: evaluation parameters.
v: evaluation parameters.
Returns: Point (location of surface at the parameter u,v).
Remarks: No error handling.
Since: 7.1

Rhino.Geometry.BezierSurface.ToNurbsSurface
Constructs a NURBS surface representation of this surface.
Returns: NURBS representation of the surface on success, null on failure.
Since: 7.1

Rhino.Geometry.BezierSurface.IsRational
Gets a value indicating whether or not the surface is rational.
Rational surfaces have control-points with custom weights.
Since: 7.1

Rhino.Geometry.BezierSurface.ControlVertexCount(System.Int32)
Number of control vertices in this surface
direction:
0 for first parameter's domain, 1 for second parameter's domain.
Since: 7.1

Rhino.Geometry.BezierSurface.GetControlVertex2d(System.Int32,System.Int32)
Get location of a control vertex.
i:
Control vertex index (0 <= index < ControlVertexCount)
j:
Control vertex index (0 <= index < ControlVertexCount)
Returns:
If the bezier is rational, the euclidean location is returned.
Throws System.ArgumentOutOfRangeException: when i or j is out of range
Since: 7.1

Rhino.Geometry.BezierSurface.GetControlVertex3d(System.Int32,System.Int32)
Get location of a control vertex.
i:
Control vertex index (0 <= index < ControlVertexCount)
j:
Control vertex index (0 <= index < ControlVertexCount)
Returns:
If the bezier is rational, the euclidean location is returned.
Throws System.ArgumentOutOfRangeException: when i or j is out of range
Since: 7.1

Rhino.Geometry.BezierSurface.GetControlVertex4d(System.Int32,System.Int32)
Get location of a control vertex.
i:
Control vertex index (0 <= index < ControlVertexCount)
j:
Control vertex index (0 <= index < ControlVertexCount)
Returns:
Homogeneous value of control vertex. If the bezier is not
rational, the weight is 1.
Throws System.ArgumentOutOfRangeException: when index is out of range
Since: 7.1

Rhino.Geometry.BezierSurface.MakeRational
Make bezier rational
Returns: true if successful
Since: 7.1

Rhino.Geometry.BezierSurface.MakeNonRational
Make bezier non-rational
Returns: true if successful
Since: 7.1

Rhino.Geometry.BezierSurface.Split(System.Int32,System.Double,Rhino.Geometry.BezierSurface@,Rhino.Geometry.BezierSurface@)
Divides the Bezier surface at the specified parameter.
direction: 0 is split along u and 1 is split along v
t: parameter must satisfy 0 < t < 1
left:
right:
Returns: true on success
Since: 7.1