Rhino.Geometry.Intersect.MeshIntersectionCache
Provides a mechanism for lazily evaluating mesh data.
Since: 8.0

Rhino.Geometry.Intersect.MeshIntersectionCache.ConstPointer
Gets the const (immutable) pointer of this class.
Returns: The const pointer.
Since: 8.0

Rhino.Geometry.Intersect.MeshIntersectionCache.NonConstPointer
Gets the non-const pointer (for modification) of this class.
Returns: The non-const pointer.
Since: 8.0

Rhino.Geometry.Intersect.MeshIntersectionCache.#ctor
Provides a mechanism for lazily evaluating mesh data.
The implementation is private and subject to change.
Since: 8.0

Rhino.Geometry.Intersect.MeshIntersectionCache.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().
Since: 8.0

Rhino.Geometry.Intersect.MeshIntersectionCache.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 8.0

Rhino.Geometry.Intersect.MeshIntersectionCache.Dispose(System.Boolean)
Disposes the mesh intersection cache.
disposing: If set to true dispose was called explicitly,
otherwise specify false if calling from a finalizer.
Since: 8.0