Rhino.Display.DisplayPipelineAttributes.ClippingShadeColorUse
Since: 8.11

Rhino.Display.DisplayPipelineAttributes.ClippingShadeColorUse.PlaneColor
Uses the clipping plane's color (object or layer).

Rhino.Display.DisplayPipelineAttributes.ClippingShadeColorUse.PlaneMaterialColor
Uses the plane's render material (object or layer).

Rhino.Display.DisplayPipelineAttributes.ClippingShadeColorUse.SolidColor
Solid Color