Rhino.Display.ColorGradient


Rhino.Display.ColorGradient.Duplicate
Create a duplicate of this color gradient.
Returns: An exact duplicate of this color gradient.
Since: 8.8

Rhino.Display.ColorGradient.GradientType
Gradient fill type associated with this hatch
Since: 7.0

Rhino.Display.ColorGradient.GetColorStops
Get sorted list of colors / positions that a gradient is defined over
Returns:
Since: 7.0

Rhino.Display.ColorGradient.SetColorStops(System.Collections.Generic.IEnumerable{Rhino.Display.ColorStop})
Set color stops for the gradient
stops:
Since: 7.0

Rhino.Display.ColorGradient.Repeat
Repeat factor for gradient. Factors greater than 1 define a reflected
repeat factor while values less than -1 define a wrapped repeat factor.
Since: 7.0

Rhino.Display.ColorGradient.StartPoint
Start point of gradient
Since: 7.0

Rhino.Display.ColorGradient.EndPoint
End point of gradient
Since: 7.0