Rhino.Geometry.Intersect.SphereSphereIntersection
Represents all possible cases of a Sphere|Sphere intersection event.
Since: 5.0

Rhino.Geometry.Intersect.SphereSphereIntersection.None
Spheres do not intersect.

Rhino.Geometry.Intersect.SphereSphereIntersection.Point
Spheres touch at a single point.

Rhino.Geometry.Intersect.SphereSphereIntersection.Circle
Spheres intersect at a circle.

Rhino.Geometry.Intersect.SphereSphereIntersection.Overlap
Spheres are identical.