Rhino.Input.Custom.GetString
Used to get strings.

Rhino.Input.Custom.GetString.#ctor
Constructs a new GetString.
Since: 5.0

Rhino.Input.Custom.GetString.Get
Returns the string that the user typed. By default, space stops the string input.
Returns: The result type. If the user typed a string, this is Rhino.Input.GetResult.String.
Since: 5.0

Rhino.Input.Custom.GetString.GetLiteralString
Returns the string that the user typed. By default, space does not stop input.
Returns: The result type. If the user typed a string, this is Rhino.Input.GetResult.String.
Since: 5.0