Rhino.PrivateMeshCommands.MeshTypes.Graph
Constains an immutable instance of a non-oriented curve network

Rhino.PrivateMeshCommands.MeshTypes.Graph.#ctor(Rhino.Geometry.Curve[])
Constructs a single topology
curves: The array or list of curves that will be shallow copied. Modifying curves invalidates this class.

Rhino.PrivateMeshCommands.MeshTypes.Graph.#ctor(Rhino.Geometry.Curve[],System.Double,System.Boolean)
Constructs a single topology with tolerance
curves: The array or list of curves that will be shallow copied. Modifying curves invalidates this class.
tolerance: A positive tolerance value, measured in document units.
dropDuplicates: Removes curves that fall within tolerance.

Rhino.PrivateMeshCommands.MeshTypes.Graph.EdgeLength
The total amount of edges

Rhino.PrivateMeshCommands.MeshTypes.Graph.VertexLength
The total amount of vertices

Rhino.PrivateMeshCommands.MeshTypes.Graph.CurveAt(System.Int32)
Retrieves an input curve at an edge index
i: The ordered index. Curves have the exact same order and indices as edges: you can access the edges through EdgeAt(i)
Returns: The curve

Rhino.PrivateMeshCommands.MeshTypes.Graph.EdgeAt(System.Int32)
Retrieves a topological edge
i: The ordered index. Edges have the exact same order and indices as the input curves, that you can access through CurveAt(i)
Returns: The topological edge

Rhino.PrivateMeshCommands.MeshTypes.Graph.GetClosestNode(Rhino.Geometry.Point3d)
Iterate through vertices and find the closest index, no matter of the distance
position: The cartesian location of the wanted point
Returns: The index of the vertex

Rhino.PrivateMeshCommands.MeshTypes.Graph.GetVertexIndexOf(Rhino.Geometry.Point3d)
Iterate through vertices and find the one index within tolerance
position: The cartesian location of the wanted point
Returns: The index of the vertex, or -1 if no suitable vertex was found

Rhino.PrivateMeshCommands.MeshTypes.Graph.LinearDistanceAt(Rhino.PrivateMeshCommands.MeshTypes.EdgeAddress)
Returns the linear distance of an edge
edge: The edgeaddress
Returns: The length

Rhino.PrivateMeshCommands.MeshTypes.Graph.LinearDistanceAt(System.Int32)
Returns the linear distance of an edge
edgeIndex: The edge index
Returns: The length

Rhino.PrivateMeshCommands.MeshTypes.Graph.MeasureAllEdgeLengths
Get the physical length of all input curves
Returns: The ordered physical length of all input curves

Rhino.PrivateMeshCommands.MeshTypes.Graph.MeasureAllEdgeLinearDistances
Get the physical length of all input curves
Returns: The ordered physical length of all input curves

Rhino.PrivateMeshCommands.MeshTypes.Graph.NodeAt(System.Int32)
Retrieves a node (the idea of a location where curves connect)
i: The ordered vertex index. You can access the location with the same index through VertexAt()
Returns:

Rhino.PrivateMeshCommands.MeshTypes.Graph.VertexAt(System.Int32)
Retrieves a location of a vertex within tolerance at the specified node index.
i: The position where a Node exists (might be one of the points within the chosen tolerance).
It has the exact same ordering as NodeAt()
Returns:

Rhino.PrivateMeshCommands.MeshTypes.Graph.RLT(Rhino.Geometry.Point3d[],System.Int32[]@,System.Double)
Repetition counts with tolerance