Rhino.Runtime.CorruptGeometryException
Thrown when Rhino finds a brep or mesh that will cause a crash if used for calculations.

Rhino.Runtime.CorruptGeometryException.#ctor(System.IntPtr,Rhino.Runtime.CommonObject)
Intentionally internal so only the IsCorrupt test can throw this exception.
ptrGeometry: pointer to base geometry (ON_Object*)
obj: Corrupt geometry .NET class

Rhino.Runtime.CorruptGeometryException.Pointer
pointer to base geometry (ON_Object*)
Since: 6.10

Rhino.Runtime.CorruptGeometryException.CommonObject
Corrupt geometry .NET class
Since: 6.10