Rhino.Geometry.Collections.NurbsSurfaceKnotList
Provides access to the knot vector of a NURBS surface.

Rhino.Geometry.Collections.NurbsSurfaceKnotList.Count
Gets the total number of knots in this curve.
Since: 5.0

Rhino.Geometry.Collections.NurbsSurfaceKnotList.ClampedAtStart
Determines if a knot vector is clamped.
Since: 5.0

Rhino.Geometry.Collections.NurbsSurfaceKnotList.ClampedAtEnd
Determines if a knot vector is clamped.
Since: 5.0

Rhino.Geometry.Collections.NurbsSurfaceKnotList.SuperfluousKnot(System.Boolean)
Computes the knots that are superfluous because they are not used in NURBs evaluation.
These make it appear so that the first and last surface spans are different from interior spans.
http://wiki.mcneel.com/developer/onsuperfluousknot
start: true if the query targets the first knot. Otherwise, the last knot.
Returns: A component.
Since: 5.0

Rhino.Geometry.Collections.NurbsSurfaceKnotList.KnotStyle
Gets the style of the knot vector.
Since: 7.1

Rhino.Geometry.Collections.NurbsSurfaceKnotList.Item(System.Int32)
Gets or sets the knot vector value at the given index.
index: Index of knot to access.
Returns: The knot value at [index]

Rhino.Geometry.Collections.NurbsSurfaceKnotList.EnsurePrivateCopy
If you want to keep a copy of this class around by holding onto it in a variable after a command
completes, call EnsurePrivateCopy to make sure that this class is not tied to the document. You can
call this function as many times as you want.
Since: 5.0

Rhino.Geometry.Collections.NurbsSurfaceKnotList.InsertKnot(System.Double)
Inserts a knot and update control point locations.
Does not change parameterization or locus of curve.
value: Knot value to insert.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Collections.NurbsSurfaceKnotList.InsertKnot(System.Double,System.Int32)
Inserts a knot and update control point locations.
Does not change parameterization or locus of curve.
value: Knot value to insert.
multiplicity: Multiplicity of knot to insert.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Collections.NurbsSurfaceKnotList.KnotMultiplicity(System.Int32)
Get knot multiplicity.
index: Index of knot to query.
Returns: The multiplicity (valence) of the knot.
Since: 5.0

Rhino.Geometry.Collections.NurbsSurfaceKnotList.CreateUniformKnots(System.Double)
Compute a clamped, uniform knot vector based on the current
degree and control point count. Does not change values of control
vertices.
knotSpacing: Spacing of subsequent knots.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Collections.NurbsSurfaceKnotList.CreatePeriodicKnots(System.Double)
Compute a clamped, uniform, periodic knot vector based on the current
degree and control point count. Does not change values of control
vertices.
knotSpacing: Spacing of subsequent knots.
Returns: true on success, false on failure.
Since: 5.0

Rhino.Geometry.Collections.NurbsSurfaceKnotList.RemoveMultipleKnots(System.Int32,System.Int32,System.Double)
Remove multiple knots from this surface
minimumMultiplicity:
Remove knots with multiplicity > minimumKnotMultiplicity
maximumMultiplicity:
Remove knots with multiplicity < maximumKnotMultiplicity
tolerance:
When you remove knots, the shape of the surface is changed.
If tolerance is RhinoMath.UnsetValue, any amount of change is permitted.
If tolerance is >=0, the maximum distance between the input and output
surface is restricted to be <= tolerance.
Returns: number of knots removed on success. 0 if no knots were removed
Since: 6.0

Rhino.Geometry.Collections.NurbsSurfaceKnotList.RemoveKnots(System.Int32,System.Int32)
Remove knots from the knot vector and adjusts the remaining control points to maintain surface position as closely as possible.
The knots from Knots[index0] through Knots[index1 - 1] will be removed.
index0: The starting knot index, where Degree-1 < index0 < index1 <= Points.Count-1.
index1: The ending knot index, where Degree-1 < index0 < index1 <= Points.Count-1.
Returns: true if successful, false on failure.
Since: 6.0

Rhino.Geometry.Collections.NurbsSurfaceKnotList.RemoveKnotsAt(System.Double,System.Double)
Remove knots from the surface and adjusts the remaining control points to maintain surface position as closely as possible.
u: The u parameter on the surface that is closest to the knot to be removed.
v: The v parameter on the surface that is closest to the knot to be removed.
Returns: true if successful, false on failure.
Since: 6.0

Rhino.Geometry.Collections.NurbsSurfaceKnotList.EpsilonEquals(Rhino.Geometry.Collections.NurbsSurfaceKnotList,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:
Since: 5.4