Rhino.NodeInCode.Components
Provides access to all Grasshopper runtime components.

Rhino.NodeInCode.Components.Instance
Gets access to the unique

Rhino.NodeInCode.Components.__getAllFunctions
Returns a collection with all component functions.
For infrastructure usage only.

Rhino.NodeInCode.Components.NodeInCodeFunctions
Returns a collection with all component functions.
Since: 6.0

Rhino.NodeInCode.Components.FindComponent(System.String)
Finds a component given its full name.
fullName: The name, including its library name and a period if it is made by a third-party.
Since: 6.0