Rhino.PrivateMeshCommands.MeshTypes.MeshFromLinesGraph.g_tetrahedron_normals
Tetrahedron normals for size 1

Rhino.PrivateMeshCommands.MeshTypes.MeshFromLinesGraph.FindSmallerAngle(System.Int32,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d@,System.Int32,System.Int32@,System.Boolean@,Rhino.PrivateMeshCommands.MeshTypes.EdgeAddress@,Rhino.Geometry.Vector3d@)
Finds edge with smallest angle