Rhino.Geometry.SweepTwoRail
Utility class for generating Breps by sweeping cross section curves over two rail curves.
Note, this class has been superseded by the Rhino.Geometry.Brep.CreateFromSweep static functions.

Rhino.Geometry.SweepTwoRail.#ctor
Since: 5.0

Rhino.Geometry.SweepTwoRail.SweepTolerance
Gets or sets the sweeping tolerance.
Since: 5.0

Rhino.Geometry.SweepTwoRail.AngleToleranceRadians
Gets or sets the angle tolerance in radians.
Since: 5.0

Rhino.Geometry.SweepTwoRail.MaintainHeight
Removes the association between the height scaling from the width scaling.
Since: 5.0

Rhino.Geometry.SweepTwoRail.ClosedSweep
If the input rails are closed, ClosedSweep determines if the swept Breps will also be closed.
Since: 5.0

Rhino.Geometry.SweepTwoRail.AutoAdjust
Set to true to have shape curves adjusted, sorted, and matched automatically.
This will produce results comparable to Rhino's Sweep2 command.
Set to false to not have shape curves adjusted, sorted, and matched automatically.
Since: 7.19

Rhino.Geometry.SweepTwoRail.UseLegacySweeper
Set to true if you want to use the legacy, low-level sweeper found in earlier versions of Rhino.
Since: 8.8

Rhino.Geometry.SweepTwoRail.PerformSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve)
Sweep2 function that fits a surface through profile curves that define the surface cross-sections
and two curves that defines a surface edge.
rail1: Rail to sweep shapes along.
rail2: Rail to sweep shapes along.
crossSection: Shape curve.
Returns: Array of Brep sweep results.
Since: 5.0

Rhino.Geometry.SweepTwoRail.PerformSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double)
Sweep2 function that fits a surface through profile curves that define the surface cross-sections
and two curves that defines a surface edge.
rail1: Rail to sweep shapes along.
rail2: Rail to sweep shapes along.
crossSection: Shape curve.
crossSectionParameterRail1: Curve parameter on first rail curve. Unused if Rhino.Geometry.SweepTwoRail.UseLegacySweeper is true.
crossSectionParameterRail2: Curve parameter on second rail curve. Unused if Rhino.Geometry.SweepTwoRail.UseLegacySweeper is true.
Returns: Array of Brep sweep results.
Since: 5.0

Rhino.Geometry.SweepTwoRail.PerformSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve})
Sweep2 function that fits a surface through profile curves that define the surface cross-sections
and two curves that defines a surface edge.
rail1: Rail to sweep shapes along.
rail2: Rail to sweep shapes along.
crossSections: Shape curves.
Returns: Array of Brep sweep results.
Since: 5.0

Rhino.Geometry.SweepTwoRail.PerformSweep(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double})
Sweep2 function that fits a surface through profile curves that define the surface cross-sections
and two curves that defines a surface edge.
rail1: Rail to sweep shapes along.
rail2: Rail to sweep shapes along.
crossSections: Cross section curves.
crossSectionParameters1: Curve parameters on first rail curve. Unused if Rhino.Geometry.SweepTwoRail.UseLegacySweeper is true.
crossSectionParameters2: Curve parameters on second rail curve. Unused if Rhino.Geometry.SweepTwoRail.UseLegacySweeper is true.
Returns: Array of Brep sweep results.
Since: 5.0

Rhino.Geometry.SweepTwoRail.PerformSweepRefit(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double)
Sweep2 function that fits a surface through profile curves that define the surface cross-sections
and two curves that defines a surface edge.
rail1: Rail to sweep shapes along.
rail2: Rail to sweep shapes along.
crossSection: Shape curve.
refitTolerance: Refit tolerance.
Returns: Array of Brep sweep results.
Since: 5.0

Rhino.Geometry.SweepTwoRail.PerformSweepRefit(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double,System.Double)
Sweep2 function that fits a surface through profile curves that define the surface cross-sections
and two curves that defines a surface edge.
rail1: Rail to sweep shapes along.
rail2: Rail to sweep shapes along.
crossSection: Shape curve.
crossSectionParameterRail1: Curve parameter on first rail curve. Unused if Rhino.Geometry.SweepTwoRail.UseLegacySweeper is true.
crossSectionParameterRail2: Curve parameter on second rail curve. Unused if Rhino.Geometry.SweepTwoRail.UseLegacySweeper is true.
refitTolerance: Refit tolerance.
Returns: Array of Brep sweep results.
Since: 5.0

Rhino.Geometry.SweepTwoRail.PerformSweepRefit(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Double)
Sweep2 function that fits a surface through profile curves that define the surface cross-sections
and two curves that defines a surface edge.
rail1: Rail to sweep shapes along.
rail2: Rail to sweep shapes along.
crossSections: Shape curves.
refitTolerance: Refit tolerance.
Returns: Array of Brep sweep results.
Since: 5.0

Rhino.Geometry.SweepTwoRail.PerformSweepRefit(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Double)
Sweep2 function that fits a surface through profile curves that define the surface cross-sections
and two curves that defines a surface edge.
rail1: Rail to sweep shapes along.
rail2: Rail to sweep shapes along.
crossSections: Shape curves.
crossSectionParametersRail1: Curve parameters on first rail curve. Unused if Rhino.Geometry.SweepTwoRail.UseLegacySweeper is true.
crossSectionParametersRail2: Curve parameters on second rail curve. Unused if Rhino.Geometry.SweepTwoRail.UseLegacySweeper is true.
refitTolerance: Refit tolerance.
Returns: Array of Brep sweep results.
Since: 5.0

Rhino.Geometry.SweepTwoRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Int32)
Sweep2 function that fits a surface through profile curves that define the surface cross-sections
and two curves that defines a surface edge.
rail1: Rail to sweep shapes along.
rail2: Rail to sweep shapes along.
crossSection: Shape curve.
rebuildCount: Rebuild point count.
Returns: Array of Brep sweep results.
Since: 5.0

Rhino.Geometry.SweepTwoRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Double,System.Double,System.Int32)
Sweep2 function that fits a surface through profile curves that define the surface cross-sections
and two curves that defines a surface edge.
rail1: Rail to sweep shapes along.
rail2: Rail to sweep shapes along.
crossSection: Shape curve.
crossSectionParameterRail1: Curve parameter on first rail curve. Unused if Rhino.Geometry.SweepTwoRail.UseLegacySweeper is true.
crossSectionParameterRail2: Curve parameter on second rail curve. Unused if Rhino.Geometry.SweepTwoRail.UseLegacySweeper is true.
rebuildCount: Rebuild point count.
Returns: Array of Brep sweep results.
Since: 5.0

Rhino.Geometry.SweepTwoRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Int32)
Sweep2 function that fits a surface through profile curves that define the surface cross-sections
and two curves that defines a surface edge.
rail1: Rail to sweep shapes along.
rail2: Rail to sweep shapes along.
crossSections: Shape curves.
rebuildCount: Rebuild point count.
Returns: Array of Brep sweep results.
Since: 5.0

Rhino.Geometry.SweepTwoRail.PerformSweepRebuild(Rhino.Geometry.Curve,Rhino.Geometry.Curve,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},System.Collections.Generic.IEnumerable{System.Double},System.Collections.Generic.IEnumerable{System.Double},System.Int32)
Sweep2 function that fits a surface through profile curves that define the surface cross-sections
and two curves that defines a surface edge.
rail1: Rail to sweep shapes along.
rail2: Rail to sweep shapes along.
crossSections: Shape curves.
crossSectionParametersRail1: Curve parameters on first rail curve. Unused if Rhino.Geometry.SweepTwoRail.UseLegacySweeper is true.
crossSectionParametersRail2: Curve parameters on second rail curve. Unused if Rhino.Geometry.SweepTwoRail.UseLegacySweeper is true.
rebuildCount: Rebuild point count.
Returns: Array of Brep sweep results.
Since: 5.0