Rhino.DocObjects.Custom.UserDictionary
Defines the storage data class for a user dictionary.

Rhino.DocObjects.Custom.UserDictionary.Dictionary
Gets the dictionary that is associated with this class.
This dictionary is unique.
Since: 5.0

Rhino.DocObjects.Custom.UserDictionary.Description
Gets the text "RhinoCommon UserDictionary".
Since: 5.0

Rhino.DocObjects.Custom.UserDictionary.OnDuplicate(Rhino.DocObjects.Custom.UserData)
Clones the user data.
source: The source data.

Rhino.DocObjects.Custom.UserDictionary.ShouldWrite
Writes this entity if the count is larger than 0.
Since: 5.0

Rhino.DocObjects.Custom.UserDictionary.Read(Rhino.FileIO.BinaryArchiveReader)
Is called to read this entity.
archive: An archive.
Returns: Always returns true.

Rhino.DocObjects.Custom.UserDictionary.Write(Rhino.FileIO.BinaryArchiveWriter)
Is called to write this entity.
archive: An archive.
Returns: Always returns true.

Rhino.DocObjects.Custom.UserDictionary.OnGetChangeSerialNumber
Get current change serial number.
Returns: current change serial number