Rhino.Display.DisplayPipelineAttributes.MeshDisplayAttributes.HighlightMeshes
Since: 5.0

Rhino.Display.DisplayPipelineAttributes.MeshDisplayAttributes.AllMeshWiresColor
Color.Empty means that we are NOT using a single color for all mesh wires.
Since: 5.0

Rhino.Display.DisplayPipelineAttributes.MeshDisplayAttributes.MeshWireThickness
Since: 5.0

Rhino.Display.DisplayPipelineAttributes.MeshDisplayAttributes.ShowMeshWires
Since: 5.0

Rhino.Display.DisplayPipelineAttributes.MeshDisplayAttributes.ShowMeshVertices
Since: 5.0