Rhino.Render.Fields.Vector2dField
Vector2d field value class

Rhino.Render.Fields.Vector2dField.#ctor(Rhino.Render.RenderContent,System.IntPtr)
Constructor
renderContent: RenderContent whose Fields owns this filed.
attachToPointer: Existing C++ pointer to attach to.

Rhino.Render.Fields.Vector2dField.Value
Gets or sets the field value
Since: 5.1

Rhino.Render.Fields.Vector2dField.ValueAsObject
Since: 5.7