Rhino.Geometry.Transform
Represents the values in a 4x4 transform matrix.
This is parallel to C++ ON_Xform.

Rhino.Geometry.Transform.#ctor(System.Double)
Initializes a new transform matrix with a specified value along the diagonal.
diagonalValue: Value to assign to all diagonal cells except M33 which is set to 1.0.
Since: 5.0

Rhino.Geometry.Transform.#ctor(Rhino.Geometry.Transform)
Initializes a new transform matrix with a specified value.
value: Value to assign to all cells.
Since: 6.0

Rhino.Geometry.Transform.Identity
Gets a new identity transform matrix. An identity matrix defines no transformation.
Since: 5.0

Rhino.Geometry.Transform.ZeroTransformation
ZeroTransformation diagonal = (0,0,0,1)
Since: 6.1

Rhino.Geometry.Transform.Unset
Gets an XForm filled with RhinoMath.UnsetValue.
Since: 5.0

Rhino.Geometry.Transform.RotationZYX(System.Double,System.Double,System.Double)
Create rotation transformation From Tait-Byran angles (also loosely known as Euler angles).
yaw: Angle, in radians, to rotate about the Z axis.
pitch: Angle, in radians, to rotate about the Y axis.
roll: Angle, in radians, to rotate about the X axis.
Returns: A transform matrix from Tait-Byran angles.
Remarks:
RotationZYX(yaw, pitch, roll) = R_z(yaw) * R_y(pitch) * R_x(roll)
where R_*(angle) is rotation of angle radians about the corresponding world coordinate axis.
Since: 6.11

Rhino.Geometry.Transform.RotationZYZ(System.Double,System.Double,System.Double)
Create rotation transformation From Euler angles.
alpha: Angle, in radians, to rotate about the Z axis.
beta: Angle, in radians, to rotate about the Y axis.
gamma: Angle, in radians, to rotate about the X axis.
Returns: A transform matrix from Euler angles.
Remarks:
RotationZYZ(alpha, beta, gamma) = R_z(alpha) * R_y(beta) * R_z(gamma)
where R_*(angle) is rotation of angle radians about the corresponding *-world coordinate axis.
Note, alpha and gamma are in the range (-pi, pi] while beta in the range [0, pi]
Since: 6.11

Rhino.Geometry.Transform.Translation(Rhino.Geometry.Vector3d)
Constructs a new translation (move) transformation.
motion: Translation (motion) vector.
Returns: A transform matrix which moves geometry along the motion vector.
Since: 5.0

Rhino.Geometry.Transform.Translation(System.Double,System.Double,System.Double)
Constructs a new translation (move) transformation.
Right column is (dx, dy, dz, 1.0).
dx: Distance to translate (move) geometry along the world X axis.
dy: Distance to translate (move) geometry along the world Y axis.
dz: Distance to translate (move) geometry along the world Z axis.
Returns: A transform matrix which moves geometry with the specified distances.
Since: 5.0

Rhino.Geometry.Transform.Diagonal(Rhino.Geometry.Vector3d)
Constructs a new transformation with diagonal (d0,d1,d2,1.0).
diagonal: The diagonal values.
Returns: A transformation with diagonal (d0,d1,d2,1.0).
Since: 6.12

Rhino.Geometry.Transform.Diagonal(System.Double,System.Double,System.Double)
Constructs a new transformation with diagonal (d0,d1,d2,1.0).
d0: Transform.M00 value.
d1: Transform.M11 value.
d2: Transform.M22 value.
Returns: A transformation with diagonal (d0,d1,d2,1.0).
Since: 6.12

Rhino.Geometry.Transform.Scale(Rhino.Geometry.Point3d,System.Double)
Constructs a new uniform scaling transformation with a specified scaling anchor point.
anchor: Defines the anchor point of the scaling operation.
scaleFactor: Scaling factor in all directions.
Returns: A transform matrix which scales geometry uniformly around the anchor point.
Since: 5.0

Rhino.Geometry.Transform.Scale(Rhino.Geometry.Plane,System.Double,System.Double,System.Double)
Constructs a new non-uniform scaling transformation with a specified scaling anchor point.
plane: Defines the center and orientation of the scaling operation.
xScaleFactor: Scaling factor along the anchor plane X-Axis direction.
yScaleFactor: Scaling factor along the anchor plane Y-Axis direction.
zScaleFactor: Scaling factor along the anchor plane Z-Axis direction.
Returns: A transformation matrix which scales geometry non-uniformly.
Since: 5.0

Rhino.Geometry.Transform.Rotation(System.Double,System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Constructs a new rotation transformation with specified angle, rotation center and rotation axis.
sinAngle: Sine of the rotation angle.
cosAngle: Cosine of the rotation angle.
rotationAxis: 3D unit axis of rotation.
rotationCenter: 3D center of rotation.
Returns: A rotation transformation matrix.
Since: 5.0

Rhino.Geometry.Transform.Rotation(System.Double,Rhino.Geometry.Point3d)
Constructs a new rotation transformation with specified angle and rotation center. The axis of rotation is Rhino.Geometry.Vector3d.ZAxis.
angleRadians: Rotation angle in radians.
rotationCenter: 3D center of rotation.
Returns: A rotation transformation matrix.
Since: 5.0

Rhino.Geometry.Transform.Rotation(System.Double,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Constructs a new rotation transformation with specified angle, rotation center and rotation axis.
angleRadians: Rotation angle in radians.
rotationAxis: 3D unit axis of rotation.
rotationCenter: 3D center of rotation.
Returns: A rotation transformation matrix.
Since: 5.0

Rhino.Geometry.Transform.Rotation(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d)
Constructs a new rotation transformation with start and end directions and rotation center.
startDirection: A start direction.
endDirection: An end direction.
rotationCenter: 3D center of rotation.
Returns: A rotation transformation matrix.
Since: 5.0

Rhino.Geometry.Transform.Rotation(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Constructs a transformation that maps X0 to X1, Y0 to Y1, Z0 to Z1.
The frames should be right hand orthonormal frames (unit vectors with Z = X x Y).
The resulting rotation fixes the origin (0,0,0), maps initial X to final X,
initial Y to final Y, and initial Z to final Z.
x0: Initial frame X.
y0: Initial frame Y.
z0: Initial frame Z.
x1: Final frame X.
y1: Final frame Y.
z1: Final frame Z.
Returns: A rotation transformation matrix.
Since: 5.0

Rhino.Geometry.Transform.Mirror(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d)
Create mirror transformation matrix
The mirror transform maps a point Q to
Q - (2*(Q-P)oN)*N, where
P = pointOnMirrorPlane and N = normalToMirrorPlane.
pointOnMirrorPlane: Point on the mirror plane.
normalToMirrorPlane: Normal vector to the mirror plane.
Returns: A transformation matrix which mirrors geometry in a specified plane.
Since: 5.0

Rhino.Geometry.Transform.Mirror(Rhino.Geometry.Plane)
Constructs a new Mirror transformation.
mirrorPlane: Plane that defines the mirror orientation and position.
Returns: A transformation matrix which mirrors geometry in a specified plane.
Since: 5.0

Rhino.Geometry.Transform.TextureMapping(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Construct a UVW Transform from components.
offset:
repeat:
rotation:
Returns:
Since: 8.0

Rhino.Geometry.Transform.PlaneToPlane(Rhino.Geometry.Plane,Rhino.Geometry.Plane)
Create a rotation transformation that orients plane0 to plane1. If you want to orient objects from
one plane to another, use this form of transformation.
plane0: The plane to orient from.
plane1: the plane to orient to.
Returns: The translation transformation if successful, Transform.Unset on failure.
Since: 5.0

Rhino.Geometry.Transform.ChangeBasis(Rhino.Geometry.Plane,Rhino.Geometry.Plane)
Gets a change of basis transformation.
The change of basis transformation is not the same as the rotation transformation that rotates one orthonormal frame to another.
If you have geometry defined with respect to planes, this method takes two planes and computes the transformation to change coordinates from one plane to another.
plane0: Coordinate system in which the geometry is currently described.
plane1: Target coordinate system in which we want the geometry to be described.
Returns:
A change of basis transformation if success, Rhino.Geometry.Transform.Unset on failure.
Remarks:
Change of basis transformations and rotation transformations are often confused.
This is a change of basis transformation.
If Q = P0 + a0*X0 + b0*Y0 + c0*Z0 = P1 + a1*X1 + b1*Y1 + c1*Z1, then this transform will map the point (a0,b0,c0) to (a1,b1,c1).
Since: 5.0

Rhino.Geometry.Transform.ChangeBasis(Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Gets a change of basis transformation.
The change of basis transformation is not the same as the rotation transformation that rotates one orthonormal frame to another.
X0: Initial basis X (can be any 3d basis).
Y0: Initial basis Y (can be any 3d basis).
Z0: Initial basis Z (can be any 3d basis).
X1: Final basis X (can be any 3d basis).
Y1: Final basis Y (can be any 3d basis).
Z1: Final basis Z (can be any 3d basis).
Returns:
A change of basis transformation if success, Rhino.Geometry.Transform.Unset on failure.
Remarks:
Change of basis transformations and rotation transformations are often confused.
This is a change of basis transformation.
If Q = a0*X0 + b0*Y0 + c0*Z0 = a1*X1 + b1*Y1 + c1*Z1, then this transform will map the point (a0,b0,c0) to (a1,b1,c1).
Since: 5.0

Rhino.Geometry.Transform.ChangeBasis(Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Gets a change of basis transformation.
The change of basis transformation is not the same as the rotation transformation that rotates one orthonormal frame to another.
P0: Initial center.
X0: Initial basis X (can be any 3d basis).
Y0: Initial basis Y (can be any 3d basis).
Z0: Initial basis Z (can be any 3d basis).
P1: Final center.
X1: Final basis X (can be any 3d basis).
Y1: Final basis Y (can be any 3d basis).
Z1: Final basis Z (can be any 3d basis).
Returns:
A change of basis transformation if success, Rhino.Geometry.Transform.Unset on failure.
Remarks:
Change of basis transformations and rotation transformations are often confused.
This is a change of basis transformation.
If Q = P0 + a0*X0 + b0*Y0 + c0*Z0 = P1 + a1*X1 + b1*Y1 + c1*Z1, then this transform will map the point (a0,b0,c0) to (a1,b1,c1).
Since: 8.17

Rhino.Geometry.Transform.PlanarProjection(Rhino.Geometry.Plane)
Constructs a projection transformation.
plane: Plane onto which everything will be perpendicularly projected.
Returns: A transformation matrix which projects geometry onto a specified plane.
Since: 5.0

Rhino.Geometry.Transform.ProjectAlong(Rhino.Geometry.Plane,Rhino.Geometry.Vector3d)
Construct a projection onto a plane along a specific direction.
plane: Plane to project onto.
direction: Projection direction, must not be parallel to the plane.
Returns: Projection transformation or identity transformation if projection could not be calculated.
Since: 6.0

Rhino.Geometry.Transform.Shear(Rhino.Geometry.Plane,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d,Rhino.Geometry.Vector3d)
Constructs a Shear transformation.
plane: Base plane for shear.
x: Shearing vector along plane x-axis.
y: Shearing vector along plane y-axis.
z: Shearing vector along plane z-axis.
Returns: A transformation matrix which shear geometry.
Since: 5.0

Rhino.Geometry.Transform.op_Equality(Rhino.Geometry.Transform,Rhino.Geometry.Transform)
Determines if two transformations are equal in value.
a: A transform.
b: Another transform.
Returns: true if transforms are equal; otherwise false.
Since: 5.0

Rhino.Geometry.Transform.op_Inequality(Rhino.Geometry.Transform,Rhino.Geometry.Transform)
Determines if two transformations are different in value.
a: A transform.
b: Another transform.
Returns: true if transforms are different; otherwise false.
Since: 5.0

Rhino.Geometry.Transform.op_Multiply(Rhino.Geometry.Transform,Rhino.Geometry.Transform)
Multiplies (combines) two transformations.
a: First transformation.
b: Second transformation.
Returns: A transformation matrix that combines the effect of both input transformations.
The resulting Transform gives the same result as though you'd first apply B then A.
Since: 5.0

Rhino.Geometry.Transform.op_Multiply(Rhino.Geometry.Transform,Rhino.Geometry.Point3d)
Multiplies a transformation by a point and gets a new point.
m: A transformation.
p: A point.
Returns: The transformed point.
Remarks:
Note well: The right hand column and bottom row have an important effect
when transforming a Euclidean point and have no effect when transforming a vector.
Be sure you understand the differences between vectors and points when applying a 4x4 transformation.
Since: 5.0

Rhino.Geometry.Transform.op_Multiply(Rhino.Geometry.Transform,Rhino.Geometry.Vector3d)
Multiplies a transformation by a vector and gets a new vector.
m: A transformation.
v: A vector.
Returns: The transformed vector.
Remarks:
Note well: The right hand column and bottom row have an important effect
when transforming a Euclidean point and have no effect when transforming a vector.
Be sure you understand the differences between vectors and points when applying a 4x4 transformation.
Since: 5.0

Rhino.Geometry.Transform.Multiply(Rhino.Geometry.Transform,Rhino.Geometry.Transform)
Multiplies (combines) two transformations.
This is the same as the * operator between two transformations.
a: First transformation.
b: Second transformation.
Returns: A transformation matrix that combines the effect of both input transformations.
The resulting Transform gives the same result as though you'd first apply B then A.
Since: 5.0

Rhino.Geometry.Transform.M00
Gets or sets this[0,0].
Since: 5.0

Rhino.Geometry.Transform.M01
Gets or sets this[0,1].
Since: 5.0

Rhino.Geometry.Transform.M02
Gets or sets this[0,2].
Since: 5.0

Rhino.Geometry.Transform.M03
Gets or sets this[0,3].
Since: 5.0

Rhino.Geometry.Transform.M10
Gets or sets this[1,0].
Since: 5.0

Rhino.Geometry.Transform.M11
Gets or sets this[1,1].
Since: 5.0

Rhino.Geometry.Transform.M12
Gets or sets this[1,2].
Since: 5.0

Rhino.Geometry.Transform.M13
Gets or sets this[1,3].
Since: 5.0

Rhino.Geometry.Transform.M20
Gets or sets this[2,0].
Since: 5.0

Rhino.Geometry.Transform.M21
Gets or sets this[2,1].
Since: 5.0

Rhino.Geometry.Transform.M22
Gets or sets this[2,2].
Since: 5.0

Rhino.Geometry.Transform.M23
Gets or sets this[2,3].
Since: 5.0

Rhino.Geometry.Transform.M30
Gets or sets this[3,0].
Since: 5.0

Rhino.Geometry.Transform.M31
Gets or sets this[3,1].
Since: 5.0

Rhino.Geometry.Transform.M32
Gets or sets this[3,2].
Since: 5.0

Rhino.Geometry.Transform.M33
Gets or sets this[3,3].
Since: 5.0

Rhino.Geometry.Transform.Item(System.Int32,System.Int32)
Gets or sets the matrix value at the given row and column indices.
row: Index of row to access, must be 0, 1, 2 or 3.
column: Index of column to access, must be 0, 1, 2 or 3.
Returns: The value at [row, column]
The new value at [row, column]

Rhino.Geometry.Transform.IsIdentity
Return true if this Transform is the identity transform
Since: 6.0

Rhino.Geometry.Transform.IsValid
Gets a value indicating whether or not this Transform is a valid matrix.
A valid transform matrix is not allowed to have any invalid numbers.
Since: 5.0

Rhino.Geometry.Transform.IsZero
True if matrix is Zero4x4, ZeroTransformation, or some other type of
zero. The value xform[3][3] can be anything.
Since: 6.1

Rhino.Geometry.Transform.IsZero4x4
True if all values are 0
Since: 6.1

Rhino.Geometry.Transform.IsZeroTransformation
True if all values are 0, except for M33 which is 1.
Rhino.Geometry.Transform.IsZeroTransformationWithTolerance(System.Double)
Since: 6.1

Rhino.Geometry.Transform.IsZeroTransformaton(System.Double)
True if all values are 0 within tolerance, except for M33 which is exactly 1.
zeroTolerance: The zero tolerance.
Returns: Returns true if all values are 0 within tolerance, except for M33 which is exactly 1.
Rhino.Geometry.Transform.IsZeroTransformationWithTolerance(System.Double)
Since: 6.12
7.1

Rhino.Geometry.Transform.IsZeroTransformationWithTolerance(System.Double)
True if all values are 0 within tolerance, except for M33 which is exactly 1.
zeroTolerance: The tolerance for 0 elements.
Returns:
True if the transformation matrix is ON_Xform::ZeroTransformation, with xform[3][3] equal to 1:
0 0 0 0
0 0 0 0
0 0 0 0
0 0 0 1
An element x of the matrix is "zero" if fabs(x) ≤ zeroTolerance.
IsZeroTransformation is the same as IsZeroTransformationWithTolerance(0.0)
Since: 7.1

Rhino.Geometry.Transform.SimilarityType
Gets a value indicating whether or not the Transform maintains similarity.
The easiest way to think of Similarity is that any circle, when transformed,
remains a circle. Whereas a non-similarity Transform deforms circles into ellipses.
Since: 5.0

Rhino.Geometry.Transform.IsSimilarity(System.Double)
Gets a value indicating whether or not the Transform maintains similarity.
A similarity transformation can be broken into a sequence of a dilation, translation, rotation, and a reflection.
tolerance: The evaluation tolerance.
Returns: The similarity type.
Since: 6.12

Rhino.Geometry.Transform.DecomposeSimilarity(Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Transform@,System.Double)
Decomposes a similarity transformation. The transformation must be affine.
A similarity transformation can be broken into a sequence of a dilation, translation, rotation, and a reflection.
translation: Translation vector.
dilation: Dilation, where dilation lt; 0 if this is an orientation reversing similarity.
rotation: A proper rotation transformation, where R*Transpose(R)=I and Determinant(R)=1.
tolerance: The evaluation tolerance.
Returns: The similarity type.
Remarks:
If X.DecomposeSimilarity(T, d, R, tol) !=0 then X ~ Translation(T)*Diagonal(d)*R
note when d gt;0 the transformation is orientation preserving.
If dilation lt; 0 then Diagonal(dilation) is actually a reflection combined with a true dilation, or
Diagonal(dilation) = Diagonal(-1) * Diagonal(|diagonal|).
Since: 6.12

Rhino.Geometry.Transform.DecomposeTextureMapping(Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@,Rhino.Geometry.Vector3d@)
Decomposition of a uvw transform into components
offset: Offset
repeat: Repear
rotation: Rotation
Since: 8.0

Rhino.Geometry.Transform.RigidType
Gets a value indicating whether or not the Transform is rigid.
A rigid transformation can be broken into  a proper rotation and a translation,
while an isometry transformation could also include a reflection.
Since: 6.12

Rhino.Geometry.Transform.IsRigid(System.Double)
Gets a value indicating whether or not the Transform is rigid.
A rigid transformation can be broken into  a proper rotation and a translation,
while an isometry transformation could also include a reflection.
tolerance: The evaluation tolerance.
Returns: The rigid type.
Since: 6.12

Rhino.Geometry.Transform.DecomposeRigid(Rhino.Geometry.Vector3d@,Rhino.Geometry.Transform@,System.Double)
Decomposes a rigid transformation. The transformation must be affine.
A rigid transformation can be broken into  a proper rotation and a translation,
while an isometry transformation could also include a reflection.
translation: Translation vector.
rotation: Proper rotation transformation, where R*Transpose(R)=I and det(R)=1.
tolerance: The evaluation tolerance.
Returns: The rigid type.
Remarks:
If X.DecomposeRigid(T, R) is 1, then X ~ Translation(T)*R.
If X.DecomposeRigid(T, R) is -1, then X ~ Transform(-1) * Translation(T)*R.
DecomposeRigid will find the closest rotation to the linear part of this transformation.
Since: 6.12

Rhino.Geometry.Transform.IsAffine
Tests for an affine transformation.
A transformation is affine if it is valid and its last row is [0, 0, 0, 1].
An affine transformation can be broken into a linear transformation and a translation.
Since: 6.12

Rhino.Geometry.Transform.IsLinear
Tests for a linear transformation.
A transformation is affine if it is valid and its last row is [0, 0, 0, 1].
If in addition its last column is ( 0, 0, 0, 1)^T then it is linear.
An affine transformation can be broken into a linear transformation and a translation.
Since: 6.12

Rhino.Geometry.Transform.DecomposeAffine(Rhino.Geometry.Vector3d@,Rhino.Geometry.Transform@)
Decomposes an affine transformation.
A transformation is affine if it is valid and its last row is [0, 0, 0, 1].
An affine transformation can be broken into a linear transformation and a translation.
Note, a perspective transformation is not affine.
translation: Translation vector.
linear: Linear transformation.
Returns: True if successful decomposition.
Remarks:
If X.DecomposeAffine(T, L) is true then X == Translation(T)*L.
DecomposeAffine(T,L) succeeds for all affine transformations and is a simple copying of values.
Since: 6.12

Rhino.Geometry.Transform.DecomposeAffine(Rhino.Geometry.Transform@,Rhino.Geometry.Vector3d@)
Decomposes an affine transformation.
A transformation is affine if it is valid and its last row is [0, 0, 0, 1].
An affine transformation can be broken into a linear transformation and a translation.
Note, a perspective transformation is not affine.
linear: Linear transformation.
translation: Translation vector.
Returns: True if successful decomposition.
Remarks:
If X.DecomposeAffine(L, T) is true then X == L* Translation(T).
DecomposeAffine(L, T) may fail for affine transformations if L is not invertible,
and is more computationally expensive then X.DecomposeAffine(T, L).
Since: 6.12

Rhino.Geometry.Transform.DecomposeAffine(Rhino.Geometry.Vector3d@,Rhino.Geometry.Transform@,Rhino.Geometry.Transform@,Rhino.Geometry.Vector3d@)
An affine transformation can be decomposed into a Symmetric, Rotation and Translation.
Then the Symmetric component may be further decomposed as non-uniform scale in an orthonormal
coordinate system.
translation: Translation vector.
rotation: Proper rotation transformation.
orthogonal: Orthogonal basis.
diagonal: Diagonal elements of a Diagonal transformation.
Returns: True if successful decomposition.
Since: 6.12

Rhino.Geometry.Transform.IsRotation
Returns true if this is a proper rotation.
Since: 6.12

Rhino.Geometry.Transform.GetQuaternion(Rhino.Geometry.Quaternion@)
If this transform is a proper rotation, then find the equivalent quaternion.
quaternion: Quaternion that represents this rotation transformation.
Returns: true if this transform is a proper rotation, false otherwise.
Since: 7.12

Rhino.Geometry.Transform.Affineize
Replaces the last row with (0 0 0 1), discarding any perspective part of this transform
Since: 6.12

Rhino.Geometry.Transform.Linearize
Affinitize() and replaces the last column with (0 0 0 1)^T, discarding any translation part of this transform.
Since: 6.12

Rhino.Geometry.Transform.Orthogonalize(System.Double)
Force the linear part of this transformation to be a rotation (or a rotation with reflection).
Use DecomposeRigid(T,R) to find the nearest rotation.
tolerance: The evaluation tolerance
Returns: true if successful, false otherwise.
Since: 6.12

Rhino.Geometry.Transform.DecomposeSymmetric(Rhino.Geometry.Transform@,Rhino.Geometry.Vector3d@)
A Symmetric linear transformation can be decomposed A = Q * Diag * Q ^ T, where Diag is a diagonal
transformation. Diag[i][i] is an eigenvalue of A and the i-th column of Q is a corresponding
unit length eigenvector. Note, this transformation must be Linear and Symmetric.
matrix: An orthonormal matrix of eigenvectors (Q).
diagonal: A vector of eigenvalues.
Returns: true if successful, false otherwise.
Remarks:
If success, this== Q*Diagonal(diagonal) * QT, where QT == Q.Transpose().
If L.IsLinear and LT==L.Transpose then LT*L is symmetric and is a common source of symmetric transformations.
Since: 6.12

Rhino.Geometry.Transform.Determinant
The determinant of this 4x4 matrix.
Since: 5.0

Rhino.Geometry.Transform.GetYawPitchRoll(System.Double@,System.Double@,System.Double@)
Find the Tait-Byran angles (also loosely called Euler angles) for a rotation transformation.
yaw: Angle of rotation, in radians, about the Z axis.
pitch: Angle of rotation, in radians, about the Y axis.
roll: Angle of rotation, in radians, about the X axis.
Returns: If true, then this = RotationZYX(yaw, pitch, roll) = R_z(yaw) * R_y(pitch) * R_x(roll)
where R_*(angle) is rotation of angle radians about the corresponding world coordinate axis.
If false, then this is not a rotation.
Since: 6.11

Rhino.Geometry.Transform.GetEulerZYZ(System.Double@,System.Double@,System.Double@)
Find the Euler angles for a rotation transformation.
alpha: Angle of rotation, in radians, about the Z axis.
beta: Angle of rotation, in radians, about the Y axis.
gamma: Angle of rotation, in radians, about the Z axis.
Returns:
If true, then this = RotationZYZ(alpha, beta, gamma) = R_z(alpha) * R_y(beta) * R_z(gamma)
where R_*(angle) is rotation of angle radians about the corresponding *-world coordinate axis.
If false, then this is not a rotation.
Remarks:
Note, alpha and gamma are in the range (-pi, pi] while beta in the range [0, pi]
Since: 6.11

Rhino.Geometry.Transform.TransformBoundingBox(Rhino.Geometry.BoundingBox)
Computes a new bounding box that is the smallest axis aligned
bounding box that contains the transformed result of its 8 original corner
points.
Returns: A new bounding box.
Since: 5.0

Rhino.Geometry.Transform.TransformList(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Given a list, an array or any enumerable set of points, computes a new array of transformed points.
points: A list, an array or any enumerable set of points to be left untouched and copied.
Returns: A new array.
Since: 5.0

Rhino.Geometry.Transform.Equals(System.Object)
Determines if another object is a transform and its value equals this transform value.
obj: Another object.
Returns: true if obj is a transform and has the same value as this transform; otherwise, false.

Rhino.Geometry.Transform.Equals(Rhino.Geometry.Transform)
Determines if another transform equals this transform value.
other: Another transform.
Returns: true if other has the same value as this transform; otherwise, false.
Since: 5.0

Rhino.Geometry.Transform.GetHashCode
Gets a non-unique hashing code for this transform.
Returns: A number that can be used to hash this transform in a dictionary.

Rhino.Geometry.Transform.ToString
Returns a string representation of this transform.
Returns: A textual representation.

Rhino.Geometry.Transform.TryGetInverse(Rhino.Geometry.Transform@)
Attempts to get the inverse transform of this transform.
inverseTransform: The inverse transform. This out reference will be assigned during this call.
Returns:
true on success.
If false is returned and this Transform is Invalid, inserveTransform will be set to this Transform.
If false is returned and this Transform is Valid, inverseTransform will be set to a pseudo inverse.
Since: 5.0

Rhino.Geometry.Transform.Transpose
Flip row/column values
Returns:
Since: 5.9

Rhino.Geometry.Transform.ToFloatArray(System.Boolean)
Return the matrix as a linear array of 16 float values.
rowDominant:
If true, returns { M00, M01, M02...}.
If false, returns { M00, M10, M20...}.
Returns: An array of 16 floats.
Since: 5.9

Rhino.Geometry.Transform.ToDoubleArray(System.Boolean)
Return the matrix as a linear array of 16 double values.
rowDominant:
If true, returns { M00, M01, M02...}.
If false, returns { M00, M10, M20...}.
Returns: An array of 16 doubles.
Since: 8.0

Rhino.Geometry.Transform.System#ICloneable#Clone
Since: 6.0

Rhino.Geometry.Transform.Clone
Returns a deep copy of the transform. For languages that treat structures as value types, this can
be accomplished by a simple assignment.
Returns: A deep copy of this data structure.
Since: 6.0

Rhino.Geometry.Transform.CompareTo(Rhino.Geometry.Transform)
Compares this transform with another transform.
M33 has highest value, then M32, etc..
other: Another transform.
Returns: -1 if this < other; 0 if both are equal; 1 otherwise.
Since: 5.0