Rhino.FileIO.File3mfWriteOptions
Options for writing a 3mf file

Rhino.FileIO.File3mfWriteOptions.Title
Since: 8.7

Rhino.FileIO.File3mfWriteOptions.Designer
Since: 8.7

Rhino.FileIO.File3mfWriteOptions.Description
Since: 8.7

Rhino.FileIO.File3mfWriteOptions.Copyright
Since: 8.7

Rhino.FileIO.File3mfWriteOptions.LicenseTerms
Since: 8.7

Rhino.FileIO.File3mfWriteOptions.Rating
Since: 8.7

Rhino.FileIO.File3mfWriteOptions.MoveOutputToPositiveXYZOctant
Since: 8.7

Rhino.FileIO.File3mfWriteOptions.Metadata
Since: 8.7

Rhino.FileIO.File3mfWriteOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Since: 8.7