Rhino.DocObjects.Tables.SnapshotTable
All snapshots in a rhino document.

Rhino.DocObjects.Tables.SnapshotTable.Document
Document that owns this table.
Since: 6.7

Rhino.DocObjects.Tables.SnapshotTable.Names
Array of Snapshot names.
Returns:
A string array with the names of all Snapshots in the document.
Since: 6.7