Rhino.FileIO.File3dmLayerTable
Provides access to layers in the 3dm file.

Rhino.FileIO.File3dmLayerTable.ComponentType
Returns Rhino.DocObjects.ModelComponentType.Layer.
Since: 6.0

Rhino.FileIO.File3dmLayerTable.AddLayer(System.String,System.Drawing.Color)
Easy way to add a new layer to the model.
name: Layer name.
color: Layer color.
Returns:
The layer's index (>=0) is returned. Otherwise, RhinoMath.UnsetIntIndex is returned.
Remarks:
Note, the layer name will be modified as needed in the model and manifest.
Since: 7.6

Rhino.FileIO.File3dmLayerTable.AddLayer(System.String,System.Drawing.Color,System.Guid)
Add a new layer to the model.
name: Layer name.
color: Layer color.
parentId: The id of the parent layer, can be Guid.Empty.
Returns:
The layer's index (>=0) is returned. Otherwise, RhinoMath.UnsetIntIndex is returned.
Since: 7.30

Rhino.FileIO.File3dmLayerTable.AddDefaultLayer(System.String,System.Drawing.Color)
Easy way to add a default layer to the model.
name: Layer name.
color: Layer color.
Returns:
The layer's index (>=0) is returned. Otherwise, RhinoMath.UnsetIntIndex is returned.
Remarks:
Note, the layer name will be modified as needed in the model and manifest.
Since: 7.30

Rhino.FileIO.File3dmLayerTable.FindName(System.String,System.Guid)
Finds a Layer given its name.
name: The name of the Layer to be searched.
parentId: The id of the parent Layer to be searched.
Returns: A Layer, or null on error.
Since: 6.0

Rhino.FileIO.File3dmLayerTable.FindNameHash(Rhino.FileIO.NameHash)
Finds a Layer given its name hash.
nameHash: The name hash of the Layer to be searched.
Returns: An Layer, or null on error.
Since: 6.0

Rhino.FileIO.File3dmLayerTable.FindIndex(System.Int32)
Retrieves a Layer object based on Index. This search type of search is discouraged.
We are moving towards using only IDs for all tables.
index: The index to search for.
Returns: A Layer object, or null if none was found.
Since: 6.0