Rhino.Geometry.ControlPoint
Represents control point geometry with three-dimensional position and weight.

Rhino.Geometry.ControlPoint.#ctor(System.Double,System.Double,System.Double)
Constructs a new world 3-D, or Euclidean, control point.
The 4-D representation is (x, y, z, 1.0).
x: X coordinate of the control point.
y: Y coordinate of the control point.
z: Z coordinate of the control point.
Since: 5.0

Rhino.Geometry.ControlPoint.#ctor(System.Double,System.Double,System.Double,System.Double)
Constructs a new homogeneous control point, where the 4-D representation is (x, y, z, w).
The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
x: X coordinate of the control point.
y: Y coordinate of the control point.
z: Z coordinate of the control point.
weight: Weight factor of the control point. You should not use weights less than or equal to zero.
Remarks:
For expert use only. If you do not understand homogeneous coordinates, then
use an override that accepts world 3-D, or Euclidean, coordinates as input.
Since: 5.0

Rhino.Geometry.ControlPoint.#ctor(Rhino.Geometry.Point3d)
Constructs a new world 3-D, or Euclidean, control point.
The 4-D representation of this is (x, y, z, 1.0).
pt: Coordinates of the control point.
Since: 5.0

Rhino.Geometry.ControlPoint.#ctor(Rhino.Geometry.Point3d,System.Double)
Constructs a control point from a world 3-D, or Euclidean, location and a weight.
The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
euclideanPt: Coordinates of the control point.
weight: Weight factor of the control point. You should not use weights less than or equal to zero.
Since: 5.0

Rhino.Geometry.ControlPoint.#ctor(Rhino.Geometry.Point4d)
Constructs a new homogeneous control point, where the 4-D representation is (x, y, z, w).
The world 3-D, or Euclidean, representation is (x/w, y/w, z/w).
pt: Coordinates of the control point.
Remarks:
For expert use only. If you do not understand homogeneous coordinates, then
use an override that accepts world 3-D, or Euclidean, coordinates as input.
Since: 5.0

Rhino.Geometry.ControlPoint.Unset
Gets the predefined, unset control point.
Since: 5.0

Rhino.Geometry.ControlPoint.Location
Gets or sets world 3-D, or Euclidean location of the control point.
Since: 5.0

Rhino.Geometry.ControlPoint.X
Gets or sets the X coordinate of the control point.
Since: 6.0

Rhino.Geometry.ControlPoint.Y
Gets or sets the Y coordinate of the control point.
Since: 6.0

Rhino.Geometry.ControlPoint.Z
Gets or sets the Z coordinate of the control point.
Since: 6.0

Rhino.Geometry.ControlPoint.Weight
Gets or sets the weight of this control point.
Since: 5.0

Rhino.Geometry.ControlPoint.EpsilonEquals(Rhino.Geometry.ControlPoint,System.Double)
Check that all values in other are within epsilon of the values in this
other:
epsilon:
Returns:
Since: 5.4

Rhino.Geometry.ControlPoint.Equals(Rhino.Geometry.ControlPoint)
Determines if two points exactly match.
other: The other point.
Returns: True if the other control point exactly matches this one.
Since: 6.0