Rhino.UI.Controls.IRdkViewModel.GetData(System.Guid,System.Boolean,System.Boolean)
Since: 6.0

Rhino.UI.Controls.IRdkViewModel.Commit(System.Guid)
Since: 6.0

Rhino.UI.Controls.IRdkViewModel.Discard(System.Guid)
Since: 6.0