Rhino.Display.ColorXYZ
Represents an XYZ (Hue, Saturation, Luminance) color with double precision floating point channels.
XYZ colors are based on the CIE 1931 XYZ color space standard and they mimic the natural
sensitivity of cones in the human retina.

Rhino.Display.ColorXYZ.m_a
Alpha values are inverted internally! 0 = opaque; 1 = transparent!

Rhino.Display.ColorXYZ.#ctor(System.Drawing.Color)
Constructs a new instance of ColorXYZ that is equivalent to an ARGB color.
rgb: ARGB color to mimic.
Remarks: Exact conversions between color spaces are often not possible.
Since: 5.0

Rhino.Display.ColorXYZ.#ctor(System.Double,System.Double,System.Double)
Constructs a new instance of ColorXYZ with custom channel values.
x: X channel value, channel will be limited to 0~1.
y: Y channel value, channel will be limited to 0~1.
z: Z channel value, channel will be limited to 0~1.
Since: 5.0

Rhino.Display.ColorXYZ.#ctor(System.Double,System.Double,System.Double,System.Double)
Constructs a new instance of ColorXYZ with custom channel values.
alpha: Alpha channel value, channel will be limited to 0~1.
x: X channel value, channel will be limited to 0~1.
y: Y channel value, channel will be limited to 0~1.
z: Z channel value, channel will be limited to 0~1.
Since: 5.0

Rhino.Display.ColorXYZ.CreateFromRGBA(Rhino.Display.ColorRGBA)
Create the nearest XYZ equivalent of a RGBA color.
rgba: Target color in RGBA space.
Returns: The XYZ equivalent of the RGBA color.
Since: 7.0

Rhino.Display.ColorXYZ.CreateFromHSL(Rhino.Display.ColorHSL)
Create the nearest XYZ equivalent of an HSL color.
hsl: Target color in HSL space.
Returns: The XYZ equivalent of the HSL color.
Since: 5.0

Rhino.Display.ColorXYZ.CreateFromCMYK(Rhino.Display.ColorCMYK)
Create the nearest XYZ equivalent of a CMYK color.
cmyk: Target color in CMYK space.
Returns: The XYZ equivalent of the CMYK color.
Since: 5.0

Rhino.Display.ColorXYZ.CreateFromLAB(Rhino.Display.ColorLAB)
Create the nearest XYZ equivalent of a Lab color.
lab: Target color in LAB space.
Returns: The XYZ equivalent of the LAB color.
Since: 5.0

Rhino.Display.ColorXYZ.CreateFromLCH(Rhino.Display.ColorLCH)
Create the nearest XYZ equivalent of an LCH color.
lch: Target color in LCH space.
Returns: The XYZ equivalent of the LCH color.
Since: 5.0

Rhino.Display.ColorXYZ.CreateFromHSV(Rhino.Display.ColorHSV)
Constructs the nearest XYZ equivalent of an HSV color.
hsv: Target color in HSV space.
Returns: The XYZ equivalent of the HSV color.
Since: 6.0

Rhino.Display.ColorXYZ.op_Implicit(Rhino.Display.ColorXYZ)~System.Drawing.Color
Implicitly converts a XYZ color into a .Net library color.
xyz: A XYZ color.
Returns: A ARGB .Net library color.

Rhino.Display.ColorXYZ.X
Gets or set the X channel value. Channel will be limited to 0~1.
Since: 5.0

Rhino.Display.ColorXYZ.Y
Gets or set the Y channel value. Channel will be limited to 0~1.
Since: 5.0

Rhino.Display.ColorXYZ.Z
Gets or set the Z channel value. Channel will be limited to 0~1.
Since: 5.0

Rhino.Display.ColorXYZ.A
Gets or set the Alpha channel value. Channel will be limited to 0~1.
Since: 5.0