Rhino.PrivateMeshCommands.Operations.Utils.NumberUtil.ZeroToOne``2(``0,``0,System.Single)
(right - left) * leftIsZero + left;
Returns:

Rhino.PrivateMeshCommands.Operations.Utils.NumberUtil.ZeroToOne``2(``0,``0,System.Double)
(right - left) * leftIsZero + left;

Rhino.PrivateMeshCommands.Operations.Utils.NumberUtil.Avarage``2(``0,``0)
(a + b) * 0.5

Rhino.PrivateMeshCommands.Operations.Utils.NumberUtil.FillIntegerArray(System.Int32[])
Fills an array with integers, based 0.
indices: The array to fill. Array must be non-null.

Rhino.PrivateMeshCommands.Operations.Utils.NumberUtil.FillNewIntegerArray(System.Int32)
Returns a new, 0-based array, of count (count) and last element (count-1)
count:
Returns:

Rhino.PrivateMeshCommands.Operations.Utils.NumberUtil.FillNewIntegerArrayWith(System.Int32,System.Int32)
Returns a new, 0-based array, of count elements and filled with value