Rhino.FileIO.FileCsv
Support for writing Csv file format

Rhino.FileIO.FileCsv.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileCsvWriteOptions)
Write a Csv file based on the contents of a RhinoDoc
path: path to write a file to
doc: document to get geometry from
options: options used for generating the Csv file
Returns: true on success
Since: 8.0