Rhino.Runtime.RhinoAccounts.RhinoAccoountsProgressInfo
This class is designed to convey the progress of an asynchronous operation through .NET's System.IProgress`1 interface.
It can be used by callers of such tasks to relay the tasks' progress, as well as useful metadata information that may be of interest.

Rhino.Runtime.RhinoAccounts.RhinoAccoountsProgressInfo.#ctor(Rhino.Runtime.RhinoAccounts.ProgressState,System.Collections.Generic.Dictionary{System.Object,System.Object},System.String)
Creates a new instance.
state: The state to report.
metadata: Optional. Any metadata of interest that may be used by the caller of a task.
customDescription: Optional. If a non-null value is passed, it will override the default description of the instance.

Rhino.Runtime.RhinoAccounts.RhinoAccoountsProgressInfo.Metadata
Any metadata of interest that may be used by the caller of a task.
Since: 7.0

Rhino.Runtime.RhinoAccounts.RhinoAccoountsProgressInfo.Description
A localized description of the state that may be shown to the user of the application.
Since: 7.0

Rhino.Runtime.RhinoAccounts.RhinoAccoountsProgressInfo.State
The state to report.
Since: 7.0