Rhino.Input.Custom.GetCone
Class provides user interface to define a cone.

Rhino.Input.Custom.GetCone.#ctor
Since: 6.0

Rhino.Input.Custom.GetCone.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Input.Custom.GetCone.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 6.0

Rhino.Input.Custom.GetCone.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.Input.Custom.GetCone.ConeConstraint
State of the cone/cylinder constraint option. When the cone/cylinder option is
selected, the circle is being made as a base for a cone/cylinder.
By default the vertical cone/cylinder option not available but is not
selected.  By default the "Vertical" option applies to VerticalCircle.
Since: 6.0

Rhino.Input.Custom.GetCone.DefaultSize
Default radius or diameter (based on InDiameterMode)
Since: 6.0

Rhino.Input.Custom.GetCone.InDiameterMode
Determines if the "size" value is representing a radius or diameter
Since: 6.0

Rhino.Input.Custom.GetCone.ApexAngleDegrees
Since: 6.0

Rhino.Input.Custom.GetCone.BaseAngleDegrees
Since: 6.0

Rhino.Input.Custom.GetCone.Height
Since: 6.0

Rhino.Input.Custom.GetCone.Cap
Gets or sets whether or not the output should be capped.
Since: 6.0

Rhino.Input.Custom.GetCone.AllowInputAngle
Since: 6.0

Rhino.Input.Custom.GetCone.Get(Rhino.Geometry.Cone@)
Prompt for the getting of a cone.
cone: The cone geometry defined by the user.
Returns: The result of the getting operation.
Since: 6.0

Rhino.Input.Custom.GetCone.GetMesh(System.Int32@,System.Int32@,Rhino.Geometry.Cone@)
Prompt for the getting of a mesh cone.
verticalFaces: The number of faces in the vertical direction.
aroundFaces: The number of faces in the around direction
cone: The cone geometry defined by the user.
Returns: The result of the getting operation.
Since: 7.0

Rhino.Input.Custom.GetCone.GetMesh(System.Int32@,System.Int32@,System.Int32@,Rhino.Geometry.Cone@)
Prompt for the getting of a mesh cone.
verticalFaces: The number of faces in the vertical direction.
aroundFaces: The number of faces in the around direction
capStyle: Set to 0 if you don't want the prompt, 3 is triangles, 4 is quads.
cone: The cone geometry defined by the user.
Returns: The result of the getting operation.
Remarks: The prompt for capStyle will only be seen if it's not zero, aroundFaces is even
and the solid option is on.
Since: 7.0