Rhino.Render.DocumentOrFreeFloatingBase
Base class for Rhino.Render objects that are owned by the document, or can be delivered separately
from other functions.  In general, you cannot create these objects yourself.

Rhino.Render.DocumentOrFreeFloatingBase.BeginChange(Rhino.Render.RenderContent.ChangeContexts)
Since: 6.0
8.0
[Obsolete("This is no longer needed and is not implemented")]

Rhino.Render.DocumentOrFreeFloatingBase.EndChange
Since: 6.0
8.0
[Obsolete("This is no longer needed and is not implemented")]