Rhino.Render.CustomRenderContentAttribute
Attributes for RenderContent

Rhino.Render.CustomRenderContentAttribute.#ctor(System.String,System.Boolean,System.String,System.Boolean,System.Boolean,System.Boolean)
Since: 6.0

Rhino.Render.CustomRenderContentAttribute.#ctor(System.String,System.Boolean,System.String,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Since: 6.16

Rhino.Render.CustomRenderContentAttribute.RenderEngineId
Since: 6.0

Rhino.Render.CustomRenderContentAttribute.ImageBased
Since: 6.0

Rhino.Render.CustomRenderContentAttribute.IsLinear
Since: 6.16

Rhino.Render.CustomRenderContentAttribute.IsHdrCapable
Since: 6.16

Rhino.Render.CustomRenderContentAttribute.IsNormalMap
Since: 6.16

Rhino.Render.CustomRenderContentAttribute.Category
Since: 6.0

Rhino.Render.CustomRenderContentAttribute.IsElevated
Since: 6.0

Rhino.Render.CustomRenderContentAttribute.IsBuiltIn
Since: 6.0

Rhino.Render.CustomRenderContentAttribute.IsPrivate
Since: 6.0