Rhino.FileIO.FileGtsWriteOptions
Options for writing a Gts file

Rhino.FileIO.FileGtsWriteOptions.MeshingParameters
Since: 8.0

Rhino.FileIO.FileGtsWriteOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0