Rhino.Render.ConvertibleExtensions
Extension methods for IConvertible that work when
an object is a Variant.

Rhino.Render.ConvertibleExtensions.ToColor4f(System.IConvertible)
Since: 6.0

Rhino.Render.ConvertibleExtensions.ToVector2d(System.IConvertible)
Since: 6.0

Rhino.Render.ConvertibleExtensions.ToVector3d(System.IConvertible)
Since: 6.0