Rhino.DocObjects.HatchPattern.Defaults.Solid
Since: 6.0

Rhino.DocObjects.HatchPattern.Defaults.Hatch1
Since: 6.0

Rhino.DocObjects.HatchPattern.Defaults.Hatch2
Since: 6.0

Rhino.DocObjects.HatchPattern.Defaults.Hatch3
Since: 6.0

Rhino.DocObjects.HatchPattern.Defaults.Dash
Since: 6.0

Rhino.DocObjects.HatchPattern.Defaults.Grid
Since: 6.0

Rhino.DocObjects.HatchPattern.Defaults.Grid60
Since: 6.0

Rhino.DocObjects.HatchPattern.Defaults.Plus
Since: 6.0

Rhino.DocObjects.HatchPattern.Defaults.Squares
Since: 6.0