Rhino.Geometry.AngularDimension
Represents a dimension of an entity that can be measured with an angle.

Rhino.Geometry.AngularDimension.#ctor
Constructs an angular dimension.
Since: 6.0

Rhino.Geometry.AngularDimension.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor used in serialization.

Rhino.Geometry.AngularDimension.#ctor(Rhino.Geometry.Arc,System.Double)
Constructs an angular dimension from a given arc.
arc: The start and end points of the arc are the start and endpoints of the dimension
offset: How far to offset the dimension location from the arc
Since: 5.0

Rhino.Geometry.AngularDimension.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Constructs an angular dimension with extension lines starting at plane origin (arc center).
plane: Dimension's plane.
horizontal: Horizontal reference direction.
centerpoint: Dimension center point.
defpoint1: Point on first extension line.
defpoint2: Point on second extension line.
dimlinepoint: Point on dimension arc.
Since: 8.0

Rhino.Geometry.AngularDimension.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Constructs an angular dimension from parameters.
plane: The dimension's plane.
horizontal: The horizontal direction.
extpoint1: Start of first extension line.
extpoint2: start of second extension line.
dirpoint1: point on first extension vector.
dirpoint2: Spoint on second extension vector.
dimlinepoint: point on dimension line.
Since: 8.0

Rhino.Geometry.AngularDimension.#ctor(Rhino.Geometry.Line,Rhino.Geometry.Point3d,Rhino.Geometry.Line,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean)
Constructs an angular dimension between the lines.
If the lines intersect in a single point, that point is used as the center
of the angular dimension arc.In this case, there are eight possible angles
to dimension.The pointOnAngularDimensionArc and pointOnLine parameters
are used to select the correct angle to dimension. If a pointOnLine parameter
is not set, the corresponding line's midpoint is used.
If the lines are colinear, the point on the line closest to
pointOnAngularDimensionArc is the center of the angular dimension arc.
line1: The first line.
pointOnLine1:
If specified, indicates which semi-infinite portion of line1 to dimension.
Otherwise the midpoint of line1 as a segment is used.
When in doubt, use Point3d.Unset.
line2: The second line.
If specified, indicates which semi-infinite portion of line2 to dimension.
Otherwise the midpoint of line2 as a segment is used.
When in doubt, use Point3d.Unset.
pointOnLine2:
pointOnAngularDimensionArc:
A point on the interior of the angular dimension arc.
bSetExtensionPoints:
If bSetExtensionPoints is true, and a pointOnLine parameter is valid,
that point is used as the extension point.
Otherwise the angular dimension arc endpoint is used.
Since: 8.0

Rhino.Geometry.AngularDimension.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Creates an angular dimension with extension lines starting at plane origin (arc center).
dimStyle: Dimension's dimension style
plane: Dimension's plane.
horizontal: Horizontal reference direction.
centerpoint: Dimension center point.
defpoint1: Point on first extension line.
defpoint2: Point on second extension line.
dimlinepoint: Point on dimension arc.
Returns: The angular dimension if successful, null otherwise.
Since: 6.0

Rhino.Geometry.AngularDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Updates dimension geometry from point locations.
plane: Dimension's plane
centerpoint: Dimension's center point
defpoint1: Point on first extension line.
defpoint2: Point on second extension line.
dimlinepoint: Point on dimension arc.
Returns: True if successful, false otherwise.
Since: 6.0

Rhino.Geometry.AngularDimension.Create(System.Guid,Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
8.0

Rhino.Geometry.AngularDimension.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.Vector3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Creates an angular dimension from parameters.
dimStyle: The dimension style.
plane: The dimension's plane.
horizontal: The horizontal direction.
extpoint1: Start of first extension line.
extpoint2: start of second extension line.
dirpoint1: point on first extension vector.
dirpoint2: Spoint on second extension vector.
dimlinepoint: point on dimension line.
Returns:
Since: 8.0

Rhino.Geometry.AngularDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Update angular dimension from point locations.
plane: Dimension's plane
extpoint1: Start of first extension line.
extpoint2: start of second extension line.
dirpoint1: point on first extension vector.
dirpoint2: Spoint on second extension vector.
dimlinepoint: point on dimension line.
Returns: True if successful, false otherwise.
Since: 6.0

Rhino.Geometry.AngularDimension.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Line,Rhino.Geometry.Point3d,Rhino.Geometry.Line,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Boolean)
The angle between the lines is dimensioned.
If the lines intersect in a single point, that point is used as the center
of the angular dimension arc.In this case, there are eight possible angles
to dimension.The pointOnAngularDimensionArc and pointOnLine parameters
are used to select the correct angle to dimension. If a pointOnLine parameter
is not set, the corresponding line's midpoint is used.
If the lines are colinear, the point on the line closest to
pointOnAngularDimensionArc is the center of the angular dimension arc.
dimStyle: Dimension style.
line1: The first line.
pointOnLine1:
If specified, indicates which semi-infinite portion of line1 to dimension.
Otherwise the midpoint of line1 as a segment is used.
When in doubt, use Point3d.Unset.
line2: The second line.
If specified, indicates which semi-infinite portion of line2 to dimension.
Otherwise the midpoint of line2 as a segment is used.
When in doubt, use Point3d.Unset.
pointOnLine2:
pointOnAngularDimensionArc:
A point on the interior of the angular dimension arc.
bSetExtensionPoints:
If bSetExtensionPoints is true, and a pointOnLine parameter is valid,
that point is used as the extension point.
Otherwise the angular dimension arc endpoint is used.
Returns: The angular dimension if successful, null otherwise.
Since: 8.0

Rhino.Geometry.AngularDimension.Get3dPoints(Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)
Get locations of dimension's 3d points
centerpoint: Dimension's center point
defpoint1: First definition point
defpoint2: Second definition point
arrowpoint1: First arrow point
arrowpoint2: Second arrow point
dimlinepoint: Point on dimension line
textpoint: Text location point
Returns:
Since: 6.0

Rhino.Geometry.AngularDimension.CenterPoint
Since: 6.0

Rhino.Geometry.AngularDimension.DefPoint1
Since: 6.0

Rhino.Geometry.AngularDimension.DefPoint2
Since: 6.0

Rhino.Geometry.AngularDimension.DimlinePoint
Since: 6.0

Rhino.Geometry.AngularDimension.ArrowPoint1
Since: 6.0

Rhino.Geometry.AngularDimension.ArrowPoint2
Since: 6.0

Rhino.Geometry.AngularDimension.GetTextRectangle(Rhino.Geometry.Point3d[]@)
Since: 6.0

Rhino.Geometry.AngularDimension.GetDisplayLines(Rhino.DocObjects.DimensionStyle,System.Double,Rhino.Geometry.Line[]@,Rhino.Geometry.Arc[]@)
Since: 6.0

Rhino.Geometry.AngularDimension.GetAngleDisplayText(Rhino.DocObjects.DimensionStyle)
Since: 6.0

Rhino.Geometry.AngularDimension.AngleFormat
Since: 6.0

Rhino.Geometry.AngularDimension.AngleResolution
Since: 6.0

Rhino.Geometry.AngularDimension.AngleRoundoff
Since: 6.0

Rhino.Geometry.AngularDimension.AngleZeroSuppression
Since: 6.0