Rhino.DocObjects.Tables.ObjectTable.Document
Gets the document that owns this object table.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Find(System.Guid)
Please use FindId().
objectId: Do not use this method.
Returns: Do not use this method.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.FindId(System.Guid)
Uses the object guid to find a rhino object. Deleted objects cannot be found by id.
The guid is the value that is stored on RhinoObject.Id
In a single document, no two active objects have the same guid. If an object is
replaced with a new object, then the guid  persists. For example, if the _Move command
moves an object, then the moved object inherits it's guid from the starting object.
If the Copy command copies an object, then the copy gets a new guid. This guid persists
through file saving/opening operations. This function will not find grip objects.
id: ID of object to search for.
Returns: Reference to the rhino object with the objectId or null if no such object could be found.
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.TryFindPoint(System.Guid,Rhino.Geometry.Point3d@)
Finds the location of a point, if a point exists in the document.
id: ID of point object to search for.
point: The point will be passed here.
Returns: true on success; false if point was not found, id represented another geometry type, or on error.
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.FindGeometry(System.Guid)
Same as FindId, but returns the Geometry property directly, if it exists.
id: ID of object to search for.
Returns: Reference to the geometry in the rhino object with the objectId or null if no such object could be found.
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.Find(System.UInt32)
Use the object runtime serial number to find a rhino object in the document. This is the value stored on
RhinoObject.RuntimeObjectSerialNumber. The RhinoObject constructor sets the runtime serial number and every
instance of a RhinoObject class will have a unique serial number for the duration of the Rhino application.
If an object is replaced with a new object, then the new object will have a different runtime serial number.
Deleted objects stored in the undo list maintain their runtime serial numbers and this function will return
pointers to these objects. Call RhinoObject.IsDeleted if you need to determine if the returned object is
active or deleted.  The runtime serial number is not saved in files.
runtimeSerialNumber: Runtime serial number to search for.
Returns: Reference to the rhino object with the objectId or null if no such object could be found.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.FindByGroup(System.Int32)
Finds all RhinoObjects that are in a given group.
groupIndex: Index of group to search for.
Returns: An array of objects that belong to the specified group or null if no objects could be found.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.FindByLayer(Rhino.DocObjects.Layer)
Finds all RhinoObjects that are in a given layer.
layer: Layer to search.
Returns:
Array of objects that belong to the specified group or null if no objects could be found.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.FindByLayer(System.String)
Finds all RhinoObjects that are in a given layer.
layerName: Name of layer to search.
Returns:
Array of objects that belong to the specified group or null if no objects could be found.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.FindByFilter(Rhino.DocObjects.ObjectEnumeratorSettings)
Same as GetObjectList but converts the result to an array.
filter: The Rhino.DocObjects.ObjectEnumeratorSettings filter to customize inclusion requirements.
Returns: A Rhino object array. This array can be empty but not null.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.FindByObjectType(Rhino.DocObjects.ObjectType)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.FindByUserString(System.String,System.String,System.Boolean)
Finds all objects whose UserString matches the search patterns.
key: Search pattern for UserString keys (supported wildcards are: ? = any single character, * = any sequence of characters).
value: Search pattern for UserString values (supported wildcards are: ? = any single character, * = any sequence of characters).
caseSensitive: If true, string comparison will be case sensitive.
Returns: An array of all objects whose UserString matches with the search patterns or null when no such objects could be found.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.FindByUserString(System.String,System.String,System.Boolean,System.Boolean,System.Boolean,Rhino.DocObjects.ObjectType)
Finds all objects whose UserString matches the search patterns.
key: Search pattern for UserString keys (supported wildcards are: ? = any single character, * = any sequence of characters).
value: Search pattern for UserString values (supported wildcards are: ? = any single character, * = any sequence of characters).
caseSensitive: If true, string comparison will be case sensitive.
searchGeometry: If true, UserStrings attached to the geometry of an object will be searched.
searchAttributes: If true, UserStrings attached to the attributes of an object will be searched.
filter: Object type filter.
Returns: An array of all objects whose UserString matches with the search patterns or null when no such objects could be found.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.FindByUserString(System.String,System.String,System.Boolean,System.Boolean,System.Boolean,Rhino.DocObjects.ObjectEnumeratorSettings)
Finds all objects whose UserString matches the search patterns.
key: Search pattern for UserString keys (supported wildcards are: ? = any single character, * = any sequence of characters).
value: Search pattern for UserString values (supported wildcards are: ? = any single character, * = any sequence of characters).
caseSensitive: If true, string comparison will be case sensitive.
searchGeometry: If true, UserStrings attached to the geometry of an object will be searched.
searchAttributes: If true, UserStrings attached to the attributes of an object will be searched.
filter: Rhino.DocObjects.ObjectEnumeratorSettings filter used to restrict the number of objects searched.
Returns: An array of all objects whose UserString matches with the search patterns or null when no such objects could be found.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.FindByDrawColor(System.Drawing.Color,System.Boolean)
Finds all objects whose draw color matches a given color.
drawColor: The alpha value of this color is ignored.
includeLights: true if lights should be included.
Returns: An array of Rhino document objects. This array can be empty.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.FindByWindowRegion(Rhino.Display.RhinoViewport,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Boolean,Rhino.DocObjects.ObjectType)
Finds objects bounded by a polyline region
viewport: viewport to use for selection
region: list of points that define the
inside: should objects returned be the ones inside of this region (or outside)
filter: filter down list by object type
Returns: An array of RhinoObjects that are inside of this region
Since: 5.7

Rhino.DocObjects.Tables.ObjectTable.FindByWindowRegion(Rhino.Display.RhinoViewport,Rhino.Geometry.Point2d,Rhino.Geometry.Point2d,System.Boolean,Rhino.DocObjects.ObjectType)
Finds objects bounded by a polyline region
viewport: viewport to use for selection
screen1: first screen corner
screen2: second screen corner
inside: should objects returned be the ones inside of this region (or outside)
filter: filter down list by object type
Returns: An array of RhinoObjects that are inside of this region
Since: 5.8

Rhino.DocObjects.Tables.ObjectTable.FindByCrossingWindowRegion(Rhino.Display.RhinoViewport,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},System.Boolean,Rhino.DocObjects.ObjectType)
Finds objects bounded by a polyline region
viewport: viewport to use for selection
region: list of points that define the
inside: should objects returned be the ones inside of this region (or outside)
filter: filter down list by object type
Returns: An array of RhinoObjects that are inside of this region
Since: 5.7

Rhino.DocObjects.Tables.ObjectTable.FindByCrossingWindowRegion(Rhino.Display.RhinoViewport,Rhino.Geometry.Point2d,Rhino.Geometry.Point2d,System.Boolean,Rhino.DocObjects.ObjectType)
Finds objects bounded by a region
viewport: viewport to use for selection
screen1: first screen corner
screen2: second screen corner
inside: should objects returned be the ones inside of this region (or outside)
filter: filter down list by object type
Returns: An array of RhinoObjects that are inside of this region
Since: 5.8

Rhino.DocObjects.Tables.ObjectTable.FindClippingPlanesForViewport(Rhino.Display.RhinoViewport)
Finds all of the visible clipping plane objects that actively clip a viewport.
viewport: The viewport in which clipping planes are searched.
Returns: An array of clipping plane objects. The array can be empty but not null.
Remarks:
Hidden clipping planes, and clipping planes on hidden layers, are not included in
the results even though they continue to clip geometry in the viewport. Call
Rhino.DocObjects.Tables.ObjectTable.FindClippingPlanesForViewport(Rhino.Display.RhinoViewport,System.Boolean) with
includeHidden set to true to get every plane that clips the viewport.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.FindClippingPlanesForViewport(Rhino.Display.RhinoViewport,System.Boolean)
Finds all of the clipping plane objects that actively clip a viewport.
viewport: The viewport in which clipping planes are searched.
includeHidden:
When true, clipping planes that are hidden, or that are on hidden layers, are
included in the results. Such planes still clip geometry in the viewport, so pass
true when you need the complete set of planes affecting what is displayed.
Returns: An array of clipping plane objects. The array can be empty but not null.
Since: 8.35

Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.Custom.CustomMeshObject)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.Custom.CustomMeshObject,Rhino.DocObjects.HistoryRecord)
Since: 6.1

Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.MeshObject,Rhino.Geometry.Mesh)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.Custom.CustomBrepObject)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.Custom.CustomBrepObject,Rhino.DocObjects.HistoryRecord)
Since: 6.1

Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.BrepObject,Rhino.Geometry.Brep)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.Custom.CustomPointObject)
Since: 5.6

Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.Custom.CustomPointObject,Rhino.DocObjects.HistoryRecord)
Since: 6.1

Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.PointObject,Rhino.Geometry.Point)
Since: 5.6

Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.CurveObject,Rhino.Geometry.Curve)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddRhinoObject(Rhino.DocObjects.Custom.CustomCurveObject,Rhino.DocObjects.HistoryRecord)
Since: 6.1

Rhino.DocObjects.Tables.ObjectTable.Add(Rhino.Geometry.GeometryBase)
Adds geometry that is not further specified.
This is meant, for example, to handle addition of sets of different geometrical entities.
geometry: The base geometry. This cannot be null.
Returns: The new object ID on success.
Throws System.ArgumentNullException: If geometry is null.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Add(Rhino.Geometry.GeometryBase,Rhino.DocObjects.ObjectAttributes)
Adds geometry that is not further specified.
This is meant, for example, to handle addition of sets of different geometrical entities.
geometry: The base geometry. This cannot be null.
attributes: The object attributes. This can be null.
Returns: The new object ID on success.
Throws System.ArgumentNullException: If geometry is null.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Add(Rhino.Geometry.GeometryBase,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds geometry that is not further specified.
This is meant, for example, to handle addition of sets of different geometrical entities.
geometry: The base geometry. This cannot be null.
attributes: The object attributes. This can be null.
history: The history information that will be saved.
reference: If reference is true, object will not be saved in the 3dm file.
Returns: The new object ID on success.
Throws System.ArgumentNullException: If geometry is null.
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.HistoryRecordCount
Returns the amount of history records in this document.
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.AddPoint(System.Double,System.Double,System.Double)
Adds a point object to the document.
x: X component of point coordinate.
y: Y component of point coordinate.
z: Z component of point coordinate.
Returns: A unique identifier for the object..
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddPoint(Rhino.Geometry.Point3d)
Adds a point object to the document.
point: location of point.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddPoint(Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes)
Adds a point object to the document.
point: location of point.
attributes: attributes to apply to point. null is acceptable
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddPoint(Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds a point object to the document
point: location of point
attributes: attributes to apply to point. null is acceptable
history: history associated with this point. null is acceptable
reference:
true if the object is from a reference file.  Reference objects do
not persist in archives
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddPoint(Rhino.Geometry.Point,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds a point object and its geometry-linked information to the document
point: A point geometry class.
attributes: attributes to apply to point. null is acceptable
history: history associated with this point. null is acceptable
reference:
true if the object is from a reference file.  Reference objects do
not persist in archives
Returns: A unique identifier for the object.
Throws System.ArgumentNullException: If point is null.
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.AddPoint(Rhino.Geometry.Point3f)
Adds a point object to the document.
point: location of point.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddPoint(Rhino.Geometry.Point3f,Rhino.DocObjects.ObjectAttributes)
Adds a point object to the document.
point: location of point.
attributes: attributes to apply to point.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Adds multiple points to the document.
points: Points to add.
Returns: List of object ids.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.DocObjects.ObjectAttributes)
Adds multiple points to the document.
points: Points to add.
attributes: Attributes to apply to point objects.
Returns: List of object ids.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3f})
Adds multiple points to the document.
points: Points to add.
Returns: List of object ids.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddPoints(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3f},Rhino.DocObjects.ObjectAttributes)
Adds multiple points to the document.
points: Points to add.
attributes: Attributes to apply to point objects.
Returns: List of object ids.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddPointCloud(Rhino.Geometry.PointCloud)
Adds a point cloud object to the document.
cloud: PointCloud to add.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddPointCloud(Rhino.Geometry.PointCloud,Rhino.DocObjects.ObjectAttributes)
Adds a point cloud object to the document.
cloud: PointCloud to add.
attributes: Attributes to apply to point cloud.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddPointCloud(Rhino.Geometry.PointCloud,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds a point cloud object to the document.
cloud: PointCloud to add.
attributes: Attributes to apply to point cloud. null is acceptable
history: history associated with this point cloud. null is acceptable
reference:
true if the object is from a reference file.  Reference objects do
not persist in archives
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddOrderedPointCloud(System.Int32,System.Int32,System.Int32,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds a point cloud object to the document.
xCt: Number of points in X dir.
yCt: Number of points in Y dir.
zCt: Number of points in Z dir.
min: point at x0,y0,z0 of bounding box of the pointcloud
max: point at x1,y1,z1 of bounding box of the pointcloud
attributes: Attributes to apply to point cloud. null is acceptable
history: history associated with this point cloud. null is acceptable
reference:
true if the object is from a reference file.  Reference objects do
not persist in archives
Returns: A unique identifier for the object.
Since: 8.0

Rhino.DocObjects.Tables.ObjectTable.AddOrderedPointCloud(System.Int32,System.Int32,System.Int32,Rhino.Geometry.Point3d[],Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds a point cloud object to the document.
xCt: Number of points in X dir.
yCt: Number of points in Y dir.
zCt: Number of points in Z dir.
box: box to use for output, does not need to be a boundingbox.  The function that takes to points assumes it's a bounding box.
attributes: Attributes to apply to point cloud. null is acceptable
history: history associated with this point cloud. null is acceptable
reference:
true if the object is from a reference file.  Reference objects do
not persist in archives
Returns: A unique identifier for the object.
Since: 8.0

Rhino.DocObjects.Tables.ObjectTable.AddPointCloud(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Adds a point cloud object to the document.
points: A list, an array or any enumerable set of points.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddPointCloud(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.DocObjects.ObjectAttributes)
Adds a point cloud object to the document.
points: A list, an array or any enumerable set of points.
attributes: attributes to apply to point cloud.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddPointCloud(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds a point cloud object to the document.
points: A list, an array or any enumerable set of points
attributes: Attributes to apply to point cloud. null is acceptable
history: history associated with this point cloud. null is acceptable
reference:
true if the object is from a reference file.  Reference objects do
not persist in archives
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddClippingPlane(Rhino.Geometry.Plane,System.Double,System.Double,System.Guid)
Adds a clipping plane object to Rhino.
plane: The plane value.
uMagnitude: The size in the U direction.
vMagnitude: The size in the V direction.
clippedViewportId: Viewport ID that the new clipping plane will clip.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddClippingPlane(Rhino.Geometry.Plane,System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Guid})
Adds a clipping plane object to Rhino.
plane: The plane value.
uMagnitude: The size in the U direction.
vMagnitude: The size in the V direction.
clippedViewportIds: A list, an array or any enumerable set of viewport IDs
that the new clipping plane will clip.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddClippingPlane(Rhino.Geometry.Plane,System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Guid},Rhino.DocObjects.ObjectAttributes)
Adds a clipping plane object to Rhino.
plane: The plane value.
uMagnitude: The size in the U direction.
vMagnitude: The size in the V direction.
clippedViewportIds: A list, an array or any enumerable set of viewport IDs
that the new clipping plane will clip.
attributes: Document attributes for the plane.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddClippingPlane(Rhino.Geometry.Plane,System.Double,System.Double,System.Guid,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddClippingPlane(Rhino.Geometry.Plane,System.Double,System.Double,System.Collections.Generic.IEnumerable{System.Guid},Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddRadialDimension(Rhino.Geometry.RadialDimension)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddRadialDimension(Rhino.Geometry.RadialDimension,Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddRadialDimension(Rhino.Geometry.RadialDimension,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds a radial dimension object to the document.
dimension: Dimension object to add.
attributes: Attributes to apply to dimension.
history: Object history to save.
reference: If reference, then object will not be saved into the 3dm file.
Returns: The Guid of the newly added object or Guid.Empty on failure.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddRectangle(Rhino.Geometry.Rectangle3d)
Adds a rectangle to the object table.
rectangle: The rectangle.
Returns: The ID.
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.AddRectangle(Rhino.Geometry.Rectangle3d,Rhino.DocObjects.ObjectAttributes)
Adds a rectangle to the object table.
rectangle: The rectangle.
attributes: Attributes that will be linked with the surface object.
Returns: The ID.
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.AddRectangle(Rhino.Geometry.Rectangle3d,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds a rectangle to the object table.
rectangle: The rectangle.
attributes: Attributes that will be linked with the surface object.
history: History data records.
reference: If a reference, object will not be saved in the document.
Returns: The ID.
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.AddBox(Rhino.Geometry.Box)
Adds a box to the object table.
box: The box.
Returns: The ID.
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.AddBox(Rhino.Geometry.Box,Rhino.DocObjects.ObjectAttributes)
Adds a box to the object table.
box: The box.
attributes: Attributes that will be linked with the surface object.
Returns: The ID.
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.AddBox(Rhino.Geometry.Box,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds a box to the object table, as an extrusion.
box: The box.
attributes: Attributes that will be linked with the surface object.
history: History data records.
reference: If a reference, object will not be saved in the document.
Returns: The ID.
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.AddLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d)
Adds a line object to Rhino.
from: The line origin.
to: The line end.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes)
Adds a line object to Rhino.
from: The line origin.
to: The line end.
attributes: Attributes to apply to line.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddLine(Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddLine(Rhino.Geometry.Line)
Adds a line object to Rhino.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddLine(Rhino.Geometry.Line,Rhino.DocObjects.ObjectAttributes)
Adds a line object to Rhino.
line: The line value.
attributes: Attributes to apply to line.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Adds a polyline object to Rhino.
points: A Rhino.Geometry.Polyline; a list, an array, or any enumerable set of Rhino.Geometry.Point3d.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.DocObjects.ObjectAttributes)
Adds a polyline object to Rhino.
points: A Rhino.Geometry.Polyline; a list, an array, or any enumerable set of Rhino.Geometry.Point3d.
attributes: attributes to apply to line.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddPolyline(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d},Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddArc(Rhino.Geometry.Arc)
Adds a curve object to the document representing an arc.
arc: An arc value.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddArc(Rhino.Geometry.Arc,Rhino.DocObjects.ObjectAttributes)
Adds a curve object to the document representing an arc.
arc: An arc value.
attributes: Attributes to apply to arc.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddArc(Rhino.Geometry.Arc,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddCircle(Rhino.Geometry.Circle)
Adds a curve object to the document representing a circle.
circle: A circle value.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddCircle(Rhino.Geometry.Circle,Rhino.DocObjects.ObjectAttributes)
Adds a curve object to the document representing a circle.
circle: A circle value.
attributes: Attributes to apply to circle.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddCircle(Rhino.Geometry.Circle,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddEllipse(Rhino.Geometry.Ellipse)
Adds a curve object to the document representing an ellipse.
ellipse: An ellipse value.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddEllipse(Rhino.Geometry.Ellipse,Rhino.DocObjects.ObjectAttributes)
Adds a curve object to the document representing an ellipse.
ellipse: An ellipse value.
attributes: Attributes to apply to ellipse.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddEllipse(Rhino.Geometry.Ellipse,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddSphere(Rhino.Geometry.Sphere)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddSphere(Rhino.Geometry.Sphere,Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddSphere(Rhino.Geometry.Sphere,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddCurve(Rhino.Geometry.Curve)
Adds a curve object to Rhino.
curve: A curve. A duplicate of this curve is added to Rhino.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddCurve(Rhino.Geometry.Curve,Rhino.DocObjects.ObjectAttributes)
Adds a curve object to Rhino.
curve: A curve. A duplicate of this curve is added to Rhino.
attributes: Attributes to apply to curve.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddCurve(Rhino.Geometry.Curve,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddTextDot(System.String,Rhino.Geometry.Point3d)
Adds a text dot object to Rhino.
text: A text string.
location: A point position.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddTextDot(System.String,Rhino.Geometry.Point3d,Rhino.DocObjects.ObjectAttributes)
Adds a text dot object to Rhino.
text: A text string.
location: A point position.
attributes: Attributes to apply to curve.
Returns: The Guid of the newly added object or Guid.Empty on failure.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddTextDot(Rhino.Geometry.TextDot)
Adds a text dot object to Rhino.
dot: A text dot that will be copied.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddTextDot(Rhino.Geometry.TextDot,Rhino.DocObjects.ObjectAttributes)
Adds a text dot object to Rhino.
dot: A text dot that will be copied.
attributes: Attributes to apply to text dot.
Returns: The Guid of the newly added object or Guid.Empty on failure.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddTextDot(Rhino.Geometry.TextDot,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddText(Rhino.Geometry.TextEntity)
Adds a v6_TextObject to the document.
text:  Text object to add.
Returns:  The Id of the newly added object or Guid.Empty on failure.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddText(Rhino.Geometry.TextEntity,Rhino.DocObjects.ObjectAttributes)
Adds a text object to the document.
text: Text object to add.
attributes:
Returns: The Id of the newly added object or Guid.Empty on failure.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddText(Rhino.Geometry.TextEntity,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds a text object to the document.
text: Text object to add.
attributes:
history: Object history to save.
reference: If reference, then object will not be saved into the 3dm file.
Returns: The Id of the newly added object or Guid.Empty on failure.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddLeader(Rhino.Geometry.Leader)
Adds a Leader object to the document.
leader: The leader object.
Returns: The Id of the newly added object or Guid.Empty on failure.
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.AddLeader(Rhino.Geometry.Leader,Rhino.DocObjects.ObjectAttributes)
Adds Leader object to the document.
leader: The leader object.
attributes: Attributes to apply to rich text.
Returns: The Guid of the newly added object or Guid.Empty on failure.
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.AddLeader(Rhino.Geometry.Leader,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds a Leader object to the document.
leader: The leader object.
attributes: Attributes to apply to rich text.
history: Object history to save.
reference: If reference, then object will not be saved into the 3dm file.
Returns: The Guid of the newly added object or Guid.Empty on failure.
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.AddLinearDimension(Rhino.Geometry.LinearDimension)
Adds a linear dimension object to the document.
dimension:
Dimension object to add.
Returns:
The Id of the newly added object or Guid.Empty on failure.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddLinearDimension(Rhino.Geometry.LinearDimension,Rhino.DocObjects.ObjectAttributes)
Adds a linear dimension object to the document.
dimension: Dimension object to add.
attributes:
Returns: The Guid of the newly added object or Guid.Empty on failure.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddLinearDimension(Rhino.Geometry.LinearDimension,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds a linear dimension object to the document.
dimension: Dimension object to add.
attributes: Attributes to apply to dimension.
history: Object history to save.
reference: If reference, then object will not be saved into the 3dm file.
Returns: The Guid of the newly added object or Guid.Empty on failure.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddAngularDimension(Rhino.Geometry.AngularDimension)
Adds a angular dimension object to the document.
dimension:
Dimension object to add.
Returns:
The Id of the newly added object or Guid.Empty on failure.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddAngularDimension(Rhino.Geometry.AngularDimension,Rhino.DocObjects.ObjectAttributes)
Adds a angular dimension object to the document.
dimension: Dimension object to add.
attributes:
Returns: The Guid of the newly added object or Guid.Empty on failure.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddAngularDimension(Rhino.Geometry.AngularDimension,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds an angular dimension object to the document.
dimension: Dimension object to add.
attributes: Attributes to apply to dimension.
history: Object history to save.
reference: If reference, then object will not be saved into the 3dm file.
Returns: The Guid of the newly added object or Guid.Empty on failure.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddOrdinateDimension(Rhino.Geometry.OrdinateDimension,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds an ordinate dimension object to the document.
dimordinate: Dimension object to add.
attributes: Attributes to apply to dimension.
history: Object history to save.
reference: If reference, then object will not be saved into the 3dm file.
Returns: The Guid of the newly added object or Guid.Empty on failure.
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.AddCentermark(Rhino.Geometry.Centermark,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds an ordinate dimension object to the document.
centermark: Dimension object to add.
attributes: Attributes to apply to dimension.
history: Object history to save.
reference: If reference, then object will not be saved into the 3dm file.
Returns: The Guid of the newly added object or Guid.Empty on failure.
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.AddText(Rhino.Display.Text3d)
Adds an annotation text object to the document.
text3d: The text object to add.
Returns: The Guid of the newly added object or Guid.Empty on failure.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddText(Rhino.Display.Text3d,Rhino.DocObjects.ObjectAttributes)
Adds an annotation text object to the document.
text3d: The text object to add.
attributes: Object Attributes.
Returns: The Guid of the newly added object or Guid.Empty on failure.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddText(System.String,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean)
Adds an annotation text object to the document.
text: Text string.
plane: Plane of text.
height: Height of text.
fontName: Name of FontFace.
bold: Bold flag.
italic: Italic flag.
Returns: The Guid of the newly added object or Guid.Empty on failure.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddText(System.String,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean,Rhino.Geometry.TextJustification)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddText(System.String,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean,Rhino.DocObjects.ObjectAttributes)
Adds an annotation text object to the document.
text: Text string.
plane: Plane of text.
height: Height of text.
fontName: Name of FontFace.
bold: Bold flag.
italic: Italic flag.
attributes: Attributes that will be linked with the object.
Returns: The Guid of the newly added object or Guid.Empty on failure.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddText(System.String,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean,Rhino.Geometry.TextJustification,Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddText(System.String,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddText(System.String,Rhino.Geometry.Plane,System.Double,System.String,System.Boolean,System.Boolean,Rhino.Geometry.TextJustification,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddSubD(Rhino.Geometry.SubD)
Adds a SubD object to Rhino.
subD: A duplicate of this SubD is added to Rhino.
Returns: A unique identifier for the object.
Since: 7.0

Rhino.DocObjects.Tables.ObjectTable.AddSubD(Rhino.Geometry.SubD,Rhino.DocObjects.ObjectAttributes)
Adds a SubD object to Rhino.
subD: A duplicate of this SubD is added to Rhino.
attributes: Attributes that will be linked with the object.
Returns: A unique identifier for the object.
Since: 7.0

Rhino.DocObjects.Tables.ObjectTable.AddSubD(Rhino.Geometry.SubD,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds a SubD object to Rhino.
subD: A duplicate of this SubD is added to Rhino.
attributes: Attributes that will be linked with the object.
history:
reference:
Returns: A unique identifier for the object.
Since: 7.0

Rhino.DocObjects.Tables.ObjectTable.AddSurface(Rhino.Geometry.Surface)
Adds a surface object to Rhino.
surface: A duplicate of this surface is added to Rhino.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddSurface(Rhino.Geometry.Surface,Rhino.DocObjects.ObjectAttributes)
Adds a surface object to Rhino.
surface: A duplicate of this surface is added to Rhino.
attributes: Attributes that will be linked with the surface object.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddSurface(Rhino.Geometry.Surface,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddExtrusion(Rhino.Geometry.Extrusion)
Adds an extrusion object to Rhino.
extrusion: A duplicate of this extrusion is added to Rhino.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddExtrusion(Rhino.Geometry.Extrusion,Rhino.DocObjects.ObjectAttributes)
Adds an extrusion object to Rhino.
extrusion: A duplicate of this extrusion is added to Rhino.
attributes: Attributes that will be linked with the extrusion object.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddExtrusion(Rhino.Geometry.Extrusion,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddClippingPlaneSurface(Rhino.Geometry.ClippingPlaneSurface,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Since: 8.11

Rhino.DocObjects.Tables.ObjectTable.AddMesh(Rhino.Geometry.Mesh)
Adds a mesh object to Rhino.
mesh: A duplicate of this mesh is added to Rhino.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddMesh(Rhino.Geometry.Mesh,Rhino.DocObjects.ObjectAttributes)
Adds a mesh object to Rhino.
mesh: A duplicate of this mesh is added to Rhino.
attributes: Attributes that will be linked with the mesh object.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddMesh(Rhino.Geometry.Mesh,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddMesh(Rhino.Geometry.Mesh,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean,System.Boolean)
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.AddBrep(Rhino.Geometry.Brep)
Adds a brep object to Rhino.
brep: A duplicate of this brep is added to Rhino.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddBrep(Rhino.Geometry.Brep,Rhino.DocObjects.ObjectAttributes)
Adds a brep object to Rhino.
brep: A duplicate of this brep is added to Rhino.
attributes: attributes to apply to brep.
Returns: A unique identifier for the object.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddBrep(Rhino.Geometry.Brep,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddBrep(Rhino.Geometry.Brep,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean,System.Boolean)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddExplodedInstancePieces(Rhino.DocObjects.InstanceObject,System.Boolean,System.Boolean)
Since: 5.11

Rhino.DocObjects.Tables.ObjectTable.AddInstanceObject(System.Int32,Rhino.Geometry.Transform)
Adds an instance object to the document.
instanceDefinitionIndex: The index of the instance definition.
instanceXform: The instance transformation.
Returns: A unique identifier for the object if successful. Guid.Empty it not successful.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddInstanceObject(System.Int32,Rhino.Geometry.Transform,Rhino.DocObjects.ObjectAttributes)
Adds an instance object to the document.
instanceDefinitionIndex: The index of the instance definition.
instanceXform: The instance transformation.
attributes: The attributes to apply to the instance object.
Returns: A unique identifier for the object if successful. Guid.Empty it not successful.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddInstanceObject(System.Int32,Rhino.Geometry.Transform,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Adds an instance object to the document.
instanceDefinitionIndex: The index of the instance definition.
instanceXform: The instance transformation.
attributes: The attributes to apply to the instance object.
history: The history record associated with this instance object.
reference: true if the object is from a reference file. Reference objects do not persist in archives.
Returns: A unique identifier for the object if successful. Guid.Empty it not successful.
Since: 6.24

Rhino.DocObjects.Tables.ObjectTable.AddLeader(Rhino.Geometry.Plane,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d})
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddLeader(Rhino.Geometry.Plane,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d},Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddLeader(System.String,Rhino.Geometry.Plane,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d},Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddLeader(System.String,Rhino.Geometry.Plane,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d},Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddLeader(System.String,Rhino.Geometry.Plane,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point2d})
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddLeader(System.String,System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddLeader(System.Collections.Generic.IEnumerable{Rhino.Geometry.Point3d})
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddHatch(Rhino.Geometry.Hatch)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddHatch(Rhino.Geometry.Hatch,Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddHatch(Rhino.Geometry.Hatch,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddMorphControl(Rhino.Geometry.MorphControl)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddMorphControl(Rhino.Geometry.MorphControl,Rhino.DocObjects.ObjectAttributes)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AddMorphControl(Rhino.Geometry.MorphControl,Rhino.DocObjects.ObjectAttributes,Rhino.DocObjects.HistoryRecord,System.Boolean)
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.AddPictureFrame(Rhino.Geometry.Plane,System.String,System.Boolean,System.Double,System.Double,System.Boolean,System.Boolean)
Creates a PictureFrame object from a plane and a path to an image file,
Note, a PictureFrame object is just a Plane surface or mesh that has a
material with a texture assigned to it that displays in all display
modes.
plane:
Plane in which the PictureFrame will be created.  Bottom left corner of
picture will be at plane's origin, width will be in the plane's x axis
direction, height will be in the plane's y axis direction.
texturePath: path to an image file
asMesh:
If true, the function will make a MeshObject rather than a surface
width:
Width of the resulting PictureFrame. If 0.0, the width of the picture frame
is the width of the image if height is also 0.0 or calculated from the
height and aspect ratio of the image if height is not 0.0.
height:
Height of the resulting PictureFrame. If 0.0, the height of the picture frame
is the height of the image if width is also 0.0 or calculated from the width
and aspect ratio of the image if width is not 0.0.
selfIllumination:
If true, the image mapped to the picture frame plane always displays at full
intensity and is not affected by light or shadow.
embedBitmap:
If true, the function adds the image to the bitmap table of the document
to which the PictureFrame will be added
Returns: A unique identifier for the object
Since: 5.10

Rhino.DocObjects.Tables.ObjectTable.Delete(Rhino.DocObjects.ObjRef,System.Boolean,System.Boolean)
Deletes objref.Object(). The deletion can be undone by calling UndeleteObject().
objref: objref.Object() will be deleted.
quiet: If false, a message box will appear when an object cannot be deleted.
ignoreModes:
If true, locked and hidden objects are deleted.  If false objects that
are locked, hidden, or on locked or hidden layers are not deleted.
Returns: true on success, false on failure.
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.Delete(Rhino.DocObjects.ObjRef,System.Boolean)
Deletes objref.Object(). The deletion can be undone by calling UndeleteObject().
objref: objref.Object() will be deleted.
quiet: If false, a message box will appear when an object cannot be deleted.
Returns: true on success, false on failure.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Delete(Rhino.DocObjects.RhinoObject,System.Boolean)
Deletes object from document. The deletion can be undone by calling UndeleteObject().
obj: The object to delete.
quiet: If false, a message box will appear when an object cannot be deleted.
Returns: true on success, false on failure.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Delete(Rhino.DocObjects.RhinoObject,System.Boolean,System.Boolean)
Deletes object from document. The deletion can be undone by calling UndeleteObject().
obj: The object to delete.
quiet: If false, a message box will appear when an object cannot be deleted.
ignoreModes:
If true, locked and hidden objects are deleted.  If false objects that
are locked, hidden, or on locked or hidden layers are not deleted.
Returns: true on success, false on failure.
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.Delete(System.Guid,System.Boolean)
Deletes object from document. The deletion can be undone by calling UndeleteObject().
objectId: Id of the object to delete.
quiet: If false, a message box will appear when an object cannot be deleted.
Returns: true on success, false on failure.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Delete(System.Collections.Generic.IEnumerable{System.Guid},System.Boolean)
Deletes a collection of objects from the document.
objectIds: Ids of all objects to delete.
quiet: If false, a message box will appear when an object cannot be deleted.
Returns: The number of successfully deleted objects.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Delete(Rhino.DocObjects.RhinoObject)
Deletes an object, taking into account modes and not showing error message boxes.
item: The object to delete.
Returns: True on success.
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.DeleteGrip(System.Guid)
Deletes a grip object.
gripId: The id of the grip object to delete.
Returns: True on success.
Since: 6.5

Rhino.DocObjects.Tables.ObjectTable.DeleteGrip(Rhino.DocObjects.ObjRef)
Deletes a grip object.
gripRef: A reference to the grip object to delete.
Returns: True on success.
Since: 6.5

Rhino.DocObjects.Tables.ObjectTable.DeleteGrip(Rhino.DocObjects.GripObject)
Deletes a grip object.
grip: The grip object to delete.
Returns: True on success.
Since: 6.5

Rhino.DocObjects.Tables.ObjectTable.DeleteGrips(System.Collections.Generic.IEnumerable{System.Guid})
Deletes one or more grip objects.
gripIds: The ids of the grip objects to delete.
Returns: The number of successfully deleted grip objects.
Since: 6.5

Rhino.DocObjects.Tables.ObjectTable.DeleteGrips(System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjRef})
Deletes one or more grip objects.
gripRefs: References to the grip objects to delete.
Returns: The number of successfully deleted grip objects.
Since: 6.5

Rhino.DocObjects.Tables.ObjectTable.DeleteGrips(System.Collections.Generic.IEnumerable{Rhino.DocObjects.GripObject})
Deletes one or more grip objects.
grips: The grip objects to delete.
Returns: The number of successfully deleted grip objects.
Since: 6.5

Rhino.DocObjects.Tables.ObjectTable.DeleteGrips(Rhino.DocObjects.RhinoObject,System.Collections.Generic.IEnumerable{System.Int32})
Deletes one or more grip objects.
owner: The owner of the grip objects.
gripIndices: The indices of the grip objects to delete.
Returns: The number of successfully deleted grip objects.
Since: 6.5

Rhino.DocObjects.Tables.ObjectTable.Purge(System.UInt32)
Removes object from document and deletes the pointer. Typically you will
want to call Delete instead in order to keep the object on the undo list.
runtimeSerialNumber: A runtime serial number of the object that will be deleted.
Returns: true if the object was purged; otherwise false.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Purge(Rhino.DocObjects.RhinoObject)
Removes object from document and deletes the pointer. Typically you will
want to call Delete instead in order to keep the object on the undo list.
rhinoObject: A Rhino object that will be deleted.
Returns: true if the object was purged; otherwise false.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Undelete(System.UInt32)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Undelete(Rhino.DocObjects.RhinoObject)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Select(Rhino.DocObjects.ObjRef)
Select a single object.
objref: Object represented by this ObjRef is selected.
Returns: true on success, false on failure.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Select(Rhino.DocObjects.ObjRef,System.Boolean)
Select or deselects a single object.
objref: Object represented by this ObjRef is selected.
select: If true, the object will be selected, if false, it will be deselected.
Returns: true on success, false on failure.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Select(Rhino.DocObjects.ObjRef,System.Boolean,System.Boolean)
Select or deselects a single object.
objref: Object represented by this ObjRef is selected.
select: If true, the object will be selected, if false, it will be deselected.
syncHighlight:
If true, then the object is highlighted if it is selected
and unhighlighted if is not selected.
Returns: true on success, false on failure.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Select(Rhino.DocObjects.ObjRef,System.Boolean,System.Boolean,System.Boolean)
Select or deselects a single object.
objref: Object represented by this ObjRef is selected.
select: If true, the object will be selected, if false, it will be deselected.
syncHighlight:
If true, then the object is highlighted if it is selected
and unhighlighted if is not selected.
persistentSelect:
Objects that are persistently selected stay selected when a command terminates.
Returns: true on success, false on failure.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Select(Rhino.DocObjects.ObjRef,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Select or deselects a single object.
objref: Object represented by this ObjRef is selected.
select: If true, the object will be selected, if false, it will be deselected.
syncHighlight:
If true, then the object is highlighted if it is selected
and unhighlighted if is not selected.
persistentSelect:
Objects that are persistently selected stay selected when a command terminates.
ignoreGripsState:
If true, then objects with grips on can be selected.
If false, then the value returned by the object's IsSelectableWithGripsOn() function
decides if the object can be selected when it has grips turned on.
ignoreLayerLocking:
If true, then objects on locked layers can be selected.
ignoreLayerVisibility:
If true, then objects on hidden layers can be selectable.
Returns: true on success, false on failure.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Select(System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjRef})
Selects a collection of objects.
objRefs: References to objects to select.
Returns: Number of objects successfully selected.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Select(System.Collections.Generic.IEnumerable{Rhino.DocObjects.ObjRef},System.Boolean)
Selects or deselects a collection of objects.
objRefs: References to objects to select or deselect.
select:
If true, objects will be selected.
If false, objects will be deselected.
Returns: Number of objects successfully selected or deselected.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Select(System.Guid)
Select a single object.
objectId: Id of object to select.
Returns: true on success, false on failure.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Select(System.Guid,System.Boolean)
Select or deselects a single object.
objectId: Id of object to select.
select: If true, the object will be selected, if false, it will be deselected.
Returns: true on success, false on failure.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Select(System.Guid,System.Boolean,System.Boolean)
Select or deselects a single object.
objectId: Id of object to select.
select: If true, the object will be selected, if false, it will be deselected.
syncHighlight:
If true, then the object is highlighted if it is selected
and unhighlighted if is not selected.
Returns: true on success, false on failure.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Select(System.Guid,System.Boolean,System.Boolean,System.Boolean)
Select or deselects a single object.
objectId: Id of object to select.
select: If true, the object will be selected, if false, it will be deselected.
syncHighlight:
If true, then the object is highlighted if it is selected
and unhighlighted if is not selected.
persistentSelect:
Objects that are persistently selected stay selected when a command terminates.
Returns: true on success, false on failure.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Select(System.Guid,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Select or deselects a single object.
objectId: Id of object to select.
select: If true, the object will be selected, if false, it will be deselected.
syncHighlight:
If true, then the object is highlighted if it is selected
and unhighlighted if is not selected.
persistentSelect:
Objects that are persistently selected stay selected when a command terminates.
ignoreGripsState:
If true, then objects with grips on can be selected.
If false, then the value returned by the object's IsSelectableWithGripsOn() function
decides if the object can be selected when it has grips turned on.
ignoreLayerLocking:
If true, then objects on locked layers can be selected.
ignoreLayerVisibility:
If true, then objects on hidden layers can be selectable.
Returns: true on success, false on failure.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Select(System.Collections.Generic.IEnumerable{System.Guid})
Selects a collection of objects.
objectIds: Ids of objects to select.
Returns: Number of objects successfully selected.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Select(System.Collections.Generic.IEnumerable{System.Guid},System.Boolean)
Selects or deselects a collection of objects.
objectIds: Ids of objects to select or deselect.
select:
If true, objects will be selected.
If false, objects will be deselected.
Returns: Number of objects successfully selected or deselected.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.UnselectAll(System.Boolean)
Unselect objects.
ignorePersistentSelections:
if true, then objects that are persistently selected will not be unselected.
Returns: Number of object that were unselected.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.UnselectAll
Unselect objects.
Returns: Number of object that were unselected.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.ModifyAttributes(Rhino.DocObjects.ObjRef,Rhino.DocObjects.ObjectAttributes,System.Boolean)
Modifies an object's attributes.  Cannot be used to change object id.
objref: reference to object to modify.
newAttributes: new attributes.
quiet: if true, then warning message boxes are disabled.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.ModifyAttributes(Rhino.DocObjects.RhinoObject,Rhino.DocObjects.ObjectAttributes,System.Boolean)
Modifies an object's attributes.  Cannot be used to change object id.
obj: object to modify.
newAttributes: new attributes.
quiet: if true, then warning message boxes are disabled.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.ModifyAttributes(System.Guid,Rhino.DocObjects.ObjectAttributes,System.Boolean)
Modifies an object's attributes.  Cannot be used to change object id.
objectId: Id of object to modify.
newAttributes: new attributes.
quiet: if true, then warning message boxes are disabled.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.ModifyRenderMaterial(Rhino.DocObjects.RhinoObject,Rhino.Render.RenderMaterial)
Modifies an object's render material assignment, this will set the
objects material source to ObjectMaterialSource.MaterialFromObject.
obj: Object to modify.
material:
Material to assign to this object.
Returns:
Returns true on success otherwise returns false.
Since: 5.7

Rhino.DocObjects.Tables.ObjectTable.ModifyRenderMaterial(Rhino.DocObjects.ObjRef,Rhino.Render.RenderMaterial)
Modifies an object's render material assignment, this will set the
objects material source to ObjectMaterialSource.MaterialFromObject.
objRef: Object to modify.
material:
Material to assign to this object.
Returns:
Returns true on success otherwise returns false.
Since: 5.7

Rhino.DocObjects.Tables.ObjectTable.ModifyRenderMaterial(System.Guid,Rhino.Render.RenderMaterial)
Modifies an object's render material assignment, this will set the
objects material source to ObjectMaterialSource.MaterialFromObject.
objectId: Id of object to modify.
material:
Material to assign to this object.
Returns:
Returns true on success otherwise returns false.
Since: 5.7

Rhino.DocObjects.Tables.ObjectTable.ModifyTextureMapping(Rhino.DocObjects.ObjRef,System.Int32,Rhino.Render.TextureMapping)
objRef:
channel:
mapping:
Returns:
Since: 5.7

Rhino.DocObjects.Tables.ObjectTable.ModifyTextureMapping(System.Guid,System.Int32,Rhino.Render.TextureMapping)
objId:
channel:
mapping:
Returns:
Since: 5.7

Rhino.DocObjects.Tables.ObjectTable.ModifyTextureMapping(Rhino.DocObjects.RhinoObject,System.Int32,Rhino.Render.TextureMapping)
obj:
channel:
mapping:
Returns:
Since: 5.7

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.DocObjects.RhinoObject)
Replaces one object with another. Conceptually, this function is the same as calling
Setting new_object attributes = old_object attributes
DeleteObject(old_object);
AddObject(old_object);
objref: reference to old object to be replaced. The objref.Object() will be deleted.
newObject: new replacement object - must not be in document.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.GeometryBase,System.Boolean)
Replaces the geometry in one object.
objectId: Id of object to be replaced.
geometry:
ignoreModes:
Returns: true if successful.
Since: 7.9

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.GeometryBase,System.Boolean)
Replaces the geometry in one object.
objref: reference to old object to be replaced. The objref.Object() will be deleted.
geometry:
ignoreModes:
Returns: true if successful.
Since: 7.9

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Point3d)
Replaces one object with new point object.
objref:
Reference to old object to be replaced. The object objref.Object() will be deleted.
point: new point to be added.  The point is copied.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Point3d)
Replaces one object with new point object.
objectId: Id of object to be replaced.
point: new point to be added.  The point is copied.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Point)
Replaces one object with new point object.
objref:
Reference to old object to be replaced. The object objref.Object() will be deleted.
point: new point to be added.  The point is copied.
Returns: true if successful.
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Point)
Replaces one object with new point object.
objectId: Id of object to be replaced.
point: new point to be added.  The point is copied.
Returns: true if successful.
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.TextEntity)
Replaces one object with new text object.
objref:
Reference to old object to be replaced. The object objref.Object() will be deleted.
text: new text to be added.  The text is copied.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.TextEntity)
Replaces one object with new text object.
objectId: Id of object to be replaced.
text: new text to be added.  The text is copied.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Leader)
Replaces one object with new text object.
objref:
Reference to old object to be replaced. The object objref.Object() will be deleted.
leader: new leader to be added.  The leader is copied.
Returns: true if successful.
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Leader)
Replaces one object with new text object.
objectId: Id of object to be replaced.
leader: new leader to be added.  The leader is copied.
Returns: true if successful.
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.TextDot)
Replaces one object with new text dot object.
objref:
Reference to old object to be replaced. The object objref.Object() will be deleted.
dot: new text dot to be added.  The text dot is copied.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.TextDot)
Replaces one object with new text dot object.
objectId: Id of object to be replaced.
dot: new text dot to be added.  The text dot is copied.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Hatch)
Replaces one object with new hatch object.
objref:
Reference to old object to be replaced. The object objref.Object() will be deleted.
hatch: new hatch to be added. The hatch is copied.
Returns: true if successful.
Since: 6.1

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Hatch)
Replaces one object with new hatch object.
objectId: Id of object to be replaced.
hatch: new hatch to be added. The hatch is copied.
Returns: true if successful.
Since: 6.1

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Line)
Replaces one object with new line curve object.
objref:
Reference to old object to be replaced. The object objref.Object() will be deleted.
line: new line to be added.  The line is copied.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Line)
Replaces one object with new line curve object.
objectId: Id of object to be replaced.
line: new line to be added.  The line is copied.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Circle)
Replaces one object with new curve object.
objref:
Reference to old object to be replaced. The object objref.Object() will be deleted.
circle: new circle to be added.  The circle is copied.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Circle)
Replaces one object with new curve object.
objectId: Id of object to be replaced.
circle: new circle to be added.  The circle is copied.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Arc)
Replaces one object with new curve object.
objref:
Reference to old object to be replaced. The object objref.Object() will be deleted.
arc: new arc to be added.  The arc is copied.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Arc)
Replaces one object with new curve object.
objectId: Id of object to be replaced.
arc: new arc to be added.  The arc is copied.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Polyline)
Replaces one object with new curve object.
objref:
Reference to old object to be replaced. The object objref.Object() will be deleted.
polyline: new polyline to be added.  The polyline is copied.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Polyline)
Replaces one object with new curve object.
objectId: Id of object to be replaced.
polyline: new polyline to be added.  The polyline is copied.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Curve)
Replaces one object with new curve object.
objref: reference to old object to be replaced. The objref.Object() will be deleted.
curve:
New curve to be added. A duplicate of the curve is added to the Rhino model.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Curve)
Replaces one object with new curve object.
objectId: Id of object to be replaced.
curve:
New curve to be added. A duplicate of the curve is added to the Rhino model.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Surface)
Replaces one object with new surface object.
objref: reference to old object to be replaced. The objref.Object() will be deleted.
surface:
new surface to be added
A duplicate of the surface is added to the Rhino model.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Surface)
Replaces one object with new surface object.
objectId: Id of object to be replaced.
surface:
new surface to be added
A duplicate of the surface is added to the Rhino model.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Brep)
Replaces one object with new brep object.
objref: reference to old object to be replaced. The objref.Object() will be deleted.
brep:
new brep to be added
A duplicate of the brep is added to the Rhino model.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Brep,System.Boolean)
Since: 6.1

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Brep)
Replaces one object with new brep object.
objectId: Id of object to be replaced.
brep:
new surface to be added
A duplicate of the brep is added to the Rhino model.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Brep,System.Boolean)
Since: 6.1

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Extrusion)
Replaces one object with new extrusion object.
objref: reference to old object to be replaced. The objref.Object() will be deleted.
extrusion: New extrusion to be added. A duplicate of the extrusion is added to the Rhino model.
Returns: true if successful.
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Extrusion)
Replaces one object with new extrusion object.
objectId: Id of object to be replaced.
extrusion: New extrusion to be added. A duplicate of the extrusion is added to the Rhino model.
Returns: true if successful.
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.Mesh)
Replaces one object with new mesh object.
objref: reference to old object to be replaced. The objref.Object() will be deleted.
mesh:
new mesh to be added
A duplicate of the mesh is added to the Rhino model.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.SubD)
Replaces one object with a new SubD object.
objref: reference to old object to be replaced. The objref.Object() will be deleted.
subD:
new SubD to be added
A duplicate of the SubD is added to the Rhino model.
Returns: true if successful.
Since: 7.0

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.Mesh)
Replaces one object with new mesh object.
objectId: Id of object to be replaced.
mesh:
new mesh to be added
A duplicate of the mesh is added to the Rhino model.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.SubD)
Replaces one object with new subd object.
objectId: Id of object to be replaced.
subD:
new mesh to be added
A duplicate of the mesh is added to the Rhino model.
Returns: true if successful.
Since: 7.0

Rhino.DocObjects.Tables.ObjectTable.Replace(Rhino.DocObjects.ObjRef,Rhino.Geometry.PointCloud)
Replaces one object with new point cloud object.
objref: reference to old object to be replaced. The objref.Object() will be deleted.
pointcloud:
new point cloud to be added
A duplicate of the point cloud is added to the Rhino model.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Replace(System.Guid,Rhino.Geometry.PointCloud)
Replaces one object with new point cloud object.
objectId: Id of object to be replaced.
pointcloud:
new point cloud to be added
A duplicate of the point cloud is added to the Rhino model.
Returns: true if successful.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.ReplaceInstanceObject(System.Guid,System.Int32)
Replaces the underlying instance definition of an instance object.
objectId: Id of the instance object to be replaced.
instanceDefinitionIndex: The index of the new instance definition to use.
Returns: true if successful.
Since: 6.8

Rhino.DocObjects.Tables.ObjectTable.ReplaceInstanceObject(Rhino.DocObjects.ObjRef,System.Int32)
Replaces the underlying instance definition of an instance object.
objref: Reference to the instance object to be replaced. The objref.Object() will be deleted.
instanceDefinitionIndex: The index of the new instance definition to use.
Returns: true if successful.
Since: 6.8

Rhino.DocObjects.Tables.ObjectTable.MostRecentObject
Gets the most recently added object that is still in the Document.
Returns: The most recent (non-deleted) object in the document, or null if no such object exists.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.AllObjectsSince(System.UInt32)
Gets all the objects that have been added to the document since a given runtime serial number.
runtimeSerialNumber: Runtime serial number of the last object not to include in the list.
Returns: An array of objects or null if no objects were added since the given runtime serial number.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Hide(Rhino.DocObjects.ObjRef,System.Boolean)
If objref.Object().IsNormal() is true, then the object will be hidden.
objref: reference to object to hide.
ignoreLayerMode:
if true, the object will be hidden even if it is on a layer that is locked or off.
Returns: true if the object was successfully hidden.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Hide(Rhino.DocObjects.ObjRef,System.Boolean,System.String)
Hides object that is referenced by objref and optionally assigns it to a hide group.
If objref.Object().IsNormal() is true, then the object will be hidden.
objref: reference to object to hide.
ignoreLayerMode:
if true, the object will be hidden even if it is on a layer that is locked or off.
hideGroup:
name of the hide group to attach to the hidden object. If null or empty, no hide group is assigned.
Returns: true if the object was successfully hidden.
Since: 8.0

Rhino.DocObjects.Tables.ObjectTable.Hide(Rhino.DocObjects.RhinoObject,System.Boolean)
If obj.IsNormal() is true, then the object will be hidden.
obj: object to hide.
ignoreLayerMode:
if true, the object will be hidden even if it is on a layer that is locked or off.
Returns: true if the object was successfully hidden.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Hide(System.Guid,System.Boolean)
If Object().IsNormal() is true, then the object will be hidden.
objectId: Id of object to hide.
ignoreLayerMode:
if true, the object will be hidden even if it is on a layer that is locked or off.
Returns: true if the object was successfully hidden.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Show(Rhino.DocObjects.ObjRef,System.Boolean)
If objref.Object().IsHidden() is true, then the object will be returned to normal (visible and selectable) mode.
objref: reference to normal object to show.
ignoreLayerMode:
if true, the object will be shown even if it is on a layer that is locked or off.
Returns: true if the object was successfully shown.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Show(Rhino.DocObjects.RhinoObject,System.Boolean)
If obj.IsHidden() is true, then the object will be returned to normal (visible and selectable) mode.
obj: the normal object to show.
ignoreLayerMode:
if true, the object will be shown even if it is on a layer that is locked or off.
Returns: true if the object was successfully shown.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Show(System.Guid,System.Boolean)
If Object().IsHidden() is true, then the object will be returned to normal (visible and selectable) mode.
objectId: Id of the normal object to show.
ignoreLayerMode:
if true, the object will be shown even if it is on a layer that is locked or off.
Returns: true if the object was successfully shown.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Lock(Rhino.DocObjects.ObjRef,System.Boolean)
If objref.Object().IsNormal() is true, then the object will be locked.
objref: reference to normal object to lock.
ignoreLayerMode:
if true, the object will be locked even if it is on a layer that is locked or off.
Returns: true if the object was successfully locked.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Lock(Rhino.DocObjects.RhinoObject,System.Boolean)
If obj.IsNormal() is true, then the object will be locked.
obj: normal object to lock.
ignoreLayerMode:
if true, the object will be locked even if it is on a layer that is locked or off.
Returns: true if the object was successfully locked.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Lock(System.Guid,System.Boolean)
If objref.Object().IsNormal() is true, then the object will be locked.
objectId: Id of normal object to lock.
ignoreLayerMode:
if true, the object will be locked even if it is on a layer that is locked or off.
Returns: true if the object was successfully locked.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Unlock(Rhino.DocObjects.ObjRef,System.Boolean)
If objref.Object().IsLocked() is true, then the object will be returned to normal (visible and selectable) mode.
objref: reference to locked object to unlock.
ignoreLayerMode:
if true, the object will be unlocked even if it is on a layer that is locked or off.
Returns: true if the object was successfully unlocked.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Unlock(Rhino.DocObjects.RhinoObject,System.Boolean)
If obj.IsLocked() is true, then the object will be returned to normal (visible and selectable) mode.
obj: locked object to unlock.
ignoreLayerMode:
if true, the object will be unlocked even if it is on a layer that is locked or off.
Returns: true if the object was successfully unlocked.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Unlock(System.Guid,System.Boolean)
If Object().IsLocked() is true, then the object will be returned to normal (visible and selectable) mode.
objectId: Id of locked object to unlock.
ignoreLayerMode:
if true, the object will be unlocked even if it is on a layer that is locked or off.
Returns: true if the object was successfully unlocked.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.BoundingBox
Gets the bounding box for all objects (normal, locked and hidden) in this
document that exist in "model" space. This bounding box does not include
objects that exist in layout space.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.BoundingBoxVisible
Gets the bounding box for all visible objects (normal and locked) in this
document that exist in "model" space. This bounding box does not include
hidden objects or any objects that exist in layout space.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.InvalidateBoundingBox
Destroys the cached scene bounding box so that it will be regenerated again from scratch next time the view is regenerated
Since: 8.8

Rhino.DocObjects.Tables.ObjectTable.ComponentType
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.Transform(Rhino.DocObjects.ObjRef,Rhino.Geometry.Transform,System.Boolean)
Constructs a new object that is the transformation of the existing object
and deletes the existing object if deleteOriginal is true.
objref:
reference to object to transform. The objref.Object() will be deleted if deleteOriginal is true.
xform: transformation to apply.
deleteOriginal:
if true, the original object is deleted
if false, the original object is not deleted.
Returns:
Id of the new object that is the transformation of the existing_object.
The new object has identical attributes.
Remarks:
If the object is locked or on a locked layer, then it cannot be transformed.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Transform(Rhino.DocObjects.RhinoObject,Rhino.Geometry.Transform,System.Boolean)
Constructs a new object that is the transformation of the existing object
and deletes the existing object if deleteOriginal is true.
obj:
Rhino object to transform. This object will be deleted if deleteOriginal is true.
xform: transformation to apply.
deleteOriginal:
if true, the original object is deleted
if false, the original object is not deleted.
Returns:
Id of the new object that is the transformation of the existing_object.
The new object has identical attributes.
Remarks:
If the object is locked or on a locked layer, then it cannot be transformed.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Transform(System.Guid,Rhino.Geometry.Transform,System.Boolean)
Constructs a new object that is the transformation of the existing object
and deletes the existing object if deleteOriginal is true.
objectId:
Id of rhino object to transform. This object will be deleted if deleteOriginal is true.
xform: transformation to apply.
deleteOriginal:
if true, the original object is deleted
if false, the original object is not deleted.
Returns:
Id of the new object that is the transformation of the existing_object.
The new object has identical attributes.
Remarks:
If the object is locked or on a locked layer, then it cannot be transformed.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.TransformWithHistory(Rhino.DocObjects.ObjRef,Rhino.Geometry.Transform)
Constructs a new object that is the transformation of the existing object
and records history of the transformation if history recording is turned on.
If history recording is not enabled, this function will act the same as
Transform(objref, xform, false)
objref:
reference to object to transform.
xform: transformation to apply.
Returns:
Id of the new object that is the transformation of the existing_object.
The new object has identical attributes.
Remarks:
If the object is locked or on a locked layer, then it cannot be transformed.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.TransformWithHistory(Rhino.DocObjects.RhinoObject,Rhino.Geometry.Transform)
Constructs a new object that is the transformation of the existing object
and records history of the transformation if history recording is turned on.
If history recording is not enabled, this function will act the same as
Transform(obj, xform, false)
obj:
Rhino object to transform.
xform: transformation to apply.
Returns:
Id of the new object that is the transformation of the existing_object.
The new object has identical attributes.
Remarks:
If the object is locked or on a locked layer, then it cannot be transformed.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.TransformWithHistory(System.Guid,Rhino.Geometry.Transform)
Constructs a new object that is the transformation of the existing object
and records history of the transformation if history recording is turned on.
If history recording is not enabled, this function will act the same as
Transform(objectId, xform, false)
objectId:
Id of rhino object to transform.
xform: transformation to apply.
Returns:
Id of the new object that is the transformation of the existing_object.
The new object has identical attributes.
Remarks:
If the object is locked or on a locked layer, then it cannot be transformed.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Duplicate(Rhino.DocObjects.ObjRef)
Duplicates the object that is referenced by objref.
Same as Transform(objref, Transform.Identity, false)
objref: A Rhino object reference to follow for object duplication.
Returns: The new object ID.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Duplicate(Rhino.DocObjects.RhinoObject)
Duplicates the object that is referenced by obj.
Same as TransformObject(obj, Transform.Identityy, false)
obj: A Rhino object to duplicate.
Returns: The new object ID.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.Duplicate(System.Guid)
Same as TransformObject(objref, ON_Xform.Identity, false)
objectId: An ID to an object in the document that needs to be duplicated.
Returns: The new object ID.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.PickObjects(Rhino.Input.Custom.PickContext)
Pick one or more objects based on a given pick context
pickContext: settings used to define what is picked
Returns: zero or more objects
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.GripUpdate(Rhino.DocObjects.RhinoObject,System.Boolean)
Altered grip positions on a RhinoObject are used to calculate an updated object
that is added to the document.
obj: object with modified grips to update.
deleteOriginal: if true, obj is deleted from the document.
Returns: new RhinoObject on success; otherwise null.
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.ObjectCount(Rhino.DocObjects.ObjectEnumeratorSettings)
Returns the number objects that pass a filter.
filter: The Rhino.DocObjects.ObjectEnumeratorSettings filter.
Returns: The number of objects that pass the filter.

Rhino.DocObjects.Tables.ObjectTable.GetObjectList(Rhino.DocObjects.ObjectEnumeratorSettings)
Returns an enumerable based on a Rhino.DocObjects.ObjectEnumeratorSettings filter.
settings: The Rhino.DocObjects.ObjectEnumeratorSettings settings.
Returns: The enumerable.

Rhino.DocObjects.Tables.ObjectTable.GetObjectIdList(Rhino.DocObjects.ObjectEnumeratorSettings)
Returns an enumerable based on a Rhino.DocObjects.ObjectEnumeratorSettings filter.
settings: The Rhino.DocObjects.ObjectEnumeratorSettings settings.
Returns: The enumerable.
Since: 8.25

Rhino.DocObjects.Tables.ObjectTable.GetObjectList(System.Type)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.GetObjectsByType``1
Returns Rhino object by type.
Returns: The enumerable.
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.GetObjectsByType``1(Rhino.DocObjects.ObjectEnumeratorSettings)
Returns Rhino object by type.
Returns: The enumerable.
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.GetObjectList(Rhino.DocObjects.ObjectType)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.GetSelectedObjects(System.Boolean,System.Boolean)
Since: 5.0

Rhino.DocObjects.Tables.ObjectTable.SelectedObjectsExist(Rhino.DocObjects.ObjectType,System.Boolean)
Quick way to test if any objects are currently selected
objectType: the type of objects to test for
checkSubObjects: Check to see if subobjects are selected
Returns:
Since: 8.10

Rhino.DocObjects.Tables.ObjectTable.GetSelectedObjectTypes
What geometry types are currently selected
Since: 6.0

Rhino.DocObjects.Tables.ObjectTable.GetSelectedObjectCount(System.Boolean)
Compute the current number of selected objects
checkSubObjects: Check to see if subobjects are selected
Returns:
Since: 8.10

Rhino.DocObjects.Tables.ObjectTable.GetEnumerator
Since: 5.0