Rhino.Render.PostEffects.PostEffectJob.SerialNumber
Since: 7.0

Rhino.Render.PostEffects.PostEffectJob.CppPointer
Since: 7.0

Rhino.Render.PostEffects.PostEffectJob.#ctor
Since: 7.0

Rhino.Render.PostEffects.PostEffectJob.Dispose(System.Boolean)
Since: 7.0

Rhino.Render.PostEffects.PostEffectJob.Clone
Since: 7.0

Rhino.Render.PostEffects.PostEffectJob.Execute(System.Drawing.Rectangle,Rhino.Render.PostEffects.PostEffectJobChannels)
Since: 7.0