Rhino.FileIO.FileSatWriteOptions
Options used when writing a Sat file

Rhino.FileIO.FileSatWriteOptions.Type
Get and set the type of the sat file being written.
Since: 8.0

Rhino.FileIO.FileSatWriteOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0