Rhino.DocObjects.Tables.LayerTableEventArgs.Document
Since: 5.0

Rhino.DocObjects.Tables.LayerTableEventArgs.EventType
Since: 5.0

Rhino.DocObjects.Tables.LayerTableEventArgs.LayerIndex
Since: 5.0

Rhino.DocObjects.Tables.LayerTableEventArgs.NewState
Since: 5.0

Rhino.DocObjects.Tables.LayerTableEventArgs.OldState
Since: 5.0