Rhino.UI.NotImplementedPanelsService
If something goes wrong and the service does not get implemented by
either RhinoMac or RhinoWindows then use this version of the service
which will just throw NotImplementedException's