Rhino.DocObjects.ConstructionPlane
Represents a construction plane inside the document.
Use Rhino.DocObjects.Tables.NamedConstructionPlaneTable
methods and indexers to add and access a Rhino.DocObjects.ConstructionPlane.

Rhino.DocObjects.ConstructionPlane.#ctor
Initializes a new instance of Rhino.DocObjects.ConstructionPlane.
Since: 5.0

Rhino.DocObjects.ConstructionPlane.Plane
Gets or sets the geometric plane to use for construction.
Since: 5.0

Rhino.DocObjects.ConstructionPlane.GridSpacing
Gets or sets the distance between grid lines.
Since: 5.0

Rhino.DocObjects.ConstructionPlane.SnapSpacing
when "grid snap" is enabled, the distance between snap points.
Typically this is the same distance as grid spacing.
Since: 5.0

Rhino.DocObjects.ConstructionPlane.GridLineCount
Gets or sets the total amount of grid lines in each direction.
Since: 5.0

Rhino.DocObjects.ConstructionPlane.ThickLineFrequency
Gets or sets the recurrence of a wider line on the grid.
0: No lines are thick, all are drawn thin.
1: All lines are thick.
2: Every other line is thick.
3: One line in three lines is thick (and two are thin).
4: ...
Since: 5.0

Rhino.DocObjects.ConstructionPlane.DepthBuffered
Gets or sets whether the grid is drawn on top of geometry.
false=grid is always drawn behind 3d geometry
true=grid is drawn at its depth as a 3d plane and grid lines obscure things behind the grid.
Since: 5.0

Rhino.DocObjects.ConstructionPlane.Name
Gets or sets the name of the construction plane.
Since: 5.0

Rhino.DocObjects.ConstructionPlane.ShowGrid
Gets or sets whether the grid itself should be visible.
Since: 5.0

Rhino.DocObjects.ConstructionPlane.ShowAxes
Gets or sets whether the axes of the grid should be visible.
Since: 5.0

Rhino.DocObjects.ConstructionPlane.ShowZAxis
Gets or sets whether the Z axis of the grid should be visible.
Since: 6.0

Rhino.DocObjects.ConstructionPlane.ThinLineColor
Gets or sets the color of the thinner, less prominent line.
Since: 5.0

Rhino.DocObjects.ConstructionPlane.ThickLineColor
Gets or sets the color of the thicker, wider line.
Since: 5.0

Rhino.DocObjects.ConstructionPlane.GridXColor
Gets or sets the color of the grid X-axis mark.
Since: 5.0

Rhino.DocObjects.ConstructionPlane.GridYColor
Gets or sets the color of the grid Y-axis mark.
Since: 5.0

Rhino.DocObjects.ConstructionPlane.GridZColor
Gets or sets the color of the grid Z-axis mark.
Since: 5.0