Rhino.UI.RhinoPanelStyle.PanelStyle
Gets a value indicating whether to auto initialize the handler, false to defer this to the widget author
true if initialize; otherwise, false.

Rhino.UI.RhinoPanelStyle.#ctor(Rhino.UI.PanelStyles)
style: If set to true initialize the widget automatically, otherwise false.