Rhino.FileIO.ICommonComponentTable`1
Provides methods to use all File3dm and RhinoDoc tables under the same contract.
Do not derive from this interface. This is to ensure all tables can be used with the same method list.

Rhino.FileIO.ICommonComponentTable`1.FindId(System.Guid)
Retrieves an object based on ID. You should prefer ID search over Index search.
id: The id to search for.
Returns: A model component, or null if none was found.

Rhino.FileIO.ICommonComponentTable`1.FindNameHash(Rhino.FileIO.NameHash)
Retrieves an object based on Name.
nameHash: The name hash for which to search.

Rhino.FileIO.ICommonComponentTable`1.ComponentType
Returns the model component type the table handles.