Rhino.ApplicationSettings.SmartTrackSettingsState
Represents a snapshot of Rhino.ApplicationSettings.SmartTrackSettings.

Rhino.ApplicationSettings.SmartTrackSettingsState.UseSmartTrack
Gets or sets if the 'smart track' feature is active.
Since: 5.0

Rhino.ApplicationSettings.SmartTrackSettingsState.UseDottedLines
Gets or sets a value indicating if lines are drawn dotted.
Since: 5.0

Rhino.ApplicationSettings.SmartTrackSettingsState.SmartOrtho
Gets or sets a value indicating if the 'Smart Ortho' feature is active.
Since: 5.0

Rhino.ApplicationSettings.SmartTrackSettingsState.SmartTangents
Gets or sets a value indicating if the 'Smart Tangents' feature is active.
Since: 5.0

Rhino.ApplicationSettings.SmartTrackSettingsState.ActivationDelayMilliseconds
Gets or sets the activation delay in milliseconds.
Since: 5.0

Rhino.ApplicationSettings.SmartTrackSettingsState.MaxSmartPoints
Gets or sets the maximum number of smart points.
Since: 5.0

Rhino.ApplicationSettings.SmartTrackSettingsState.LineColor
Gets or sets the smart track line color.
Since: 5.0

Rhino.ApplicationSettings.SmartTrackSettingsState.TanPerpLineColor
Gets or sets the tangent and perpendicular line color.
Since: 5.0

Rhino.ApplicationSettings.SmartTrackSettingsState.PointColor
Gets or sets the point color.
Since: 5.0

Rhino.ApplicationSettings.SmartTrackSettingsState.ActivePointColor
Gets or sets the active point color.
Since: 5.0

Rhino.ApplicationSettings.SmartTrackSettingsState.GuideColor
Gets or sets the active guide color
Since: 8.21