Rhino.Runtime.InteropWrappers.IntPtrSafeHandle
Maintains a pointer created with the C++ new keyword
and takes care to delete it even if the developers forgets or cannot call
Dispose(). This class must be inherited and a meaningful constructor
should set UnsafePointer. Only the first call of Dispose() triggers
ReleaseUnsafePointer().

Rhino.Runtime.InteropWrappers.IntPtrSafeHandle.CreateFromMethods(System.Func{System.IntPtr},System.Action{System.IntPtr})
Creates on object responsible of creating and disposing an unsafe pointer.
creator: The creation method.
disposer: The disposing method.
Returns: