Rhino.Geometry.OrdinateDimension
Represents an ordinate dimension

Rhino.Geometry.OrdinateDimension.#ctor
Since: 6.0

Rhino.Geometry.OrdinateDimension.#ctor(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Protected constructor used in serialization.

Rhino.Geometry.OrdinateDimension.#ctor(Rhino.Geometry.Plane,Rhino.Geometry.OrdinateDimension.MeasuredDirection,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double)
Constructs an ordinate dimension from parameters.
plane: Dimension's plane
direction: MeasuredDirection.XAxis or MeasuredDirection.YAxis
basepoint: Dimension's base point
defpoint: Dimension's definition point
leaderpoint: Point at tail of leader
kinkoffset1: Distance to first jog
kinkoffset2: Distance to second jog
Since: 8.0

Rhino.Geometry.OrdinateDimension.Create(Rhino.DocObjects.DimensionStyle,Rhino.Geometry.Plane,Rhino.Geometry.OrdinateDimension.MeasuredDirection,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double)
Initialize Dimension parameters
dimStyle: Dimension's AnnotationStyle
plane: Dimension's plane
direction: MeasuredDirection.XAxis or MeasuredDirection.YAxis
basepoint: Dimension's base point
defpoint: Dimension's definition point
leaderpoint: Point at tail of leader
kinkoffset1: Distance to first jog
kinkoffset2: Distance to second jog
Returns:
Since: 6.0

Rhino.Geometry.OrdinateDimension.AdjustFromPoints(Rhino.Geometry.Plane,Rhino.Geometry.OrdinateDimension.MeasuredDirection,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,Rhino.Geometry.Point3d,System.Double,System.Double)
Update Dimension geometry from point locations
plane: Dimension's plane
direction: MeasuredDirection.XAxis or MeasuredDirection.YAxisw
basepoint: Dimension's base point
defpoint: Dimension's definition point
leaderpoint: Point at tail of leader
kinkoffset1: Distance to first jog
kinkoffset2: Distance to second jog
Returns:
Since: 6.0

Rhino.Geometry.OrdinateDimension.Get3dPoints(Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@,Rhino.Geometry.Point3d@)
Get locations of dimension's 3d points
basepoint: Dimension's base point
defpoint: Dimension's definition point
leaderpoint: Point at tail of leader
kinkpoint1: Point at first jog
kinkpoint2: Point at second jog
Returns:
Since: 6.0

Rhino.Geometry.OrdinateDimension.DefPoint
Since: 6.0

Rhino.Geometry.OrdinateDimension.LeaderPoint
Since: 6.0

Rhino.Geometry.OrdinateDimension.KinkPoint1
Since: 6.0

Rhino.Geometry.OrdinateDimension.KinkPoint2
Since: 6.0

Rhino.Geometry.OrdinateDimension.KinkOffset1
Since: 6.0

Rhino.Geometry.OrdinateDimension.KinkOffset2
Since: 6.0

Rhino.Geometry.OrdinateDimension.Direction
Gets or sets the measured direction.
Since: 8.0

Rhino.Geometry.OrdinateDimension.GetTextRectangle(Rhino.Geometry.Point3d[]@)
Since: 6.0

Rhino.Geometry.OrdinateDimension.GetDistanceDisplayText(Rhino.UnitSystem,Rhino.DocObjects.DimensionStyle)
Since: 6.0