Rhino.Geometry.SubDComponent
A part of SubD geometry. Common base class for vertices, faces, and edges

Rhino.Geometry.SubDComponent.ComponentPtrType
The type bits this component sets in its component pointer. Every concrete
SubDComponent knows what it is, so the type bits never have to be inspected to
decide how to interpret the pointer.

Rhino.Geometry.SubDComponent.Id
Unique id within the parent SubD for this item
Since: 7.0

Rhino.Geometry.SubDComponent.ParentSubD
SubD that this component belongs to
Since: 7.0

Rhino.Geometry.SubDComponent.ComponentDirection
True when this component is referenced with the reverse of its natural orientation.
This is always false for vertices, and for edges and faces obtained directly from
the parent SubD; it is only set on components reached through an oriented
reference, such as the face on a given side of an oriented edge.
Since: 8.36

Rhino.Geometry.SubDComponent.ReverseComponentDirection
Flips Rhino.Geometry.SubDComponent.ComponentDirection and returns this component, so it can be used
inline where an oppositely oriented reference is wanted.
Returns: This component.
Since: 8.36

Rhino.Geometry.SubDComponent.Equals(Rhino.Geometry.SubDComponent)
Determines whether this component and another refer to the same component, with the
same orientation, in the same SubD.
other: The component to compare with.
Since: 8.36

Rhino.Geometry.SubDComponent.Equals(System.Object)
Determines whether an object is a SubDComponent referring to the same component,
with the same orientation, in the same SubD.
obj: The object to compare with.
Since: 8.36

Rhino.Geometry.SubDComponent.GetHashCode
Gets a hash code for this component.
Since: 8.36

Rhino.Geometry.SubDComponent.op_Equality(Rhino.Geometry.SubDComponent,Rhino.Geometry.SubDComponent)
Determines whether two components refer to the same component, with the same
orientation, in the same SubD.
a: The first component.
b: The second component.
Since: 8.36

Rhino.Geometry.SubDComponent.op_Inequality(Rhino.Geometry.SubDComponent,Rhino.Geometry.SubDComponent)
Determines whether two components refer to different components, orientations, or SubDs.
a: The first component.
b: The second component.
Since: 8.36

Rhino.Geometry.SubDComponent.ToString
Returns a string of the form "SubDEdge(+12)", naming the component type, the
orientation it is referenced with, and its id.
Since: 8.36

Rhino.Geometry.SubDComponent.IsSelected
Returns true if the SubD component is selected.
Since: 7.6

Rhino.Geometry.SubDComponent.IsHighlighted
Returns true if the SubD component is highlighted.
Since: 7.6

Rhino.Geometry.SubDComponent.IsHidden
Returns true if the SubD component is hidden.
Since: 7.6

Rhino.Geometry.SubDComponent.IsLocked
Returns true if the SubD component is locked.
Since: 7.6

Rhino.Geometry.SubDComponent.IsDeleted
Returns true if the SubD component is deleted.
Since: 7.6

Rhino.Geometry.SubDComponent.IsDamaged
Returns true if the SubD component is damaged.
Since: 7.6