Rhino.RhinoWindow
Represents the top level window in Rhino

Rhino.RhinoWindow.Handle
Since: 5.0

Rhino.RhinoWindow.Invoke(System.Delegate)
method:
Returns:
Since: 5.0

Rhino.RhinoWindow.InvokeRequired
See Control.InvokeRequired
Since: 5.0