Rhino.DocObjects.Custom.UserDataListEnumerator
Enumerator for UserDataList

Rhino.DocObjects.Custom.UserDataListEnumerator.#ctor(Rhino.DocObjects.Custom.UserDataList)
Create new UserDataListEnumerator
udl: UserDataList to enumerate
Since: 6.0

Rhino.DocObjects.Custom.UserDataListEnumerator.Current
Get current UserData on the enumerator.
Since: 6.0

Rhino.DocObjects.Custom.UserDataListEnumerator.System#Collections#IEnumerator#Current
Since: 6.0

Rhino.DocObjects.Custom.UserDataListEnumerator.Dispose
Implement Dispose(). NOP.
Since: 6.0

Rhino.DocObjects.Custom.UserDataListEnumerator.MoveNext
Advance enumerator to next UserData item.
Returns: True if there is a next item.
Since: 6.0

Rhino.DocObjects.Custom.UserDataListEnumerator.Reset
Reset the enumerator
Since: 6.0