Rhino.Geometry.ChainDirection
Which way to search along a chain from the current link.

Rhino.Geometry.ChainDirection.Unset
Not set.

Rhino.Geometry.ChainDirection.Previous
Search for chain links before the current link.

Rhino.Geometry.ChainDirection.Next
Search for chain links after the current link.

Rhino.Geometry.ChainDirection.Both
Search for chain links before and after the current link.