Rhino.Render.ParameterNames.PhysicallyBased
Helper class with properties containing the names of fields available in our PBR implementation.

Rhino.Render.ParameterNames.PhysicallyBased.BaseColor
Since: 7.0

Rhino.Render.ParameterNames.PhysicallyBased.BRDF
Since: 7.0

Rhino.Render.ParameterNames.PhysicallyBased.Subsurface
Since: 7.0

Rhino.Render.ParameterNames.PhysicallyBased.SubsurfaceScatteringColor
Since: 7.0

Rhino.Render.ParameterNames.PhysicallyBased.SubsurfaceScatteringRadius
Since: 7.0

Rhino.Render.ParameterNames.PhysicallyBased.Specular
Since: 7.0

Rhino.Render.ParameterNames.PhysicallyBased.SpecularTint
Since: 7.0

Rhino.Render.ParameterNames.PhysicallyBased.Metallic
Since: 7.0

Rhino.Render.ParameterNames.PhysicallyBased.Roughness
Since: 7.0

Rhino.Render.ParameterNames.PhysicallyBased.Anisotropic
Since: 7.0

Rhino.Render.ParameterNames.PhysicallyBased.AnisotropicRotation
Since: 7.0

Rhino.Render.ParameterNames.PhysicallyBased.Sheen
Since: 7.0

Rhino.Render.ParameterNames.PhysicallyBased.SheenTint
Since: 7.0

Rhino.Render.ParameterNames.PhysicallyBased.Clearcoat
Since: 7.0

Rhino.Render.ParameterNames.PhysicallyBased.ClearcoatRoughness
Since: 7.0

Rhino.Render.ParameterNames.PhysicallyBased.ClearcoatBump
Since: 7.0

Rhino.Render.ParameterNames.PhysicallyBased.OpacityIor
Since: 7.0

Rhino.Render.ParameterNames.PhysicallyBased.Opacity
Since: 7.0

Rhino.Render.ParameterNames.PhysicallyBased.OpacityRoughness
Since: 7.0

Rhino.Render.ParameterNames.PhysicallyBased.Emission
Since: 7.0

Rhino.Render.ParameterNames.PhysicallyBased.Displacement
Since: 7.0

Rhino.Render.ParameterNames.PhysicallyBased.Bump
Since: 7.0

Rhino.Render.ParameterNames.PhysicallyBased.AmbientOcclusion
Since: 7.0

Rhino.Render.ParameterNames.PhysicallyBased.Alpha
Since: 7.0