Rhino.Input.Custom.GetPointMouseEventArgs
Arguments for mouse information during point getting.

Rhino.Input.Custom.GetPointMouseEventArgs.Source
Since: 5.0

Rhino.Input.Custom.GetPointMouseEventArgs.Viewport
Since: 5.0

Rhino.Input.Custom.GetPointMouseEventArgs.Point
Since: 5.0

Rhino.Input.Custom.GetPointMouseEventArgs.WindowPoint
Since: 5.0

Rhino.Input.Custom.GetPointMouseEventArgs.LeftButtonDown
Since: 5.0

Rhino.Input.Custom.GetPointMouseEventArgs.RightButtonDown
Since: 5.0

Rhino.Input.Custom.GetPointMouseEventArgs.ShiftKeyDown
Since: 5.0

Rhino.Input.Custom.GetPointMouseEventArgs.ControlKeyDown
Since: 5.0

Rhino.Input.Custom.GetPointMouseEventArgs.MiddleButtonDown
Since: 5.0