Rhino.Geometry.CurveSimplifyOptions
Enumerates the options to use when simplifying a curve.
Since: 5.0

Rhino.Geometry.CurveSimplifyOptions.None
No option is specified.

Rhino.Geometry.CurveSimplifyOptions.SplitAtFullyMultipleKnots
Split NurbsCurves at fully multiple knots.
Effectively turning single NURBS segments with kinks into multiple segments.

Rhino.Geometry.CurveSimplifyOptions.RebuildLines
Replace linear segments with LineCurves.

Rhino.Geometry.CurveSimplifyOptions.RebuildArcs
Replace partially circular segments with ArcCurves.

Rhino.Geometry.CurveSimplifyOptions.RebuildRationals
Replace rational NURBS curve with constant weights
with an equivalent non-rational NurbsCurve.

Rhino.Geometry.CurveSimplifyOptions.AdjustG1
Adjust segments that are G1 to each other.
Segments might only be G1 within tolerance. This can affect downstream operations, such as offsetting.
So, if G1 within tolerance, adjust segments so to be exactly G1.

Rhino.Geometry.CurveSimplifyOptions.Merge
Merge adjacent co-linear lines or co-circular arcs
or combine consecutive line segments into a polyline.

Rhino.Geometry.CurveSimplifyOptions.All
Implies all of the simplification functions will be used.