Rhino.FileIO.FileDwgWriteOptions.AutocadVersion
AutoCAD version format to write to
Since: 8.0

Rhino.FileIO.FileDwgWriteOptions.AutocadVersion.Release12
Acad 12

Rhino.FileIO.FileDwgWriteOptions.AutocadVersion.Release14
Acad 14

Rhino.FileIO.FileDwgWriteOptions.AutocadVersion.Acad2000
Acad 2000

Rhino.FileIO.FileDwgWriteOptions.AutocadVersion.Acad2004
Acad 2004

Rhino.FileIO.FileDwgWriteOptions.AutocadVersion.Acad2007
Acad 2007

Rhino.FileIO.FileDwgWriteOptions.AutocadVersion.Acad2010
Acad 2010

Rhino.FileIO.FileDwgWriteOptions.AutocadVersion.Acad2013
Acad 2013

Rhino.FileIO.FileDwgWriteOptions.AutocadVersion.Acad2018
Acad 2018