Rhino.RhinoDoc.RenderMaterialAssignmentChangedEventArgs.IsLayer
Since: 5.10

Rhino.RhinoDoc.RenderMaterialAssignmentChangedEventArgs.IsObject
Since: 5.10

Rhino.RhinoDoc.RenderMaterialAssignmentChangedEventArgs.LayerId
Since: 5.10

Rhino.RhinoDoc.RenderMaterialAssignmentChangedEventArgs.ObjectId
Since: 5.10

Rhino.RhinoDoc.RenderMaterialAssignmentChangedEventArgs.OldRenderMaterial
Since: 5.10

Rhino.RhinoDoc.RenderMaterialAssignmentChangedEventArgs.NewRenderMaterial
Since: 5.10