Rhino.PersistentSettingsManager.m_plugin_id
If this settings PersistentSettingsManager is created by plug-in provided DLL then save the plug-in ID
so that when the plug-in requests its setting it will get the same PersistentSettingsManager

Rhino.PersistentSettingsManager.#ctor(System.Reflection.Assembly,System.Guid)
PersistentSettingsManager constructor.
assembly: Requires a valid Assembly object to attach to.
pluginId: Optional plug-in Id which identifies the plug-in associated with this settings class.

Rhino.PersistentSettingsManager.#ctor(System.Guid)
PersistentSettingsManager constructor.
pluginId: Requires a valid pluginId to attach to

Rhino.PersistentSettingsManager.#ctor(Rhino.Runtime.Skin)
PersistentSettingsManager constructor.
skin:

Rhino.PersistentSettingsManager.PluginSettings
Gets the Plug-in settings associated with this plug-in, if this is the first time called then
the plug-in settings member variable will get initialized and if a settings file exists it
will get loaded.

Rhino.PersistentSettingsManager.WindowPositionSettings
Gets the window position settings associated with this plug-in, if this is the first time called then
the window position settings member variable will get initialized and if a settings file exists it
will get loaded.

Rhino.PersistentSettingsManager.CommandSettings(System.String)
Gets the PersistentSettings associated with the specified command.  If the settings file
has not been previously loaded and exists then it will get read.  If the command name is
not in the command settings dictionary then a new entry will get created and its settings
will be returned.
name: Command name key to search for and/or add.
Returns: Returns PersistentSettings object associated with command name on success or null on error.

Rhino.PersistentSettingsManager.ContainsChangedValues
Check the plug-in and command settings dictionaries for values that have changed.
Returns: Returns true if either the plug-ins or commands dictionaries contains a changed item otherwise false.

Rhino.PersistentSettingsManager.ClearChangedFlag
Clear changed flag for all values

Rhino.PersistentSettingsManager.ContainsModifiedValues
Check the plug-in and command settings dictionaries for values other than default value.
Returns: Returns true if either the plug-ins or commands dictionaries contains a modified item otherwise false.

Rhino.PersistentSettingsManager.WriteSettings(System.Boolean)
If they exist and contain modified values write global settings first then local settings.
shuttingDown:
Will be true if this is getting called when Rhino is closing otherwise it will be false.
Returns: Returns true if local settings were successfully written.