Rhino.Render.ChildSlotNames.PhysicallyBased
Helper class with properties containing the names of children available in our PBR implementation.

Rhino.Render.ChildSlotNames.PhysicallyBased.BaseColor
Since: 7.0

Rhino.Render.ChildSlotNames.PhysicallyBased.Subsurface
Since: 7.0

Rhino.Render.ChildSlotNames.PhysicallyBased.SubsurfaceScatteringColor
Since: 7.0

Rhino.Render.ChildSlotNames.PhysicallyBased.SubsurfaceScatteringRadius
Since: 7.0

Rhino.Render.ChildSlotNames.PhysicallyBased.Specular
Since: 7.0

Rhino.Render.ChildSlotNames.PhysicallyBased.SpecularTint
Since: 7.0

Rhino.Render.ChildSlotNames.PhysicallyBased.Metallic
Since: 7.0

Rhino.Render.ChildSlotNames.PhysicallyBased.Roughness
Since: 7.0

Rhino.Render.ChildSlotNames.PhysicallyBased.Anisotropic
Since: 7.0

Rhino.Render.ChildSlotNames.PhysicallyBased.AnisotropicRotation
Since: 7.0

Rhino.Render.ChildSlotNames.PhysicallyBased.Sheen
Since: 7.0

Rhino.Render.ChildSlotNames.PhysicallyBased.SheenTint
Since: 7.0

Rhino.Render.ChildSlotNames.PhysicallyBased.Clearcoat
Since: 7.0

Rhino.Render.ChildSlotNames.PhysicallyBased.ClearcoatRoughness
Since: 7.0

Rhino.Render.ChildSlotNames.PhysicallyBased.ClearcoatBump
Since: 7.0

Rhino.Render.ChildSlotNames.PhysicallyBased.OpacityIor
Since: 7.0

Rhino.Render.ChildSlotNames.PhysicallyBased.Opacity
Since: 7.0

Rhino.Render.ChildSlotNames.PhysicallyBased.OpacityRoughness
Since: 7.0

Rhino.Render.ChildSlotNames.PhysicallyBased.Emission
Since: 7.0

Rhino.Render.ChildSlotNames.PhysicallyBased.Displacement
Since: 7.0

Rhino.Render.ChildSlotNames.PhysicallyBased.Bump
Since: 7.0

Rhino.Render.ChildSlotNames.PhysicallyBased.AmbientOcclusion
Since: 7.0

Rhino.Render.ChildSlotNames.PhysicallyBased.Alpha
Since: 7.0

Rhino.Render.ChildSlotNames.PhysicallyBased.FromTextureType(Rhino.DocObjects.TextureType)
Since: 7.0