Rhino.Render.RenderSettings.EnvironmentPurpose
The purpose a render environment is being used for.
Since: 8.0

Rhino.Render.RenderSettings.EnvironmentPurpose.Standard
Used to directly get and set the environment instance id.

Rhino.Render.RenderSettings.EnvironmentPurpose.ForRendering
Used to get the environment instance id to be used for actual rendering.