Rhino.Render.RenderContentKind
Defines constant values for all render content kinds, such as material,
environment or texture.
Since: 5.1

Rhino.Render.RenderContentKind.None
Specifies no RenderContent kind.

Rhino.Render.RenderContentKind.Material
Specifies a material RenderContent kind.

Rhino.Render.RenderContentKind.Environment
Specifies an environment RenderContent kind.

Rhino.Render.RenderContentKind.Texture
Specifies a texture RenderContent kind.