Rhino.PlugIns.PlugInDescriptionAttribute
Rhino plug-in developer information attributes.

Rhino.PlugIns.PlugInDescriptionAttribute.#ctor(Rhino.PlugIns.DescriptionType,System.String)
Since: 5.0

Rhino.PlugIns.PlugInDescriptionAttribute.DescriptionType
Since: 5.0

Rhino.PlugIns.PlugInDescriptionAttribute.Value
Since: 5.0