Rhino.FileIO.FileSkp
Support for writing Skp file format

Rhino.FileIO.FileSkp.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileSkpWriteOptions)
Write a Skp file based on the contents of a RhinoDoc
filename: path to write a file to
doc: document to get geometry from
options: options used for generating the Skp file
Returns: true on success
Since: 8.0

Rhino.FileIO.FileSkp.Read(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileSkpReadOptions)
Read a Skp file into a RhinoDoc
path: path to read a file from
doc: document to import geometry into
options: options used for importing the Skp file
Returns: true on success
Since: 8.0