Rhino.Render.UICommands.UICommandSeparator
This enum is for UICommand Separator

Rhino.Render.UICommands.UICommandSeparator.None
No separators will surround this UICommand on the menu.

Rhino.Render.UICommands.UICommandSeparator.Before
A separator will appear before this UICommand on the menu.

Rhino.Render.UICommands.UICommandSeparator.After
A separator will appear after this UICommand on the menu.

Rhino.Render.UICommands.UICommandSeparator.Both
A separator will appear before and after this UICommand on the menu.