Rhino.DocObjects.DimensionStyle.ArrowFit
Arrow display position inside or outside extension lines

Rhino.DocObjects.DimensionStyle.ArrowFit.Auto
Auto - Display when space permits

Rhino.DocObjects.DimensionStyle.ArrowFit.ArrowsInside
Force arrows inside extensions

Rhino.DocObjects.DimensionStyle.ArrowFit.ArrowsOutside
Force arrows outside extensions