Rhino.Display.DisplayPoint
A 3d point with attributes used by the display pipeline

Rhino.Display.DisplayPoint.#ctor(Rhino.Geometry.Point3d)
Since: 8.0

Rhino.Display.DisplayPoint.WithAttributes(Rhino.Display.DisplayPointAttributes)
Since: 8.0

Rhino.Display.DisplayPoint.Location
Since: 8.0