Rhino.Render.CustomRenderMeshes.RenderMeshes
RenderMeshes is a collection of geometry instances for a given ObjectId typically returned by the Custom Render primitive system.
As each set of primitives is returned by the RenderMeshProviders in turn, the running hash is updated with new information
about the primitive modifications that have been made along the way.

Rhino.Render.CustomRenderMeshes.RenderMeshes.#ctor(Rhino.RhinoDoc,System.Guid,System.Guid,System.UInt32)
Create a new render primitives collection.
doc: The Rhino document with which this collection will be associated.
objectId: The ObjectId that this collection is for.
renderMeshProviderId: The RenderMeshProvider that created this collection - if this is the first in the stack, typically this will be ON_nil_uuid.
runningHash: The running hash of this collection - each RenderMeshProvider will update the hash with its own modification hash.
Since: 8.0
8.14

Rhino.Render.CustomRenderMeshes.RenderMeshes.#ctor(Rhino.RhinoDoc,System.Guid,System.Guid,System.UInt32,System.UInt32)
Create a new render primitives collection.
doc: The Rhino document with which this collection will be associated.
objectId: The ObjectId that this collection is for.
renderMeshProviderId: The RenderMeshProvider that created this collection - if this is the first in the stack, typically this will be ON_nil_uuid.
runningHash: The running hash of this collection - each RenderMeshProvider will update the hash with its own modification hash.
flags: The flags these render meshes were created with.
Since: 8.0

Rhino.Render.CustomRenderMeshes.RenderMeshes.AddInstance(Rhino.Render.CustomRenderMeshes.Instance)
Adds a new instance to the render primitives collection.
instance: The instance to be added.
Since: 8.0

Rhino.Render.CustomRenderMeshes.RenderMeshes.InstanceCount
The number of instance objects in this collection.
Since: 8.0

Rhino.Render.CustomRenderMeshes.RenderMeshes.GetEnumerator
Return an object to iterator over the instances in the collection
Returns:
Since: 8.0

Rhino.Render.CustomRenderMeshes.RenderMeshes.System#Collections#IEnumerable#GetEnumerator
Since: 8.0

Rhino.Render.CustomRenderMeshes.RenderMeshes.ObjectId
The ObjectId with which this IRenderMeshes object is associated.
Since: 8.0

Rhino.Render.CustomRenderMeshes.RenderMeshes.Document
The document with which this IRenderMeshes object is associated.
Since: 8.0

Rhino.Render.CustomRenderMeshes.RenderMeshes.Hash
The running hash for these render meshes.
Since: 8.6

Rhino.Render.CustomRenderMeshes.RenderMeshes.GetHashCode
Overrides default hash code function - just returns Hash
Returns:

Rhino.Render.CustomRenderMeshes.RenderMeshes.Finalize
Finalizer for this collection

Rhino.Render.CustomRenderMeshes.RenderMeshes.Dispose
Dispose this collection
Since: 8.0

Rhino.Render.CustomRenderMeshes.RenderMeshes.Dispose(System.Boolean)
Dispose
isDisposing: