Rhino.ApplicationSettings.CommandPromptPosition
Defines enumerated constant values for default positions of the command prompt inside the frame of the full editor window.
Since: 5.0

Rhino.ApplicationSettings.CommandPromptPosition.Top
The command prompt is shown on top.

Rhino.ApplicationSettings.CommandPromptPosition.Bottom
The command prompt is shown at the bottom.

Rhino.ApplicationSettings.CommandPromptPosition.Floating
The command prompt is shown floating.

Rhino.ApplicationSettings.CommandPromptPosition.Hidden
The command prompt is shown hidden.