Rhino.DocObjects.Tables.LinetypeTableEventType
LinetypeTable event types
Since: 8.0

Rhino.DocObjects.Tables.LinetypeTableEventType.Added
A linetype was added.

Rhino.DocObjects.Tables.LinetypeTableEventType.Deleted
A linetype was deleted.

Rhino.DocObjects.Tables.LinetypeTableEventType.Undeleted
A linetype was undeleted.

Rhino.DocObjects.Tables.LinetypeTableEventType.Modified
A linetype was modified.

Rhino.DocObjects.Tables.LinetypeTableEventType.Sorted
The linetype table was sorted.

Rhino.DocObjects.Tables.LinetypeTableEventType.Current
The current linetype has changed.