Rhino.Render.TextureGraphInfo.CppPointer
Since: 6.3

Rhino.Render.TextureGraphInfo.#ctor
Since: 6.3

Rhino.Render.TextureGraphInfo.Dispose
Since: 6.3

Rhino.Render.TextureGraphInfo.AmountU
Since: 6.3

Rhino.Render.TextureGraphInfo.SetAmountU(System.Double)
Since: 6.3

Rhino.Render.TextureGraphInfo.AmountV
Since: 6.3

Rhino.Render.TextureGraphInfo.SetAmountV(System.Double)
Since: 6.3

Rhino.Render.TextureGraphInfo.AmountW
Since: 6.3

Rhino.Render.TextureGraphInfo.SetAmountW(System.Double)
Since: 6.3

Rhino.Render.TextureGraphInfo.ActiveAxis
Since: 6.3

Rhino.Render.TextureGraphInfo.SetActiveAxis(Rhino.Render.TextureGraphInfo.Axis)
Since: 6.3

Rhino.Render.TextureGraphInfo.ActiveChannel
Since: 6.3

Rhino.Render.TextureGraphInfo.SetActiveChannel(Rhino.Render.TextureGraphInfo.Channel)
Since: 6.3