Rhino.PlugIns.DigitizerPlugIn
A Rhino plug-in that interfaces with 3-D digitizing or input devices.

Rhino.PlugIns.DigitizerPlugIn.EnableDigitizer(System.Boolean)
Called by Rhino to enable/disable input from the digitizer.
If enable is true and EnableDigitizer() returns false, then
Rhino will not calibrate the digitizer.
enable:
If true, enable the digitizer. If false, disable the digitizer.
Returns: true if the operation succeeded; otherwise, false.

Rhino.PlugIns.DigitizerPlugIn.DigitizerUnitSystem
Unit system of the points the digitizer passes to SendPoint().
Rhino uses this value when it calibrates a digitizer.
This unit system must be not change.

Rhino.PlugIns.DigitizerPlugIn.PointTolerance
The point tolerance is the distance the digitizer must move
(in digitizer coordinates) for a new point to be considered
real rather than noise. Small desktop digitizer arms have
values like 0.001 inches and 0.01 millimeters.  This value
should never be smaller than the accuracy of the digitizing
device.

Rhino.PlugIns.DigitizerPlugIn.SendPoint(Rhino.Geometry.Point3d,Rhino.UI.MouseButton,System.Boolean,System.Boolean)
If the digitizer is enabled, call this function to send a point to Rhino.
Call this function as much as you like.  The digitizers that Rhino currently
supports send a point every 15 milliseconds or so. This function should be
called when users press or release any digitizer button.
point: 3d point in digitizer coordinates.
mousebuttons: corresponding digitizer button is down.
shiftKey: true if the Shift keyboard key was pressed. Otherwise, false.
controlKey: true if the Control keyboard key was pressed. Otherwise, false.
Since: 6.0

Rhino.PlugIns.DigitizerPlugIn.SendRay(Rhino.Geometry.Ray3d,Rhino.UI.MouseButton,System.Boolean,System.Boolean)
If the digitizer is enabled, call this function to send a point and direction to Rhino.
Call this function as much as you like.  The digitizers that Rhino currently
supports send a point every 15 milliseconds or so. This function should be
called when users press or release any digitizer button.
ray: 3d ray in digitizer coordinates.
mousebuttons: corresponding digitizer button is down.
shiftKey: true if the Shift keyboard key was pressed. Otherwise, false.
controlKey: true if the Control keyboard key was pressed. Otherwise, false.
Since: 6.0