Rhino.Display.ColorHSV
Represents an HSV (Hue, Saturation, Value) color with double precision floating point channels.
HSV colors (also sometimes called HSB, where B means Brightness) are similar to HSL colors in that they
represent colors in a cylindrical color space, and are intended to provide intuitive means to edit the
brightness of a particular color over RGB color space where each color channel would need to be
modified to affect the color brightness.

Rhino.Display.ColorHSV.m_a
Alpha values are inverted internally! 0 = opaque; 1 = transparent!

Rhino.Display.ColorHSV.#ctor(System.Drawing.Color)
Constructs a new instance of ColorHSV that is equivalent to an ARGB color.
rgb: ARGB color to mimic.
Remarks: Exact conversions between color spaces are often not possible.
Since: 6.0

Rhino.Display.ColorHSV.#ctor(System.Double,System.Double,System.Double)
Constructs a new instance of ColorHSV with custom channel values.
hue: Hue channel value. Hue channels rotate between 0.0 and 1.0.
saturation: Saturation channel value. Channel will be limited to 0~1.
value: Value (Brightness) channel value. Channel will be limited to 0~1.
Since: 6.0

Rhino.Display.ColorHSV.#ctor(System.Double,System.Double,System.Double,System.Double)
Constructs a new instance of ColorHSV with custom channel values.
alpha: Alpha channel value. Channel will be limited to 0~1.
hue: Hue channel value. Hue channels rotate between 0.0 and 1.0.
saturation: Saturation channel value. Channel will be limited to 0~1.
value: Value (Brightness) channel value. Channel will be limited to 0~1.
Since: 6.0

Rhino.Display.ColorHSV.CreateFromRGBA(Rhino.Display.ColorRGBA)
Create the nearest HSV equivalent of a RGBA color.
rgba: Target color in RGBA space.
Returns: The HSV equivalent of the RGBA color.
Since: 7.0

Rhino.Display.ColorHSV.CreateFromHSL(Rhino.Display.ColorHSL)
Constructs the nearest HSV equivalent of an HSL color.
hsl: Target color in HSL space.
Returns: The HSV equivalent of the HSL color.
Since: 6.0

Rhino.Display.ColorHSV.CreateFromCMYK(Rhino.Display.ColorCMYK)
Create the nearest HSV equivalent of a CMYK color.
cmyk: Target color in CMYK space.
Returns: The HSV equivalent of the CMYK color.
Since: 6.0

Rhino.Display.ColorHSV.CreateFromXYZ(Rhino.Display.ColorXYZ)
Create the nearest HSV equivalent of an XYZ color.
xyz: Target color in XYZ space.
Returns: The HSV equivalent of the XYZ color.
Since: 6.0

Rhino.Display.ColorHSV.CreateFromLAB(Rhino.Display.ColorLAB)
Create the nearest HSV equivalent of a LAB color.
lab: Target color in LAB space.
Returns: The HSV equivalent of the LAB color.
Since: 6.0

Rhino.Display.ColorHSV.CreateFromLCH(Rhino.Display.ColorLCH)
Create the nearest HSV equivalent of a LCH color.
lch: Target color in LCH space.
Returns: The HSV equivalent of the LCH color.
Since: 6.0

Rhino.Display.ColorHSV.op_Implicit(Rhino.Display.ColorHSV)~System.Drawing.Color
Implicitly converts a ColorHSV in a .Net library color.
hsv: A HSV color.
Returns: A ARGB .Net library color.

Rhino.Display.ColorHSV.H
Gets or sets the hue channel value.
Hue channels rotate between 0.0 and 1.0.
Since: 6.0

Rhino.Display.ColorHSV.S
Gets or sets the saturation channel value.
Saturation channels are limited to a 0~1 range.
Since: 6.0

Rhino.Display.ColorHSV.V
Gets or sets the value (brightness) channel value.
Value channels are limited to a 0~1 range.
Since: 6.0

Rhino.Display.ColorHSV.A
Gets or sets the alpha channel value.
Alpha channels are limited to a 0~1 range.
Since: 6.0

Rhino.Display.ColorHSV.ToArgbColor
Convert HSV color to an equivalent System.Drawing.Color.
Returns: A .Net framework library color value.
Since: 6.0