Rhino.Render.RenderContentCollection
A collection of Render content

Rhino.Render.RenderContentCollection.CppPointer
Internal function to get native pointer
Since: 6.0

Rhino.Render.RenderContentCollection.#ctor
Construct an empty collection of RenderContent objects
Since: 6.0

Rhino.Render.RenderContentCollection.#ctor(System.IntPtr)
Internal function to create collection from native pointer
nativePtr: Native pointer
Since: 6.0

Rhino.Render.RenderContentCollection.Finalize
Finalizer for RenderContentCollection

Rhino.Render.RenderContentCollection.Dispose
Dispose function for RenderContentCollection
Since: 6.0

Rhino.Render.RenderContentCollection.GetFilterContentByUsage
Gets usage filter type for collection
Returns: Usage filter type for collection
Since: 6.9

Rhino.Render.RenderContentCollection.GetForcedVaries
See SetForcedVaries
Returns: Forced varies
Since: 6.9

Rhino.Render.RenderContentCollection.SetForcedVaries(System.Boolean)
Set the collection to 'varies'.
Only valid if the collection is a 'selection' collection.
Useful for clients that only support single content selections.
b: Varies if true
Since: 6.9

Rhino.Render.RenderContentCollection.SetSearchPattern(System.String)
Sets a search pattern for filtering contents. This is not actually used by the iterator,
but is stored for use by any UI that wants to filter contents based on a search string
by using the function RhRdkCheckSearchPattern()
pattern: The search pattern. See RhRdkCheckSearchPattern() for details
Since: 6.0

Rhino.Render.RenderContentCollection.GetSearchPattern
See SetSearchPattern
Returns:
Since: 6.0

Rhino.Render.RenderContentCollection.FirstTag
Gets the first tag
Returns: The first tag
Since: 6.13

Rhino.Render.RenderContentCollection.NextTag
Call FirstTag first - this gets the next tag
Returns: The next tag
Since: 6.13

Rhino.Render.RenderContentCollection.ContentNeedsPreviewThumbnail(Rhino.Render.RenderContent,System.Boolean)
To be documented
c:
includeChildren:
Returns:
Since: 7.0

Rhino.Render.RenderContentCollection.Remove(Rhino.Render.RenderContentCollection)
Remove an array of contents from the collection.
collection: Collection of contents to remove
Since: 6.0

Rhino.Render.RenderContentCollection.Add(Rhino.Render.RenderContentCollection)
Add an array of non-const contents to the collection.
collection: The array of contents to add
Since: 6.0

Rhino.Render.RenderContentCollection.Set(Rhino.Render.RenderContentCollection)
Set an array of const contents as the collection.
collection: The array of contents to set.
Since: 6.0

Rhino.Render.RenderContentCollection.Clear
Clear the collection.
Since: 6.0

Rhino.Render.RenderContentCollection.Append(Rhino.Render.RenderContent)
Append a RenderContent to the collection
content: The array of contents to append.
Since: 6.0

Rhino.Render.RenderContentCollection.Count
The number of items in the collection.
Returns: The number of items in the collection.
Since: 6.0

Rhino.Render.RenderContentCollection.Iterator
Gets an iterator for the collection
Returns:
Since: 6.0

Rhino.Render.RenderContentCollection.Find_Sel(System.Guid)
TODO
uuid:
Returns:
Since: 6.0

Rhino.Render.RenderContentCollection.ContentAt(System.Int32)
Content at index
index:
Returns:
Since: 6.0

Rhino.Render.RenderContentCollection.GetEnumerator
Since: 6.0