Rhino.PlugIns.VerifyLicenseKeyDelegate
Called by Rhino to verify a license key. For details, see http://developer.rhino3d.com/guides/rhinocommon/rhinocommon-zoo-plugins/
licenseKey: A license key string. Will be null if user clicks Evaluate.
validationCode: An optional validation code, passed on a second call to ValidateProductKeyDelegate if the first call set LicenseData.RequiresOnlineValidation to true
validationCodeInstallDate: The date the validation code was saved
gracePeriodExpired: Whether the validation grace period has passed
licenseData: Output parameter where your delegate can set return data, such as error messages to display to the user.
Returns: