Rhino.ApplicationSettings.OpenGLSettingsState
Represents a snapshot of Rhino.ApplicationSettings.OpenGLSettings

Rhino.ApplicationSettings.OpenGLSettingsState.AntialiasLevel
AA level used in OpenGL viewports
Since: 6.1