Rhino.UnitsChangedWithScalingEventArgs
Provides information about UnitsChangedWithScaling events.
Since: 7.20

Rhino.UnitsChangedWithScalingEventArgs.DocumentSerialNumber
Gets the uniques document serial number for this event.
Since: 7.20

Rhino.UnitsChangedWithScalingEventArgs.Document
Gets the document for this event. This field might be null.
Since: 7.20

Rhino.UnitsChangedWithScalingEventArgs.Scale
The scale factor.
Since: 7.20