Rhino.Render.Fields.DoubleField
double field value class

Rhino.Render.Fields.DoubleField.#ctor(Rhino.Render.RenderContent,System.IntPtr)
Constructor
renderContent: RenderContent whose Fields owns this filed.
attachToPointer: Existing C++ pointer to attach to.

Rhino.Render.Fields.DoubleField.Value
Gets or sets the field value
Since: 5.1

Rhino.Render.Fields.DoubleField.ValueAsObject
Since: 5.7