Rhino.RhinoDoc.RenderContentTableEventType
Type of content table event
Since: 5.7

Rhino.RhinoDoc.RenderContentTableEventType.Loaded
The document has been read and the table has been loaded

Rhino.RhinoDoc.RenderContentTableEventType.Clearing
The table is about to be cleared

Rhino.RhinoDoc.RenderContentTableEventType.Cleared
The table has been cleared

Rhino.RhinoDoc.RenderContentTableEventType.MaterialAssignmentChanged
Object or layer material assignment changed