Rhino.Display.DisplayConduit.Enabled
Since: 5.0

Rhino.Display.DisplayConduit.OnEnable(System.Boolean)
Called when the enabled state changes for this class instance
enable:
Since: 7.0

Rhino.Display.DisplayConduit.GeometryFilter
The geometry filter will ensure that your conduit's per-object functions
will only be called for objects that are of certain geometry type
Since: 7.0

Rhino.Display.DisplayConduit.SetSelectionFilter(System.Boolean,System.Boolean)
The selection filter will make per-object conduit functions only be
called for selected objects (when the filter is turned on)
on:
checkSubObjects:
Since: 7.0

Rhino.Display.DisplayConduit.GetSelectionFilter(System.Boolean@,System.Boolean@)
The selection filter will make per-object conduit functions only be
called for selected objects (when the filter is turned on)
on:
checkSubObjects:
Since: 7.0

Rhino.Display.DisplayConduit.SetObjectIdFilter(System.Guid)
Set an object Id that this conduit's per-object functions will
only be called for
id:
Since: 7.0

Rhino.Display.DisplayConduit.SetObjectIdFilter(System.Collections.Generic.IEnumerable{System.Guid})
Set object Ids that this conduit's per-object functions will
only be called for
ids:
Since: 7.0

Rhino.Display.DisplayConduit.SpaceFilter
If you want this conduit to only work in a specific space (model or page),
then set this filter to that specific space. The default is None meaning
no filter is applied
Since: 6.0

Rhino.Display.DisplayConduit.ObjectCulling(Rhino.Display.CullObjectEventArgs)
The default implementation does nothing.
e:

Rhino.Display.DisplayConduit.CalculateBoundingBox(Rhino.Display.CalculateBoundingBoxEventArgs)
Library developers should override this function to increase the bounding box of scene so it includes the
geometry that you plan to draw in the "Draw" virtual functions.
The default implementation does nothing.
e: The event argument contain the current bounding box state.

Rhino.Display.DisplayConduit.CalculateBoundingBoxZoomExtents(Rhino.Display.CalculateBoundingBoxEventArgs)
If you want to participate in the Zoom Extents command with your display conduit,
then you will need to override ZoomExtentsBoundingBox.  Typically you could just
call your CalculateBoundingBox override, but you may also want to spend a little
more time here and compute a tighter bounding box for your conduit geometry if
that is needed.
The default implementation does nothing.
e: The event argument contain the current bounding box state.

Rhino.Display.DisplayConduit.PreDrawObjects(Rhino.Display.DrawEventArgs)
Called before objects are been drawn. Depth writing and testing are on.
The default implementation does nothing.
e: The event argument contain the current viewport and display state.

Rhino.Display.DisplayConduit.PreDrawObject(Rhino.Display.DrawObjectEventArgs)
Called before every object in the scene is drawn.
e:

Rhino.Display.DisplayConduit.PostDrawObjects(Rhino.Display.DrawEventArgs)
Called after all non-highlighted objects have been drawn. Depth writing and testing are
still turned on. If you want to draw without depth writing/testing, see DrawForeground.
The default implementation does nothing.
e: The event argument contains the current viewport and display state.

Rhino.Display.DisplayConduit.DrawForeground(Rhino.Display.DrawEventArgs)
Called after all non-highlighted objects have been drawn and PostDrawObjects has been called.
Depth writing and testing are turned OFF. If you want to draw with depth writing/testing,
see PostDrawObjects.
The default implementation does nothing.
e: The event argument contains the current viewport and display state.

Rhino.Display.DisplayConduit.DrawOverlay(Rhino.Display.DrawEventArgs)
If Rhino is in a feedback mode, the draw overlay call allows for temporary geometry to be drawn on top of
everything in the scene. This is similar to the dynamic draw routine that occurs with custom get point.
The default implementation does nothing.
e: The event argument contains the current viewport and display state.