Rhino.DocObjects.MaterialRef.MaterialSource
Determines if the simple material should come from the object or from
it's layer.
Since: 5.10

Rhino.DocObjects.MaterialRef.PlugInId
Identifies a rendering plug-in
Since: 5.10

Rhino.DocObjects.MaterialRef.FrontFaceMaterialId
The Id of the Material used to render the front of an object.
Since: 5.10

Rhino.DocObjects.MaterialRef.BackFaceMaterialId
The Id of the Material used to render the back of an object.
Since: 5.10

Rhino.DocObjects.MaterialRef.FrontFaceMaterialIndex
The index of the material used to render the front of an object
Since: 5.10

Rhino.DocObjects.MaterialRef.BackFaceMaterialIndex
The index of the material used to render the back of an object
Since: 5.10

Rhino.DocObjects.MaterialRef.Dispose
Since: 5.10