Rhino.NodeInCode.ComponentFunctionInfo
Defines the base class for a function representing a component.
This class is abstract.

Rhino.NodeInCode.ComponentFunctionInfo.#ctor(System.String,System.String,System.String,System.Collections.Generic.IReadOnlyList{System.String},System.Collections.Generic.IReadOnlyList{System.String},System.Collections.Generic.IReadOnlyList{System.String},System.Collections.Generic.IReadOnlyList{System.Boolean},System.Collections.Generic.IReadOnlyList{System.String},System.Collections.Generic.IReadOnlyList{System.String},System.Collections.Generic.IReadOnlyList{System.String},System.Guid)
Instantiates a new instance of the function class. This is not meant for public consumption.
name: Name.
namespace: Namespace.
description: Description.
inputNames: Input parameter names.
inputDescriptions: Input parameter descriptions.
inputTypeNames: Input parameter type names.
inputsOptional: Indications for optional inputs.
outputNames: Output names.
outputDescriptions: Output descriptions.
outputTypeNames: Output type names.
componentGuid: Component guid.

Rhino.NodeInCode.ComponentFunctionInfo.Name
The function name.
Since: 6.0

Rhino.NodeInCode.ComponentFunctionInfo.Namespace
The function namespace.
Since: 6.0

Rhino.NodeInCode.ComponentFunctionInfo.IsDefault
Determines if the component is a default one.
Since: 6.0

Rhino.NodeInCode.ComponentFunctionInfo.Description
The function description.
Since: 6.0

Rhino.NodeInCode.ComponentFunctionInfo.InputNames
The function input parameter names.
Since: 6.0

Rhino.NodeInCode.ComponentFunctionInfo.InputDescriptions
The function input parameter descriptions.
Since: 6.0

Rhino.NodeInCode.ComponentFunctionInfo.InputTypeNames
The function input type names.
Since: 6.0

Rhino.NodeInCode.ComponentFunctionInfo.InputsOptional
Indications for each function input parameter whether it is optional.
Since: 6.0

Rhino.NodeInCode.ComponentFunctionInfo.OutputNames
Grasshopper returns several items in general. This property returns the output names.
Since: 6.0

Rhino.NodeInCode.ComponentFunctionInfo.OutputDescriptions
Grasshopper returns several items in general. This property returns the output descriptions.
Since: 6.0

Rhino.NodeInCode.ComponentFunctionInfo.OutputTypeNames
Grasshopper returns several items in general. This property returns the output type names.
Since: 6.0

Rhino.NodeInCode.ComponentFunctionInfo.ComponentGuid
The unique identifier of the Grasshopper component.
It is the original developer's responsibility to ensure that this ID is unique.
Since: 6.0

Rhino.NodeInCode.ComponentFunctionInfo.ToString
Returns a string representing this function.
Returns: The namespace and the name.

Rhino.NodeInCode.ComponentFunctionInfo.FullName
Returns the name of the component prefixed by, if existing, the namespace.
Since: 6.0

Rhino.NodeInCode.ComponentFunctionInfo.FullScriptingName
Shows the full name of the component, including optional periods.
Removes spaces and common operator signs.
Since: 6.0

Rhino.NodeInCode.ComponentFunctionInfo.Evaluate(System.Collections.IEnumerable,System.Boolean,System.String[]@)
Evaluates the component with a set of arguments.
There needs to be an argument for each input param, and each output param gives an entry in the output array.
args: The arguments list. Each item is assigned to each input param, in order.
keepTree: A value indicating whether trees should be considered valid inputs, and should be returned.
In this case, output variables are not simplified to common types.
warnings: A possible list of warnings, or null.
Returns: An array of objects, each representing an output result.
Remarks: For component that store no state, this method is thread safe.
Since: 6.0

Rhino.NodeInCode.ComponentFunctionInfo.SimplifyTreeOutput(System.Object[],System.String[],System.Boolean)
Performs list logical reduction when trees are not used.
input: The computed data.
warnings: A series of warnings.
treatWarningsAsErrors: If warnings should be considered, then this is set to true.
Returns: The simplified object.
Since: 6.0

Rhino.NodeInCode.ComponentFunctionInfo.Invoke(System.Object[])
Runs Rhino.NodeInCode.ComponentFunctionInfo.Evaluate(System.Collections.IEnumerable,System.Boolean,System.String[]@) with keepTree equal to false,
and raises an exception on the first warning.
args: Arguments. One for each component input.
Returns: Items.
Since: 7.0

Rhino.NodeInCode.ComponentFunctionInfo.InvokeSilenceWarnings(System.Object[])
Runs Rhino.NodeInCode.ComponentFunctionInfo.Evaluate(System.Collections.IEnumerable,System.Boolean,System.String[]@) with keepTree equal to false,
then simplifies output with Rhino.NodeInCode.ComponentFunctionInfo.SimplifyTreeOutput(System.Object[],System.String[],System.Boolean) and discards warnings (this is a dangerous operation!).
args: Arguments. One for each component input.
Returns: Items.
Since: 7.0

Rhino.NodeInCode.ComponentFunctionInfo.InvokeKeepTree(System.Object[])
Runs Rhino.NodeInCode.ComponentFunctionInfo.Evaluate(System.Collections.IEnumerable,System.Boolean,System.String[]@) with keepTree equal to true and raises an exception on the first warning.
args: Arguments. One for each component input.
Returns: Items.
Since: 7.0

Rhino.NodeInCode.ComponentFunctionInfo.InvokeKeepTreeSilenceWarnings(System.Object[])
Runs Rhino.NodeInCode.ComponentFunctionInfo.Evaluate(System.Collections.IEnumerable,System.Boolean,System.String[]@) with keepTree equal to true,
and discards warnings (this is a dangerous operation!).
args: Arguments.
Returns: Array of items.
Since: 7.0

Rhino.NodeInCode.ComponentFunctionInfo.Delegate
Returns a delegate that can be directly invoked using a list of arguments.
This flattens trees.
Since: 6.0

Rhino.NodeInCode.ComponentFunctionInfo.DelegateNoWarnings
Returns a delegate that can be directly invoked using a list of arguments.
This flattens trees.
Since: 6.0

Rhino.NodeInCode.ComponentFunctionInfo.DelegateTree
Returns a delegate that can be directly invoked using a list of arguments.
This considers trees and simplifies single-output components.
Since: 6.0

Rhino.NodeInCode.ComponentFunctionInfo.DelegateTreeNoWarnings
Returns a delegate that can be directly invoked using a list of arguments.
This considers trees and simplifies single-output components.
Since: 6.0