Rhino.ApplicationSettings.DraftAngleAnalysisSettings


Rhino.ApplicationSettings.DraftAngleAnalysisSettings.GetDefaultState
Gets the factory settings of the application.
Since: 7.0

Rhino.ApplicationSettings.DraftAngleAnalysisSettings.GetCurrentState
Gets the current settings of the application.
Since: 7.0

Rhino.ApplicationSettings.DraftAngleAnalysisSettings.RestoreDefaults
Commits the default settings as the current settings.
Since: 7.0

Rhino.ApplicationSettings.DraftAngleAnalysisSettings.UpdateFromState(Rhino.ApplicationSettings.DraftAngleAnalysisSettingsState)
Sets all settings to a particular defined joined state.
state: The particular state.
Since: 7.0

Rhino.ApplicationSettings.DraftAngleAnalysisSettings.AngleRange
The angle range.
Since: 7.0

Rhino.ApplicationSettings.DraftAngleAnalysisSettings.ShowIsoCurves
Show isoparametric curves.
Since: 7.0

Rhino.ApplicationSettings.DraftAngleAnalysisSettings.UpDirection
The up direction.
Since: 7.0