Rhino.FileIO.FileFbxReadOptions
Options for reading a Fbx file

Rhino.FileIO.FileFbxReadOptions.Unweld
Since: 8.0

Rhino.FileIO.FileFbxReadOptions.UnweldAngle
Since: 8.0

Rhino.FileIO.FileFbxReadOptions.ImportMeshesAsSubD
Since: 8.0

Rhino.FileIO.FileFbxReadOptions.ImportLights
Since: 8.0

Rhino.FileIO.FileFbxReadOptions.ImportCameras
Since: 8.0

Rhino.FileIO.FileFbxReadOptions.MapFbxYtoRhinoZ
Since: 8.0

Rhino.FileIO.FileFbxReadOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0