Rhino.FileIO.FileXaml
Support for writing Xaml file format

Rhino.FileIO.FileXaml.Write(System.String,Rhino.RhinoDoc,Rhino.FileIO.FileFbxWriteOptions)
Write a Xaml file based on the contents of a RhinoDoc
path: path to write a file to
doc: document to get geometry from
options: options used for generating the Xaml file
Returns: true on success
Since: 8.0