Rhino.Render.ChangeQueue.MappingChannel
Mapping Channel for a ChangeQueue Mesh

Rhino.Render.ChangeQueue.MappingChannel.Local
Local transform for the mapping
Since: 6.0

Rhino.Render.ChangeQueue.MappingChannel.Channel
Get channel number for this MappingChannel
Since: 8.12

Rhino.Render.ChangeQueue.MappingChannel.Mapping
Return TexturMapping for this MappingChannel
Since: 6.0