Rhino.Geometry.AreaMassProperties
Contains static initialization methods and allows access to the computed
metrics of area, area centroid and area moments in closed
planar curves, in meshes, in surfaces, in hatches and in boundary representations.

Rhino.Geometry.AreaMassProperties.Finalize
Passively reclaims unmanaged resources when the class user did not explicitly call Dispose().

Rhino.Geometry.AreaMassProperties.Dispose
Actively reclaims unmanaged resources that this instance uses.
Since: 5.0

Rhino.Geometry.AreaMassProperties.Dispose(System.Boolean)
For derived class implementers.
This method is called with argument true when class user calls Dispose(), while with argument false when
the Garbage Collector invokes the finalizer, or Finalize() method.
You must reclaim all used unmanaged resources in both cases, and can use this chance to call Dispose on disposable fields if the argument is true.
Also, you must call the base virtual method within your overriding method.
disposing: true if the call comes from the Dispose() method; false if it comes from the Garbage Collector finalizer.

Rhino.Geometry.AreaMassProperties.Compute(Rhino.Geometry.Curve)
Computes an AreaMassProperties for a closed planar curve.
closedPlanarCurve: Curve to measure.
Returns: The AreaMassProperties for the given curve or null on failure.
Throws System.ArgumentNullException: When closedPlanarCurve is null.
Since: 5.0

Rhino.Geometry.AreaMassProperties.Compute(Rhino.Geometry.Curve,System.Double)
Computes an AreaMassProperties for a closed planar curve.
closedPlanarCurve: Curve to measure.
planarTolerance: absolute tolerance used to insure the closed curve is planar
Returns: The AreaMassProperties for the given curve or null on failure.
Throws System.ArgumentNullException: When closedPlanarCurve is null.
Since: 5.0

Rhino.Geometry.AreaMassProperties.Compute(Rhino.Geometry.Hatch)
Computes an AreaMassProperties for a hatch.
hatch: Hatch to measure.
Returns: The AreaMassProperties for the given hatch or null on failure.
Throws System.ArgumentNullException: When hatch is null.
Since: 5.0

Rhino.Geometry.AreaMassProperties.Compute(Rhino.Geometry.Mesh)
Computes an AreaMassProperties for a mesh.
mesh: Mesh to measure.
Returns: The AreaMassProperties for the given Mesh or null on failure.
Throws System.ArgumentNullException: When mesh is null.
Since: 5.0

Rhino.Geometry.AreaMassProperties.Compute(Rhino.Geometry.Mesh,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Compute the AreaMassProperties for a single Mesh.
mesh: Mesh to measure.
area: true to calculate area.
firstMoments: true to calculate area first moments, area, and area centroid.
secondMoments: true to calculate area second moments.
productMoments: true to calculate area product moments.
Returns: The AreaMassProperties for the given Mesh or null on failure.
Throws System.ArgumentNullException: When mesh is null.
Since: 6.3

Rhino.Geometry.AreaMassProperties.Compute(Rhino.Geometry.Brep)
Computes an AreaMassProperties for a brep.
brep: Brep to measure.
Returns: The AreaMassProperties for the given Brep or null on failure.
Throws System.ArgumentNullException: When brep is null.
Since: 5.0

Rhino.Geometry.AreaMassProperties.Compute(Rhino.Geometry.Brep,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Compute the AreaMassProperties for a single Brep.
brep: Brep to measure.
area: true to calculate area.
firstMoments: true to calculate area first moments, area, and area centroid.
secondMoments: true to calculate area second moments.
productMoments: true to calculate area product moments.
Returns: The AreaMassProperties for the given Brep or null on failure.
Throws System.ArgumentNullException: When brep is null.
Since: 6.3

Rhino.Geometry.AreaMassProperties.Compute(Rhino.Geometry.Brep,System.Boolean,System.Boolean,System.Boolean,System.Boolean,System.Double,System.Double)
Compute the AreaMassProperties for a single Brep.
brep: Brep to measure.
area: true to calculate area.
firstMoments: true to calculate area first moments, area, and area centroid.
secondMoments: true to calculate area second moments.
productMoments: true to calculate area product moments.
relativeTolerance: The relative tolerance used for the calculation. In overloads of this function where tolerances are not specified, 1.0e-6 is used.
absoluteTolerance: The absolute tolerancwe used for the calculation. In overloads of this function where tolerances are not specified, 1.0e-6 is used.
Returns: The AreaMassProperties for the given Brep or null on failure.
Throws System.ArgumentNullException: When brep is null.
Since: 7.10

Rhino.Geometry.AreaMassProperties.Compute(Rhino.Geometry.Surface)
Computes an AreaMassProperties for a surface.
surface: Surface to measure.
Returns: The AreaMassProperties for the given Surface or null on failure.
Throws System.ArgumentNullException: When surface is null.
Since: 5.0

Rhino.Geometry.AreaMassProperties.Compute(Rhino.Geometry.Surface,System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Compute the AreaMassProperties for a single Surface.
surface: Surface to measure.
area: true to calculate area.
firstMoments: true to calculate area first moments, area, and area centroid.
secondMoments: true to calculate area second moments.
productMoments: true to calculate area product moments.
Returns: The AreaMassProperties for the given Surface or null on failure.
Throws System.ArgumentNullException: When surface is null.
Since: 6.3

Rhino.Geometry.AreaMassProperties.Compute(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase})
Computes the Area properties for a collection of geometric objects.
At present only Breps, Surfaces, Meshes and Planar Closed Curves are supported.
geometry: Objects to include in the area computation.
Returns: The Area properties for the entire collection or null on failure.
Since: 5.1

Rhino.Geometry.AreaMassProperties.Compute(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Computes the AreaMassProperties for a collection of geometric objects.
At present only Breps, Surfaces, Meshes and Planar Closed Curves are supported.
geometry: Objects to include in the area computation.
area: true to calculate area.
firstMoments: true to calculate area first moments, area, and area centroid.
secondMoments: true to calculate area second moments.
productMoments: true to calculate area product moments.
Returns: The AreaMassProperties for the entire collection or null on failure.
Since: 6.3

Rhino.Geometry.AreaMassProperties.Area
Gets the area solution.
Since: 5.0

Rhino.Geometry.AreaMassProperties.AreaError
Gets the uncertainty in the area calculation.
Since: 5.0

Rhino.Geometry.AreaMassProperties.Centroid
Gets the area centroid in the world coordinate system.
Since: 5.0

Rhino.Geometry.AreaMassProperties.CentroidError
Gets the uncertainty in the centroid calculation.
Since: 5.0

Rhino.Geometry.AreaMassProperties.WorldCoordinatesFirstMoments
Returns the world coordinate first moments if they were able to be calculated.
X is integral of "x dm" over the area
Y is integral of "y dm" over the area
Z is integral of "z dm" over the area.
Since: 5.0

Rhino.Geometry.AreaMassProperties.WorldCoordinatesFirstMomentsError
Uncertainty in world coordinates first moments calculation.
Since: 5.0

Rhino.Geometry.AreaMassProperties.WorldCoordinatesSecondMoments
Returns the world coordinate second moments if they were able to be calculated.
X is integral of "xx dm" over the area
Y is integral of "yy dm" over the area
Z is integral of "zz dm" over the area.
Since: 5.0

Rhino.Geometry.AreaMassProperties.WorldCoordinatesSecondMomentsError
Uncertainty in world coordinates second moments calculation.
Since: 5.0

Rhino.Geometry.AreaMassProperties.WorldCoordinatesProductMoments
Returns the world coordinate product moments if they were able to be calculated.
X is integral of "xy dm" over the area
Y is integral of "yz dm" over the area
Z is integral of "zx dm" over the area.
Since: 5.0

Rhino.Geometry.AreaMassProperties.WorldCoordinatesProductMomentsError
Uncertainty in world coordinates second moments calculation.
Since: 5.0

Rhino.Geometry.AreaMassProperties.WorldCoordinatesMomentsOfInertia
The moments of inertia about the world coordinate axes.
X = integral of (y^2 + z^2) dm
Y = integral of (z^2 + x^2) dm
Z = integral of (z^2 + y^2) dm.
Remarks:
What is meant by "moments of inertia" varies widely in textbooks and papers.
The values returned here are the integrals listed in the Summary section.
Some applications may want the values from WorldCoordinatesSecondMoments
instead of the values returned here.
Since: 5.0

Rhino.Geometry.AreaMassProperties.WorldCoordinatesMomentsOfInertiaError
Uncertainty in world coordinates moments of inertia calculation.
Since: 5.0

Rhino.Geometry.AreaMassProperties.WorldCoordinatesRadiiOfGyration
Radii of gyration with respect to world coordinate system.
X = sqrt(integral of (y^2 + z^2) dm/M)
Y = sqrt(integral of (z^2 + x^2) dm/M)
Z = sqrt(integral of (z^2 + y^2) dm/M)
Remarks:
What is meant by "radii of gyration" varies widely in textbooks and papers.
The values returned here are the integrals listed in the Returns section.
Since: 5.0

Rhino.Geometry.AreaMassProperties.CentroidCoordinatesSecondMoments
Second moments with respect to centroid coordinate system.
X = integral of (x-x0)^2 dm
Y = integral of (y-y0)^2 dm
Z = integral of (z-z0)^2 dm
where (x0,y0,z0) = centroid.
Since: 5.0

Rhino.Geometry.AreaMassProperties.CentroidCoordinatesSecondMomentsError
Uncertainty in centroid coordinates second moments calculation.
Since: 5.0

Rhino.Geometry.AreaMassProperties.CentroidCoordinatesProductMoments
Product moments with respect to centroid coordinate system.
Since: 6.26

Rhino.Geometry.AreaMassProperties.CentroidCoordinatesProductMomentsError
Uncertainty in product moments with respect to centroid coordinate system.
Since: 6.26

Rhino.Geometry.AreaMassProperties.CentroidCoordinatesMomentsOfInertia
Moments of inertia with respect to centroid coordinate system.
X = integral of ((y-y0)^2 + (z-z0)^2) dm
Y = integral of ((z-z0)^2 + (x-x0)^2) dm
Z = integral of ((z-z0)^2 + (y-y0)^2) dm
where (x0,y0,z0) = centroid.
Remarks:
What is meant by "moments of inertia" varies widely in textbooks and papers.
The values returned here are the integrals listed in the Summary section.
Some applications may want the values from WorldCoordinatesSecondMoments
instead of the values returned here.
Since: 5.0

Rhino.Geometry.AreaMassProperties.CentroidCoordinatesMomentsOfInertiaError
Uncertainty in centroid coordinates moments of inertia calculation.
Since: 5.0

Rhino.Geometry.AreaMassProperties.CentroidCoordinatesRadiiOfGyration
Radii of gyration with respect to centroid coordinate system.
X = sqrt(integral of ((y-y0)^2 + (z-z0)^2) dm/M)
Y = sqrt(integral of ((z-z0)^2 + (x-x0)^2) dm/M)
Z = sqrt(integral of ((z-z0)^2 + (y-y0)^2) dm/M)
where (x0,y0,z0) = centroid.
Remarks:
What is meant by "radii of gyration" varies widely in textbooks and papers.
The values returned here are the integrals listed in the Returns section.
Since: 5.0

Rhino.Geometry.AreaMassProperties.WorldCoordinatesPrincipalMoments(System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@)
Calculates the eigenvalues and eigenvectors of moments matrix in world coordinates.
x: Principal moment.
xaxis: Principal axis for x.
y: Principal moment.
yaxis: Principal axis for y.
z: Principal moment.
zaxis: Principal axis for z.
Returns: true if successful.
Since: 6.9

Rhino.Geometry.AreaMassProperties.WorldCoordinatesPrincipalMomentsOfInertia(System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@)
Calculates the principal moments of inertia and principal axes with respect to world coordinates.
x: Principal moment.
xaxis: Principal axis for x.
y: Principal moment.
yaxis: Principal axis for y.
z: Principal moment.
zaxis: Principal axis for z.
Returns: true if successful.
Since: 7.3

Rhino.Geometry.AreaMassProperties.CentroidCoordinatesPrincipalMoments(System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@)
Calculates the eigenvalues and eigenvectors of the moments matrix with respect to centroid coordinates.
x: Principal moment.
xaxis: Principal axis for x.
y: Principal moment.
yaxis: Principal axis for y.
z: Principal moment.
zaxis: Principal axis for z.
Returns: true if successful.
Since: 6.9

Rhino.Geometry.AreaMassProperties.CentroidCoordinatesPrincipalMomentsOfInertia(System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@,System.Double@,Rhino.Geometry.Vector3d@)
Calculates the principal moments of inertia and principal axes with respect to centroid coordinates.
x: Principal moment.
xaxis: Principal axis for x.
y: Principal moment.
yaxis: Principal axis for y.
z: Principal moment.
zaxis: Principal axis for z.
Returns: true if successful.
Since: 7.3