Rhino.Render.GroundPlane
Represents an infinite plane for implementation by renderers.
See SupportsFeature.

Rhino.Render.GroundPlane.#ctor
Create a utility object not associated with any document
Since: 6.0

Rhino.Render.GroundPlane.#ctor(Rhino.Render.GroundPlane)
Create a utility object not associated with any document from another object
g:
Since: 6.0

Rhino.Render.GroundPlane.Changed
This event is raised when a GroundPlane property value is changed.
Since: 5.10

Rhino.Render.GroundPlane.CopyFrom(Rhino.Render.FreeFloatingBase)
Since: 6.0

Rhino.Render.GroundPlane.Dispose
Since: 8.0

Rhino.Render.GroundPlane.Enabled
Determines whether the document ground plane is enabled.
Since: 5.0

Rhino.Render.GroundPlane.ShadowOnly
Determines whether the ground plane shows the material assigned, or whether it is transparent, but captures shadows.
Since: 6.0

Rhino.Render.GroundPlane.AutoAltitude
Determines whether the ground plane is fixed by the Altitude property, or whether it is automatically placed at the lowest point in the model.
Since: 6.0

Rhino.Render.GroundPlane.ShowUnderside
If this is off, the ground plane will not be visible when seen from below.
Since: 6.0

Rhino.Render.GroundPlane.Altitude
Height above world XY plane in model units. Auto-altitude is computed if enabled.
Since: 5.0

Rhino.Render.GroundPlane.MaterialInstanceId
Id of material in material table for this ground plane.
Since: 5.0

Rhino.Render.GroundPlane.TextureOffset
Texture mapping offset in world units.
Since: 5.0

Rhino.Render.GroundPlane.TextureSize
Texture mapping single UV span size in world units.
Since: 5.0

Rhino.Render.GroundPlane.TextureRotation
Texture mapping rotation around world origin + offset in degrees.
Since: 5.0

Rhino.Render.GroundPlane.TextureSizeLocked
Texture size locked.
Since: 6.0

Rhino.Render.GroundPlane.TextureOffsetLocked
Texture offset locked.
Since: 6.0