Rhino.Render.PostEffects.PostEffectState.CppPointer
Since: 7.0

Rhino.Render.PostEffects.PostEffectState.#ctor(System.IntPtr)
Since: 7.0

Rhino.Render.PostEffects.PostEffectState.Dispose
Since: 7.0

Rhino.Render.PostEffects.PostEffectState.TryGetValue``1(System.String,``0@)
Since: 7.0

Rhino.Render.PostEffects.PostEffectState.SetValue``1(System.String,``0)
Since: 7.0