Rhino.UI.Controls.IWindow.Created
Since: 6.0

Rhino.UI.Controls.IWindow.Shown
Since: 6.0

Rhino.UI.Controls.IWindow.Enabled
Since: 6.0

Rhino.UI.Controls.IWindow.Caption
Since: 6.0

Rhino.UI.Controls.IWindow.Parent
Since: 6.0

Rhino.UI.Controls.IWindow.Window
Since: 6.0

Rhino.UI.Controls.IWindow.Move(System.Drawing.Rectangle,System.Boolean,System.Boolean)
Since: 6.0