Rhino.Geometry.Collections.BrepCurveList
Provides access to all the underlying curves in a Brep object.

Rhino.Geometry.Collections.BrepCurveList.Count
Gets the number of curves in this list.
Since: 5.6

Rhino.Geometry.Collections.BrepCurveList.Item(System.Int32)
Gets the Curve at the given index.
The index must be valid or an IndexOutOfRangeException will be thrown.
index: Index of Curve to access.
Throws System.IndexOutOfRangeException: Thrown when the index is invalid.
Returns: The Curve at [index].

Rhino.Geometry.Collections.BrepCurveList.Add(Rhino.Geometry.Curve)
Adds a curve
curve: A copy of the curve is added to this brep
Returns:
Index that should be used to reference the geometry.
-1 is returned if the input is not acceptable.
Since: 5.6

Rhino.Geometry.Collections.BrepCurveList.System#Collections#IEnumerable#GetEnumerator
Gets the same enumerator as Rhino.Geometry.Collections.BrepCurveList.GetEnumerator.
Returns: The enumerator.
Since: 5.6

Rhino.Geometry.Collections.BrepCurveList.GetEnumerator
Get an enumerator that visits all curves.
Returns: The enumerator.
Since: 5.6