Rhino.Geometry.Intersect.IntersectionEvent
Provides all the information for a single Curve Intersection event.

Rhino.Geometry.Intersect.IntersectionEvent.IsPoint
All curve intersection events are either a single point or an overlap.
Since: 5.0

Rhino.Geometry.Intersect.IntersectionEvent.IsOverlap
All curve intersection events are either a single point or an overlap.
Since: 5.0

Rhino.Geometry.Intersect.IntersectionEvent.PointA
Gets the point on Curve A where the intersection occurred.
If the intersection type is overlap, then this will return the
start of the overlap region.
Since: 5.0

Rhino.Geometry.Intersect.IntersectionEvent.PointA2
Gets the end point of the overlap on Curve A.
If the intersection type is not overlap, this value is meaningless.
Since: 5.0

Rhino.Geometry.Intersect.IntersectionEvent.PointB
Gets the point on Curve B (or Surface B) where the intersection occurred.
If the intersection type is overlap, then this will return the
start of the overlap region.
Since: 5.0

Rhino.Geometry.Intersect.IntersectionEvent.PointB2
Gets the end point of the overlap on Curve B (or Surface B).
If the intersection type is not overlap, this value is meaningless.
Since: 5.0

Rhino.Geometry.Intersect.IntersectionEvent.ParameterA
Gets the parameter on Curve A where the intersection occurred.
If the intersection type is overlap, then this will return the
start of the overlap region.
Since: 5.0

Rhino.Geometry.Intersect.IntersectionEvent.ParameterB
Gets the parameter on Curve B where the intersection occurred.
If the intersection type is overlap, then this will return the
start of the overlap region.
Since: 5.0

Rhino.Geometry.Intersect.IntersectionEvent.OverlapA
Gets the interval on curve A where the overlap occurs.
If the intersection type is not overlap, this value is meaningless.
Since: 5.0

Rhino.Geometry.Intersect.IntersectionEvent.OverlapB
Gets the interval on curve B where the overlap occurs.
If the intersection type is not overlap, this value is meaningless.
Since: 5.0

Rhino.Geometry.Intersect.IntersectionEvent.SurfacePointParameter(System.Double@,System.Double@)
If this instance records a Curve|Surface intersection event,
and the intersection type is point, then use this function
to get the U and V parameters on the surface where the intersection occurs.
u: Parameter on surface u direction where the intersection occurs.
v: Parameter on surface v direction where the intersection occurs.
Since: 5.0

Rhino.Geometry.Intersect.IntersectionEvent.SurfaceOverlapParameter(Rhino.Geometry.Interval@,Rhino.Geometry.Interval@)
If this instance records a Curve|Surface intersection event,
and the intersection type if overlap, then use this function
to get the U and V domains on the surface where the overlap occurs.
uDomain: Domain along surface U direction for overlap event.
vDomain: Domain along surface V direction for overlap event.
Since: 5.0

Rhino.Geometry.Intersect.IntersectionEvent.CompareEquivalent(Rhino.Geometry.Intersect.IntersectionEvent,Rhino.Geometry.Intersect.IntersectionEvent,System.Double)
Compare intersection events.
eventA: The first intersection event to compare.
eventB: The second intersection event to compare.
relativePointTolerance: The comparison tolerance. If RhinoMath.UnsetValue, then RhinoMath.SqrtEpsilon is used.
Returns: true if the two inputs represent the same intersection, false otherwise.
Since: 7.0

Rhino.Geometry.Intersect.IntersectionEvent.CompareEquivalent(Rhino.Geometry.Intersect.IntersectionEvent,Rhino.Geometry.Intersect.IntersectionEvent,System.Double,Rhino.FileIO.TextLog)
Compare intersection events.
eventA: The first intersection event to compare.
eventB: The second intersection event to compare.
relativePointTolerance: The comparison tolerance. If RhinoMath.UnsetValue, then RhinoMath.SqrtEpsilon is used.
log: If not null and false is returned, then a description of the error is appended to log.
Returns:
Since: 7.0