Rhino.Runtime.RhinoAccounts.RhinoAccountsCannotListenException
Exception thrown when there is no port available on the machine for Rhino to listen for Rhino Accounts' response.

Rhino.Runtime.RhinoAccounts.RhinoAccountsCannotListenException.#ctor(System.String,System.Exception)
Generates a new instance of the exception.
message: The message of the exception.
innerException: The inner exception.
Since: 7.0

Rhino.Runtime.RhinoAccounts.RhinoAccountsCannotListenException.#ctor(System.Exception)
Generates a new instance of the exception.
innerException: The inner exception.
Since: 7.0