Rhino.UI.DrawingUtilities
RhinoCommon Drawing Utilities

Rhino.UI.DrawingUtilities.MakeArgb(System.Byte,System.Byte,System.Byte,System.Byte)
a:
r:
g:
b:
Returns:
Since: 8.0

Rhino.UI.DrawingUtilities.PixelsFromSvg(System.String,System.Int32,System.Int32,System.Boolean,System.Drawing.Color)
Get array of bytes that represent RGBA values for an image of a given
size created from SVG
svg:
width:
height:
premultiplyAlpha: Pre-lends the background color with the pixels based on their alpha value
backgroundColor: Background color - pass Color.Empty if you don't know what to pass.
Returns:
Since: 8.0

Rhino.UI.DrawingUtilities.DarkModeConvertPixel(System.Byte@,System.Byte@,System.Byte@)
Attempt to adjust pixels to an image that works for dark mode
r:
g:
b:
Since: 8.0

Rhino.UI.DrawingUtilities.DarkModeConvertPixels(System.Byte[]@)
Attempt to adjust pixels to an image that works for dark mode
rgbaBytes:
Since: 8.0

Rhino.UI.DrawingUtilities.BitmapFromSvg(System.String,System.Int32,System.Int32)
Create bitmap of a given size from an svg string
svg:
width:
height:
Returns:
Since: 7.6

Rhino.UI.DrawingUtilities.BitmapFromSvg(System.String,System.Int32,System.Int32,System.Boolean)
Create bitmap of a given size from an svg string
svg:
width:
height:
adjustForDarkMode:
Returns:
Since: 8.0

Rhino.UI.DrawingUtilities.SvgToRhinoDibIntPtr(System.String,System.Int32,System.Int32,System.Boolean,System.IntPtr)
Create bitmap of a given size from an svg string
svg:
width:
height:
adjustForDarkMode:
pRhinoDib:
Returns:
Since: 8.0

Rhino.UI.DrawingUtilities.IconFromResource(System.String,System.Reflection.Assembly)
Load a Icon from an embedded resource.
resourceName:
The case-sensitive name of the icon manifest resource being requested.
assembly:
The assembly containing the manifest resource, will use the calling
assembly if null.
Returns:
The Icon resource if found and loaded otherwise null.
Since: 6.0

Rhino.UI.DrawingUtilities.IconFromResource(System.String,System.Drawing.Size,System.Reflection.Assembly)
Load a Icon from an embedded resource.
resourceName:
The case-sensitive name of the icon manifest resource being requested.
size:
The desired size of the icon.
assembly:
The assembly containing the manifest resource, will use the calling
assembly if null.
Returns:
The Icon resource if found and loaded otherwise null.
Since: 6.0

Rhino.UI.DrawingUtilities.BitmapFromIconResource(System.String,System.Reflection.Assembly)
Load a Icon from an embedded resource and convert it to a bitmap of the
specified size.  Will look for a icon image that is greater than or
equal to the requested size, if all images are less than the requested
size the largest image will be used.
resourceName:
assembly:
The assembly containing the manifest resource, will use the calling
assembly if null.
Returns:
Since: 6.12

Rhino.UI.DrawingUtilities.BitmapFromIconResource(System.String,System.Drawing.Size,System.Reflection.Assembly)
Load a Icon from an embedded resource and convert it to a bitmap of the
specified size.  Will look for a icon image that is greater than or
equal to the requested size, if all images are less than the requested
size the largest image will be used.
resourceName:
bitmapSize:
Desired bitmap size
assembly:
The assembly containing the manifest resource, will use the calling
assembly if null.
Returns:
Since: 6.0

Rhino.UI.DrawingUtilities.ImageFromResource(System.String,System.Reflection.Assembly)
Load a Image from an embedded resource.
resourceName:
The case-sensitive name of the image manifest resource being requested.
assembly:
The assembly containing the manifest resource, will use the calling
assembly if null.
Returns:
The Image resource if found and loaded otherwise null.
Since: 6.0

Rhino.UI.DrawingUtilities.LoadBitmapWithScaleDown(System.String,System.Int32,System.Reflection.Assembly)
Loads an icon from an embedded resource and converts it to a bitmap.
If the icon is not a standard size, this function scales down a larger
image.
iconName:
The case-sensitive name of the icon manifest resource being requested.
sizeDesired:
The desired size, in pixels, of the icon.
assembly:
The assembly containing the manifest resource.
Returns:
The icon converted to a bitmap if successful, null otherwise.
Throws System.ArgumentException:
Thrown when iconName is not found as an embedded resource in the
specified assembly.
Since: 6.0

Rhino.UI.DrawingUtilities.LoadIconWithScaleDown(System.String,System.Int32,System.Reflection.Assembly)
Loads an icon from an embedded resource.
If the icon is not a standard size, this function scales down a larger
image.
iconName:
The case-sensitive name of the icon manifest resource being requested.
sizeDesired:
The desired size, in pixels, of the icon.
assembly:
The assembly containing the manifest resource.
Returns: The icon if successful, null otherwise.
Throws System.ArgumentException:
Thrown when iconName is not found as an embedded resource in the
specified assembly.
Since: 6.0

Rhino.UI.DrawingUtilities.IconToBitmap(System.Drawing.Icon,System.Drawing.Size)
Convert a Icon to a Bitmap of the requested size, will stretch the icon
if necessary to fit the requested size.
icon:
size:
Returns:

Rhino.UI.DrawingUtilities.ExtractVistaIcon(System.IO.Stream)
System.Drawing.Icon will not load a Vista-style icon from a stream.
This code works around this limitation.

Rhino.UI.DrawingUtilities.CreateMeshPreviewImage(Rhino.Geometry.Mesh,System.Drawing.Color,System.Drawing.Size)
Creates a preview image of a mesh.
mesh: The mesh.
color: The draw color.
size: The size of the preview image.
Returns: A bitmap if successful, null otherwise.
Since: 6.0

Rhino.UI.DrawingUtilities.CreateMeshPreviewImage(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Collections.Generic.IEnumerable{System.Drawing.Color},System.Drawing.Size)
Creates a preview image of one or more meshes.
meshes: The meshes.
colors: The draw colors, one for each mesh.
size: The size of the preview image.
Returns: A bitmap if successful, null otherwise.
Since: 6.0

Rhino.UI.DrawingUtilities.CreateMeshPreviewImage(Rhino.RhinoDoc,System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},System.Collections.Generic.IEnumerable{System.Drawing.Color},System.Drawing.Size)
Creates a preview image of one or more meshes.
doc: The active document.
meshes: The meshes.
colors: The draw colors, one for each mesh.
size: The size of the preview image.
Returns: A bitmap if successful, null otherwise.
Since: 7.0

Rhino.UI.DrawingUtilities.CreateCurvePreviewGeometry(Rhino.Geometry.Curve,Rhino.DocObjects.Linetype,System.Int32,System.Int32)
Create a series of closed polyline loops representing a curve and a linetype combination.
curve:
linetype:
width:
height:
Returns:
Since: 8.0