Rhino.FileIO.FileLwoReadOptions
Options for reading a Lwo file

Rhino.FileIO.FileLwoReadOptions.Unweld
Since: 8.0

Rhino.FileIO.FileLwoReadOptions.UnweldAngle
Since: 8.0

Rhino.FileIO.FileLwoReadOptions.ToDictionary
Create a dictionary of these options. This dictionary can be passed to the
RhinoDoc.Export function
Returns:
Since: 8.0