Rhino.Render.Fields.Vector2dField.#ctor(Rhino.Render.RenderContent,System.IntPtr,System.String,System.String,Rhino.Geometry.Vector2d)
Constructor
renderContent: RenderContent whose Fields owns this filed.
attachToPointer: Existing C++ pointer to attach to.
key: Field key name
prompt: Field user interface prompt string
value: Initial value for this string field