Rhino.Render.UI.UserInterfaceSection.m_Window
The control created and embedded in the expandable tab control in the content browser.

Rhino.Render.UI.UserInterfaceSection.m_SerialNumber
C++ pointer serial number returned by the C interface wrapper.

Rhino.Render.UI.UserInterfaceSection.m_SearchHint
Search hint helper

Rhino.Render.UI.UserInterfaceSection.m_UserInterfaceSectionDictionary
UserInterfaceSection instance dictionary, the constructor adds objects to the dictionary
and the C++ destructor callback removes them when they get destroyed.