Rhino.Render.Fields.Color4fField.#ctor(Rhino.Render.RenderContent,System.IntPtr,System.String,System.String,Rhino.Display.Color4f)
Constructor
renderContent: RenderContent whose Fields owns this filed.
attachToPointer: Existing C++ pointer to attach to.
key: Field key name
prompt: Field user interface prompt string
value: Initial value for this string field

Rhino.Render.Fields.Color4fField.#ctor(Rhino.Render.RenderContent,System.IntPtr,System.String,System.String,System.Drawing.Color)
Constructor
renderContent: RenderContent whose Fields owns this filed.
attachToPointer: Existing C++ pointer to attach to.
key: Field key name
prompt: Field user interface prompt string
value: Initial value for this string field