Rhino.Render.RenderContent.FromInstanceId(System.Guid)
Search for a C++ pointer of the requested Id
instanceId:
Returns:

Rhino.Render.RenderContent.HarvestData(Rhino.Render.RenderContent)
Implement this to transfer data from another content to this content during creation.
oldContent: An old content object from which the implementation may harvest data.
Returns: The harvested result.

Rhino.Render.RenderContent.RenderContentAdded
Used to monitor render content addition to the document.

Rhino.Render.RenderContent.RenderContentRenamed
Used to monitor render content renaming in the document.

Rhino.Render.RenderContent.RenderContentDeleting
Used to monitor render content deletion from the document.

Rhino.Render.RenderContent.RenderContentReplacing
Used to monitor render content replacing in the document.

Rhino.Render.RenderContent.RenderContentReplaced
Used to monitor render content replacing in the document.

Rhino.Render.RenderContent.RenderContentChanged
Used to monitor render content modifications.

Rhino.Render.RenderContent.RenderContentUpdatePreview
Used to monitor render content preview updates.

Rhino.Render.RenderContent.RenderContentTypeAdded
Used to monitor render content types being registered.

Rhino.Render.RenderContent.RenderContentTypeDeleting
Used to monitor render content types being registered.

Rhino.Render.RenderContent.RenderContentTypeDeleted
Used to monitor render content types being registered.