Rhino.Render.RdkPlugIn.m_rdkPlugInDictionary
Dictionary of valid RdkPlugIn's

Rhino.Render.RdkPlugIn.m_rhinoPlugInId
CRhinoPluIn Id that owns this RdkPlugIn

Rhino.Render.RdkPlugIn.m_rdkPlugInPointer
The RDK C++ CRdkPlugIn pointer associated with this object

Rhino.Render.RdkPlugIn.m_renderContentTypes
List of valid RenderContent class types associated with this plug-in.