Rhino.Render.Fields.FieldDictionary.AddField(Rhino.Render.Fields.Field)
AddField a new Field to the dictionary, will throw an exception if the key
is already in the dictionary or if value is not a supported type.
field:
The new Field object to add, this will not create the Fields C++
pointer, that happens later on after the dictionary C++ object has
been created.
Returns: Returns the newly added Field object.

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.String)
AddField a new StringField to the dictionary, will throw an exception if the
key is already in the dictionary.  This will be a data only field and
not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.String,System.String)
AddField a new StringField to the dictionary, will throw an exception if the
key is already in the dictionary.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Boolean)
AddField a new BoolField to the dictionary, will throw an exception if the
key is already in the dictionary.  This will be a data only field and
not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Boolean,System.String)
AddField a new BoolField to the dictionary, will throw an exception if the
key is already in the dictionary.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Int32)
AddField a new IntField to the dictionary, will throw an exception if the
key is already in the dictionary.  This will be a data only field and
not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Int32,System.String)
AddField a new IntField to the dictionary, will throw an exception if the
key is already in the dictionary.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Single)
AddField a new FloatField to the dictionary, will throw an exception if the
key is already in the dictionary.  This will be a data only field and
not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Single,System.String)
AddField a new FloatField to the dictionary, will throw an exception if the
key is already in the dictionary.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Double)
AddField a new DoubleField to the dictionary, will throw an exception if the
key is already in the dictionary.  This will be a data only field and
not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Double,System.String)
AddField a new DoubleField to the dictionary, will throw an exception if the
key is already in the dictionary.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:

Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Display.Color4f)
AddField a new Color4fField to the dictionary, will throw an exception if the
key is already in the dictionary.  This will be a data only field and
not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:

Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Display.Color4f,System.String)
AddField a new Color4fField to the dictionary, will throw an exception if the
key is already in the dictionary.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Drawing.Color)
AddField a new Color4fField to the dictionary, will throw an exception if the
key is already in the dictionary.  This will be a data only field and
not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Drawing.Color,System.String)
AddField a new Color4fField to the dictionary, will throw an exception if the
key is already in the dictionary.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:

Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Geometry.Vector2d)
AddField a new Vector2dField to the dictionary, will throw an exception if the
key is already in the dictionary.  This will be a data only field and
not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:

Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Geometry.Vector2d,System.String)
AddField a new Vector2dField to the dictionary, will throw an exception if the
key is already in the dictionary.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:

Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Geometry.Vector3d)
AddField a new Vector3dField to the dictionary, will throw an exception if the
key is already in the dictionary.  This will be a data only field and
not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:

Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Geometry.Vector3d,System.String)
AddField a new Vector3dField to the dictionary, will throw an exception if the
key is already in the dictionary.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:

Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Geometry.Point2d)
AddField a new Point2dField to the dictionary, will throw an exception if the
key is already in the dictionary.  This will be a data only field and
not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:

Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Geometry.Point2d,System.String)
AddField a new Point2dField to the dictionary, will throw an exception if the
key is already in the dictionary.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:

Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Geometry.Point3d)
AddField a new Point3dField to the dictionary, will throw an exception if the
key is already in the dictionary.  This will be a data only field and
not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:

Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Geometry.Point3d,System.String)
AddField a new Point3dField to the dictionary, will throw an exception if the
key is already in the dictionary.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:

Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Geometry.Point4d)
AddField a new Point4dField to the dictionary, will throw an exception if the
key is already in the dictionary.  This will be a data only field and
not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:

Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Geometry.Point4d,System.String)
AddField a new Point4dField to the dictionary, will throw an exception if the
key is already in the dictionary.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Guid)
AddField a new GuidField to the dictionary, will throw an exception if the
key is already in the dictionary.  This will be a data only field and
not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Guid,System.String)
AddField a new GuidField to the dictionary, will throw an exception if the
key is already in the dictionary.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:

Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Geometry.Transform)
AddField a new TransformField to the dictionary, will throw an exception if the
key is already in the dictionary.  This will be a data only field and
not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:

Rhino.Render.Fields.FieldDictionary.Add(System.String,Rhino.Geometry.Transform,System.String)
AddField a new TransformField to the dictionary, will throw an exception if the
key is already in the dictionary.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.DateTime)
AddField a new DateTimeField to the dictionary, will throw an exception if the
key is already in the dictionary.  This will be a data only field and
not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns:

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.DateTime,System.String)
AddField a new DateTimeField to the dictionary, will throw an exception if the
key is already in the dictionary.
key: Key name for the field value to change.
value: Initial value for this field.
prompt:
Prompt to display in the user interface (Content Browsers) if this
is null or an empty string the this field is a data only field and will
not appear in the user interface.
Returns:

Rhino.Render.Fields.FieldDictionary.Add(System.String,System.Byte[])
AddField a new ByteArrayField to the dictionary, will throw an exception if the
key is already in the dictionary.  This will be a data only field and
not show up in the content browsers.
key: Key name for the field value to change.
value: Initial value for this field.
Returns: