Rhino.Render.Fields.Field.m_autoDelete
If this is true then the m_fieldPointer is deleted when this object is
disposed of, if Attached is called when accessing data provided by
another plug-in then a temporary version of this field will be returned
and its value extracted by the RenderContent.FieldDictionary, in that
Attach is called instead of CreaetCppPointer() so the m_fieldPointer
should not be deleted.

Rhino.Render.Fields.Field.m_initialValue
Place holder for the initial field value, this will get used by
CreateCppPointer(), it will call Set(m_initialValue) after creating the
C++ pointer to initialize the field value.

Rhino.Render.Fields.Field.m_fieldPointer
C++ pointer associated with this object, used for data access.

Rhino.Render.Fields.Field.m_key
Field key value string set by constructor

Rhino.Render.Fields.Field.m_prompt
Optional UI prompt string set by constructor

Rhino.Render.Fields.Field.#ctor(Rhino.Render.RenderContent,System.IntPtr,System.String,System.String,System.Object)
Field constructor
renderContent: RenderContent whose Fields owns this filed.
attachToPointer: C++ pointer to attach to.
key: Unique key for this field
prompt: Display string used by the user interface
initialValue:
Initial value used to initialize the field after creating the C++
pointer.