Rhino.Geometry.Brep.CreateFromTaperedExtrudeWithRef(Rhino.Geometry.Curve,Rhino.Geometry.Vector3d,System.Double,System.Double,Rhino.Geometry.Plane,System.Double)
Creates one or more surface by extruding a curve a distance along an axis with draft angle.
curve: The curve to extrude.
direction: The extrusion direction.
distance: The extrusion distance.
draftAngle: The extrusion draft angle in radians.
plane:
The end of the extrusion will be perpendicular to this plane, and "distance" from the plane's origin.
The plane's origin is generally be a point on the curve. For planar curves, a natural choice for the
plane's normal direction will be the normal direction of the curve's plane. In any case,
plane.Normal = direction may make sense.
tolerance: The intersecting and trimming tolerance.
Returns: An array of Bre[s if successful.