Rhino.Render.UI.FloatingPreviewManagerBase
This is the abstract interface class for for all Floating Preview Managers.

Rhino.Render.UI.FloatingPreviewManagerBase.#ctor
SnapShotsClient constructor

Rhino.Render.UI.FloatingPreviewManagerBase.Dispose
SnapShotsClient Dispose