Rhino.Geometry.Intersect.Intersection.BrepBrep(Rhino.Geometry.Brep,Rhino.Geometry.Brep,System.Double,Rhino.Geometry.Curve[]@,Rhino.Geometry.Point3d[]@)
Intersects two Breps.
brepA: First Brep for intersection.
brepB: Second Brep for intersection.
tolerance: Intersection tolerance.
intersectionCurves: The intersection curves will be returned here.
intersectionPoints: The intersection points will be returned here.
Returns: true on success; false on failure.
Since: 5.0

Rhino.Geometry.Intersect.Intersection.BrepBrep(Rhino.Geometry.Brep,Rhino.Geometry.Brep,System.Double,System.Boolean,Rhino.Geometry.Curve[]@,Rhino.Geometry.Point3d[]@)
Intersects two Breps.
brepA: First Brep for intersection.
brepB: Second Brep for intersection.
tolerance: Intersection tolerance.
joinCurves: If true, join the resulting curves where possible.
intersectionCurves: The intersection curves will be returned here.
intersectionPoints: The intersection points will be returned here.
Returns: true on success; false on failure.
Since: 8.12

Rhino.Geometry.Intersect.Intersection.BrepSurface(Rhino.Geometry.Brep,Rhino.Geometry.Surface,System.Double,Rhino.Geometry.Curve[]@,Rhino.Geometry.Point3d[]@)
Intersects a Brep and a Surface.
brep: A brep to be intersected.
surface: A surface to be intersected.
tolerance: A tolerance value.
intersectionCurves: The intersection curves array argument. This out reference is assigned during the call.
intersectionPoints: The intersection points array argument. This out reference is assigned during the call.
Returns: true on success; false on failure.
Since: 5.0

Rhino.Geometry.Intersect.Intersection.BrepSurface(Rhino.Geometry.Brep,Rhino.Geometry.Surface,System.Double,System.Boolean,Rhino.Geometry.Curve[]@,Rhino.Geometry.Point3d[]@)
Intersects a Brep and a Surface.
brep: A brep to be intersected.
surface: A surface to be intersected.
tolerance: A tolerance value.
joinCurves: If true, join the resulting curves where possible.
intersectionCurves: The intersection curves array argument. This out reference is assigned during the call.
intersectionPoints: The intersection points array argument. This out reference is assigned during the call.
Returns: true on success; false on failure.
Since: 8.12