Rhino.Geometry.Curve.Split(Rhino.Geometry.Brep,System.Double,System.Double)
Splits a curve into pieces using a polysurface.
cutter: A cutting surface or polysurface.
tolerance: A tolerance for computing intersections.
angleToleranceRadians:
Returns: An array of curves. This array can be empty.
Since: 6.0

Rhino.Geometry.Curve.Split(Rhino.Geometry.Surface,System.Double)
Splits a curve into pieces using a surface.
cutter: A cutting surface or polysurface.
tolerance: A tolerance for computing intersections.
Returns: An array of curves. This array can be empty.
Since: 5.0
6.0

Rhino.Geometry.Curve.Split(Rhino.Geometry.Surface,System.Double,System.Double)
Splits a curve into pieces using a surface.
cutter: A cutting surface or polysurface.
tolerance: A tolerance for computing intersections.
angleToleranceRadians:
Returns: An array of curves. This array can be empty.
Since: 6.0