Rhino.Geometry.Mesh.CreatePartitions(System.Int32,System.Int32)
In ancient times (or modern smartphone times), some rendering engines
were only able to process small batches of triangles and the
CreatePartitions() function was provided to partition the mesh into
subsets of vertices and faces that those renering engines could handle.
maximumVertexCount:
maximumTriangleCount:
Returns: true on success

Rhino.Geometry.Mesh.GetPartition(System.Int32)
which:
Returns: