Rhino.Geometry.BrepFace.CreateExtrusion(Rhino.Geometry.Curve,System.Boolean)
Extrude a face in a Brep.
pathCurve: The path to extrude along.
bCap: If true, the extrusion is capped with a translation of the face being extruded
Returns: A Brep on success or null on failure.