Rhino.DocObjects.InstanceObject.Explode(System.Boolean,System.Guid,System.Boolean,Rhino.DocObjects.RhinoObject[]@,Rhino.DocObjects.ObjectAttributes[]@,Rhino.Geometry.Transform[]@)
Explodes the instance reference into pieces.
skipHiddenPieces:
If true, pieces that are not visible will not be appended to the pieces out parameter.
viewportId:
If skipHiddenPieces is false, then viewportId is ignored.
If bSkipHiddenPieces is true and and viewportId is not Guid.Empty, then layer and object per viewport visibility settings are used.
If bSkipHiddenPieces is true and and viewport_id is Guid.Empty, then layer and object global visibility settings are used.
explodeNestedInstances:
If true, then nested instance references are recursively exploded into pieces until actual geometry is found.
If false, an InstanceObject is added to the pieces out parameter when this InstanceObject has nested references.
pieces: An array of Rhino objects will be assigned to this out parameter during this call.
pieceAttributes: An array of object attributes will be assigned to this out parameter during this call.
pieceTransforms: An array of the previously applied transform matrices will be assigned to this out parameter during this call.
Since: 8.9