Rhino.Render.RenderContentType.NewRenderContent
Returns a new instance of the render content of this type.  This content can be added to a persistant list.
Returns: A new render content instance.
Since: 6.0