Rhino.DocObjects.Tables.LinetypeTable.FindName(System.String)
Finds the linetype with a given name.
name: he name of the linetype to find.
Returns:
The linetype. If the linetype was not found, then the default, or or "Continuous" linetype is returned.
Since: 6.0