Rhino.FileIO.File3dmStringTable.SetString(System.String,System.String)
Adds or sets a a document string in the 3dm file.
key: The key.
value: The entry value.
Returns:
The previous value if successful.
Since: 6.0