Rhino.FileIO.File3dmPlugInDataTable.TryRead(Rhino.FileIO.File3dmPlugInData,System.Func{Rhino.FileIO.File3dm,Rhino.FileIO.BinaryArchiveReader,System.Boolean})
Attempts to read a Rhino plug-in's custom data from the Rhino.FileIO.File3dm file.
pluginData: The plug-in whose data you want to try to read.
dataReader:
The function that will read the data.
This function must be implemented identical to the the originating plug-in's Rhino.PlugIns.PlugIn.ReadDocument(Rhino.RhinoDoc,Rhino.FileIO.BinaryArchiveReader,Rhino.FileIO.FileReadOptions) method.
Returns: The value returned by the data reading function if successful, false otherwise.