Rhino.Geometry.Curve.FindLocalInflection(Rhino.Geometry.Vector3d,Rhino.Geometry.Interval,System.Double,System.Double@,System.Double@)
Local minimization for point on a curve with tangent perpendicular to N.
N:
This vector and the curve tangent define a plane. In this plane, there is a vector V perpendicular to the tangent.
subDomain:
Subdomain of of curve to evaluate. This must not be empty.
seed:
A seed parameter, which must be included in the subdomain.
curveParameter: The parameter on the curve if successful, RhinoMath.UnsetValue if unsuccessful.
angleError:
The measure, in radians, of the angle between N and V. The angle will be zero when the result is an inflection.
Returns: true if the minimization succeeds, regardless of angle_error, false if unsuccessful.
Remarks:
The algorithm minimizes the square of the dot product of N with the curve tangent.
It is possible that the result will not be close to zero.
Since: 8.0

Rhino.Geometry.Curve.PullToMesh(Rhino.Geometry.Mesh,System.Double)
Makes a polyline approximation of the curve and gets the closest point on the mesh for each point on the curve.
Then it "connects the points" so that you have a polyline on the mesh.
mesh: Mesh to project onto.
tolerance: Input tolerance. When in doubt, the the document's model absolute tolerance.
Returns: A curve if success, or null on failure.
Since: 5.0

Rhino.Geometry.Curve.PullToMesh(Rhino.Geometry.Mesh,System.Double,System.Boolean)
Projects this curve onto a mesh.
mesh: Mesh to project onto.
tolerance: Input tolerance. When in doubt, the the document's model absolute tolerance.
loose:
If true, the curve's edit points are pulled back to the mesh.
If any edit point misses the mesh, the curve will not be created.
Returns: A curve if success, or null on failure.
Since: 8.17

Rhino.Geometry.Curve.FilletSurfaceToRail(Rhino.Geometry.BrepFace,Rhino.Geometry.BrepFace,System.Double,System.Double,System.Int32,System.Int32,System.Collections.Generic.IEnumerable{System.Double},System.Int32,System.Boolean,Rhino.Geometry.FilletSurfaceSplitType,System.Double,System.Collections.Generic.List{Rhino.Geometry.Brep},System.Collections.Generic.List{Rhino.Geometry.Brep},System.Collections.Generic.List{Rhino.Geometry.Brep},System.Double[]@)
Creates a surface between two surfaces, with a fixed rail curve on the first surface.
faceWithCurve: The first face on which the curve exists
secondFace: The second face
u1: A parameter in the u direction of the second face at the side you want to keep after filleting.
v1: A parameter in the v direction of the second face at the side you want to keep after filleting.
railDegree: Desired fillet degree (3 or 5) in the u-direction, along the rails
arcDegree: esired fillet degree (2, 3, 4, or 5) in the v-direction, along the fillet arcs.If 2, then the surface is rational in v
arcSliders: Array of 2 sliders to shape the fillet in the arc direction, used for arcDegree = 3, 4, or 5; input { 0.0, 0.0 } to ignore
[0] (-1 to 1) slides tangent arms from base (-1) to theoretical(1)
[1] (-1 to 1) slides inner CV(s) from base (-1) to theoretical(1)
numBezierSrfs: If >0, this indicates the number of equally-spaced fillet surfaces to be output in the rail direction, each surface Bézier in u.
extend: If true, then when one input surface is longer than the other, the fillet surface is extended to the input surface edges.
split_type: The split type
tolerance: The tolerance. In in doubt, the the document's absolute tolerance.
out_fillets: The results of the fillet calculation.
out_breps0: The trim or split results of the Brep owned by faceWithCurve.
out_breps1: The trim or split results of the Brep owned by pFace1.
fitResults: array of doubles indicating fitting results:
[0] max 3d point deviation along surface 0
[1] max 3d point deviation along surface 1
[2] max angle deviation along surface 0 (in degrees)
[3] max angle deviation along surface 1 (in degrees)
[4] max angle deviation between Bézier surfaces(in degrees)
[5] max curvature difference between Bézier surfaces
Returns:  true if successful, false otherwise.
Remarks: The trim or split input Breps are in OutBreps0, and OutBreps1. If the input faces are
from the same Brep, nothing will be added to OutBreps1.If you specified a split type
of RhinoFilletSurfaceSplitType::Nothing, then nothing will be added to either OutBreps0
or OutBreps1.
Since: 8.0

Rhino.Geometry.Curve.FilletSurfaceToCurve(Rhino.Geometry.BrepFace,System.Double,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Collections.Generic.IEnumerable{System.Double},System.Int32,System.Double,System.Collections.Generic.List{Rhino.Geometry.Brep},System.Double[]@)
Creates a constant-radius fillet surface between a surface and the curve.
face: the face being filleted.
t: A parameter on the curve, indicating region of fillet.
u: A parameter in the u direction of the face indicating which side of the curve to fillet.
v: A parameter in the v direction of the face indicating which side of the curve to fillet.
radius: The radius of the constant-radius fillet desired. NOTE: using arcSliders will change the shape of the arcs themselves
alignToCurve: Does the user want the fillet to align to the curve?
0 - No, ignore the curve's b-spline structure
1 - Yes, match the curves's degree, spans, CVs as much as possible
2 - Same as 1, but iterate to fit to tolerance
Note that a value of 1 or 2 will cause nBezierSrfs to be ignored
railDegree: Desired fillet degree (3 or 5) in the u-direction, along the curve
arcDegree: Desired fillet degree (2, 3, 4, or 5) in the v-direction, along the fillet arcs.If 2, then the surface is rational in v
arcSliders: Array of 2 sliders to shape the fillet in the arc direction, used for arcDegree = 3, 4, or 5; input { 0.0, 0.0 } to ignore
[0] (-1 to 1) slides tangent arms from base (-1) to theoretical(1)
[1] (-1 to 1) slides inner CV(s) from base (-1) to theoretical(1)
numBezierSrfs: If >0, this indicates the number of equally-spaced fillet surfaces to be output in the rail direction, each surface Bézier in u.
tolerance: The tolerance. In in doubt, the the document's absolute tolerance.
out_fillets: he results of the fillet calculation.
fitResults: array of doubles indicating fitting results:
[0] max 3d point deviation along curve
[1] max 3d point deviation along face
[2] max angle deviation along face(in degrees)
[3] max angle deviation between Bézier surfaces(in degrees)
[4] max curvature difference between Bézier surfaces
Returns: true if successful, false otherwise.
Since: 8.0