Rhino.FileIO.File3dmObject.TryReadUserData(System.Guid,System.Boolean,System.Func{Rhino.FileIO.File3dm,Rhino.FileIO.BinaryArchiveReader,System.Boolean})
Attempts to read a Rhino plug-in's custom userdata from the Rhino.FileIO.File3dmObject object.
userDataId: The id of the custom userdata object whose data you want to try to read
readFromAttributes:
Set true to attempt to read custom userdata object from the object's Rhino.FileIO.File3dmObject.Attributes.
Set false to attempt to read custom userdata object from the object's Rhino.FileIO.File3dmObject.Geometry.
dataReader:
The function that will read the data.
This function must be implemented identical to the the originating Rhino.DocObjects.Custom.UserData-inherited class's Read method.
Returns: The value returned by the data reading function if successful, false otherwise.