Rhino.Geometry.Mesh.CreateFromClosedPolylinesAndPoints(Rhino.Geometry.Point2d[],System.Int32[][],System.Boolean,System.Boolean,System.Double,Rhino.TesselationFailure@)
Attempts to create a Mesh that is a triangulation of an outermost simple closed polyline possibly with holes, all supplied by loops.
The loops are indices into the points array. All loops have to be closed - meaning that their first and last entries have to be the same -, free from self-intersections, and not intersecting each other.
The outermost loop will be interpreted as representing the outer boundary, and all other loops will be interpreted as holes.
Loops that are nested to deeper levels will be ignored.
This function will perform a fast de-duplication of the points before meshing.
This function may fail and return null, in which case it gives the caller some indication about what went wrong in its TesselationFailure argument.
points: The input point array.
loopIndices: The indices of closed loops standing for the inner and outer boundaries of the region to be meshed.
permitVertexAdditions: Boolean to indicate if you are fine with new vertices
permitEdgeSplitting: Boolean to indicate if you are with with your edges getting split
tolerance: The tolerance to use for de-duplicating the points.
failure: [out] The reason for failure, if any.
Returns:
New mesh on success or null on failure.

Rhino.Geometry.Mesh.MatchEdges(System.Double,System.Boolean)
Moves face edges of an open mesh to meet adjacent face edges.
The method will first try to match vertices, and then then it will try to split edges to make the edges match.
distance: The distance tolerance. Use larger tolerances only if you select specific edges to close.
rachet:
If true, matching the mesh takes place in four passes starting at a tolerance that is smaller
than your specified tolerance and working up to the specified tolerance with successive passes.
This matches small edges first and works up to larger edges.
If false, then a single pass is made.
Returns: True of edges were matched, false otherwise.
Since: 7.4

Rhino.Geometry.Mesh.Reduce(System.Int32,System.Boolean,System.Int32,System.Boolean)
Reduce polygon count
desiredPolygonCount: desired or target number of faces
allowDistortion:
If true mesh appearance is not changed even if the target polygon count is not reached
accuracy: Integer from 1 to 10 telling how accurate reduction algorithm
to use. Greater number gives more accurate results
normalizeSize: If true mesh is fitted to an axis aligned unit cube until reduction is complete
Returns: True if mesh is successfully reduced and false if mesh could not be reduced for some reason.
Since: 5.10

Rhino.Geometry.Mesh.Reduce(System.Int32,System.Boolean,System.Int32,System.Boolean,System.Boolean)
Reduce polygon count
desiredPolygonCount: desired or target number of faces
allowDistortion:
If true mesh appearance is not changed even if the target polygon count is not reached
accuracy: Integer from 1 to 10 telling how accurate reduction algorithm
to use. Greater number gives more accurate results
normalizeSize: If true mesh is fitted to an axis aligned unit cube until reduction is complete
threaded:
If True then will run computation inside a worker thread and ignore any provided CancellationTokens and ProgressReporters.
If False then will run on main thread.
Returns: True if mesh is successfully reduced and false if mesh could not be reduced for some reason.
Since: 6.15

Rhino.Geometry.Mesh.Reduce(System.Int32,System.Boolean,System.Int32,System.Boolean,System.Threading.CancellationToken,System.IProgress{System.Double},System.String@)
Reduce polygon count
desiredPolygonCount: desired or target number of faces
allowDistortion:
If true mesh appearance is not changed even if the target polygon count is not reached
accuracy: Integer from 1 to 10 telling how accurate reduction algorithm
to use. Greater number gives more accurate results
normalizeSize: If true mesh is fitted to an axis aligned unit cube until reduction is complete
cancelToken:
progress:
problemDescription:
Returns: True if mesh is successfully reduced and false if mesh could not be reduced for some reason.
Since: 6.0

Rhino.Geometry.Mesh.Reduce(System.Int32,System.Boolean,System.Int32,System.Boolean,System.Threading.CancellationToken,System.IProgress{System.Double},System.String@,System.Boolean)
Reduce polygon count
desiredPolygonCount: desired or target number of faces
allowDistortion:
If true mesh appearance is not changed even if the target polygon count is not reached
accuracy: Integer from 1 to 10 telling how accurate reduction algorithm
to use. Greater number gives more accurate results
normalizeSize: If true mesh is fitted to an axis aligned unit cube until reduction is complete
cancelToken:
progress:
problemDescription:
threaded:
If True then will run computation inside a worker thread and ignore any provided CancellationTokens and ProgressReporters.
If False then will run on main thread.
Returns: True if mesh is successfully reduced and false if mesh could not be reduced for some reason.
Since: 6.15