Rhino.DocObjects.InstanceDefinitionLayerStyle.Reference
Layers from the linked instance definition are reference components in the model.
This is the default layer style when the instance definition type is InstanceDefinitionUpdateType.Linked.
This layer style may be used when the instance definition type is is InstanceDefinitionUpdateType.Linked.