Rhino.Geometry.SubDHashType.Topology
The Topology hash includes component ids, and all topological relationships
between vertices, edges, and faces. If two SubDs have the same topology hash,
then the the have identical labeled control net topology.