Rhino.Render.RdkPlugIn.FromRenderContentClassType(System.Type)
Check each RdkPlugIn in the Render Development Kit(RDK) dictionary and
return the first one found that contains the specified content contentType.
type: Class contentType to search for
Returns:
If there is a plug-in in the dictionary that registered the requested
contentType then return the plug-in, if not then return null.