Rhino.Geometry.BrepFace.RefitTrim(Rhino.Geometry.BrepEdge,System.Collections.Generic.IEnumerable{System.Double},System.Double,System.Boolean,System.Double@)
The RefitTrim command replaces a trimmed surface edge with an untrimmed edge.
edge: The edge to fit.
knots: The custom knot vector to use, or an empty vector to use the existing knots of the surface.
tolerance: The 3d tolerance for projection, splitting, and fitting.
bSections: If true, the surface is divided into seperate surface patches at all knots.
fitQuality: A measure of the 3d fit to the trim curve.
Returns: The trimmed surfaces.
Since: 7.0

Rhino.Geometry.BrepFace.FilletSurfaceToRail(Rhino.Geometry.Curve,Rhino.Geometry.BrepFace,System.Double,System.Double,System.Int32,System.Int32,System.Collections.Generic.IEnumerable{System.Double},System.Int32,System.Boolean,Rhino.Geometry.FilletSurfaceSplitType,System.Double,System.Collections.Generic.List{Rhino.Geometry.Brep},System.Collections.Generic.List{Rhino.Geometry.Brep},System.Collections.Generic.List{Rhino.Geometry.Brep},System.Double[]@)
Creates a surface between two surfaces, with a fixed rail curve on the first surface.
curveOnFace: A curve on this face
secondFace: The second face
u1: A parameter in the u direction of the second face at the side you want to keep after filleting.
v1: A parameter in the v direction of the second face at the side you want to keep after filleting.
railDegree: Desired fillet degree (3 or 5) in the u-direction, along the rails
arcDegree: esired fillet degree (2, 3, 4, or 5) in the v-direction, along the fillet arcs.If 2, then the surface is rational in v
arcSliders: Array of 2 sliders to shape the fillet in the arc direction, used for arcDegree = 3, 4, or 5; input { 0.0, 0.0 } to ignore
[0] (-1 to 1) slides tangent arms from base (-1) to theoretical(1)
[1] (-1 to 1) slides inner CV(s) from base (-1) to theoretical(1)
numBezierSrfs: If >0, this indicates the number of equally-spaced fillet surfaces to be output in the rail direction, each surface Bézier in u.
extend: If true, then when one input surface is longer than the other, the fillet surface is extended to the input surface edges.
split_type: The split type
tolerance: The tolerance. In in doubt, the the document's absolute tolerance.
out_fillets: The results of the fillet calculation.
out_breps0: The trim or split results of the Brep owned by faceWithCurve.
out_breps1: The trim or split results of the Brep owned by pFace1.
fitResults: array of doubles indicating fitting results:
[0] max 3d point deviation along surface 0
[1] max 3d point deviation along surface 1
[2] max angle deviation along surface 0 (in degrees)
[3] max angle deviation along surface 1 (in degrees)
[4] max angle deviation between Bézier surfaces(in degrees)
[5] max curvature difference between Bézier surfaces
Returns:  true if successful, false otherwise.
Remarks: The trim or split input Breps are in OutBreps0, and OutBreps1. If the input faces are
from the same Brep, nothing will be added to OutBreps1.If you specified a split type
of RhinoFilletSurfaceSplitType::Nothing, then nothing will be added to either OutBreps0
or OutBreps1.
Since: 8.0

Rhino.Geometry.BrepFace.FilletSurfaceToCurve(Rhino.Geometry.Curve,System.Double,System.Double,System.Double,System.Double,System.Int32,System.Int32,System.Int32,System.Collections.Generic.IEnumerable{System.Double},System.Int32,System.Double,System.Collections.Generic.List{Rhino.Geometry.Brep},System.Double[]@)
Creates a constant-radius fillet surface between a surface and the curve.
curve: the curve to which this face is being filleted.
t: A parameter on the curve, indicating region of fillet.
u: A parameter in the u direction of the face indicating which side of the curve to fillet.
v: A parameter in the v direction of the face indicating which side of the curve to fillet.
radius: The radius of the constant-radius fillet desired. NOTE: using arcSliders will change the shape of the arcs themselves
alignToCurve: Does the user want the fillet to align to the curve?
0 - No, ignore the curve's b-spline structure
1 - Yes, match the curves's degree, spans, CVs as much as possible
2 - Same as 1, but iterate to fit to tolerance
Note that a value of 1 or 2 will cause nBezierSrfs to be ignored
railDegree: Desired fillet degree (3 or 5) in the u-direction, along the curve
arcDegree: Desired fillet degree (2, 3, 4, or 5) in the v-direction, along the fillet arcs.If 2, then the surface is rational in v
arcSliders: Array of 2 sliders to shape the fillet in the arc direction, used for arcDegree = 3, 4, or 5; input { 0.0, 0.0 } to ignore
[0] (-1 to 1) slides tangent arms from base (-1) to theoretical(1)
[1] (-1 to 1) slides inner CV(s) from base (-1) to theoretical(1)
numBezierSrfs: If >0, this indicates the number of equally-spaced fillet surfaces to be output in the rail direction, each surface Bézier in u.
tolerance: The tolerance. In in doubt, the the document's absolute tolerance.
out_fillets: he results of the fillet calculation.
fitResults: array of doubles indicating fitting results:
[0] max 3d point deviation along curve
[1] max 3d point deviation along face
[2] max angle deviation along face(in degrees)
[3] max angle deviation between Bézier surfaces(in degrees)
[4] max curvature difference between Bézier surfaces
Returns: true if successful, false otherwise.
Since: 8.0