Rhino.Geometry.SquishParameters.AbsoluteLimit
If -1.0 <= AnsoluteLimit < 0.0, then then an absolute
compression limit is applied so that
(2d length)/(3d length) >= abs(AbsoluteLimit).
In particular, Absolute = -1.0, then no compression
is permitted(2d length) >= (3d length).
If 0.0 < m_absolute_limit <= 1.0 then then an absolute
stretching limit is applied so that
(2d length)/(3d length) <= 1/abs(AbsoluteLimit).
Examples:
AbsoluteLimit
1.0: no stretching, (2d length) <= 1.0*(3d length)
0.5: cap on stretching, 0.5*(2d length) <= (3d length)
-0.5: cap on compression, (2d length) >= 0.5*(3d length)
-1.0: no compression, (2d length) >= 1.0*(3d length)
Since: 7.9