Rhino.DocObjects.RhinoObject.GetRenderMeshesWithUpdatedTCs(System.Collections.Generic.IEnumerable{Rhino.DocObjects.RhinoObject},System.Boolean,System.Boolean,System.Boolean,System.Boolean)
Gets the render meshes of some objects.
rhinoObjects: An array, a list, or any enumerable set of Rhino objects.
okToCreate: true if the method is allowed to instantiate new meshes if they do not exist.
returnAllObjects: true if all objects should be returned.
skipHiddenObjects: true if if hidden objects should be ignored.
updateMeshTCs: true if the TCs should be updated with a texture mapping.
Returns: An array of object references.
Since: 7.3
Rhino.DocObjects.RhinoObject.RenderMeshes(Rhino.Geometry.MeshType,Rhino.DocObjects.ViewportInfo,System.Collections.Generic.List{Rhino.DocObjects.InstanceObject},Rhino.Render.CustomRenderMeshes.RenderMeshProvider.Flags@,Rhino.PlugIns.PlugIn,Rhino.Display.DisplayPipelineAttributes)
8.0