Rhino.Geometry.Quaternion.GetEulerZYZ(System.Double@,System.Double@,System.Double@)
Find the Euler angles for a rotation transformation.
alpha: Angle, in radians, to rotate about the ZAxis.
beta: Angle, in radians, to rotate about the YAxis.
gamma: Angle, in radians, to rotate about the ZAxis.
Returns: true if successful, or false if this is not a rotation.
Remarks:
When true, this = RotationZYZ(alpha, beta, gamma) = R_z(alpha) * R_y(beta) * R_z(gamma),
where R_*(angle) is rotation of angle radians about the corresponding *-world coordinate axis.
alpha and gamma are in the range (-pi, pi], while beta in in the range [0, pi].
Since: 8.0