Rhino.DocObjects.Custom.CustomObjectGrips.NurbsSurface
If the grips control a NURBS surface, this returns a pointer to that
surface.  You can look at but you must NEVER change this surface.
Returns: A pointer to a NURBS surface or null.