Rhino.DocObjects.Tables.ObjectTable.FindClippingPlanesForViewport(Rhino.Display.RhinoViewport)
Finds all of the clipping plane objects that actively clip a viewport.
viewport: The viewport in which clipping planes are searched.
Returns: An array of clipping plane objects. The array can be empty but not null.
Since: 5.0