Rhino.Runtime.IShrinkWrapService.ShrinkWrap(Rhino.Geometry.Mesh,Rhino.Geometry.ShrinkWrapParameters,System.Threading.CancellationToken)
Create a shrinkwrap from a single mesh
Null on error or incompatible settings
mesh:
parameters:
cancellationToken:
Returns:

Rhino.Runtime.IShrinkWrapService.ShrinkWrap(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Geometry.ShrinkWrapParameters,System.Threading.CancellationToken)
Create mesh from input meshes.
Null on error or incompatible settings
meshes:
parameters:
cancellationToken:
Returns:

Rhino.Runtime.IShrinkWrapService.ShrinkWrap(Rhino.Geometry.PointCloud,Rhino.Geometry.ShrinkWrapParameters,System.Threading.CancellationToken)
Create mesh from point cloud input.
Null on error or incompatible settings
pointCloud:
parameters:
cancellationToken:
Returns:

Rhino.Runtime.IShrinkWrapService.ShrinkWrap(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},Rhino.Geometry.ShrinkWrapParameters,Rhino.Geometry.MeshingParameters,System.Threading.CancellationToken)
Create a mesh from a collection of geometry base objects
Null on error or incompatible settings
geometryBases:
parameters:
meshingParameters:
cancellationToken:
Returns: