Rhino.Geometry.Brep.CreateFromMatch(Rhino.Geometry.BrepEdge,Rhino.Geometry.Curve,Rhino.Geometry.MatchSrfSettings,Rhino.Geometry.Brep@,Rhino.Geometry.Brep@)
Match an edge to the target curve using the settings provided
edge: The edge to match. This need to be an untrimmed surface edge.
targetCurve: The curve to match to. This needs to be a Rhino.Geometry.BrepEdge if tangent or curvature matching is requested.
settings: The settings used for matching
matched: If successful, this contains the matched brep
target: If successful and Rhino.Geometry.MatchSrfSettings.Average is true, this contains the changed target brep.
Returns:

Rhino.Geometry.Brep.CreateFromMatch(Rhino.Geometry.BrepEdge,System.Collections.Generic.IEnumerable{Rhino.Geometry.Curve},Rhino.Geometry.MatchSrfSettings,Rhino.Geometry.Brep@,Rhino.Geometry.Brep@)
Match an edge to the target curves using the settings provided
edge: The edge to match. This need to be an untrimmed surface edge.
targetCurves: The curves to match to. These need to be Rhino.Geometry.BrepEdge if tangent or curvature matching is requested.
settings: The settings used for matching
matched: If successful, this contains the matched brep
target: If successful and Rhino.Geometry.MatchSrfSettings.Average is true, this contains the changed target brep.
Returns: