Rhino.Render.ChangeQueue.ChangeQueue.OriginalInstanceIdsFromMaterialId(System.UInt32)
Return the collection of original document instance ids assocaited with the material id.
crc: The material id
Returns:

Rhino.Render.ChangeQueue.ChangeQueue.OriginalInstanceIdsFromTextureId(System.UInt32)
Return the collection of original document instance ids assocaited with the Texture id.
crc: The Texture id
Returns:

Rhino.Render.ChangeQueue.ChangeQueue.OriginalInstanceIdsFromEnvironmentId(System.UInt32)
Return the collection of original document instance ids assocaited with the Environment id.
crc: The Environment id
Returns: