Rhino.RhinoDocUndoRecord.#ctor(Rhino.RhinoDoc,System.String)
Begin a RhinoDoc undo record.
doc: The active document.
description: A description of the record.

Rhino.RhinoDocUndoRecord.#ctor(System.UInt32,System.String)
Begin a RhinoDoc undo record.
docRuntimeSerialNumber: The active document's runtime serial number.
description: A description of the record.

Rhino.RhinoDocUndoRecord.Dispose
IDisposable implementaton