Rhino.Geometry.MatchSrfSettings.#ctor(Rhino.Geometry.Continuity,Rhino.Geometry.Continuity)
Constructor
match:
otherEnd:

Rhino.Geometry.MatchSrfSettings.EnableRefinement(System.Boolean,System.Double,System.Double,System.Double)
Enable refinement of the surface being edited
enabled: Switch refinement on or off
positionalTolerance: absolute distance
angleToleranceRadians: angle between surface normals
curvatureTolerance: percentage difference in radius of curvature

Rhino.Geometry.MatchSrfSettings.Continuity
Match the shape of the edge being edited to the target edge
Rhino.Geometry.Continuity.C0_continuous: edge position only
Rhino.Geometry.Continuity.G1_continuous: edge position and tangency
Rhino.Geometry.Continuity.G2_continuous: edge position, tangency and curvature

Rhino.Geometry.MatchSrfSettings.OtherEnd
Maintain the shape of the edge opposite the one being edited
Rhino.Geometry.Continuity.None: opposite edge is free to change
Rhino.Geometry.Continuity.C0_continuous: opposite edge position only
Rhino.Geometry.Continuity.G1_continuous: opposite edge position and tangency
Rhino.Geometry.Continuity.G2_continuous: opposite edge position, tangency and curvature

Rhino.Geometry.MatchSrfSettings.Average
If true, change both surfaces

Rhino.Geometry.MatchSrfSettings.MatchClosestPoints
Match the edge to the closest points on the target edge

Rhino.Geometry.MatchSrfSettings.RefineMatch
Add control point rows to the surface if necessary

Rhino.Geometry.MatchSrfSettings.RefinePositionalTolerance
Absolute distance tolerance for refinement

Rhino.Geometry.MatchSrfSettings.RefineAngleToleranceRadians
Angle between surface normals during refinement

Rhino.Geometry.MatchSrfSettings.RefineCurvatureTolerance
Percentage radius of curvature difference during refinement

Rhino.Geometry.MatchSrfSettings.PreserveIso
The way the surface iso-lines align with the target

Rhino.Geometry.MatchSrfSettings.ReverseMatchDirection
Reverse the direction of the edge to match.

Rhino.Geometry.MatchSrfSettings.ReverseAverageTargetDirection
Reverse the direction of the target for the averaged edge.