Rhino.Geometry.Mesh.ShrinkWrap(System.Collections.Generic.IEnumerable{Rhino.Geometry.Mesh},Rhino.Geometry.ShrinkWrapParameters,System.Threading.CancellationToken)
Creates a unified ShrinkWrap mesh from a collection of input meshes.
Returns null on error or failure.
Supports cancellation during volumetric calculations.
meshes:
parameters:
token: Supports cancellation during volumetric calculations.
Returns:

Rhino.Geometry.Mesh.ShrinkWrap(Rhino.Geometry.PointCloud,Rhino.Geometry.ShrinkWrapParameters,System.Threading.CancellationToken)
Creates a unified ShrinkWrap mesh from a point cloud
returns null on error or failure
Supports cancellation during volumetric calculations.
pointCloud:
parameters:
token:
Returns:

Rhino.Geometry.Mesh.ShrinkWrap(System.Collections.Generic.IEnumerable{Rhino.Geometry.GeometryBase},Rhino.Geometry.ShrinkWrapParameters,Rhino.Geometry.MeshingParameters,System.Threading.CancellationToken)
Creates a unified ShrinkWrap mesh from a collection of GeometryBase objects.
returns null or error on failure
Supports cancellation during volumetric calculations. geometryBase mesh creation is not cancellable
geometryBases:
parameters: A ShrinkWrapParameters object that specifies the configuration settings for the ShrinkWrap process.
meshingParameters: GeometryBase objects are converted to meshes first using the MeshingParameters provided. Those meshes are then used in the ShrinkWrap process.
token: Supports cancellation during volumetric calculations. geometryBase mesh creation is not cancellable
Returns: