Rhino.Geometry.ComponentIndex.IsSet
True if Rhino.Geometry.ComponentIndex.ComponentIndexType is set to a value between
Rhino.Geometry.ComponentIndexType.BrepVertex and Rhino.Geometry.ComponentIndexType.DimLeaderPoint.