Rhino.Display.DisplayPipelineAttributes.FrontOverrideObjectTransparency
Objects acquire transparency from render materials.

Rhino.Display.DisplayPipelineAttributes.FrontOverrideObjectReflectivity
Objects acquire reflectivity from render materials.

Rhino.Display.DisplayPipelineAttributes.BackOverrideObjectTransparency
Objects acquire transparency from render materials.

Rhino.Display.DisplayPipelineAttributes.BackOverrideObjectReflectivity
Objects acquire reflectivity from render materials.