Rhino.DocObjects.Tables.ObjectTable.GetObjectIdList(Rhino.DocObjects.ObjectEnumeratorSettings)
Returns an enumerable based on a Rhino.DocObjects.ObjectEnumeratorSettings filter.
settings: The Rhino.DocObjects.ObjectEnumeratorSettings settings.
Returns: The enumerable.